[
{
    "name": "  The Lost Bookshop: The most charming and uplifting novel for 2024 and the perfect gift for book lovers! ",
    "stars": [
        "58%",
        "28%",
        "11%",
        "2%",
        "1%"
    ],
    "pid": "0008609217",
    "ratings": "102,099 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Amazing",
    "rating": "5.0 out of 5 stars",
    "content": "I really love this book! Amazing story with so much suspense, and mystery. I couldn't put it down. It was a constant rollercoaster of emotions for me.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book and couldn’t put it down. The actor did a great job of bringing all the characters into focus and the past into present.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "0008609217"
},
{
    "title": "Fun, charming, heart breakingly wonderful!",
    "rating": "4.0 out of 5 stars",
    "content": "Like the book but it went back and for in time for more characters than you usually see doing this method",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was spellbound by this magical whimsical novel. In the land Irish folklore the novel unfolds beautifully. The pace is slow methodical. The combining of fact and fiction is well done",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "0008609217"
},
{
    "title": "Goo characters and story",
    "rating": "5.0 out of 5 stars",
    "content": "An amazing story telling about books and dreams. I never thought I would be so engrossed and captivated in its pages, not wanting to see it end.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is one of a few books that I wish actually had more words/pages. I wanted to know more about Madame Bowden and Josef and Rose.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "0008609217"
},
{
    "title": "Fairytale",
    "rating": "5.0 out of 5 stars",
    "content": "The intertwining of fantasy and reality in different time periods from different characters perspectives makes this a must read. A true page turner. Each chapter makes you wanting more. Although there is some violence it is more of a fantastical story with a mention of what actually happened to women through history.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The story is told from 2 different time periods. The story is well written and jumps back and forth between between 2 women who have been hurt by those who should have loved them. The ladies run for freedom, but find their way out will not be easy.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "0008609217"
},
{
    "title": "what dreams are made of",
    "rating": "5.0 out of 5 stars",
    "content": "I look forward to reading more books by Evie Woods.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great characters woven into a great plot and dual timeline. It had me rooting for all the main characters and on Eye edge of my seat right up until the very last page. I couldn't put it down!",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "0008609217"
},
{
    "title": "i couldn’t put it down!",
    "rating": "5.0 out of 5 stars",
    "content": "I’m not the type to finish a book in a few days. I usually put things down for a while but not this book. It was so captivating the whole way through.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Avid readers know all too well the way books draw you in and open up the playground of the imagination. This book draws the reader into the stories of the people but at the center of it all is the magic found inside a bookshop and the world of literature.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "0008609217"
},
{
    "title": "The Magic of Books",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book so much that I just bought another from this author today.  The story is so captivating.  Loved Opaline so much and her troubles were heartbreaking.  It was told with so much emotion and the character was so resilient.  I can't say much more without spoilers.  This book was pure magic from start to finish and cannot wait to read the next one in my queue.  Thank you Evie for such a wonderful story.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was wonderful. I enjoyed following the characters as they developed and not being confused by it. Not sure what year was was for Martha, but seemed more present day. The past lives of the characters had a thread of similarities that made everything fit so perfectly together. All lives were wrapped up nicely and left me thinking. I hope she’s written other stories.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "0008609217"
},
{
    "title": "Great story telling",
    "rating": "5.0 out of 5 stars",
    "content": "Wow! This is a page turner! I couldn't soak it up fast enough. What a truly wonderful read, the imagination goes wild with this one.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "....complex story taking place, back-and-forth across 100+ years and focused on the esoteric profession of rare books dealing. Mystery and a little magic wind it's way through the story as well as some not so pleasant reminders that 100 years ago, women were largely seen as property with no individual rights. There are several \"main\" characters, so I won't describe them all, as even the fleeting, temporary ones are quite important in their times.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "0008609217"
},
{
    "title": "loved this book",
    "rating": "5.0 out of 5 stars",
    "content": "But predominantly, it is two women -- Opaline, in the early 20th century, and Martha, contemporary to now. Weirdly, they are each looking for the other in a way. Martha is helped by (or is helping) Henry in this effort as he struggles to write his thesis.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "TBH, some aspects of the story just aren't explained or, at least not explained well, or just inexplicably exist. For example, Martha's very recent past seems like it would preclude allowing anything like the exceptionally strange tattoo on her back.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "0008609217"
},
{
    "title": "Terrific book!",
    "rating": "5.0 out of 5 stars",
    "content": "Anyway... That's where some of the mystery comes in, I guess.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "All of this aside, it is a terrific story and well worth the read.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "0008609217"
},
{
    "title": "Strange Story",
    "rating": "5.0 out of 5 stars",
    "content": "I read very rapidly so for a while I didn’t realize that each chapter contained stores about the different characters.  Slowly but surely I became part of the story. I can truly say it was worth the read.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Not a bad story plot, but at times confusing to keep track of. Overall a good read and pallet cleanser!",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "0008609217"
},
{
    "title": "cutesy",
    "rating": "5.0 out of 5 stars",
    "content": "A wonderful story about finding yourself and the people you meet along the way who help shape your life...love, loss, hope, and a little magic when you need it most.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book so much. From start to finish. I had no idea what it was about when I started it but then could hardly put it down !!!! I want a movie but like most movies could not do it justice !!!!",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "0008609217"
},
{
    "title": "Highly recommend....",
    "rating": "4.0 out of 5 stars",
    "content": "Bravo !!!!",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "While I did somewhat enjoy this book,it was a bit messy w the characters and jumping from one to another. At some points I wasn’t all to sure which person was speaking and who was answering. The premise is I must very different,but it did seem(IMO)  become a bit run on at some points.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "0008609217"
},
{
    "title": "Captivating!!",
    "rating": "4.0 out of 5 stars",
    "content": "Great story, but for me, was hard to follow, since I don’t read books all the way through at one setting, so the changing stories became difficult to follow.  It was charming as described.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What’s better than reading a book? Reading a book about books! 😆This was a really sweet and fun story set mainly in Ireland. Suspend your need for reality and jump in!",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "0008609217"
},
{
    "title": "A different type of story",
    "rating": "5.0 out of 5 stars",
    "content": "This is a wonderful book with a remarkable story line and characters to match!  I could not put it down and that is remarkable considering I usually read heavy themes like war and spies.  Thanks for a wonderful book!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was a masterful story that wow itself through time. I actually dreamt about the characters and worried about what was happening to them. Thank you for imagining this and writing it for the rest of us.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "0008609217"
},
{
    "title": "MAGICAL!",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful and magical! The ending left me wanting to open a bookstore. This is the best book I have read in many years.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I picked this book solely because of the cover;  I felt with a cover that good, how could I go wrong?!  I never read any word about the book -- I just dove right into reading.  THIS HAS BEEN A WONDERFULLY WOVEN AND AMAZING STORY!  I look forward to reading more by the author.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "0008609217"
},
{
    "title": "5  ++++ ⭐",
    "rating": "5.0 out of 5 stars",
    "content": "THANK YOU EVIE WOODS!!!!",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So glad I took a chance on Kindle’s suggestion. So well written and I loved how the story unfolded taking me to another place and time. A wonderful escape.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "0008609217"
},
{
    "title": "An altogether magical read!",
    "rating": "5.0 out of 5 stars",
    "content": "I could not put it down after chapter four. Give it a try but try to keep the characters straight from the beginning.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s been a long time since I’ve read a magical story and I’m an old lady and it was a very good one",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "0008609217"
},
{
    "title": "romance, period review of women",
    "rating": "5.0 out of 5 stars",
    "content": "This book captured me in ways few do. It was both a fairytale and viscerally real, heartbreaking, and so heart-achingly hopeful. This has easily become one of my favorites, and I can’t wait to read it again and again.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Enjoyed all the characters, the magical implications, the jumping around in time periods and the love of books and authors throughout the novel!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "0008609217"
},
{
    "title": "awesome",
    "rating": "5.0 out of 5 stars",
    "content": "Four individuals-separated by time,are strategically connected by the love of a bookshop. I wanted more as it came to an end. Great writing.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love the fantastical. This book had a way of keeping my attention the entire time. I found it hard to keep track of the characters and how they connected to each other. But I finally decided to let the book just take me where needed. The last book I loved this much was the Hobbit and The Lion, The Witch and the Wardrobe. Well done, looking forward to more.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "0008609217"
},
{
    "title": "A Great Read for the Soul",
    "rating": "5.0 out of 5 stars",
    "content": "I can’t express how I love this book. In completing it I feel so joyous!  It simply is the best book I have read in quite some time.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love books and libraries and bookstores. And I loved this book which was the telling of lives intertwined with books and just a little bit of magic.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "0008609217"
},
{
    "title": "What a wonderful story!",
    "rating": "4.0 out of 5 stars",
    "content": "Dust jackets and synopses can tell you about the book, but not about the feelings or emotions invoked  from reading it. This one left me feeling sad that it was over but thrilled that I'd read it.  And hopeful that through words on paper, anything is possible.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a pretty intriguing story.  I wasn’t sure how it was all going to connect until the very end which is what kept me reading.  I have read other reviews that talk about how this book touches on Irish folklore.  I wish that could have been explained a little bit more for someone who is not familiar.  I think this book was more literary fiction with a essence of magic and mystery.  I enjoyed it and will look to read another book by the author.  The story was very unique.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "0008609217"
},
{
    "title": "Unique story",
    "rating": "5.0 out of 5 stars",
    "content": "A lost bookshop is a fanciful idea - a bookshop that was once there, and is no longer. The wonderfully strong women and their journeys add so much to this story. Their persistence, their strength, the sheer magic of their existence make this story simply enchanting. And make no mistake, Henry is a significant piece of the puzzle too.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m not sure what I expected from this story - maybe more about the bookstore and less about the people. But Evie Woods crafts it all with such beauty and grace the story simply glows with life, the energy of the tale a thing unto itself.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "0008609217"
},
{
    "title": "enchanting",
    "rating": "5.0 out of 5 stars",
    "content": "Excuse me while I search up the sequel to this book and every other thing Evie Woods has written.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book stole my sleep, my mind, and time.  All the best books do! Just read it. You won't be sorry!",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "0008609217"
},
{
    "title": "Captivating story I couldn't put down",
    "rating": "5.0 out of 5 stars",
    "content": "This was a very good read! Enjoyed the writing and story very much! I would read again! I highly recommend this book!",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "0008609217"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed this book.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "0008609217"
},
]