[
{
    "name": "  Killers of the Flower Moon: The Osage Murders and the Birth of the FBI ",
    "stars": [
        "62%",
        "25%",
        "10%",
        "2%",
        "1%"
    ],
    "pid": "0307742482",
    "ratings": "77,463 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Historical novel made interesting",
    "rating": "5.0 out of 5 stars",
    "content": "I wasn’t able to see the movie so I ordered the book and it was awesome. A lot of historical information.",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had never heard of this part of our history.  Very interesting, but sad to think how bad people can be.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "0307742482"
},
{
    "title": "Very interesting book",
    "rating": "5.0 out of 5 stars",
    "content": "Love the book and the movie",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Reading",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "0307742482"
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "Beautifully told story of an ugly corrupt town. History lesson not taught at schools but thankfully brought to light in this remarkable accounting",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I learned a lot  frm this book but didn’t really get interesting till page to 113",
    "post_time": "Reviewed in the United States on April 24, 2024",
    "pid": "0307742482"
},
{
    "title": "HistoriCal fiction",
    "rating": "5.0 out of 5 stars",
    "content": "A well researched, very well written (including organizationally) narrative history on a subject that has been given attention in the literature but remains relatively unknown by the general public. The murders of the oil rich Osage numbered over a couple dozen and for some brief period a mystery to Osage and authorities alike. I should say, federal authorities.",
    "post_time": "Reviewed in the United States on October 7, 2018",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "While the murders were another reflection of the shameful treatment of the First Nation people in a historical context, in the instance the perpetrator was a local prominent white man living as a friend of the Indians in their midst. The book deals with how the murders were solved and involved a whole cast of characters including tribal members themselves, for several their lives well recounted.",
    "post_time": "Reviewed in the United States on October 29, 2023",
    "pid": "0307742482"
},
{
    "title": "Terrifying that this is nonfiction",
    "rating": "5.0 out of 5 stars",
    "content": "Were it not for the underlying disregard for their race and therefore worth as human beings, this story is very much the age old story about human greed. But thanks to the efforts of federal law enforcement as came to be embodied with the founding of the FBI, the perpetrators, largely Whites but not exclusively, were caught and prosecuted. It is how the author weaves together the story to solve the mystery and in the process ties in side stories about the Indian plight in America and how the Osage by virtually total accident came to reside in one of the richest oil reserves in the country and as a consequence became for a time, the richest Americans because of royalties from the mineral rights, that provides for compelling reading.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A positive aspect of the writing is that while the author engages in a handful of side stories to add perspective, they are efficient and accretive to the story, not mini books in themselves that become tedious distractions to the story that characterize too many works of non-fiction. When the main story ended about three quarters through and the author embarked on an epilogue I began to fear his story discipline had broken down. But as it happened the author used the epilogue to tie together loose ends of the story post solving of the murders in the mid 1920s. Very satisfying.",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "0307742482"
},
{
    "title": "Read for my book club",
    "rating": "4.0 out of 5 stars",
    "content": "This was picked for a book club read. Mostly enjoyed it, but did struggle with the back and forth nature of the story telling; made it difficult to follow the events. Made for overall good discussion, though.",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I rarely read nonfiction books, and I have never read this author's work, but I am glad that I took the time to read this book before I see the movie later this month. The author is very thorough in his research and very detailed in his writing. The story was completely unknown to me. The Osage tribe of Native Americans earned a lot of money from the oil found on their reservation and started out quite rich. However, lawbreaking citizens managed to steal much of the money from the tribe members. When some tribe members ended up dead, the federal government got involved. At this time there was no national police, so newly formed groups investigated, leading to the formation of the FBI. I enjoyed reading this author's work, and will try some of his other work.",
    "post_time": "Reviewed in the United States on October 6, 2023",
    "pid": "0307742482"
},
{
    "title": "Very readable nonfiction book",
    "rating": "5.0 out of 5 stars",
    "content": "This was an exciting page-turning crime investigation book.  The pace is a bit slow at first, but when the gruesome murders accumulate (and suspicious cover-ups from local officials begin), it grips the reader.  I also enjoyed the history of this non-fiction work as it showcases the FBI's emergence, the heroic work of Tom White (who lived to 91 years after leading the FBI investigation and nearly losing his life as a prison warden), and the Reign of Terror which brought trauma to the Osage Indians in the early 20th century.  It is awful that suspicions still persist for Osage Indians living in Oklahoma today.",
    "post_time": "Reviewed in the United States on December 24, 2023",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Although I have not yet seen the movie, my guess is that the book will be much more interesting and engaging by providing detailed context of the murders - and the ruthless evil of Mr. Hale (a swindler who uses bribery and cover-ups to steal from the headrights of Osage Indians).  The conspiracy of corruption among many Whites living in northeast Oklahoma at the time is particularly disturbing.",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "0307742482"
},
{
    "title": "Superb Crime Investigation Book and History",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed this book for its historical value and ended by wondering why I never learned about this in school.  Very accurate but still a story in progress with further research.",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Factually written, but kept me invested the whole time. To realize how many people were involved in the hushing and hiding and cover up of these mass murders is sobering, disgusting, and makes one question so many things about our past. I’ve never been a conspiracy theorist, but there is no question there have been some troubling and inhumane conspiracies that greedy people have used to manipulate and abuse people with less means to gain and maintain power. Not a proud time in our nation’s history.",
    "post_time": "Reviewed in the United States on April 13, 2024",
    "pid": "0307742482"
},
{
    "title": "Historically Interesting",
    "rating": "3.0 out of 5 stars",
    "content": "Just finished reading this for the second time. Originally I read this excellent book several years ago and enjoyed reading this tragic story. Then I heard Martin Scorsese was making the film based on this narrative. After seeing the excellent movie, I wanted to read it again. It did not disappoint, in fact I enjoyed it even more the second time around.",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "David Grann is an author worth spending time reading. His attention to detail and description of events due to his exploration of the facts, makes this a page turner.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "0307742482"
},
{
    "title": "A Hauntingly Devastating True Murder Mystery",
    "rating": "4.0 out of 5 stars",
    "content": "Here's my honest opinion. Some peope will give this a 5-star review simply because it's a very compelling story, which it is. I went into it expecting more entertainment, but this reads very similar to a crime documentary that you'd watch on TV. There are twists and turns, but it's mostly just the facts being put forward. This is a historical account that we should have already known, but has been hidden from us. This is one of the most important events in native American history, yet I had never heard of the Osage nation until I read this. It is important, shocking, and necessary history that everyone should read. Just don't do it just because you heard the movie was good. The events are wrapped up by 60%. Sentences are passed, time is served, everyone eventually dies. I'd like some of my money back for the last 40%.",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I did not know much about this chapter of the Native Americans and how they were victimized over oil rights.  The research by this author was very impressive and he pulled together the history of these families and all the horrific events which they endured.  The treatment of the tribal members by other people in the towns and the government was shameful.  This is a must read!",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "0307742482"
},
{
    "title": "The story no one knows about; after reading you will know why!",
    "rating": "5.0 out of 5 stars",
    "content": "This Book was suggested to me by Amazon. It happen to hit upon a subject in which I am trying to learn more about, The Osage Indian. I live in a part of Arkansas which was once part of the Great Osage Nation. We still occasionally find Indian artifacts which may or may not have been made by the Osage. I have tried reading more about them but most of what I had learned is limited to they once lived here. In the early 1800's the government moved them to Kansas and like all other Native Americans were placed on a reservation. Now comes this fantastic book by David Grann. Having received this book with no prior knowledge one only gambles. However, I couldn't put it down and I can't stop thinking about it. The author in my opinion told the story with a great deal of empathy for the Osage People and with a great deal of respect in reference to Tom White, former Texas lawman to FBI agent  for purposes of this story. The story takes place in the early 1920's with a view of an Osage Nation through great leadership had chosen to purchase land in Oklahoma. The land was suggested to be so poor and worthless that no white man would want it. How wrong could they have been but how smart they were in the purchase. With the help of John Palmer an native american lawyer I have read about before, they were able to purchase the land thus having a deed and no longer dependent on government granted reservation land. Then Oil is discovered and of course the white man comes knocking on the door in attempt to gain access to the black gold below the surface. John Palmer however had gone a step further and as the author suggests was able to sneak in language whereby the tribe withheld all mineral rights. Clearly, this stumped all land grabbers who had made an art of obtaining valuable tribal land from various tribes throughout history. But wait, the story now begins because others with no particular thought as to the Osage people even being human, make their land grab and this is the story so artfully told by Mr. Grann. I cannot recommend this book enough. Here is a tribe that has done everything legally right but yet they were disappearing. Most people knew what was going on and why, but these people were also the culprits which made it almost impossible for the FBI to trust any information they obtained. J. Edgar Hoover was new in his job at this time and he was looking for just the right cases to help him argue for a National Police. This was one of the first cases that helped move them to the very respected FBI.  Oddly the term \"most people\" referenced above, still fits because as the story develops, the reader is shocked by the cruelty and total disregard for human life over the almighty dollar and these atrocities were being orchestrated by the very people who were chosen to look out for them. Go get it read it and enjoy!!!!  I recently watched Mr. Grann being interviewed on television. There is discussion he stated, where big name movie directors, producers, et cetera are wanting to make a movie out of this book. Well, it will be interesting to see, but rest assured, no movie will be as good as this book.",
    "post_time": "Reviewed in the United States on August 14, 2017",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was a good value and a good read.  The story is very depressing, as it's a true story.  If you're looking for an uplifting book to read, skip this one.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "0307742482"
},
{
    "title": "Good value",
    "rating": "5.0 out of 5 stars",
    "content": "I have not seen the movie but this book is really interesting.  Interesting information about the start of the FBI and Native American people.  I’m not sure who’s got the book right now since everyone reads this and passes it on to another person. That’s how much we enjoyed reading it.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Book was in excellent condition.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "0307742482"
},
{
    "title": "Could not put it down.",
    "rating": "5.0 out of 5 stars",
    "content": "This non-fiction book reads like a novel.  The facts revealed are horrific and nearly unbelievable.  That so many, so so many, white people could be so callous and calculating in finding every avenue possible to cheat and murder their way into control of the Osage people’s fortunes!",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My grandfather used to tell me about the Osage murders when I was a kid. He grew up in Oklahoma. It's like I can hear his voice reading to me. Great book!!",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "0307742482"
},
{
    "title": "Fast shipping",
    "rating": "4.0 out of 5 stars",
    "content": "The book is way better than the movie.  I saw the movie and hated it and that caused me to avoid reading the book.  I finally read the book and was surprised by how good this book is,  very well written and interesting.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "David Grann's \"Killers of the Flower Moon\" is an eye-opening look into an episode of American history of which I had never heard. In the early 20th Century, one of the many and ever-changing treaties between the US Government and Native Americans had assigned a major portion of Oklahoma to the Osage Indian tribe.  Surprisingly, it turned out to be extremely oil rich, and members of the tribe became millionaires.  They lived in mansions and had servants. Still, they suffered many indignities, such as having a \"guardian\" (usually a Caucasian) assigned to handle their business affairs, as native Americans were not deemed competent to handle their own money. One thing that surprised me was that there were no laws prohibiting interracial marriages among Caucasians and native Americans.  The reason I didn't expect such unions would be legal was knowing that interracial marriages among whites and blacks were not allowed until a Supreme Court case in the 1967.",
    "post_time": "Reviewed in the United States on May 17, 2021",
    "pid": "0307742482"
},
{
    "title": "A must read for every American citizen who wants to know the truth about our history!",
    "rating": "5.0 out of 5 stars",
    "content": "In the 1920s, a series of mysterious deaths began to occur among the Osage.  While some deaths resembled natural causes, they were unexplained and could have been the result of poisoning. Some were obviously murders, by gunshot wounds or stabbing. Multiple family members of Mollie Burkhart were among the victims. In those days, forensics as we know it today did not exist.  Autopsies were crude, and crime scenes were not preserved. When Mollie's sister was shot, the men who performed the autopsy could not find the bullet in her head, even though there was no exit wound. Law enforcement was extremely limited.  Citizens had to turn to private investigators for answers.  Material witnesses seemed to disappear or clam up.  A man went to Washington DC to seek help from federal authorities, but was ambushed and killed upon his arrival in the capitol city.",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Eventually, help did come from DC, from the organization that preceded and evolved into the FBI.  Because of the non cooperation and unreliability of witnesses, the feds resorted to undercover work that took years.  The old saying that \"truth is stranger than fiction,\" certainly applies to this case.  I was absolutely floored by who was really behind the killings and how the convoluted motive was supposed to work.  Though you might be tempted to Google it before the end - don't.  Reading it as Grann reveals it makes it more stunning. No wonder this was one of the top-selling nonfiction books in 2017.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "0307742482"
},
]