[
{
    "name": "  Killers of the Flower Moon: The Osage Murders and the Birth of the FBI ",
    "stars": [
        "62%",
        "25%",
        "10%",
        "2%",
        "1%"
    ],
    "pid": "0307742482",
    "ratings": "77,483 ratings",
    "other_info": {},
    "discount_price": "$ 7.99",
    "normal_price": "$17.00",
    "about_this_item": []
},
{
    "title": "Excellent condition! Great experience!",
    "rating": "5.0 out of 5 stars",
    "content": "I love that the book is brand new and was shipped fast and received fast!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "American history is loaded with episodes of shame. A large percentage of our less memorable moments, as a nation, have been swept under the rug, kept out of classrooms, and largely forgotten as time progresses. But these events are real and all it takes is a skilled author to bring the lost history back to life. Such is the case with Killers of the Flower Moon.",
    "post_time": "Reviewed in the United States on July 26, 2023",
    "pid": "0307742482"
},
{
    "title": "Another Largely Forgotten Piece of American History, Brought Back to Life",
    "rating": "5.0 out of 5 stars",
    "content": "I did not know anything about these murders against the Osage until I read this book, so this was a definite eye- opener for me. I had heard of the Osage tribe, yes, but I did not know they fell into tremendous oil wealth and, subsequently, saw their members slowly dying off, either through gunfire or poisoning, as greedy individuals tried to get their hands on some easy cash. The book details several of the known killings and the cold, callous, calculated murders are chilling and puzzling. Chilling, because of the gruesomeness of the murders; puzzling, because of the nonchalant behavior of those who plotted the killings. Even when confronted with the murders, most of the guilty individuals seem to have no remorse at all. They don’t even perceive what they did as immoral in any way.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book reads like a mystery thriller, however it isn’t a page- turner, like some mystery genre books. You do start to make guesses as to who is responsible, but rather than get wound up in the who- done- it, the book grips you more for its educational aspects. You learn all sorts of things about the Oklahoma region that the Osage called home. You learn about the newly formed FBI and its role in solving the mystery. You learn about the problems of racism and the feelings of superiority that people felt against Indians. And you learn just how evil people can be when vast amounts of wealth are at stake.",
    "post_time": "Reviewed in the United States on August 23, 2021",
    "pid": "0307742482"
},
{
    "title": "Detailed and disturbing chronicle of the crimes perpetrated on the Osage tribe.",
    "rating": "5.0 out of 5 stars",
    "content": "There are several surprises in this book, and one is the book’s final section. The book leads you to believe that the mystery has been solved and it sounds like everything is coming to a close. Then suddenly, the book continues for dozens more pages as the author tries to solve more of the mystery on his own, with the aid of local Osage tribe members. No one will ever know exactly how many people were killed during this reign of terror but I like how the author took it on himself to investigate and try to answer more questions.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is another solid, educational wakeup call on the prevalence of racism and superiority that pervaded society in the past and is rearing its ugly head once again today. I like how the book includes pictures so that you can get to know the many characters involved. With so many names and so many people involved, it’s easy to lose track of who is who. The pictures help you put a face with the name. But the most important part of this book is its educational value. It’s another sad, shameful episode from America’s past and one that we all need to know about and, hopefully, learn from.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "0307742482"
},
{
    "title": "If you like to be pissed while reading...",
    "rating": "5.0 out of 5 stars",
    "content": "Starting with forcing the tribe from their original home to what appeared to be useless land, the members were thought of as less important and less intelligent than white people. The federal government was unfortunately complaisant particularly because of the geographical separation and communication difficulties.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "  This was an extraordinary compilation of historical records , photos and recent interviews with descendants of tribal members.",
    "post_time": "Reviewed in the United States on November 17, 2023",
    "pid": "0307742482"
},
{
    "title": "Movie",
    "rating": "5.0 out of 5 stars",
    "content": "  I highly recommend this book to those interested in American history even though some of it is shameful.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I buddy read this with my friend Ashley. When I first picked this up, I had no idea what it was about. My grandma said it was one of her \"favorites\", what I think she meant to say was it was one of the most powerful and heart wrenching reads. I picked it up thinking that I would learn more about the FBI. I've been watching Mind Hunter and reading about serial killers. This book is not about those things.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "0307742482"
},
{
    "title": "Couldn't Put I Down",
    "rating": "5.0 out of 5 stars",
    "content": "Killers of the Flower Moon is the true story of the numerous murders of members of the Osage Native American tribe during the early 1920s. It was referred to as the Reign of Terror.  The Osage community was incredibly wealthy because the supposedly worthless land in Oklahoma to which they had been confined since 1870 was found to contain some of the largest oil reserves in the United States. People flocked there to strip them of their wealth by any means possible including murder. The situation was exacerbated by the government policy that claimed the Osage were not competent enough to manage their money and thus White guardians were assigned to each Osage native for that purpose.  This of course resulted in the guardians stealing from and murdering their clients.",
    "post_time": "Reviewed in the United States on October 4, 2023",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The deaths began with several members of the Osage community wasting away. The local doctors attributed this to illness. It was not until two members of the Osage were shot and killed that it was acknowledged that there was a plot against the Osage community, but little was done to solve those murders. When the bombing of an Osage home resulted in the deaths of three people, a new investigative group under the Federal Government’s Justice Department was asked to look into the murders. That department had a new director, J. Edgar Hoover. Hoover assigned Tom White to the investigation. White was successful in finding the murderers and having them prosecuted.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "0307742482"
},
{
    "title": "Stirred my soul-everyone should read it!",
    "rating": "4.0 out of 5 stars",
    "content": "The book also discusses the life of Tom White who truly was an amazing man. The author is very critical of Hoover. Admittedly, Hoover was a man of massive ego but he did create an agency that developed the technical expertise and methods that allowed the solving of murders previously deemed unsolvable.",
    "post_time": "Reviewed in the United States on March 13, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I rated this book 5 stars for several reasons. It is an extremely compelling story; I could barely put it down.  It was very well written; the author’s research into this Reign of Terror was immense. Nor did he did limit his investigation to this time frame. He also dug deep into the archives of Osage history to find unsolved or mysterious deaths that occurred both before and after the Reign of Terror. They were numerous. He estimated that the murders began in 1910 and continued through the early 1930’s. Lastly, it gave me an appreciation of the times in which I live. I am often very distressed about the changes occurring in society but when I compare it to that era’s rampant corruption and violence which was present throughout the whole of society, not just the Osage community, I cannot help but believe that we as a nation have become a more just and empathetic society.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "0307742482"
},
{
    "title": "\"You can't obliterate history.\" - David Grann, Vanity Fair Oct '23",
    "rating": "5.0 out of 5 stars",
    "content": "This book was wonderful, interesting, sad, heartbreaking and maddening. It has made me ponder human nature and our capacity for so much good and devastating evil at the same time.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Please read this book!",
    "post_time": "Reviewed in the United States on October 9, 2023",
    "pid": "0307742482"
},
{
    "title": "Good",
    "rating": "5.0 out of 5 stars",
    "content": "David Grann has brought THE spotlight (and my attention) to  one of the blackest periods in US History - The Reign of Terror and The Osage Murders in Killers of the Flower Moon, and garnered a worthy 5✨️star rating in the process. His non-fiction exposé reads more like a general fiction or mystery novel, as Grann writes with sincere emotion, both haunting and heartbreaking, creating a  complete page-turner. While most U.S. History textbooks gloss over the darker periods in America's past, providing more statistics than personal accounts, Grann's thorough research and \"obligation... to factually record our past,\" begs us to start the hard conversations about our country's negative history in order to hopefully learn from it.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Originally 4.5🌟 Stars rounded to 5, as I did find it hard to follow each and every name. But then I realized that THAT was one of the major points we ALL tend to gloss over... just HOW MANY LIVES were truly affected by the racism, greed, and unscrupulous surrounding the Osage, especially during the 1920's and 30's.  I also wanted to credit Grann with seamlessly integrating the \"birth\" of the FBI into his narrative, creating yet another layer of intricacy and information in the novel.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "0307742482"
},
{
    "title": "Great book.",
    "rating": "4.0 out of 5 stars",
    "content": "Happy with purchase",
    "post_time": "Reviewed in the United States on May 30, 2017",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great book, nicely written.",
    "post_time": "Reviewed in the United States on January 20, 2024",
    "pid": "0307742482"
},
{
    "title": "interesting story",
    "rating": "4.0 out of 5 stars",
    "content": "Interesting story that I had not known and its connections to the beginning of the FBI….written well. Not a great book but an interesting read about this and people",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Neil",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "0307742482"
},
{
    "title": "Great read",
    "rating": "5.0 out of 5 stars",
    "content": "I’m only a quarter of the way through it and I am not going to comment on any of the book, I’m not a spoiler! I recommend this book!",
    "post_time": "Reviewed in the United States on November 20, 2023",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Suspenseful. Mr. Grann wove a suspenseful true crime story that rivals any other. The book writing is so much better than the movie. Throughout the book, the reader has suspicions of who the possible greedy devils are, but not conclusive until near the end or how Molly will react with each death or revelation. The movie gives too much away much too soon- excellent acting and directing, but it gives away everything from the beginning. The book draws the reader into the depths of hell and allows the reader to wonder how depraved these white men will allow themselves to go for their greed. One reviewer wrote, 'everyone knows how the Osage were treated,' that is simply not true. Where would 'everyone' learn this?  It is certainly not in public school history books. 'History is written by the victors,' and then subsequently approved by and purchased by a majority of white people in support of and in control of government and continue to oppress and deny the real history of the United States. Grann researched and unearthed many atrocities. He spoke with the descendents multiple times and gained access to court records and case files. The FBI agent and his fellow agents were excellent and steadfast and I wish there was more about them in the movie. Excellent research and methodology. The caretakers were insufferable scum of the earth and their generations still flourish and benefit from stealing from the Osage. There should have been more accountability for all of them.  All of the 'guardians' who stole should have been tried and convicted along with all the businesses who stole and price gouched. Molly's and the others' heirs did not live in generational wealth, attend law school, or be appointed AGs. Those scoundrels should be publicly known as thieves and their names live in shame. Their families should know how evil and twisted their grandparents were and be ashamed of them- not ignore or deny history of how their family gained their wealth. Despicable behavior. I am so glad Grann brought it to light in an excellent book and that it was brought to the big screen.",
    "post_time": "Reviewed in the United States on October 24, 2023",
    "pid": "0307742482"
},
{
    "title": "Excellent True Crime Investigation- Better than the Movie",
    "rating": "5.0 out of 5 stars",
    "content": "Killers of the Flower Moon by David Grann is a well documented tale of the murders of 20 plus Osage Indians to steal their money.  It took place in the early 1920’s and became known as the Reign of Terror.  The land the Osage Indians were forced to live on was some of the richest oil reserves in the country.  The Osage sold off some of the land but retained the mineral rights, thus they owned the oil.  At one time they were the richest per capita people in the world.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Federal Government determined the Indian was incompetent and created a guardianship situation where a white man was appointed to oversee the expenditures of the funds.  In order to spend their own money for groceries or medicine or anything, the Indian had to meet with their guardian and get permission.  When the killings began, two individuals were shot and their bodies left where they fell.  The sheriff didn’t have any luck finding the killer.  When a house blew up killing an Osage woman, her white husband, and a white maid, a group of Osage went to D.C.  and appealed to the President to do something.  The FBI was created to address the situation.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "0307742482"
},
{
    "title": "Riveting Account of Murders of Osage Indians to Steal Their Money",
    "rating": "5.0 out of 5 stars",
    "content": "It is a gripping story.  I was reading until 3 a.m. to get to ‘who done it.’  It has been made into an excellent movie by Martin Scorsese but the book provides more background.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "See above",
    "post_time": "Reviewed in the United States on May 10, 2017",
    "pid": "0307742482"
},
{
    "title": "Well-researched and written.",
    "rating": "5.0 out of 5 stars",
    "content": "Tells the story of corruption and emotional self-interest of powerful men!",
    "post_time": "Reviewed in the United States on November 4, 2023",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was unaware of this historical occurrence. A wonderful book, a real page turner and valuable information for anyone with an interest in fairness, justice and history. Very well documented. Looking forward to reading The Wager, also by David Grann. He writes a compelling tale.",
    "post_time": "Reviewed in the United States on August 14, 2017",
    "pid": "0307742482"
},
{
    "title": "Good value",
    "rating": "5.0 out of 5 stars",
    "content": "This book was a good value and a good read.  The story is very depressing, as it's a true story.  If you're looking for an uplifting book to read, skip this one.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have not seen the movie but this book is really interesting.  Interesting information about the start of the FBI and Native American people.  I’m not sure who’s got the book right now since everyone reads this and passes it on to another person. That’s how much we enjoyed reading it.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "0307742482"
},
{
    "title": "Could not put it down.",
    "rating": "5.0 out of 5 stars",
    "content": "Book was in excellent condition.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Grann does a great job of exposing the horrific crimes that were committed on the Osage reservation in the 1920's.  This is one of the first cases that involved the fledgling FBI.  A great read.  Reads like a novel.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "0307742482"
},
{
    "title": "Fast shipping",
    "rating": "5.0 out of 5 stars",
    "content": "This non-fiction book reads like a novel.  The facts revealed are horrific and nearly unbelievable.  That so many, so so many, white people could be so callous and calculating in finding every avenue possible to cheat and murder their way into control of the Osage people’s fortunes!",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My grandfather used to tell me about the Osage murders when I was a kid. He grew up in Oklahoma. It's like I can hear his voice reading to me. Great book!!",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "0307742482"
},
{
    "title": "HORRIFYING CONSPIRACY",
    "rating": "4.0 out of 5 stars",
    "content": "The book is way better than the movie.  I saw the movie and hated it and that caused me to avoid reading the book.  I finally read the book and was surprised by how good this book is,  very well written and interesting.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "David Grann's \"Killers of the Flower Moon\" is an eye-opening look into an episode of American history of which I had never heard. In the early 20th Century, one of the many and ever-changing treaties between the US Government and Native Americans had assigned a major portion of Oklahoma to the Osage Indian tribe.  Surprisingly, it turned out to be extremely oil rich, and members of the tribe became millionaires.  They lived in mansions and had servants. Still, they suffered many indignities, such as having a \"guardian\" (usually a Caucasian) assigned to handle their business affairs, as native Americans were not deemed competent to handle their own money. One thing that surprised me was that there were no laws prohibiting interracial marriages among Caucasians and native Americans.  The reason I didn't expect such unions would be legal was knowing that interracial marriages among whites and blacks were not allowed until a Supreme Court case in the 1967.",
    "post_time": "Reviewed in the United States on May 17, 2021",
    "pid": "0307742482"
},
{
    "title": "A must read for every American citizen who wants to know the truth about our history!",
    "rating": "5.0 out of 5 stars",
    "content": "In the 1920s, a series of mysterious deaths began to occur among the Osage.  While some deaths resembled natural causes, they were unexplained and could have been the result of poisoning. Some were obviously murders, by gunshot wounds or stabbing. Multiple family members of Mollie Burkhart were among the victims. In those days, forensics as we know it today did not exist.  Autopsies were crude, and crime scenes were not preserved. When Mollie's sister was shot, the men who performed the autopsy could not find the bullet in her head, even though there was no exit wound. Law enforcement was extremely limited.  Citizens had to turn to private investigators for answers.  Material witnesses seemed to disappear or clam up.  A man went to Washington DC to seek help from federal authorities, but was ambushed and killed upon his arrival in the capitol city.",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Eventually, help did come from DC, from the organization that preceded and evolved into the FBI.  Because of the non cooperation and unreliability of witnesses, the feds resorted to undercover work that took years.  The old saying that \"truth is stranger than fiction,\" certainly applies to this case.  I was absolutely floored by who was really behind the killings and how the convoluted motive was supposed to work.  Though you might be tempted to Google it before the end - don't.  Reading it as Grann reveals it makes it more stunning. No wonder this was one of the top-selling nonfiction books in 2017.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "0307742482"
},
{
    "title": "Unknown History",
    "rating": "5.0 out of 5 stars",
    "content": "This book tells about a history against a race of people. The how and why of racism against a group of American Indians.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Placed by front door on covered porch.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "0307742482"
},
{
    "title": "Book in perfect condition.",
    "rating": "3.0 out of 5 stars",
    "content": "Given this is a historical record, the author goes to great lengths to provide explicit details about the known facts.  Clearly the author was intent on providing historical accuracy which absolutely was provided.  This is a well-researched book.  Unfortunately, it lacks in character development, especially with its main characters.  It made for a very clinical read- almost like a text book.  I didn’t feel engaged in the “murder mystery” as the book is marketed.  A truly horrific crime and a stain on our nation’s history.  Just not a great read.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am a very inquisitive and avid reader. I like to read and review books that I have read and liked. I happened to choose this book because of the attention being brought to it due to the movie of similar name coming out in theaters. I was intrigued about seeing the movie and wanted to know more about the subject for myself. I was very excited when the book arrived at my house. I began reading almost immediately. David Grann’s research, recording and reporting style in this book are so entertaining that I nearly forgot I was reading a non-fiction book! I feel this is a very good accounting and story telling of this time period in history. I learned so much about the native Americans, the government and the time period. The writing style is well chosen and well developed. The pacing was surprisingly fast. There are some copies or reprints of actual pictures people and families or libraries have collected and kept included throughout the book. The included photos show the reader what the real people, that Grann is reporting about, look like. This book brought the history to life for me. I would recommend this book to other readers and history buffs or inquisitive people.",
    "post_time": "Reviewed in the United States on February 23, 2024",
    "pid": "0307742482"
},
{
    "title": "Lacks character development",
    "rating": "4.0 out of 5 stars",
    "content": "Every year I make myself read at least one non-fiction book.  This book was recommended by a friend at work and because it takes place in Oklahoma (my home state), it was an easy selection.  The story begins soon after the Osage Indians have been relocated, once again, in the early 1900's to a location in Oklahoma selected by the federal government.  Their relocation spot appears desolate and of not much use to anyone, therefore they are given the land outright with the ability to do whatever they want with it.  The government’s one mistake was giving them the mineral rights to the land, even if the land is sold.  That one decision, though unknown at the time, became a death curse to many Osage, old and young.",
    "post_time": "Reviewed in the United States on September 19, 2019",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A peaceful tribe, the Osage had high expectations that finally they could settle in an area they could call their own and continue honoring their Indian culture while somewhat adopting the ways of the White Man.  All is well until it is discovered there is oil on their land – lots of oil – and LOTS of oil spells money.",
    "post_time": "Reviewed in the United States on February 3, 2024",
    "pid": "0307742482"
},
{
    "title": "Non-fiction historic accounting and record very well done",
    "rating": "4.0 out of 5 stars",
    "content": "Wealth, especially if it is “new” wealth”, can act as a magnet attracting deceit, lawlessness, evil and even murder.  I am a native to Oklahoma but am not a Native American, or at least not that I have uncovered in any of my genealogy research.  However, it doesn’t take much to realize that the American government did not do a good job at protecting the Indians; in fact, they did a lousy job.  All that was done “for them” or to help “further” their assimilation to the American way, was done with selfish motives at the core.  For the Osage, when it was discovered that millions of dollars would be pouring in to them, it was determined they needed a “White Man” to act as their financial guardian, having the authority to say how much and when monies could be disbursed, obtaining homes, cars, etc. for them at prices marked up 100%, with the profits landing in the hands of the guardians.",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "An unusual amount of unexplained deaths among the Osage (poisonings, apparent suicides, apparent murders, questionable accidents, etc.) soon caught the eye of both the Indian tribe and government officials.  Crooked officials and a scared and/or greedy non-Indian population lead nowhere in investigations.  J. Edgar Hoover finally catches wind of the growing crisis and sends undercover agents to investigate, thus beginning the birth of the Federal Bureau of Investigation.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "0307742482"
},
{
    "title": "So very interesting",
    "rating": "5.0 out of 5 stars",
    "content": "This was a heart-wrenching story and just when you thought it was winding down, you discover the deeds were far more severe and far reaching than one can fathom.  I get that sacrifices sometimes have to be made for the betterment of the good, but no sacrifices should include the loss of human lives, and never when that loss of life serves to fatten the pockets of others.",
    "post_time": "Reviewed in the United States on July 18, 2017",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I wanted to reread this book because of the movie coming out, likely with awards expected to come this season. Most people now know the story of how the Osage tribe families in Oklahoma were granted head rights in perpetuity to oil found on their ancestral land early in the 20th century. The newly created FBI began investigating why so many members of the Burkhart family, in particular, began dying within just several years under mysterious circumstances. Generally, no one would admit openly to any knowledge of what had happened. This was because the system of white \"guardians\" required to \"assist\" the Osage with their financial windfalls was totally corrupt. Many Osage were poisoned, also numerous were shot, killed in explosions, etc. by white guardians or \"friends\" conspiring to take their lives to take what belonged to them by right. In the third and final section of the book, Grann discussed primary documents and research he did to learn more about several suspicious deaths that the FBI never resolved, or even investigated in many cases.",
    "post_time": "Reviewed in the United States on April 16, 2022",
    "pid": "0307742482"
},
{
    "title": "Based on true story and facts",
    "rating": "5.0 out of 5 stars",
    "content": "I liked this book. Its story based on true facts. Its about how the Osage Indians were taken advantage of after their new found riches of oil on their land. Its also about how the FBI came into existence. If you like American History then I suggest you read this book.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Killers of the Flower Moon by David Grann is an exemplary expose of just one incident in the despicable history of the European exploitation of the indigenous people of what is known as the North American Continent. Unlike other exposes Grann’s work reads as a dark crime novel.",
    "post_time": "Reviewed in the United States on January 10, 2024",
    "pid": "0307742482"
},
{
    "title": "Ugly picture of mistreatment and exploitation",
    "rating": "5.0 out of 5 stars",
    "content": "It was a page-turner from the beginning to the end. Other reviews have given away much too much of the story, so my comments will be on other aspects.",
    "post_time": "Reviewed in the United States on January 24, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Grann’s judicious use of period photographs of the victims and murderers enhances the narrative and allows the reader to connect with the characters. His descriptions of the execution sites paint enough of a picture that I was able to see the killings take place.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "0307742482"
},
{
    "title": "Very informative, well-written, exciting, reads smoothly.  The Osage story should be known by all.",
    "rating": "5.0 out of 5 stars",
    "content": "A non-fiction book by a journalist might be expected to be a bit on the dry side—not so. Grann delivers tension, conflict, and suspense one would expect of a modern murder mystery.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Gann’s work made me angry: angry at the whites, angry at the government, angry at all but one of the lawmen, and angry enough to want the villains drawn and quartered.",
    "post_time": "Reviewed in the United States on January 2, 2024",
    "pid": "0307742482"
},
{
    "title": "Great Read!",
    "rating": "5.0 out of 5 stars",
    "content": "This is a must-read.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The events of a hundred years in Oklahoma will totally disgust you and leave you in a sort of shock. They are abhorrent beyond words. They will also be a source of fascination.  The atrocities that the Osage people endured make you ask yourself:  how could this happen in the United States?  But there is inspiration, too, in the dedication of FBI agent Tom White and his team, who put their lives on the line and left no stone unturned in their investigations into the dozens of cold-blooded murders of the Osage by those seeking to steal their money. Makes you wonder what life's all about.",
    "post_time": "Reviewed in the United States on January 19, 2024",
    "pid": "0307742482"
},
{
    "title": "wonderful read",
    "rating": "5.0 out of 5 stars",
    "content": "The book was an historical work, well researched and documented, but it reads like a crime thriller.  I blew through it, as it really drew me in. It leaves you with some questions unanswered, as the info available to the writer was limited after almost 100 years had passed.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recommend seeing Scorsese's movie (2023), too.  Starring DiCaprio, DeNiro, and Lily Gladstone. The book is better, as books always are, but the film is good.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "0307742482"
},
{
    "title": "incredible story",
    "rating": "5.0 out of 5 stars",
    "content": "I just read this book for the second time because it is my book club selection for this month. I am surprised at how much I’d forgotten. But then it’s very dense with people and the facts and stories about them. I had never heard of the Reign of Terror, a shameful chapter of our US history. The story is sad and compelling, a worthy, if depressing read. If you’ve seen the movie, which was excellent, reading the book will enrich that experience greatly. The book would have benefitted by a list of the “characters,” their connection to other people mentioned and a brief comment to help remember what they did or what happened to them to help keep track of all that is written about in the book. Highly recommend this book.",
    "post_time": "Reviewed in the United States on March 27, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "MY REVIEW:",
    "post_time": "Reviewed in the United States on June 25, 2017",
    "pid": "0307742482"
},
{
    "title": "IF I COULD GIVE IT MORE THAN 5 STARS, I WOULD.",
    "rating": "4.0 out of 5 stars",
    "content": "\"Killers of the Flower Moon\" tells the  shocking story of what was done to the Osage tribe in Oklahoma in the 1920's. At the time, the Osage was the wealthiest tribe in the U.S. thanks to rich oil deposits found on their reservation.  But, within a very few years, there were an untold number of killings and suspicious deaths on the reservation, and most of the wealth and mineral rights had been stripped from the Osage.  Eventually (some of) the murders were solved and prosecuted thanks to a tenacious Federal Agent of the newly created F.B.I.  But the pilfering had already been done thanks to  legislators, judges, lawyers, law enforcement, bankers, doctors, and people of the cloth. In other words, the most upstanding and well-respected citizens conspired against the Osage.  This didn't happen in the 1700's or the 1800's. It happened in the Twentieth Century! The case was splashed across the headlines at the time. Yet, I never read even one sentence about it in the history books.  \"Killers of the Flower Moon\"  should be required reading for all high school students in this country.  We need to stop sweeping shameful chapters under the rug.  Aren't we supposed to learn from our mistakes?  We must open our eyes and recognize injustice when we see it, not just see what we want to see. \"Those who ignore history are bound to repeat it.\"",
    "post_time": "Reviewed in the United States on April 27, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If I could give this book more than 5 stars, I would.",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "0307742482"
},
{
    "title": "Non-fiction book",
    "rating": "4.0 out of 5 stars",
    "content": "  *****",
    "post_time": "Reviewed in the United States on July 8, 2023",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "MY RUMINATIONS:  COWBOYS AND INDIANS",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "0307742482"
},
{
    "title": "Incredible history!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I was born in rural America in 1950. I have fuzzy memories of sitting in front of the tv watching  \"Davy Crockett\" and \"Daniel Boone\" fighting \"savages\" on a  black and white screen. I remember playing \"cowboys and Indians\" as a child. It goes without saying that the cowboys were the good guys and the Indians were the bad guys. Why was that?",
    "post_time": "Reviewed in the United States on November 5, 2023",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have another memory, this time when I was in my 20's.  I was on a canoe trip with co-workers and their spouses.  At one point, my husband and I  came alongside another canoe with a co-worker of mine, his wife, and their young son. The little boy had a stick and he was pretending to shoot at something on the shore.  Without thinking, I asked, \"Are you shooting Indians?\"...not knowing that the little boy was himself half Indian. I was beyond embarrassed, even though my coworker and his wife (a Native American) graciously accepted my apology. That was 40 years ago, but I never forgot it.  I should have known better.  I thought I knew better. Yet in the recesses of my mind, I was still playing \"Cowboys and Indians\".  (SMH)",
    "post_time": "Reviewed in the United States on February 21, 2024",
    "pid": "0307742482"
},
{
    "title": "Just part of the story from Osage",
    "rating": "5.0 out of 5 stars",
    "content": "Very good information, but sad to know this actually went on in my own country in the past.  Well written.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The information in this book should be taught in all levels of school - grammar school, Middle school, high school, college and University.  This is important historical information that EVERYONE should be aware of so that one specific class of people don't think they are better than anyone else.  I've read the book 3 times and watched the movie 2 times, and bought a copy of the book and gave it to a friend.  This is important history.",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "0307742482"
},
{
    "title": "Very readable nonfiction book",
    "rating": "4.0 out of 5 stars",
    "content": "I rarely read nonfiction books, and I have never read this author's work, but I am glad that I took the time to read this book before I see the movie later this month. The author is very thorough in his research and very detailed in his writing. The story was completely unknown to me. The Osage tribe of Native Americans earned a lot of money from the oil found on their reservation and started out quite rich. However, lawbreaking citizens managed to steal much of the money from the tribe members. When some tribe members ended up dead, the federal government got involved. At this time there was no national police, so newly formed groups investigated, leading to the formation of the FBI. I enjoyed reading this author's work, and will try some of his other work.",
    "post_time": "Reviewed in the United States on October 6, 2023",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was an exciting page-turning crime investigation book.  The pace is a bit slow at first, but when the gruesome murders accumulate (and suspicious cover-ups from local officials begin), it grips the reader.  I also enjoyed the history of this non-fiction work as it showcases the FBI's emergence, the heroic work of Tom White (who lived to 91 years after leading the FBI investigation and nearly losing his life as a prison warden), and the Reign of Terror which brought trauma to the Osage Indians in the early 20th century.  It is awful that suspicions still persist for Osage Indians living in Oklahoma today.",
    "post_time": "Reviewed in the United States on December 24, 2023",
    "pid": "0307742482"
},
{
    "title": "Superb Crime Investigation Book and History",
    "rating": "4.0 out of 5 stars",
    "content": "Although I have not yet seen the movie, my guess is that the book will be much more interesting and engaging by providing detailed context of the murders - and the ruthless evil of Mr. Hale (a swindler who uses bribery and cover-ups to steal from the headrights of Osage Indians).  The conspiracy of corruption among many Whites living in northeast Oklahoma at the time is particularly disturbing.",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed this book for its historical value and ended by wondering why I never learned about this in school.  Very accurate but still a story in progress with further research.",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "0307742482"
},
{
    "title": "Historically Interesting",
    "rating": "4.0 out of 5 stars",
    "content": "Factually written, but kept me invested the whole time. To realize how many people were involved in the hushing and hiding and cover up of these mass murders is sobering, disgusting, and makes one question so many things about our past. I’ve never been a conspiracy theorist, but there is no question there have been some troubling and inhumane conspiracies that greedy people have used to manipulate and abuse people with less means to gain and maintain power. Not a proud time in our nation’s history.",
    "post_time": "Reviewed in the United States on December 26, 2023",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book made me absolutely sick as I read about what the government did to the Osage peoples after pushing them onto a rocky, barren reservation that happened to be rich in oil reserves. The tribe owned the mineral rights and white Americans did unspeakable things to gain ownership of the rights of everything below ground. So many Osage were brutally killed and poisoned. I was sickened by the thinking and actions of the FBI. I read it in one day even though the writing style was very dry, like reportage. My husband is now reading if... I mean seriously reading it, and he hardly reads anything.",
    "post_time": "Reviewed in the United States on April 13, 2024",
    "pid": "0307742482"
},
{
    "title": "A Hauntingly Devastating True Murder Mystery",
    "rating": "3.0 out of 5 stars",
    "content": "Just finished reading this for the second time. Originally I read this excellent book several years ago and enjoyed reading this tragic story. Then I heard Martin Scorsese was making the film based on this narrative. After seeing the excellent movie, I wanted to read it again. It did not disappoint, in fact I enjoyed it even more the second time around.",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "David Grann is an author worth spending time reading. His attention to detail and description of events due to his exploration of the facts, makes this a page turner.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "0307742482"
},
{
    "title": "Oh, how the US government treated the Osage!",
    "rating": "4.0 out of 5 stars",
    "content": "Here's my honest opinion. Some peope will give this a 5-star review simply because it's a very compelling story, which it is. I went into it expecting more entertainment, but this reads very similar to a crime documentary that you'd watch on TV. There are twists and turns, but it's mostly just the facts being put forward. This is a historical account that we should have already known, but has been hidden from us. This is one of the most important events in native American history, yet I had never heard of the Osage nation until I read this. It is important, shocking, and necessary history that everyone should read. Just don't do it just because you heard the movie was good. The events are wrapped up by 60%. Sentences are passed, time is served, everyone eventually dies. I'd like some of my money back for the last 40%.",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I did not know much about this chapter of the Native Americans and how they were victimized over oil rights.  The research by this author was very impressive and he pulled together the history of these families and all the horrific events which they endured.  The treatment of the tribal members by other people in the towns and the government was shameful.  This is a must read!",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "0307742482"
},
{
    "title": "Historical novel made interesting",
    "rating": "5.0 out of 5 stars",
    "content": "I wasn’t able to see the movie so I ordered the book and it was awesome. A lot of historical information.",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had never heard of this part of our history.  Very interesting, but sad to think how bad people can be.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "0307742482"
},
{
    "title": "Very interesting book",
    "rating": "5.0 out of 5 stars",
    "content": "Love the book and the movie",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Reading",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "0307742482"
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "Beautifully told story of an ugly corrupt town. History lesson not taught at schools but thankfully brought to light in this remarkable accounting",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I learned a lot  frm this book but didn’t really get interesting till page to 113",
    "post_time": "Reviewed in the United States on April 24, 2024",
    "pid": "0307742482"
},
{
    "title": "HistoriCal fiction",
    "rating": "5.0 out of 5 stars",
    "content": "A well researched, very well written (including organizationally) narrative history on a subject that has been given attention in the literature but remains relatively unknown by the general public. The murders of the oil rich Osage numbered over a couple dozen and for some brief period a mystery to Osage and authorities alike. I should say, federal authorities.",
    "post_time": "Reviewed in the United States on October 7, 2018",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "While the murders were another reflection of the shameful treatment of the First Nation people in a historical context, in the instance the perpetrator was a local prominent white man living as a friend of the Indians in their midst. The book deals with how the murders were solved and involved a whole cast of characters including tribal members themselves, for several their lives well recounted.",
    "post_time": "Reviewed in the United States on October 29, 2023",
    "pid": "0307742482"
},
{
    "title": "Terrifying that this is nonfiction",
    "rating": "5.0 out of 5 stars",
    "content": "Were it not for the underlying disregard for their race and therefore worth as human beings, this story is very much the age old story about human greed. But thanks to the efforts of federal law enforcement as came to be embodied with the founding of the FBI, the perpetrators, largely Whites but not exclusively, were caught and prosecuted. It is how the author weaves together the story to solve the mystery and in the process ties in side stories about the Indian plight in America and how the Osage by virtually total accident came to reside in one of the richest oil reserves in the country and as a consequence became for a time, the richest Americans because of royalties from the mineral rights, that provides for compelling reading.",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "0307742482"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A positive aspect of the writing is that while the author engages in a handful of side stories to add perspective, they are efficient and accretive to the story, not mini books in themselves that become tedious distractions to the story that characterize too many works of non-fiction. When the main story ended about three quarters through and the author embarked on an epilogue I began to fear his story discipline had broken down. But as it happened the author used the epilogue to tie together loose ends of the story post solving of the murders in the mid 1920s. Very satisfying.",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "0307742482"
},
]