[
{
    "name": "  Summer Island: A Novel ",
    "stars": [
        "60%",
        "27%",
        "10%",
        "3%",
        "1%"
    ],
    "pid": "0345483448",
    "ratings": "31,217 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "Loved how a family was able to come back together and find love for each other. Great read as always, Kristin Hannah knows how to write a gripping tale.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "She knows how to draw u in , like a great symphony with all its parts , rise to a crescendo with a huge finale that makes u feel warm all over !",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "0345483448"
},
{
    "title": "masterpiece",
    "rating": "5.0 out of 5 stars",
    "content": "You will be in tears and smiling at the same time as memories tug. Everyone loves a come back story!",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was so well written! Characters were so deeply developed. I felt I knew them all. The love and hate and then love was something most of us have experienced in our own families. I could not put this book down. Deeply moving .... Kristin Hannah is one of my favorite authors. She outdid herself in this book",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "0345483448"
},
{
    "title": "good summer read",
    "rating": "5.0 out of 5 stars",
    "content": "I like this author Kristin Hannah.  I first read “the women” by her, about life for army nurses who served in Vietnam. This book was quite different, about family dynamics. And relationships within the core family. Sometimes you don’t understand what you think that you know.",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I enjoyed this ..easy read dealing with love, loss, forgiveness and being human ..all the struggles of a normal family that has secrets, hurts and redemption. Entertaining..",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "0345483448"
},
{
    "title": "Family Love and Hate",
    "rating": "5.0 out of 5 stars",
    "content": "I fell in love with Summer Island from the moment they stepped on it. Kristin Hannah can sure tell a great story. I didn’t want it to end.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Easy predictable story but charming - attempts made for insight into making up for wrongs/lost time. No thinking required just a time filler on the beach or the MDs office.",
    "post_time": "Reviewed in the United States on February 18, 2024",
    "pid": "0345483448"
},
{
    "title": "Good story, easy read, thought provoking",
    "rating": "5.0 out of 5 stars",
    "content": "Very hard to put this one down. Her writing is captivating, and certainly hard to make time for a restroom break! Wow, I cried a lot. Definitely recommend Kristin Hannah as a novelist!",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I’ve read three Kristin Hannah books and loved them all. In comparison, this book didn’t hold a candle to The Nightingale or The Great Alone. I was happy with the ending. Otherwise, Summer Island was a slow read.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "0345483448"
},
{
    "title": "A TYPICAL  SUMMER READ",
    "rating": "3.0 out of 5 stars",
    "content": "I MUST BE MISSING SOMETHING. . . .I THOUGHT THAT DEAN WAS THE BROTHER OF RUBY AND CAROLINE.  COME TO FIND OUT, HE WAS JUST A NEIGHBOR. . . .A \"CRUSH\" THAT RUBY HAD.  ANYWAY, AFTER I FIGURED IT ALL OUT, IT WAS AN OK READ.  TYPICAL STUFF.  NOT THE BEST BY ANY MEANS",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have read a number of Kristin Hannah's novels and enjoyed every one.  She is an excellent storyteller and I love that her books are long.  By the end, you feel like the characters are friends.  What I don't appreciate and the reason for my four star rating rather than a five star is her extreme use of foul language.  I am a Christian and the language is offensive to me.  I feel as if the stories would be just as powerful without the language.",
    "post_time": "Reviewed in the United States on September 22, 2023",
    "pid": "0345483448"
},
{
    "title": "Excellent Storyteller",
    "rating": "5.0 out of 5 stars",
    "content": "Absolutely awesome book. How does she get into the minds of her characters so well. I could hardly out this down. I loved and hated and all the characters all the way. Thank you. And a happily ever after, too— I’m hoping!",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this author, my new favorite!",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "0345483448"
},
{
    "title": "she does it again !",
    "rating": "5.0 out of 5 stars",
    "content": "I’ll read anything she writes",
    "post_time": "Reviewed in the United States on March 9, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book!  This story will tear your heart apart and then mend it in a way you never could have imagined.  I wish my mother was here just so we could share this together.  A truly moving take of mother daughter relationships, lost love and what family is all about.  You will laugh, cry and leave with a full heart.",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "0345483448"
},
{
    "title": "Fabulous reading",
    "rating": "5.0 out of 5 stars",
    "content": "Wonderful story  of relationships in a family . and the tragedy of loss and love.  Beautiful ending that you won't want to miss",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I haven’t finished reading. So far so good.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "0345483448"
},
{
    "title": "OMG",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book. Anyone who has lost a sibling will relate. But most of all, to all the mothers and daughters…",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am a voracious reader , this book brought tears to my eyes and touched a place in my heart, and  I thank the author for a return to a different  era of my life.  A Golden Oldie!",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "0345483448"
},
{
    "title": "Another Kristin Hannah novel",
    "rating": "5.0 out of 5 stars",
    "content": "I will love always!  So much pain, sorrow, memories then the underlying love finally comes through!  I loved all the characters and personalities and I laughed and cried throughout the entire book.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Enjoyed  all the characters in their family. A bit emotional at times.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "0345483448"
},
{
    "title": "Family redemption",
    "rating": "5.0 out of 5 stars",
    "content": "The story was woven through time depicting the characters individual journey in growing an awareness that their understanding of love had been stunted by their life experiences. They came together to find a truer and connected measure of love with each other to last a lifetime.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve read several of Kristin Hannah novels and I very much liked this one too. Family is so important. This is a story about judgement and resentment that slowly evolves into forgiveness and moving forward.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "0345483448"
},
{
    "title": "Growing up in love",
    "rating": "4.0 out of 5 stars",
    "content": "This is a story about the estranged relationship between a mother and daughter. Nora Bridge is a well-known and respected advice columnist  and radio talk show host who is always espousing the importance of family. In reality, Nora and her own daughter haven't spoken in years.  Ruby Bridge is a struggling standup comic who's stand-up routine consists of telling stinging jokes about the mother who abandoned her.",
    "post_time": "Reviewed in the United States on September 8, 2016",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Things change when Nora's fans turn against her after a secret in her past is made public by a would-be blackmailer. When Nora is hurt in a car accident, she flees to the family summer cottage to recover from her injuries and get away from the tabloid press. When Ruby surprisingly volunteers to come to the summer cottage to take care of her mother while she recovers, Nora is hopeful this will lead to a reconciliation with her daughter.  What Nora doesn't know is that Ruby has accepted $50,000 to write a \"tell all\" magazine article about her mother.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "0345483448"
},
{
    "title": "Forgiveness and moving forward",
    "rating": "4.0 out of 5 stars",
    "content": "This sounds like the makings of a good story (and I haven't even mentioned the rekindling of a childhood romance storyline, or the childhood friend who is now dying storyline). The book isn't bad, but it did fall a bit flat for me. It probably didn't help that Ruby isn't the most sympathetic character.",
    "post_time": "Reviewed in the United States on March 25, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "\"Summer Island\" was not nearly as compelling a story as Kristin Hannah's \"The Nightingale\", an historical fiction about two sisters during the Second World War.  Nor was it as enjoyable a read as \"Firefly Lane\", about two best friends during the Seventies, Eighties and Nineties. I think this book deserves 3.5 stars, but I'm rounding up because of the goodwill left over from prior books I've read by this author. And because I look forward to reading another Kristin Hannah book soon.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "0345483448"
},
{
    "title": "Not one of Kristin Hannah's best, but still a good read",
    "rating": "3.0 out of 5 stars",
    "content": "I love Kristin Hannah’s books and this did not disappoint.  Great “summer” read.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Different type of plot",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "0345483448"
},
{
    "title": "Nice story of reconciliation on all levels.",
    "rating": "5.0 out of 5 stars",
    "content": "Summer Island was a sweet love story. Not just between man and woman, either. It touches us to cherish the love we have for all people in our lives.",
    "post_time": "Reviewed in the United States on March 24, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is an earlier book of hers which I had never read. Family expectations and realities of a broken family, and their journey to repair themselves. Great read.",
    "post_time": "Reviewed in the United States on March 23, 2024",
    "pid": "0345483448"
},
{
    "title": "Kristin Hannah fans",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed the setting in the San Juan Islands, which brought back memories of my family vacations boating and island hopping.",
    "post_time": "Reviewed in the United States on July 28, 2023",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Most of all I savor Ms. Hannah’s gift of writing. She captures complex emotional journeys that lead to truth and healing which ultimately allows me (the reader) a window of reflection and understanding of one’s own family drama.",
    "post_time": "Reviewed in the United States on January 29, 2024",
    "pid": "0345483448"
},
{
    "title": "great summer read",
    "rating": "5.0 out of 5 stars",
    "content": "I was hooked from the first page.",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The beautifully descriptive writing just pulled me in and I didn't want to put this book down.",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "0345483448"
},
{
    "title": "Oh my gosh, the writing!",
    "rating": "5.0 out of 5 stars",
    "content": "Loved the story, and the totally relatable and wonderfully flawed characters.",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "To me, this is a perfect example of excellent women's fiction.",
    "post_time": "Reviewed in the United States on February 17, 2024",
    "pid": "0345483448"
},
{
    "title": "Summer Island",
    "rating": "5.0 out of 5 stars",
    "content": "hope's a new reader of Kristin Hannah's. This is my first read, it was so full of feeling, I can't wait to get started on the next one.",
    "post_time": "Reviewed in the United States on July 29, 2023",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Summer beach read",
    "post_time": "Reviewed in the United States on February 18, 2024",
    "pid": "0345483448"
},
{
    "title": "Always a good read",
    "rating": "4.0 out of 5 stars",
    "content": "Easy dependable good story.  You can see where this will go but you still want to read through. Kristin Hannah is always a good read- just some better than others",
    "post_time": "Reviewed in the United States on November 25, 2023",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Made it almost 80% through the book, but for once couldn’t finish it.  The characters were either uninspired or inauthentic.  Ruby was ok, but was annoyed by the rest of them, mostly.  I guess Kristin Hannah - who normally is a pretty strong author — hadn’t really hit her stride with this one.  A harlequin summer read, at best.  Pass.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "0345483448"
},
{
    "title": "Meh",
    "rating": "5.0 out of 5 stars",
    "content": "a touching a lovely book. Hannah is a wonderful writer!!",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kristin did it again and I am hooked! So many emotions and true realities. Of course, it ended as I would have dreamed. Thank you so much!",
    "post_time": "Reviewed in the United States on April 23, 2024",
    "pid": "0345483448"
},
{
    "title": "another great Hannah book!",
    "rating": "5.0 out of 5 stars",
    "content": "Kristin Hannah is an amazing writer. She is absolutely amazing. Her books touch feelings that you didn’t even know you had.",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So good",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "0345483448"
},
{
    "title": "Summer Island! Fantastic!",
    "rating": "5.0 out of 5 stars",
    "content": "Very well written to hold interest throughout the story. The author brings in several different types of family dysfunction without getting to heavy but true enough to evoke some real feelings. Makes you smile and also brings a few tears at times. A feel good read all in all!",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My entertainment while flying and visiting",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "0345483448"
},
{
    "title": "What a beautiful story.",
    "rating": "5.0 out of 5 stars",
    "content": "Powerful story about mistakes and truths and forgiveness with moving forward  Lots of important lessons - one of my favorites",
    "post_time": "Reviewed in the United States on April 26, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is totally different to some other novels . .",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "0345483448"
},
{
    "title": "Gifted",
    "rating": "4.0 out of 5 stars",
    "content": "Good service and well received",
    "post_time": "Reviewed in the United States on December 6, 2023",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this story. It reached my heart. My mom psssed away twelve years ago and I still remember the bad, but especially the good and great about being her daughter.",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "0345483448"
},
{
    "title": "one of her best",
    "rating": "5.0 out of 5 stars",
    "content": "I loved how the family found each other again and worked through some very difficult emotions and issues. It was very sad that Eric and Dean’s parents couldn’t bring themselves to honor their son’s in life and death.",
    "post_time": "Reviewed in the United States on February 9, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was an emotive and beautiful tale of a Family. The realities of life, with all its glory and flaws.  Especially now, in these times when everyone is so deeply opinionated about politics and religion, it’s a great reminder about what matters most.  Love matters most.  Forgive and remember that time is fleeting.  Except your differences and be kind.  That’s all.",
    "post_time": "Reviewed in the United States on May 9, 2023",
    "pid": "0345483448"
},
{
    "title": "gripping",
    "rating": "5.0 out of 5 stars",
    "content": "This one has it all - I laughed, cried, and mused.  Made me think about the reality of life, and the flaws in each of us. And how when we seek to understand (rather than judge) we learn so much. We learn about ourselves.",
    "post_time": "Reviewed in the United States on April 30, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love Kristen Hannah books. Great read",
    "post_time": "Reviewed in the United States on January 13, 2023",
    "pid": "0345483448"
},
{
    "title": "Summer Island",
    "rating": "3.0 out of 5 stars",
    "content": "I think what I liked most about this book was that it celebrated the fact that families don’t have to be perfect to be wonderful.  The contrast between the original version of the Bridge family and the mess it became after several years of decisions, assumptions, mistakes and failures is stark.  The peeling back of those layers is at the same time painful and poignantly beautiful.",
    "post_time": "Reviewed in the United States on February 3, 2024",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One thing is for sure, we are shaped by our childhood, but we get to choose to be better people when we are adults. This book explores so many facets of how to become a more balanced mature person from so many angles.  I really enjoyed it.",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "0345483448"
},
{
    "title": "Great book!!",
    "rating": "5.0 out of 5 stars",
    "content": "This is worth reading but her newer novels are so much better. This is a well written story of a family that was destroyed but found their way back. A bit sappy but I still liked it.",
    "post_time": "Reviewed in the United States on September 21, 2023",
    "pid": "0345483448"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You will laugh, you will cry - I mean actually need tissues cry - and you rejoice as this family finds their way back to each other",
    "post_time": "Reviewed in the United States on February 9, 2024",
    "pid": "0345483448"
},
]