[
{
    "name": "  The Demon of Unrest: A Saga of Hubris, Heartbreak, and Heroism at the Dawn of the Civil War ",
    "stars": [
        "65%",
        "24%",
        "8%",
        "2%",
        "1%"
    ],
    "pid": "0385348746",
    "ratings": "8,938 ratings",
    "other_info": {},
    "discount_price": "$ 15.03",
    "normal_price": "$35.00",
    "about_this_item": []
},
{
    "title": "An appeal to the better angels of our nature...",
    "rating": "5.0 out of 5 stars",
    "content": "At a time when our nation is perilously divided, Erik Larson publishes \"The Demon of Unrest\" and strikes a note of warning. He authors another winning work of narrative nonfiction detailing the events following the 1860 presidential election that propelled Abraham Lincoln to the White House and ushered in America's cataclysmic descent into civil war. Additionally, he brilliantly animates the famous characters of this period (Buchanan, Lincoln, Seward, and Davis) and lesser names such as Edmund Ruffin, James Hammond, and Mary Chesnut of the Southern planter aristocracy. Strikingly, the latter, products of generational slave ownership and owning as many as 400 slaves, vociferously and unashamedly champion the cause of slavery. Larson’s narrative serves as a cautionary tale, reminding us of the dangers of division and the importance of unity in our current social and political climate.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "From his extensive research, the author quotes from speeches, letters, diary entries, and other period documents revealing unapologetic pro-slavery sentiment. Through these Southerners' thoughts and comments, we learn just how, like Kudzu, slavery became wildly entwined with Southern culture. No matter how inexplicable or indefensible their position might be today, in the mid-19th century, these Americans believed it was their birthright to continue owning other human beings in the name of tradition and because slavery was so much a part of the Southern culture and rural economy. More importantly, with \"The Demon of Unrest,\" Larson sheds light on how charged the issue of slavery was in the years leading up to Lincoln's election and, therefore, how inevitable secession would become.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "0385348746"
},
{
    "title": "Excellent story telling and a worthy time investment",
    "rating": "5.0 out of 5 stars",
    "content": "As always, the author’s character development is first-rate. Perhaps best of all is his treatment of Major Robert Anderson, a career U.S. Army officer and one of the central characters appearing throughout “The Demon of Unrest.” Anderson, the Fort Sumter, South Carolina commander, and gallant American patriot of the first order, became one of the early heroes of this period. We witness his painstaking preparations to fortify Fort Sumter, a U.S. Army garrison and initial Union stronghold, key terrain in the middle of Charleston Harbor and the annals of U.S. history. He and his charges remain alone on an island, steadfastly defending American ideals. Their challenge becomes existential on April 12, 1861, when the Confederates bombard the fort and two days later force its surrender to start the war.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Claiming three-quarters of a million lives, the American Civil War, or the War Between the States, was a watershed event, the legacy with which we, as Americans, still live today. In addition to the author’s signature ability to capture the mood of a particular period or incident in history, Larson fans will recognize his trademark emphasis on meticulously mining historical documents to bring the story to life, for instance, capturing seemingly insignificant comments and minor actions of the characters so that we see that they, like us, were fully human. In detailing their activities, Larson transports us to an earlier age during which honor and chivalry in the Antebellum South held sway. Then, negotiations deadlocked, both sides determined not to move off their hardened positions, the nation tilts to war, and we readers have a ringside seat. The author helps us see firsthand how the Civil War, which resulted in more than 600,000 casualties over four years, was virtually a foregone conclusion.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "0385348746"
},
{
    "title": "A detailed account of the lead up to the beginning our Civil War and the fall of Ft. Sumter",
    "rating": "5.0 out of 5 stars",
    "content": "Larson writes fluidly but concisely, some chapters only a few pages long, and his sturdy vocabulary challenges readers to be Merriam-Webster-ready. His strength is pacing; he allows events to unfold in a way that captures the reader's attention and holds it transfixed for page after page. Like all his books, “The Demon of Unrest” reads like the story is happening in real-time. Larson achieves his objective; he sounds the alarm that another collapse into chaos is not far-fetched. Unrest in America is mounting.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One reads \"The Demon of Unrest\" with his mouth agape, incredulous that these events happened and could happen again. Worry, anxiety, and fear grip the nation today just as they did in the deeply divided America of 1861. South Carolina, specifically Charleston, became ground zero for American turning on American and friend becoming foe. A charming U.S. city seemingly overnight morphed into a powder keg.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "0385348746"
},
{
    "title": "Brilliantly Captures the Passions and Uncertainty at the Outbreak of America's Civil War",
    "rating": "4.0 out of 5 stars",
    "content": "Indeed, 1861 brought us a national Hatfield-McCoy moment, the American family riven by disagreement and debate. When considering our shrill and uncompromising public discourse and eroding confidence in U.S. government institutions today, readers of \"The Demon of Unrest\" can appreciate how easily the situation could devolve into another armed conflict.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Above all else, Larson’s \"The Demon of Unrest\" reminds Americans that we must, in Abraham Lincoln's words, \"appeal to the better angels of our nature.\"",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "0385348746"
},
{
    "title": "Another great Larson book",
    "rating": "5.0 out of 5 stars",
    "content": "I thoroughly enjoyed reading this book. I grew up in Pennsylvania, just outside Gettysburg, but have lived in Charleston, SC for over 10 years now and in SC for over 20. I found the author's bias toward southerners - their attitudes toward Yankees (yes, it's still a thing), their idea of honor, their society structure, etc. - all very accurate and very obviously telling. The author made no qualms of making his belief that the Civil War was exclusively based on the protection of slavery well known in the book. However, in Charleston the belief is (still) that they were fighting for State's rights and to protect their way of life, not necessarily to protect their right to own slaves. Larson truly hit the nail on the head with the dichotomy of the war's driving force and couldn't have more accurately captured the attitudes of those times and still now.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fort Sumter was vividly described and easily allowed readers to visualize the site, even for those who have never been here in person. My only negative for the book is that I felt some of the side stories could have been minimized just to keep the focus on the war. Ms. Mary Chestnut's storyline in particular I didn't feel contributed much to the story of Fort Sumter and the start of the Civil War, but would be an excellent basis for any number of spin-off stories about life in that era and/or in Charleston.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "0385348746"
},
{
    "title": "A Great Read",
    "rating": "5.0 out of 5 stars",
    "content": "The author does a great job at presenting history in a very readable, fascinating way.  He covers all of the sides in very fair manners and gives a lot of details that you do not find in your typical school history class.  This is the second book that I have read by this author and I will read more from him!  He breaks up the stories into digestible chunks which makes it easier to read.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Demon of Unrest by Erik Larson",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "0385348746"
},
{
    "title": "It Begins",
    "rating": "5.0 out of 5 stars",
    "content": "The Demon of Unrest: A Saga of Hubris, Heartbreak, and Heroism at the Dawn of the Civil War",
    "post_time": "Reviewed in the United States on October 16, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "by Erik Larson (Goodreads Author)",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "0385348746"
},
{
    "title": "A warning to those who are enthused about the glories of war!",
    "rating": "5.0 out of 5 stars",
    "content": "RJ's review",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Aug 07, 2024  ·",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "0385348746"
},
{
    "title": "Fascinating and outstanding!!!",
    "rating": "4.0 out of 5 stars",
    "content": "*****",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Thoroughly researched account of the hold out, then surrender of Fort Sumter , this book reads like a novel. With short chapters, one cannot wait to read on. Taking place between the arrival of Lincoln in Washington and his inauguration, the US fort is a thorn in the side of the slave holding South Carolinians. They declare themselves seceded, send reps to DC, are very put out that they are denied access to Lincoln to have him acknowledge they are now a separate country, soon joined by other southern states.They are led on by Secty of State to be , Wm. Seward who likes to think he is in command, not the president.When Sumter not surrendered, other nat'l sites nearby including a smaller fort, are occupied by southern men and guns. Fort commander Anderson, a southerner but loyal to the Union , hopes to be reinforced. Food runs out. A bombardment into the fort sets the gun powder afire ; they can not contain it. When there is no hope left, the Union troops leave Sumter and are saluted by the enemy which lives by what they consider a code of chivalry. The disloyalty leads to 1.5 M casualties. The VA warmonger man who shoots the first shot, shoots himself at wars end.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "0385348746"
},
{
    "title": "Demon of the Unrest",
    "rating": "4.0 out of 5 stars",
    "content": "As we are led thru the day by day, event by event of both sides looking at ‘winning’ for their ideas, it’s so shocking they did so without any thought of the soon to be dead 750,000 people, including children and the loss of Federalism with the rise of a single nation, indivisible with a President who is essentially a dictator.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely marveled in the details unknown about a time usually covered as ... \"The Civil War began when the Confederates fired on Fort Sumter...\" This book saw me through sleepless nights in a season of unrest for ourselves. I just can't thank Mr. Larson enough for this piece of work and am excited to read another! Discovered via Armchair Expert podcast.",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "0385348746"
},
{
    "title": "Fantastic as always",
    "rating": "5.0 out of 5 stars",
    "content": "I am a devoted reader of Larson’s ooks. I own them all & have read & reread them all multiple times. I have always found civil war history tedious and daunting, so I felt Larson might be a good way to catch up. I was not disappointed! While the book basically only covers the events leading to the fall of Fort Sumter, as always, Larson provides detailed insight into the issues happening at the time. If you love Larson’s writing as I do, or are interested in an especially fraught period in US history, I recommend this book VERY highly!",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Erik Larson is my favorite author. I’ve read all of his books and own First Editions of each of them. There are few writers out there who can bring history alive as well as he does. “The Demon of Unrest”  is no exception. Some readers may find some of the side stories and accounts distracting or not needed. I think they just add color and nuance to the overall environment he creates for us. I always learn a great deal because his research is absolutely meticulous, and his writing style so compelling. He’s the history teacher you wish you had  - or maybe were lucky to have had. When you read an Erik Larson book and go back in time, you are THERE.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "0385348746"
},
{
    "title": "BRINGS HISTORY ALIVE",
    "rating": "5.0 out of 5 stars",
    "content": "Incredible detail and perspective never learned in school on Lincoln, Fort Sumter, and just overall climate of our nation!  Erik Larson is my new favorite historical fiction author.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As usual, Erik Larsen does a profound job of digging into the details lurking behind the scenes. I received a history lesson about things that I had no idea about! We've all heard that the Confederates opening fire on Fort Sumter was the \"beginning\" of the Civil War - but at least for me, I had no real understanding of the issues that led up to it. From the election of \"Honest Abe\" to the waters of Charleston Harbor and stemming back a number of years, the book covers a lot of territory and defines the main actors in this slowly unfolding drama. I'd always wondered what became of the troops stationed there, if they ever returned fire, if any of them were killed, and what in the heck was so important about the fort anyway? Now I know! And I'm thankful to Erik for bringing it all out into the open and expounding upon it from historical documents, letters, diaries, and personal writings. Well worth the read!",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "0385348746"
},
{
    "title": "Phenomenal recount of history!",
    "rating": "5.0 out of 5 stars",
    "content": "The author is an outstanding chronicler of history!  He actually begins this work with Lincoln running for President and winning.  South Carolinians feared Lincoln's abolitionist bent would disrupt their plantation lifestyle and economy by emancipating slaves.  The governor of S. Carolina and others warned Lincoln of their displeasure and threatened to sieze Federal property including forts.  On December 20, 1860 shots were fired from Charleston on Fort Sumter, located off-shore in Charleston Harbor.  Major Robert Anderson, commander of the Fort's garrison, maintained a steady response to the bombardment. The first Union casualties of the Civil War, occurred at Sumter even before other southern states had suceeded. Due to limited food rations for his men and a fire that destroyed barracks and the entry gates of the fort, Anderson made the difficult decision to surrender on April 13, 1861.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Larson continues with the departure from the Union of other southern states.  Major battles are described as well as the events that lead up to the tide of the war turining in the Union's favor.  The author's bibliography and chapter notes are extensive including personal diaries, official records of the Union and Confederate armies , telegrams, personal and military correspondence and official reports.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "0385348746"
},
{
    "title": "Incredible, what they never told us in school!",
    "rating": "4.0 out of 5 stars",
    "content": "On April 14, 1865, now Brigadier General Robert Anderson raised at Sumter the fort's original stars and stripes .  He gave a speech that evening at a dinner praising the leadership and support of his beloved President. On that very evening, Abe Lincoln was shot and died the next day.  It is just one of the many historical ironies in this fascinating history.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We all know the reasons for the Civil War. What fascinated me about reading this though was the many  thoughts of many of the southern, and northern lead players of the time in regards to slaves and slavery. The division of the country at the time prior to the Civil War rings pretty much of the division in this country presently! Have we learned anything from past history or are we on the verge of another Civil War?",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "0385348746"
},
{
    "title": "So Much More Than About a Fort!",
    "rating": "4.0 out of 5 stars",
    "content": "GREAT READ from a GREAT AUTHOR!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great book and the multitude of reviews hit all the salient points.  The only thing missing is a good map of Charleston Harbor to orient the reader as to the location and distances of Ft. Sumter to Charleston proper, James Island, Sullivan Island etc.  Although well described, you can't beat a map.  I found using a wartime map of Charleston Harbor as a reference while reading of benefit.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "0385348746"
},
{
    "title": "Great read for civil war history fan",
    "rating": "5.0 out of 5 stars",
    "content": "After visiting Fort Sumter last year, I was excited when learned this book would come out this year. While everyone reading most likely knows how the story begins and ends, it’s well-written and kept my interest locked in. I’ve read other of the author’s books and this is my favorite hands down. Hope to see more civil war era books from him one day!",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So intense so historically accurate. In reading I felt like I was there.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "0385348746"
},
{
    "title": "excellent",
    "rating": "5.0 out of 5 stars",
    "content": "Erik Larson always a pleasure in reading thank you.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Been reading it from library.  So decided to buy as a gift for a history buff.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "0385348746"
},
{
    "title": "Read it",
    "rating": "5.0 out of 5 stars",
    "content": "Great book.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Erik Larson's works are not fiction -- they are 100% fact. This thorough and brilliantly-researched book makes the larger-than-life characters of the months leading up to the opening of hostilities human, real and believable in their emotions, beliefs, causes and hatreds. If ever anyone wonders what EXACTLY the war was about, this book answers that unequivocally, in the very words of those who said them or wrote them. A \"must-read\" for any fan of American history, or, for that matter, for EVERY American.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "0385348746"
},
{
    "title": "The Forgotten Truth about the Start of the Civil War",
    "rating": "5.0 out of 5 stars",
    "content": "Eric Larson has an amazing ability to write a historical book and make it read like a novel.  My opinion may be biased, being that I am a Civil War enthusiast, but I enjoyed this book as much as any of his previous efforts.  While we are all aware of Fort Sumter's importance as the starting point of the Civil War, the events that led to its attack, and the move towards succession are brilliantly detailed, without bogging the reader down with too much minutia.  Another brilliant work by Larson",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you read this gripping tale with reasonable historical hindsight, knowing how the events expertly related here lead to the death of 750,000 American soldiers, and the injury of millions more, you cannot help but feel a searing pain in the pit of your stomach, and a deepening heartache as you note our contemporary political climate. Mark Twain said that \"history does not repeat itself but it does rhyme\". Catastrophe has a nasty habit of sneaking up on us, and this well-written history of the five months leading up to the onset of the Civil War is often quite unsettling.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "0385348746"
},
{
    "title": "Another great Larson read",
    "rating": "5.0 out of 5 stars",
    "content": "Any Civil War enthusiast will be familiar with the events detailed in this book. What author Erik Larson does carefully, and with technical skill, is provide coherence to what were a dizzying series of events, then to explain them carefully and clearly, and shape them with novelistic drive and tension. I've read enough dry academic history to appreciate Larson's ability to breath life into unfolding events. There is a place for straightforward factual academic description. It creates an ongoing chronicle that we can use to measure the significance of events.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "But there is also a place for unfolding an historical narrative that adds humanity to the story. It is through the scrim of living history that we can begin to understand why things happened the way that they did. Larson's skill lays in the way that he amasses relevant details, and then organizes them into something resembling a living tapestry, out of which history becomes more than merely a series of disconnected events.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "0385348746"
},
{
    "title": "Another Great One from Erik Larson",
    "rating": "5.0 out of 5 stars",
    "content": "Erik Larsen has become my favorite author. His ability to tell a story around a historical event is unmatched and \"The Demon of Unrest\" is no exception. He weaves a tale around the events that would culminate in the beginning of the Civil War, the reluctance of parties on both sides to fire that first shot, and the confusion in Washington (which is nothing new, I guess). The story is about men on both sides who were put in difficult positions yet refused to back down. It is a great read and an important story.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book was shipped and delivered remarkably fast. Importantly, it was very well packaged, so it was well protected. Great job. When this shipper gives a book's condition, you can depend on it. That is so important. Thanks Amazon.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "0385348746"
},
{
    "title": "Great service & grest product",
    "rating": "5.0 out of 5 stars",
    "content": "Erik Larson doesn’t disappoint and I have all his books on my bookshelf. This is an incredible story about how the U.S. inched toward the Civil War. Yes, it was slavery because the slaveowners believed that the Black human beings who performed every job on their plantations and mansions were a lower version of humans only suited for brute labor. Larson quotes Alexis de Tocqueville who had observed two decades earlier that “The citizen of the Southern states becomes a sort of domestic dictator from infancy…”",
    "post_time": "Reviewed in the United States on May 31, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I found many comparisons to today's divided politics and the politics that gave way to the Civil War. How Buchanan, the sitting president during the rising unrest regarding the North’s and the South’s opposing views on slavery sat on his hands and allowed the outcry to ferment so that the newly elected Abraham Lincoln had to deal with it. Lincoln walked into a hornet’s nest with some Southern states seceding from the U.S. while others held secession conventions and delegates. Many of the South’s richest and most influential citizens were fanatics and the media of the times was equally biased. When the Confederates began firing at the vulnerable Union fortification, Fort Sumter in Charleston Harbor, South Carolina, Union soldier, Captain Doubleday, wrote in defending the fort since the Union did not fire the first shot, “The only alternative was to submit to a powerful oligarchy who were determined to make freedom forever subordinate to slavery.”",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "0385348746"
},
{
    "title": "CHANGE THE CHARACTERS AND THE STORY IS ABOUT TODAY",
    "rating": "5.0 out of 5 stars",
    "content": "Larson writes about the military, journalists, and citizens who left a record of that period. This is a must-read for everyone; especially those of us who constantly see history repeat itself but can’t always draw on the past to prove it.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very interesting look at what started the Civil War.  Such a sad story.  Neither side thought it would ever escalate the way it did.  After the first shot was fired there was no turning back.  It sounds very much like today.  Terribly tragic.  A very good read.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "0385348746"
},
{
    "title": "So sad...",
    "rating": "5.0 out of 5 stars",
    "content": "Long but an easy read. Will look for other books by this author.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Larson is one of my 3 favorite authors and has done a good job (except with his comparison of Jan 6) detailing events prior to and during the first shots of the Civil War. Southerners unknown to me previously who were responsible for stirring up the heat were detailed wonderfully, and his criticism of Buchanan was dead on. I also have changed my view of Winfield Scott, who made absolutely sure there would be no interruptions during the transfer of power at Lincoln’s inauguration. Good read, recommend reading it.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "0385348746"
},
{
    "title": "Well written",
    "rating": "5.0 out of 5 stars",
    "content": "The intensity of the ‘Southern cause’ was most startling, from both a moral and economic perspective. The idea that the rest of the world would come around to Southern beliefs if deprived of King Cotton, in spite of the personal costs to black slaves, was misguided and cruel, to say the least. A very well written book.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have found that all the Erik Larsen books I have read are very good and accurate.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "0385348746"
},
{
    "title": "Good but not great",
    "rating": "4.0 out of 5 stars",
    "content": "I love Erik Larson’s books and have read nearly all of them.",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Demon of Unrest is a page turner once you get past the slow start. It inspired me to visit Fort Sumter this month with my son and opened my eyes to much about the civil war’s start that I did not know.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "0385348746"
},
{
    "title": "Interesting History not taught in schools",
    "rating": "5.0 out of 5 stars",
    "content": "But on the whole the book relies too much on a few main characters that really add little to the narrative - too",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "much of Mary Chestnut’s flirtations and Edward Ruffin’s depression. These inchoate intrusions steal away our attention from the main characters and their amazing journey.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "0385348746"
},
{
    "title": "Eric Larson writes to keep you reading!",
    "rating": "5.0 out of 5 stars",
    "content": "It’s as if Mr. Larson has a romantic fancy with fringe characters that infects the main of the whole.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "That being said, I could barely put the book down and cannot wait until his next.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "0385348746"
},
{
    "title": "Well Told Story… …As Usual",
    "rating": "4.0 out of 5 stars",
    "content": "Cheerio",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "In reading about the Civil War in the past I never realized what an import part Fort Sumter played in starting the war. Also, I didn’t realize how naive both the North and South were about each other’s position on the war. This book brings it all to light in a very well written way.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "0385348746"
},
{
    "title": "Gripping, best book on civil war",
    "rating": "5.0 out of 5 stars",
    "content": "Larson communicates how the culture of the 1860's, the lag of time for letters to arrive, and the hubris of some major players fueled the start of the Civil War.  It was hard to stop reading.  It's not only historical, but culturally broad about the lives of the characters involved.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "How can you go wrong with a Larson book?  You can’t. This one tells a story very well, and provides perspectives into the pressures our country faces today.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "0385348746"
},
{
    "title": "A good look at the events leading to April 1861.",
    "rating": "4.0 out of 5 stars",
    "content": "This was a much better book by Erik Larson than some of his earlier books, as he referenced a number of sources. Unfortunately, he paints a picture of the South based on the diaries and writings of a few very wealthy individuals. This presents a politically correct picture of the South. Most Southerner in 1861 were not slave owners. In Louisiana, there were blacks who owned slaves. Taking the bias out of the story, it still is a good look at the events from the Lincoln election though the Spring of 1861, with a short look at the aftermath of the principals.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Erik’s extensive and expansive research produced an awesome",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "0385348746"
},
{
    "title": "Relevant lessons from our history",
    "rating": "5.0 out of 5 stars",
    "content": "String of quotes from historical figures, both famous and ordinary, to form the framework of the story he’s brought to us, while providing the color commentary that forms the glue that holds it all together. Given the divided state of our country today, we could all benefit from a lesson in what happened the last time the country faced such division.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very easy to read and draws parallels to recent events.As usual a great job by Larson providing a strong narrative to the beginning of the civil war.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "0385348746"
},
{
    "title": "Great Book",
    "rating": "5.0 out of 5 stars",
    "content": "I am a Larson fan. I've read every one of his books. I pre-ordered this one and was so looking forward to the read. Upon completion of the book... I'll say it was worth the read, but not his best work. Maybe I had built up too high of expectations during the wait and set myself up for disappointment. Whatever the reason, the book kept my attention but was not a stay-up-late-page-turner. As we've come to expect, Larson's use of historical documents to add color to history works extremely well to understand the characters in the book. In spite of being underwhelmed, I still recommend the book and look forward to his next one.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Learned so much more than what is in our history classes of the simple, very human causes that had us stumbling into horrific war and struggle for our Republic and it's foundation.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "0385348746"
},
{
    "title": "Good read...not his best work.",
    "rating": "5.0 out of 5 stars",
    "content": "Are we once again at such a turning point where a minority of people, with determined beliefs, are so similarly determined to impose their ideology on the majority ... destroying a democracy and replacing it with their autocracy?",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved reading the book. I learned so much about important things I knew little about. Thank you Eric for peaking my interest",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "0385348746"
},
{
    "title": "Outstanding Read",
    "rating": "5.0 out of 5 stars",
    "content": "Great and through read. Detailed in every way. We always learn about the war and the big events that lean to the war, but this is the overall pulse of the nation, the thoughts and feelings of the country.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have read Devil in the White City and 2 or 3 others of Larson's and they have all been great. This one is my 2nd favorite behind \"Devil....\", but a great read. I was surprised it ended about 65% of the way through with footnotes, bibliography etc, but still over 300 pages of great reading.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "0385348746"
},
{
    "title": "History told as if you were there",
    "rating": "5.0 out of 5 stars",
    "content": "A sense of understanding the mood of pre-civil war America as it’s being choreographed for the reader to experience a time when divisions was so intense.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Doug",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "0385348746"
},
{
    "title": "Good book.  Excellent narration voice.",
    "rating": "4.0 out of 5 stars",
    "content": "First and foremost, I am reading along to the audible version of this book and the narrators voice is amazing.  I highly recommend buying by the the book and the audible on this one.  This is the second Erik Larson book I've read, \"Devil in the White City\" being the first.  With Devil the biggest criticism was that the duel narratives were disjointed and sort of crammed together.  I agreed with this.  Reading this book is so much more cohesive,and therefore easy to get into.  The civil war isn't even one of my favorite historical eras and I am addicted.  Erik Larson really knocks this out of the park.  I highly recommend trying this book on for size, it's intrancing.",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Erik Larson brings us another of his trademark style books; this one examining the months leading up to the firing on Fort Sumter that began the Civil War. Larson relies extensively on stories emanating from the diaries and letters of key people, in particular those of firebrand secessionist Edmund Ruffin, Southern diarist Mary Boykin Chestnut, the reporting of British journalist William Howard Russell, and the official papers of Major Robert Anderson, commander of Fort Sumter. These insights help create the storytelling saga with which Larson has become famously successful.",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "0385348746"
},
{
    "title": "Larson in his trademark style",
    "rating": "4.0 out of 5 stars",
    "content": "Ironically, I was less impressed with this book than I have been with some (but not all) of his others (Devil in the White City probably being his best). I think in part this is because I am so familiar with the subject and thus didn't really learn anything new. Other readers are likely to find the book more fulfilling.",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "David J. Kent",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "0385348746"
},
{
    "title": "A most deserving best seller !",
    "rating": "4.0 out of 5 stars",
    "content": "Author, Lincoln: The Fire of Genius",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "President, Lincoln Group of DC",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "0385348746"
},
{
    "title": "A \"Dad\" Hostory?",
    "rating": "5.0 out of 5 stars",
    "content": "Erik Larson's \"The Demon of Unrest,\" his latest best seller, is an unbiased, decidedly factual history of the taking of Fort Sumter by the nascent Confederacy in April, 1861. His day to day recounting can be a tad tedious at times; his slow paced way of story telling provides an inherent honesty, the development of background and a build up of color and detail to the eventual surrender of the Fort in mid April, 1861. His cast of characters is wide ranging and superb in context; Presidents Lincoln and  Buchanan, the warriors,  Major Robert Anderson, Abner Doubleday, PGT Beauregard, and then the Secessionists, James Hammond and Edmund Ruffin,  along with the essayist, Mary Chestnut. Larson never preaches, his storyline and the marshaling of the facts is sufficient for readers to judge for themselves about this seminal event in American history, its sparking role of the clash between South and North, and,  in the end,  the abolition of slavery,  as the real cause of this War.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Alexis Coe writing in The New York Times reviewed this latest submission of Erik Larson on April 30. So snarky is the review that one must wonder if there is a history of personal animus between these two authors. She states that Larson is the \"reigning king of Dad History.\"  I'm a Dad, but I have no clue as to what that moniker applies.  Is a bibliography of eleven pages (number 9 font) and notes of 31 pages (ibid), too short?  Does the fact that the book is readable, and not a tome for study and final exam somehow diminish its scholarly content? Coe writes, \"Nary a Black person, free or enslaved, is presented as more than a fleeting, one-dimensional figure. Frederick Douglass, a leading abolitionist and standard of histories of the era, warrants no more than a mention.\" Here, she is correct, perhaps forgetting that the book's subject concerns the leaders of the Secessionist and Union movements who are the subjects of the book. It is unfortunate that luminaries such as Douglass \"warrants no more than a mention\", yet said luminaries were not leaders of the movements.",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "0385348746"
},
{
    "title": "Wow, what a book!",
    "rating": "5.0 out of 5 stars",
    "content": "This was fabulous, as all of his books are, but as an amateur historian of the Civil War era, this INE impacted me differently. The detail, the pace, the words chosen, this book is in a class of its own.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Erik Larsson, writing from primary sources, covers the period from Lincoln's election in 1860  to his inauguration in 1861, a period in which 11 states seceded (the same states -- with the exception of Virginia-- are red states today). It is a work of history which takes you into the homes, the diaries, the cities, the forts. Through the people in the middle of it and  in the periphery of it, you understand them, their actions and utterly see how our history of cotton and slavery is a foundation for everything we are today. It is a book which takes in the forest and each of the individual trees. I read Geraldine Brooks Horse afterwords which begins in Kentucky in 1850. Stunning how perfect reading one after the other was.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "0385348746"
},
{
    "title": "Best book I have read this last year",
    "rating": "5.0 out of 5 stars",
    "content": "I'm a history major and am used to reading about the Civil War. Most books are battle-oriented, save for ones that are bibliographical in nature. This book focuses on individuals and is very, very engaging.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Eric Larson does not disappoint.  I thought I knew all about what happened to start the Civil War.  I did not.  I learned so many new facts about Lincoln and what he had to contend with.  We are very fortunate to have had him as a leader during this difficult period in history.  Excellent book.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "0385348746"
},
{
    "title": "Unusual Historical Viewpoint",
    "rating": "5.0 out of 5 stars",
    "content": "An excellent look at the mindset of the Confederates and their outlook that led to succession...their strong beliefs, and southern culture, peppered with the contradictions of \"Chivalry\" and enslaved subjects to realize that lifestyle.  A visit to Charleston is now seen with a different perspective and understanding from reading this excellent book.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent research, clearly written.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "0385348746"
},
{
    "title": "Insightful views of the beginnings of the Civil War",
    "rating": "5.0 out of 5 stars",
    "content": "I had pre-ordered this before it was released. I remember seeing a review and the New York Times that was not very positive. I thought about canceling my order but decided to go ahead and read the book. I read most of the other books by this guy and really liked him. Sure enough he does not disappoint. I read this in three nights. It was just phenomenal. I have a greater understanding of what transpired between the time Lincoln was elected, and when Fort Sumter was fired on. The New York Times main complaints seem to be the lack of inclusion by a significant black Americans. That’s a good point, but they really were not that many black national leaders at that time. Putting it in that context, the events of 1860 –The New York Times main complaints seem to be the lack of inclusion by a significant black Americans. That’s a good point, but they really were not that many black national leaders at that time. Yes, there was Frederick Douglas, but really, no other major leader who is involved in the decision-making. That aside, this is a very, very good book and I’m glad I did not cancel it.",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Read everything I can by Larson",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "0385348746"
},
{
    "title": "VERY INFORMATIVE",
    "rating": "4.0 out of 5 stars",
    "content": "I usually gives the highest rating for w well written and documented work as this, but lacking",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "photographs and/or contemporary of the period prints detracts from those who do not know",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "0385348746"
},
{
    "title": "Superb",
    "rating": "5.0 out of 5 stars",
    "content": "I didn’t think this book needed any other words, but it wouldn’t let me post it without them. I loved this book! Highly recommend, one of his best",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This would be a good read even if you knew nothing about the Civil War. Larsen's writing makes you feel like you're there.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "0385348746"
},
{
    "title": "Super good, well written and researched.",
    "rating": "5.0 out of 5 stars",
    "content": "This book is a \"must read\" for anyone who not only has interest in the civil war, but he shed light on the incredible ignorance about slaves and all people of colour. The hatred expressed by many South Carolinians and other leaders of the confederacy made me thankful that Sherman did the right thing when destroyed everything in South Carolina in a 50 mile wide swath. They deserved it and one can only hope some of the miserable characters in the book lived to suffer.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Classic Larsen: poetic detailed story of the inception of the Civil War. A must read for any American history buff",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "0385348746"
},
{
    "title": "incredibly exciting!",
    "rating": "5.0 out of 5 stars",
    "content": "Tired of opinionated views of slavery and the Civil War I wanted to understand exactly how the war began. Eric Larson does a great job of explaining how the match was lit that began the unrest of our great nation. he takes you through the very beginning rumblings of what started the political friction and fracture in the Union and the great weight carried by newly elected Lincoln and his struggle to save the United States. I visited Fort Sumter before I read this book and now that I understand it more I may have to go back. I doubt most people know the story that Larson lays out with accuracy and patience in this story. read it, educate yourself.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I teach Civil War in my IB History class and I have always been fascinated by the run up to Fort Sumter. Larson's approach takes on multiple characters and events and weaves them together in a story that will shock you and in some instances make you laugh out loud. His presentation of the south before the civil war presents a ghastly atmosphere outside the elites and a \"let them eat cake\" mindset inside of the cultural elites of the south. I enjoyed it because I felt the players in the book talking to me instead of academic talking heads instead. Give it a read. Its worth it for anyone interested in the run up to the Civil War and the conflicting and conflicted personalities.",
    "post_time": "Reviewed in the United States on June 5, 2024",
    "pid": "0385348746"
},
{
    "title": "Great read",
    "rating": "5.0 out of 5 stars",
    "content": "It is a great book in the Erik Larson tradition. So much history told in the book. I will reread in 1 year so to gain more from it. Nobody tells history like E. Larson. I have read all the books snd waiting for his next one.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The South a region built on a fundamental evil.  Generations of people who are still unrepentant to this day.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "0385348746"
},
{
    "title": "great education",
    "rating": "5.0 out of 5 stars",
    "content": "\"Russell understood, however, that the true cause of the conflict, no matter how hard anyone tried to disguise it, was slavery. He called it a “curse” and likened it to a cancer whose inner damage was masked by the victim’s outward appearance of health. He marveled that the South seemed intent on staking its destiny on ground that the rest of the world had abandoned. “Never,” he wrote, “did a people enter a war so utterly destitute of any reason for waging it.”",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great book on Fort Sumter and how the Civil War began. Another great book by Erik Larson. . . .",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "0385348746"
},
]