[
{
    "name": "  The Demon of Unrest: A Saga of Hubris, Heartbreak, and Heroism at the Dawn of the Civil War ",
    "stars": [
        "65%",
        "24%",
        "8%",
        "2%",
        "1%"
    ],
    "pid": "0385348746",
    "ratings": "8,900 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Excellent intro to the beginning of WBTS.",
    "rating": "5.0 out of 5 stars",
    "content": "It gives a good amount of detail about the central characters both North & South that were significant players in the events that culminated in the firing upon US occupiers of Fort Sumter. Most of those individuals, people would likely never have heard of previously. It also provides insight into the emotions and passions of the time, and the cultures that existed then, which had significant bearing upon decisions then made.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was a much better book by Erik Larson than some of his earlier books, as he referenced a number of sources. Unfortunately, he paints a picture of the South based on the diaries and writings of a few very wealthy individuals. This presents a politically correct picture of the South. Most Southerner in 1861 were not slave owners. In Louisiana, there were blacks who owned slaves. Taking the bias out of the story, it still is a good look at the events from the Lincoln election though the Spring of 1861, with a short look at the aftermath of the principals.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "0385348746"
},
{
    "title": "A good look at the events leading to April 1861.",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to read and draws parallels to recent events.As usual a great job by Larson providing a strong narrative to the beginning of the civil war.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I am a Larson fan. I've read every one of his books. I pre-ordered this one and was so looking forward to the read. Upon completion of the book... I'll say it was worth the read, but not his best work. Maybe I had built up too high of expectations during the wait and set myself up for disappointment. Whatever the reason, the book kept my attention but was not a stay-up-late-page-turner. As we've come to expect, Larson's use of historical documents to add color to history works extremely well to understand the characters in the book. In spite of being underwhelmed, I still recommend the book and look forward to his next one.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "0385348746"
},
{
    "title": "Great Book",
    "rating": "5.0 out of 5 stars",
    "content": "Learned so much more than what is in our history classes of the simple, very human causes that had us stumbling into horrific war and struggle for our Republic and it's foundation.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Are we once again at such a turning point where a minority of people, with determined beliefs, are so similarly determined to impose their ideology on the majority ... destroying a democracy and replacing it with their autocracy?",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "0385348746"
},
{
    "title": "Good read...not his best work.",
    "rating": "5.0 out of 5 stars",
    "content": "I loved reading the book. I learned so much about important things I knew little about. Thank you Eric for peaking my interest",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great and through read. Detailed in every way. We always learn about the war and the big events that lean to the war, but this is the overall pulse of the nation, the thoughts and feelings of the country.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "0385348746"
},
{
    "title": "Outstanding Read",
    "rating": "5.0 out of 5 stars",
    "content": "I have read Devil in the White City and 2 or 3 others of Larson's and they have all been great. This one is my 2nd favorite behind \"Devil....\", but a great read. I was surprised it ended about 65% of the way through with footnotes, bibliography etc, but still over 300 pages of great reading.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Exceptional details of the machinations behind the lead up to the firing on Ft Sumter and the start of the civil war. Like a Ken Burns documentary on book form.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "0385348746"
},
{
    "title": "History told as if you were there",
    "rating": "5.0 out of 5 stars",
    "content": "A sense of understanding the mood of pre-civil war America as it’s being choreographed for the reader to experience a time when divisions was so intense.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Doug",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "0385348746"
},
{
    "title": "Good book.  Excellent narration voice.",
    "rating": "4.0 out of 5 stars",
    "content": "First and foremost, I am reading along to the audible version of this book and the narrators voice is amazing.  I highly recommend buying by the the book and the audible on this one.  This is the second Erik Larson book I've read, \"Devil in the White City\" being the first.  With Devil the biggest criticism was that the duel narratives were disjointed and sort of crammed together.  I agreed with this.  Reading this book is so much more cohesive,and therefore easy to get into.  The civil war isn't even one of my favorite historical eras and I am addicted.  Erik Larson really knocks this out of the park.  I highly recommend trying this book on for size, it's intrancing.",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Erik Larson brings us another of his trademark style books; this one examining the months leading up to the firing on Fort Sumter that began the Civil War. Larson relies extensively on stories emanating from the diaries and letters of key people, in particular those of firebrand secessionist Edmund Ruffin, Southern diarist Mary Boykin Chestnut, the reporting of British journalist William Howard Russell, and the official papers of Major Robert Anderson, commander of Fort Sumter. These insights help create the storytelling saga with which Larson has become famously successful.",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "0385348746"
},
{
    "title": "Larson in his trademark style",
    "rating": "4.0 out of 5 stars",
    "content": "Ironically, I was less impressed with this book than I have been with some (but not all) of his others (Devil in the White City probably being his best). I think in part this is because I am so familiar with the subject and thus didn't really learn anything new. Other readers are likely to find the book more fulfilling.",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "David J. Kent",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "0385348746"
},
{
    "title": "A most deserving best seller !",
    "rating": "4.0 out of 5 stars",
    "content": "Author, Lincoln: The Fire of Genius",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "President, Lincoln Group of DC",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "0385348746"
},
{
    "title": "A \"Dad\" Hostory?",
    "rating": "5.0 out of 5 stars",
    "content": "Erik Larson's \"The Demon of Unrest,\" his latest best seller, is an unbiased, decidedly factual history of the taking of Fort Sumter by the nascent Confederacy in April, 1861. His day to day recounting can be a tad tedious at times; his slow paced way of story telling provides an inherent honesty, the development of background and a build up of color and detail to the eventual surrender of the Fort in mid April, 1861. His cast of characters is wide ranging and superb in context; Presidents Lincoln and  Buchanan, the warriors,  Major Robert Anderson, Abner Doubleday, PGT Beauregard, and then the Secessionists, James Hammond and Edmund Ruffin,  along with the essayist, Mary Chestnut. Larson never preaches, his storyline and the marshaling of the facts is sufficient for readers to judge for themselves about this seminal event in American history, its sparking role of the clash between South and North, and,  in the end,  the abolition of slavery,  as the real cause of this War.",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Alexis Coe writing in The New York Times reviewed this latest submission of Erik Larson on April 30. So snarky is the review that one must wonder if there is a history of personal animus between these two authors. She states that Larson is the \"reigning king of Dad History.\"  I'm a Dad, but I have no clue as to what that moniker applies.  Is a bibliography of eleven pages (number 9 font) and notes of 31 pages (ibid), too short?  Does the fact that the book is readable, and not a tome for study and final exam somehow diminish its scholarly content? Coe writes, \"Nary a Black person, free or enslaved, is presented as more than a fleeting, one-dimensional figure. Frederick Douglass, a leading abolitionist and standard of histories of the era, warrants no more than a mention.\" Here, she is correct, perhaps forgetting that the book's subject concerns the leaders of the Secessionist and Union movements who are the subjects of the book. It is unfortunate that luminaries such as Douglass \"warrants no more than a mention\", yet said luminaries were not leaders of the movements.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "0385348746"
},
{
    "title": "Best book I have read this last year",
    "rating": "5.0 out of 5 stars",
    "content": "Erik Larsson, writing from primary sources, covers the period from Lincoln's election in 1860  to his inauguration in 1861, a period in which 11 states seceded (the same states -- with the exception of Virginia-- are red states today). It is a work of history which takes you into the homes, the diaries, the cities, the forts. Through the people in the middle of it and  in the periphery of it, you understand them, their actions and utterly see how our history of cotton and slavery is a foundation for everything we are today. It is a book which takes in the forest and each of the individual trees. I read Geraldine Brooks Horse afterwords which begins in Kentucky in 1850. Stunning how perfect reading one after the other was.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm a history major and am used to reading about the Civil War. Most books are battle-oriented, save for ones that are bibliographical in nature. This book focuses on individuals and is very, very engaging.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "0385348746"
},
{
    "title": "Unusual Historical Viewpoint",
    "rating": "4.0 out of 5 stars",
    "content": "Eric Larson does not disappoint.  I thought I knew all about what happened to start the Civil War.  I did not.  I learned so many new facts about Lincoln and what he had to contend with.  We are very fortunate to have had him as a leader during this difficult period in history.  Excellent book.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "An excellent look at the mindset of the Confederates and their outlook that led to succession...their strong beliefs, and southern culture, peppered with the contradictions of \"Chivalry\" and enslaved subjects to realize that lifestyle.  A visit to Charleston is now seen with a different perspective and understanding from reading this excellent book.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "0385348746"
},
{
    "title": "Insightful views of the beginnings of the Civil War",
    "rating": "5.0 out of 5 stars",
    "content": "It's very easy to think that the outcome of past events were inevitable.  It's equally easy to forget that the people going through those events lacked certainty.  The author focuses on the events at Fort Sumter to show that, for many of leading figures of the time, a war did not seem inevitable.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In fact many Northerners right up to President Lincoln tried very hard to avoid armed conflict. He even offered to let the Southerns keep their slaves if they stayed in the Union. On the other hand, the southern states could have left  and offered to negotiate a treaty that compensated the North for the government property confiscated by the Confederate authorities.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "0385348746"
},
{
    "title": "VERY INFORMATIVE",
    "rating": "5.0 out of 5 stars",
    "content": "The author does an excellent job explaining why it took over a month after Lincoln's presidential inauguration  for a war to begin.  He is equally good a explaining why Fort Sumter played a key role in the outbreak of that war.",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent research, clearly written.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "0385348746"
},
{
    "title": "Blow by Blow",
    "rating": "5.0 out of 5 stars",
    "content": "I had pre-ordered this before it was released. I remember seeing a review and the New York Times that was not very positive. I thought about canceling my order but decided to go ahead and read the book. I read most of the other books by this guy and really liked him. Sure enough he does not disappoint. I read this in three nights. It was just phenomenal. I have a greater understanding of what transpired between the time Lincoln was elected, and when Fort Sumter was fired on. The New York Times main complaints seem to be the lack of inclusion by a significant black Americans. That’s a good point, but they really were not that many black national leaders at that time. Putting it in that context, the events of 1860 –The New York Times main complaints seem to be the lack of inclusion by a significant black Americans. That’s a good point, but they really were not that many black national leaders at that time. Yes, there was Frederick Douglas, but really, no other major leader who is involved in the decision-making. That aside, this is a very, very good book and I’m glad I did not cancel it.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Read everything I can by Larson",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "0385348746"
},
{
    "title": "Excellent buying experience",
    "rating": "5.0 out of 5 stars",
    "content": "Another great read from Eric Larson. The book arrived in perfect condition because it was well-packaged. It was exactly as advertised. AMAZON is a great company with whom to do business. FIVE STARS!!",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I didn’t think this book needed any other words, but it wouldn’t let me post it without them. I loved this book! Highly recommend, one of his best",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "0385348746"
},
{
    "title": "Superb",
    "rating": "5.0 out of 5 stars",
    "content": "This would be a good read even if you knew nothing about the Civil War. Larsen's writing makes you feel like you're there.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is a \"must read\" for anyone who not only has interest in the civil war, but he shed light on the incredible ignorance about slaves and all people of colour. The hatred expressed by many South Carolinians and other leaders of the confederacy made me thankful that Sherman did the right thing when destroyed everything in South Carolina in a 50 mile wide swath. They deserved it and one can only hope some of the miserable characters in the book lived to suffer.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "0385348746"
},
{
    "title": "Super good, well written and researched.",
    "rating": "5.0 out of 5 stars",
    "content": "Classic Larsen: poetic detailed story of the inception of the Civil War. A must read for any American history buff",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Tired of opinionated views of slavery and the Civil War I wanted to understand exactly how the war began. Eric Larson does a great job of explaining how the match was lit that began the unrest of our great nation. he takes you through the very beginning rumblings of what started the political friction and fracture in the Union and the great weight carried by newly elected Lincoln and his struggle to save the United States. I visited Fort Sumter before I read this book and now that I understand it more I may have to go back. I doubt most people know the story that Larson lays out with accuracy and patience in this story. read it, educate yourself.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "0385348746"
},
{
    "title": "incredibly exciting!",
    "rating": "5.0 out of 5 stars",
    "content": "I teach Civil War in my IB History class and I have always been fascinated by the run up to Fort Sumter. Larson's approach takes on multiple characters and events and weaves them together in a story that will shock you and in some instances make you laugh out loud. His presentation of the south before the civil war presents a ghastly atmosphere outside the elites and a \"let them eat cake\" mindset inside of the cultural elites of the south. I enjoyed it because I felt the players in the book talking to me instead of academic talking heads instead. Give it a read. Its worth it for anyone interested in the run up to the Civil War and the conflicting and conflicted personalities.",
    "post_time": "Reviewed in the United States on June 5, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is a great book in the Erik Larson tradition. So much history told in the book. I will reread in 1 year so to gain more from it. Nobody tells history like E. Larson. I have read all the books snd waiting for his next one.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "0385348746"
},
{
    "title": "Great read",
    "rating": "5.0 out of 5 stars",
    "content": "The South a region built on a fundamental evil.  Generations of people who are still unrepentant to this day.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "0385348746"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "\"Russell understood, however, that the true cause of the conflict, no matter how hard anyone tried to disguise it, was slavery. He called it a “curse” and likened it to a cancer whose inner damage was masked by the victim’s outward appearance of health. He marveled that the South seemed intent on staking its destiny on ground that the rest of the world had abandoned. “Never,” he wrote, “did a people enter a war so utterly destitute of any reason for waging it.”",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "0385348746"
},
]