[
{
    "name": "  We Were the Lucky Ones: A Novel ",
    "stars": [
        "73%",
        "20%",
        "5%",
        "1%",
        "1%"
    ],
    "pid": "0399563091",
    "ratings": "42,587 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Informative, historical, heart wrenching",
    "rating": "5.0 out of 5 stars",
    "content": "No dislikes",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The book I ordered was a used copy, and it was in really good condition, so I was really glad I kept scrolling through the available copies and saved some money.",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "0399563091"
},
{
    "title": "Glad I kept looking",
    "rating": "5.0 out of 5 stars",
    "content": "The Kurc family was an ordinary family living in a nice apartment in Radom, Poland, when the Nazis began to invade and their lives were turned upside down. This book is based on the lives of members of the author’s family and the tragedies that they faced as well as the many challenges were heartbreaking at times. I was gasping at the atrocities that mankind forces on their fellow man as I read the accounts of how the members were able to survive, some just barely, and how they became separated. This story is one that needed to be told and is beautifully written, with realism and characters that speak to the heart.",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I checked out a copy of this book from my local library using the Libby App. All opinions expressed are my own.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "0399563091"
},
{
    "title": "Gut Wrenching Look at One Jewish Family in Poland",
    "rating": "5.0 out of 5 stars",
    "content": "This is an excellent book about an extraordinarily brave and devoted family during the worst time in history. I am very interested in World War II, history and historical fiction as well. This book is so moving and compelling. I had trouble putting it down. I would like to know more about the family; how they lived after, were they happy, did they have long lives. After all they went through, did they get to enjoy life again. Deep stuff. Great book. 🌟🌟🌟🌟🌟",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book gave often gave me chills! Told from different points of view, the reader follows the stories of the horrors and miracles faced by the family members. A must-read!",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "0399563091"
},
{
    "title": "Left me wanting more",
    "rating": "5.0 out of 5 stars",
    "content": "I had seen the series on streaming service.  Decided I wanted to read the book for further information.  Was very good.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book should be required reading in high school. So many young adults have no idea about certain events of our history, except for events that furthers certain agendas.",
    "post_time": "Reviewed in the United States on June 24, 2019",
    "pid": "0399563091"
},
{
    "title": "Simply amazing!",
    "rating": "4.0 out of 5 stars",
    "content": "Once I was 1/4 through this book I could not put it down. I read until 3:30am this morning, and after sleeping, finished the book just after noon today.",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s 3:30pm now, and I have to write this review.",
    "post_time": "Reviewed in the United States on May 5, 2024",
    "pid": "0399563091"
},
{
    "title": "Must read!!",
    "rating": "5.0 out of 5 stars",
    "content": "I’m not one for books about history or war… but this book was just WOW! It keeps you attached the whole time. I read this book for hours at a time and it felt like 30 mins at a time. Definitely recommend!",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Amazing true life story about authors ancestors survival and hardships",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "0399563091"
},
{
    "title": "Wonderful historical novel",
    "rating": "5.0 out of 5 stars",
    "content": "Georgia Hunter has linked history and her family’s experience with a uniquely researched understanding.  The reader is emerged in a family story based on not only World War 2 historical facts but also the emotional, physical and spiritual impact of the holocaust.  This story spans generations, continents and countries. Recommended for everyone who seeks historical truth.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After watching this on Hulu I ordered the book hoping to clarify many situations viewed in the movie.  This book did exactly that at least for me.  It expanded each situation with this family and by the end of the book it had tied everything together and “They were the lucky ones”.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "0399563091"
},
{
    "title": "More Than Luck",
    "rating": "5.0 out of 5 stars",
    "content": "Absolutely beautiful story that is well-written!",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is one of the best stories I have had the pleasure of reading in a very long time. It will make you laugh, cry and angry but ultimately hopeful.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "0399563091"
},
{
    "title": "Clarified the movie",
    "rating": "5.0 out of 5 stars",
    "content": "What an amazing story!!! Even more so since it's true.",
    "post_time": "Reviewed in the United States on July 4, 2017",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "SYNOPSIS",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "0399563091"
},
{
    "title": "Beautiful Story",
    "rating": "5.0 out of 5 stars",
    "content": "\"We Were the Lucky Ones\" is the true story of the Kurc family's struggle to survive as Jews in WWII Poland. The tight knit Kurc family was living a very comfortable, full life in Radom, Poland until WWII changed their lives permanently. The fought to stay alive and take care of each other while 27,000 of Radom's 30,000 Jewish population was murdered between 1939-1944. This is a story of courage, endurance, love, loss and incredible resourcefulness.",
    "post_time": "Reviewed in the United States on May 5, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "WHAT I LOVED",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "0399563091"
},
{
    "title": "True story",
    "rating": "4.0 out of 5 stars",
    "content": "The story was well told reading was easy",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I just finished this story and I don't think I have words to describe how inspiring it is. There are many stories, thousands, of those who survived the holocaust and the horrors of World War II but I cannot remember one that is as eloquent, touching and hopeful as \"We were the Lucky ones\". We become inured to the numbers and the statistics, the hardships, the starvation, the camps, the post war migration and more but this story focuses on the small things that mean so much to all of us. The hand kerchief made for a son by his mother,  family celebrations, joyfully tossing a laughing toddler into the air; the small things that make us happy. Counterpoint is survival, resilience and rebuilding lost lives. Ultimately, it is not the things that matter, it is the people. Those who are willing to climb the Alps without complaint or to persevere through starvation, hate and torture so that they can once again enjoy the small joyful things. I cannot comprehend the mental and emotional strength of those willing to get into a box car on a train  to Germany in order to get to the United States, knowing that that same boxcar carried thousands upon thousands to their deaths in a concentration camp. The author has written the story of her family with a \"third eye\" and has fluidly captured the events of World War II, pre and post war, as they happened to one family starting in Radom, Poland. Interspersed in the story are short chronological events of the war that reflect on the families survival and are integral to understanding what happened in Poland. We often forget that until Hitler decided to invade Russia, Stalin was allied with Germany and that the initial split of Poland was between Russian and Germany. WW II still affects every person in the world and still impacts many political and diplomatic issues. The story leaves the immensity of WW II to the reader while focusing on the effects it had on one family. It is a remarkable story and I found the afternotes to be just as mesmerizing as the book. And what a surprise when I recognized the name of Addy who changed his name to Eddy when he came to the US. If you go to you tube you can listen to Violin Sonata No. 2 that he wrote with the hope it would be played on Polish radio. It was. It really is about all of the small things that make us happy.",
    "post_time": "Reviewed in the United States on November 17, 2018",
    "pid": "0399563091"
},
{
    "title": "It is about the small things",
    "rating": "5.0 out of 5 stars",
    "content": "I very much enjoyed We Were the Lucky ones. This was a well researched and well written story of such a tragic war and time in the world.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bravo Georgia Hunter!",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "0399563091"
},
{
    "title": "Wow - heartbreaking, uplifting and inspiring.",
    "rating": "5.0 out of 5 stars",
    "content": "I couldn't put this book down - just riveting!  Highly recommended reading this book.  It will restore your belief in the huma spirit and the will to live.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Arrived on time and in like new condition",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "0399563091"
},
{
    "title": "An absolute MUST read!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve read many WW II /Holocaust accounts  but I have to say this is the best one I’ve read! The characters are richly developed and you form a relationship with each one. I held my breath at parts and cried at others. I can’t wait to recommend this book to my friends! I actually wanted to delay finishing this book.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book was very insightful for the time period and very moving.",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "0399563091"
},
{
    "title": "Excellent condition",
    "rating": "5.0 out of 5 stars",
    "content": "Love the book",
    "post_time": "Reviewed in the United States on April 10, 2017",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've already posted my review on Goodreads, but I'll post it on Amazon too.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "0399563091"
},
{
    "title": "Excellent book, good delivery",
    "rating": "5.0 out of 5 stars",
    "content": "My book arrived quickly in excellent condition. It was a wonderful read, based on a true story",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I find it hard to read Holocaust themed literature because it is so upsetting. This book is so beautifully written, and elicits so many emotions… it captures the horror while capturing the unyielding spirit , tenacity and ingenuousness of the Jewish people during this time. What a beautiful and amazing story. I literally could not put it down!",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "0399563091"
},
{
    "title": "An amazing, chilling but uplifting read",
    "rating": "5.0 out of 5 stars",
    "content": "I saw the trailer on Hulu and knew that I had to get the book and read it. I ordered it, and it came even quicker than it was promised. The author does such a great job of setting the scene and taking you in. The nerve wracking moments, the beautiful ones, the heartbreak, and everything in between. I cannot wait to see this translation and really see these characters come to life. I'll be watching enthusiastically and probably clutching my copy of the book and flipping through it to remember every last detail.",
    "post_time": "Reviewed in the United States on March 19, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I did enjoy this book but it never really wowed me. The way the author skips ahead in the characters situations was annoying. It did educate me on Polish Jews and what happened during the war . For that I’m grateful as I did not know the details .",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "0399563091"
},
{
    "title": "I was so invested in seeing this family be reunited",
    "rating": "5.0 out of 5 stars",
    "content": "It is a novel about the true events this family went through during WWII. It’s based on a true story and stories of that era. I’m glad I bought it. We should Never Forget",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The format of the book is similar to other World War II novels.  It may be confusing to some readers but it gives one the idea of a variety of events super imposed on themselves. The story is impactful and gives one the feelings people in a family had about the events that were unfolding around them.",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "0399563091"
},
{
    "title": "Good but not great .",
    "rating": "5.0 out of 5 stars",
    "content": "This was an excellent read!!!  Although quite a touching story, the ending was just great!  I totally recommend this book!",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Somewhat different perspective",
    "post_time": "Reviewed in the United States on April 17, 2024",
    "pid": "0399563091"
},
{
    "title": "It’s based on a true story",
    "rating": "5.0 out of 5 stars",
    "content": "Many of us know some of the stories of the holocaust. Through reading this book I hope more will understand that it is necessary to learn about our ancestors and their travails and horrors. We must all stand up and say Never Again.",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wonderful book.  A look inside the workings of the enemy during WWII and the courage of the oppressed.",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "0399563091"
},
{
    "title": "Phenomenal",
    "rating": "5.0 out of 5 stars",
    "content": "If you read one book this year it should be this one. Unlike any book of this timeframe that I’ve ever read. Beautifully written and the brief history “lessons” often at the end of chapters give more context for the reader. I loved those! The characters in this book are not characters at all. They are real people and their stories will both haunt you and inspire you. It’s a MUST read.",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Watched part of the mini series at my daughters. Couldn’t get on internet channel at home, so I bought the book.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "0399563091"
},
{
    "title": "Good book",
    "rating": "5.0 out of 5 stars",
    "content": "A great read, well written good author",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "While only the second month into the year, I can say with certainty that Georgia Hunter’s debut novel WE WERE THE LUCKY ONES is my favorite book of the year. Definitely one of the books that I will cherish. It is not only a poignant story, written so eloquently and with such heart, but the fact that it is based on the true story of her family makes it that much more special. The book is about a family of Polish Jews who were separated during World War II and what became of them. At many times, this is a difficult book to read, as it should be, given the subject. But because it is so hard to read, all the more reason to do so.",
    "post_time": "Reviewed in the United States on March 10, 2017",
    "pid": "0399563091"
},
{
    "title": "A well written, enthrawing book 5 stars",
    "rating": "5.0 out of 5 stars",
    "content": "I don’t remember the last time that I was so moved by words on a page, characters with such determination, and the evil that lay before them. To read page after page about the destruction of the war, the harsh reality of their living conditions, the brutality of the Nazi regime, and what the Jews were literally stripped of. It is a lesson in humanity, in history, and in how Poland was desecrated. As a third-generation immigrant, like Hunter, my grandparents came from Poland, and while they were in America before the war, nothing has impacted my heart more than reading this book. Surely my grandparents left behind friends and family and felt similar heartache as the Kurcs did with their beloved country.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "There are many lessons to be learned from reading this book other than how people cope with great sadness. It is about resilience, the strength of the human spirit, family, and love. Hunter is a writer to watch. Hunter's ancestors would be so proud of what she has done with this book. She has not only written a remarkable piece of literature but the effort that she put forth to gather her family’s history seems to have been no small feat, as you will learn. As a Jew and a human, I feel it was an honor to read WE WERE THE LUCKY ONES, to learn about every member of her family. I feel like I know each of them. They were the lucky ones and so are we to be given this book.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "0399563091"
},
{
    "title": "I wish I could give it MANY more stars",
    "rating": "5.0 out of 5 stars",
    "content": "The personal accounts of the family are gripping. Very well written. Cheers.",
    "post_time": "Reviewed in the United States on October 30, 2022",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Too sad at this time of the world in conflict. I couldn’t get through the whole book",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "0399563091"
},
{
    "title": "Chilling Account of Awful Time",
    "rating": "5.0 out of 5 stars",
    "content": "Painful for Anyone to read, but especially a Jewish person, because it could have been us.  The shock of the violence, the shock of the hatred because of a belief, the shock of watching people turn in to animals with no feeling, the shock of the crowds worshipping a man of evil, and that man deciding to murder 6,000,000 people, not only Jews, but other unfortunates, and the shock that others went along to do his bidding…..NOT ALL… many were heroes,,, but many were made of stone… of course many were frightened to death, of rebelling for fear they and their families would be killed, but had they stopped this evil in the beginning, laughed at this clown, Hitler, none of this would have happened. Jews have been sworn to NEVER FORGET.  All of us should know the truth of what happened, and Never allow a leader of people, to rise, who is evil… !  One who lies to his people, cares only for power, and denigrates others. And one who encourages violence, and one who forgets to speak to all the people he is leading, not only those that voted for him. We must elect leaders who know that when there time is up, they transfer power to the next leader without revolution and violence.. that is an unspeakable act in a Democracy..  We must NEVER FORGET!",
    "post_time": "Reviewed in the United States on April 30, 2024",
    "pid": "0399563091"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Absolutely riveting, with convincing portrayal of the people, well paced plot, and skillful writing.  Highly recommended.",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "0399563091"
},
]