[
{
    "name": "  The Forgotten 500: The Untold Story of the Men Who Risked All for the Greatest Rescue Mission of World War II ",
    "stars": [
        "73%",
        "19%",
        "5%",
        "1%",
        "1%"
    ],
    "pid": "0451224957",
    "ratings": "10,647 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Excellent Read",
    "rating": "5.0 out of 5 stars",
    "content": "Extremely well written.  Every time I read a book based on WWII events, I realize more and more what the United States did and sacrificed so save world democracy. I learn a bit more after reading this book and others how the British were extremely difficult to deal with. The only critique I would give this book, as a Retired USAF MSgt, on 18 September 1947, the Army Air Forces became the United States Air Force as a separate and equal element of the United States Armed Forces.  The author refers to these airman as Air Force.",
    "post_time": "Reviewed in the United States on August 27, 2023",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'd heard a little about a daring rescue of airmen during WWII but never looked into it and certainly had no idea it had been so massive and that it also contained a sad and shameful issue of political mistake.  This book provides a thorough, well researched, and exciting account of the challenges and heart breaks of the saga.",
    "post_time": "Reviewed in the United States on December 1, 2019",
    "pid": "0451224957"
},
{
    "title": "Unknown story that deserves a bigger space",
    "rating": "5.0 out of 5 stars",
    "content": "The whole Italian theater, the air war fought from bases there (and in North Africa) and the occupation of Yugoslavia seem to have been thinly covered in the publications of the biggest war in history.  Perhaps it was that huge scale that cast so many significant stories into the backwaters of coverage.",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Even the massive petroleum complex in Ploesti, which is more recognized as a focal point in German  strategy and in Allied air efforts, is not always clearly placed as well out in Eastern Europe and thus much more reachable from air bases in Italy.",
    "post_time": "Reviewed in the United States on February 19, 2020",
    "pid": "0451224957"
},
{
    "title": "This book needs to become a major motion picture",
    "rating": "5.0 out of 5 stars",
    "content": "Freeman weaves a gripping story of airmen, resistance partisans and the secretive OSS in his factual recounting of amazing events that got little attention at the time.  He writes of how this neglect came to pass and some tragic results from the very silence that shrouded this story for long after the war.",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A very informative book, well written, and we'll worth reading.",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "0451224957"
},
{
    "title": "Disinformation Kills Heroes",
    "rating": "5.0 out of 5 stars",
    "content": "This is an excellent read. It is gripping account of an amazing story.  It is a must read for those who want to read of the WW 2 stories. Best book I have read yet.",
    "post_time": "Reviewed in the United States on February 14, 2024",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A superb historical novel featuring daring rescues,  noble peasants with a heroic leader and unbelievable political machinations.",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "0451224957"
},
{
    "title": "greatn read",
    "rating": "5.0 out of 5 stars",
    "content": "Draza Mihailovich , a courageous resistance leader against Nazi invaders became an early casualty of Communist disinformation. Stalin backed Tito who would go on to lead Yugoslavia ruthlessly into the Soviet camp.  By the planting of  massive amounts of lies, moles and spies in British government agencies including many seeds of disinformation regarding Tito’s political opponent, British and USA diplomats were hopelessly trolled by the Russians.",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They blindly supported the communist-leaning Tito and abandoned Mihailovich which lead to his execution after WW2 and the loss of Yugoslavia to  Communism.  Churchill later called it his greatest error.",
    "post_time": "Reviewed in the United States on December 8, 2023",
    "pid": "0451224957"
},
{
    "title": "A story of a true ally and heroism",
    "rating": "5.0 out of 5 stars",
    "content": "What a story! For all of the volumes I've read on WWII, I'd never once come across this story. Freeman lays out the tale of POWs inside Yugoslavia and the OSS operation to airlift them out - this is behind enemy lines, mind you. The author does a great job of not only telling the story of the actual mission, but provides a good bit of the political nonsense that went on and nearly prevented it from happening. That is, how the U.S. was backing Tito over the Serbian general Mihailovich for political reasons, basically tagging Mihailovich as the enemy. The reality was the opposite as Mihailovich gave sanctuary to allied POWs and kept them moving to protect them from the Nazis. He was one of the real heroes in the story. The operation and Mihailovich's efforts were heroic. The saddest part of the tale was how long it took for the U.S. to recognize the risks and sacrifices Mihailovich and his supporters took and made to keep the allied troops safe and cared for, and how they helped in the rescue operation. A must read for any fan of history, especially WWII history.",
    "post_time": "Reviewed in the United States on September 26, 2016",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book was in very good condition.  Better than described.",
    "post_time": "Reviewed in the United States on December 29, 2023",
    "pid": "0451224957"
},
{
    "title": "As described",
    "rating": "5.0 out of 5 stars",
    "content": "I was surprised as I read further into the story, at the unexpected detail, emotion and actual events described. Most of the characters had real, human emotion. The plan details and political machinations were surprising and effective. Very enjoyable and thought-provoking.",
    "post_time": "Reviewed in the United States on August 13, 2023",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After reading this book I engaged in a debate with a woman who was brought up in Communist-era Czechoslovakia.  She was unconvinced that Tito wasn't a great man, loved by all, fair and diligent in protecting his country.  Her mind was made up, and I can't change that, but reading this book did shape my view of former Yugoslavia and what happened there before Stalin and Hitler overran them. As for me, getting the other side and hearing about Mihailovich's aid to US troops...I loved hearing that side.",
    "post_time": "Reviewed in the United States on September 14, 2014",
    "pid": "0451224957"
},
{
    "title": "A thrilling and chilling tale",
    "rating": "5.0 out of 5 stars",
    "content": "I was pretty pleased that I came out of it with a little bit of history, a lot of entertainment, and some really good debate material.  I find it sad that the many many people raised and educated under the iron curtain will believe that Tito was a great man and Mihailovich an enemy.",
    "post_time": "Reviewed in the United States on June 8, 2023",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Reading up on this subject is tough because the story is largely untold, but I recommend The Forgotten 500 for that reason.  It takes a broad array of topics occurring in Yugoslavia and pieces them together for the reader to really empathize with the Chetnics and understand how this bit of history was so badly misrepresented for so long.",
    "post_time": "Reviewed in the United States on July 29, 2019",
    "pid": "0451224957"
},
{
    "title": "Many people still don't believe this.",
    "rating": "5.0 out of 5 stars",
    "content": "Given to me, to read, by my historically curious grand son.",
    "post_time": "Reviewed in the United States on August 22, 2023",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Did not remember this portion of history. Enjoyed it so much that I sent it to family WW II veterans. Navy and Airforce Captains. And, they loved it! Neither had not known all the history revealed and they too sent it forward .",
    "post_time": "Reviewed in the United States on May 11, 2023",
    "pid": "0451224957"
},
{
    "title": "Interesting read for all",
    "rating": "4.0 out of 5 stars",
    "content": "Nice research job in this book, gives resources researched used. This story gives you a better perspective of the formation of Yugoslavia after World War II.  What a fantastic loyal job done by the Serbs protecting U.S and allied soldiers caught behind enemy lines. If you don't know much history concerning the Serbian efforts to help defeat the Nazis...then read this.  Their leader, Draza Mihailovich, was totally committed to keeping Yugoslavia free of communism, a devotion he died for as the communist influence took over after the war.",
    "post_time": "Reviewed in the United States on March 13, 2016",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This story is a tribute to Mihailovich, the Serbian people (poor farm villagers), the hundreds of Allied airmen trapped in enemy territory, and the newly formed OSS (now known as the CIA).",
    "post_time": "Reviewed in the United States on September 1, 2023",
    "pid": "0451224957"
},
{
    "title": "History for those who think they know the story of Yugoslavia",
    "rating": "5.0 out of 5 stars",
    "content": "Where is Tom Hanks when I need him? What a story!! War-lost in enemy territory- rescue mission- a love story- the start-up of the OSS-Mountain Serbs in Yugoslavia- with no shoes and little food go out of their way to assist the \"downed\" airman-  and a heart wrenching conclusion and miscarriage of Justice to the General (Yugoslavia) at the center of it all. When I ordered the book I though it was new- it is copyright 2007. Who will be the first to write a screen play and win an Academy Award? For the non fiction crowd this is a \"must read'. Outstanding book- I assume the author has a background in music- \"the words flow\"",
    "post_time": "Reviewed in the United States on May 23, 2022",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "and tell an amazing story.",
    "post_time": "Reviewed in the United States on November 20, 2007",
    "pid": "0451224957"
},
{
    "title": "Story finally told!",
    "rating": "5.0 out of 5 stars",
    "content": "DEB/ Silver Spring, MD",
    "post_time": "Reviewed in the United States on May 2, 2023",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "From the time I was seven years old, I knew the truth about General Draza Mihailovich and his Chetniks as my father published Captain Nick Lalich's entire day-by-day diary in his American SERB LIFE Magazine in 3 different monthly installments in 1948.  The characters in Greg Freeman's book, such as Arthur Jibilian, the radioman, and others were real-life heroes to me as I read and re-read those stories over and over. I know all the trouble they had with getting those radios to perform, and felt their disappointments with the huge airdrops to Tito and his Partizan followers and miniscule drops to the Chetniks.  Remember, this is all because of those British spies/moles in Cairo changing the news.",
    "post_time": "Reviewed in the United States on January 14, 2021",
    "pid": "0451224957"
},
{
    "title": "Powerful story!  Very well researched!",
    "rating": "5.0 out of 5 stars",
    "content": "Anyone wishing to discredit Mihailovich and his Chetniks is doing so for unsavory reasons.",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Mihailovich deserved our nation's highest honor as I also have the written accounts of all the news clippings that appeared across the nation wherever the 500 American airmen lived as either individually or collectively, they tried to stop the mock trial conducted by Tito and his Communists against the man who saved their lives.",
    "post_time": "Reviewed in the United States on September 16, 2019",
    "pid": "0451224957"
},
{
    "title": "The Forgotten 500",
    "rating": "5.0 out of 5 stars",
    "content": "Today's depiction of the Serbs in the media is no different than the evil done during WWII.  The airmen know the truth.  Even in the last remaining years of their lives, these grateful former soldiers/airmen are dedicating and focusing on getting the truth of Mihailovich's countless heroic deeds known.",
    "post_time": "Reviewed in the United States on November 19, 2023",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good job, Gregory Freeman.  Thank you wonderful, brave, unrelenting U.S. Airmen.  You are appreciated!",
    "post_time": "Reviewed in the United States on January 20, 2023",
    "pid": "0451224957"
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "And great reading to all who purchase the book!  Finally, the story is out!",
    "post_time": "Reviewed in the United States on December 30, 2023",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Mim Bizic",
    "post_time": "Reviewed in the United States on December 31, 2023",
    "pid": "0451224957"
},
{
    "title": "Special Personnel Recovery Mission & Assisted Evasion",
    "rating": "5.0 out of 5 stars",
    "content": "This is an outstanding book on the assisted evasion experiences of men who were downed in enemy territory during WWII, avoided capture, and survived to tell their story.  It's a story of the real meaning and importance of partisans helping military operators in very tough straights in an unfamiliar territory to stay alive each day, to evade capture and torture by an enemy, and to ultimately return to their own forces in Italy for medical aid or to fight again.  This book is also a very interesting story of a very important figure--a real hero, who is shot by a firing squad after the war because of the skewed ego/pride of a communist leader with an anti-west agenda.  The book includes insightful information about Prime Minister Churchill and USA President Roosevelt, some of their terrible choices during the war.  This book also reveals and discusses the impact of pro-communist elements within British, American and Yugoslavian organizations--affecting the lives of millions during and after WWII.  Without a few focused men (heroes) within the OSS, the Army Air Corps, and the partisans in enemy territory, this fabulous, life saving success story would never have happened. I commend them for staying focused on the importance of locating, assisting and recovering these 500 men and did not go with the flow and pressures on them to cancel their planning and not pursue this mission. I highly recommend this book become mandatory reading for military Survival and SERE instructors; Personnel Recovery policy makers, planners, and operators globally; US diplomats, and government leaders and national level organizations with international affairs roles and responsibilities.  Survivors in the Forgotten 500 included Americans, British, Russians, and others.",
    "post_time": "Reviewed in the United States on August 9, 2013",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Was a present for history buff. He loves the book and found out things he didn't know before. Highly recommend.",
    "post_time": "Reviewed in the United States on February 21, 2024",
    "pid": "0451224957"
},
{
    "title": "A Good Read. Great For History Buffs",
    "rating": "5.0 out of 5 stars",
    "content": "I would like to thank Greg Freeman for the labor of love involved in writing this book.  I believe more books should be written that can use real world situations set in hellish circumstances that highlight the best of what we should strive to be.  This is the story of the Serbs and their leader General Mihailovic's heroic struggle to help over 500 downed American fliers, the faithfulness and fearlessness of the OSS personnel who worked so tirelessly, with much of the time spent working against our own allies who tried to thwart the rescue mission, and the airmen themselves who showed their faithfulness in trying to bring truth to light long after they were safely back home.  I would highly recommend this book to those who love stories of valor and especially to those who need to have our belief in humanity restored.",
    "post_time": "Reviewed in the United States on February 27, 2022",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Forgotten 500 Book Review",
    "post_time": "Reviewed in the United States on April 10, 2017",
    "pid": "0451224957"
},
{
    "title": "A Great book!",
    "rating": "5.0 out of 5 stars",
    "content": " The Forgotten 500 was a accurate, intriguing, and informative book. The gripping pace tied into the book compliments the scattered accounts of real men who lived through the Eastern European conflict. The book covers the extensive story of men who were apart of the U.S. air force targeting oil refineries in Romania. Around 500 men were shot down by the Germans and were left stranded in Yugoslavia. Gregory A. Freeman depicts the personal struggle through the eyes of several different men each experiencing their own adventure in a situation only the most resilient could survive and thrive in. The detail in a book telling a story from mid 1900s is top notch and keeps the reader interested allowing him/her to completely comprehend the setting and situation.  There is in fact, a counter argument questioning the substance of the writing style and accusing it of being somewhat elementary and juvenile in the way Freeman describes certain situations or tries to get a point across.",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Freeman digs up a relic in one of the most unknown stories of World War II, and turned it into a best seller. The Forgotten 500 will slide off the shelves, but stay glued to you hands. It leaves you awestruck, changes your perspective on certain WWII events, and has you yearning for more, all of this conveyed in a style of writing that both informs and entertains to perfection.",
    "post_time": "Reviewed in the United States on September 14, 2023",
    "pid": "0451224957"
},
{
    "title": "Two thumbs up",
    "rating": "4.0 out of 5 stars",
    "content": "I wish all Americans would take the time to read books like this.",
    "post_time": "Reviewed in the United States on October 27, 2023",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book was so well written and interesting that I could not put it down. I have read it now two or three times. It ties aspects of World War and the Cold War together and points out how the traitorous Cambridge 5 spy ring affected post-war Eastern Europe. It also tells the story of US Air Force special operations in its immediate infancy. Just a wonderfully written and interesting book.",
    "post_time": "Reviewed in the United States on March 12, 2016",
    "pid": "0451224957"
},
{
    "title": "Terrific",
    "rating": "5.0 out of 5 stars",
    "content": "OSS extraction of downed wwii bomber pilots. Well written.  Fast reading.",
    "post_time": "Reviewed in the United States on February 9, 2024",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great story, and a good effort by the author to attempt an engrossing novel-like read, but ther were too many loose ends for that.  As a history, the research seemed light, and too much was invested in single anecdotes or quotes.  The result was that you walked away with the impression that the author had too little background that he was earnestly trying to streeeeettttcchh out into a respectable book length.  The lack of first-hand evidence was inevitable, since ithe story was uncovered when the whole WWII war generation was dying.  Add in the overwhelming Cold War paranoia, the dissolution of the OSS, and the secrecy of the mission, and it becomes clear that gathering recorded evidence of the breathtaking courage and defiance demonstrated as the story unfolded would have been a Herculeann task.",
    "post_time": "Reviewed in the United States on August 14, 2022",
    "pid": "0451224957"
},
{
    "title": "Excellent unknown story",
    "rating": "4.0 out of 5 stars",
    "content": "This was a gift for my husband who is a huge WW2 fan. His father was in the war and his mother was an English war bride. My husband loved the book, and enjoyed learning something new.",
    "post_time": "Reviewed in the United States on February 15, 2023",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A little known chapter in WWII. Would make a fantastic movie as it is true and factual!",
    "post_time": "Reviewed in the United States on September 10, 2023",
    "pid": "0451224957"
},
{
    "title": "Very informative.",
    "rating": "5.0 out of 5 stars",
    "content": "What a great book.  Obviously, well researched.  Amazing the stories of brave men and women during WW2 not limited to just the Americans but the Serbian people who guarded the American flyers w/ their lives.",
    "post_time": "Reviewed in the United States on June 11, 2023",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought additional books to share with young family members who would have been totally ignorant of the history. There are profound lessons to be learned about the events described. Included would be the personal sacrifice of so many of our military and the bravery of the local populace who had everything to loose if caught by the Nazis",
    "post_time": "Reviewed in the United States on December 4, 2022",
    "pid": "0451224957"
},
{
    "title": "History of very brave Men and Women",
    "rating": "4.0 out of 5 stars",
    "content": "A very Interesting story that I have never heard of before.  If really is amazing what transpired right under the nose of the Germans.  I did think the story seem.to drag a bit.",
    "post_time": "Reviewed in the United States on December 25, 2022",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Most of the books with \"unknown\" or \"forgotten\" in the title seem to be stories with which I am at least familiar and often provide no new information. Not this one!",
    "post_time": "Reviewed in the United States on July 20, 2020",
    "pid": "0451224957"
},
{
    "title": "There are multiple stories told revealing of the period",
    "rating": "5.0 out of 5 stars",
    "content": "I was totally unaware of this rescue mission and and certainly unfamiliar with the details of soviet manipulation of allied support for the communist Yugoslav's instead of the Chetniks. Nor was I aware of the British communist spy who facilitated that manipulation and some cases had the British working at odds with the US! The book gives great detail about the rescue and the events surrounding it. I found the end notes to also be quite illuminating.",
    "post_time": "Reviewed in the United States on December 19, 2022",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Highly recommended!",
    "post_time": "Reviewed in the United States on October 18, 2017",
    "pid": "0451224957"
},
{
    "title": "Very interesting",
    "rating": "4.0 out of 5 stars",
    "content": "I'm really glad I found this book and took a chance",
    "post_time": "Reviewed in the United States on October 7, 2021",
    "pid": "0451224957"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had never heard oh this mission before.  I am trying to understand what our fathers went through in this war and it upsets  me learning about how so many times our men were left high and dry by those in charge.  History needs to be taught better in schools.",
    "post_time": "Reviewed in the United States on September 16, 2011",
    "pid": "0451224957"
},
]