[
{
    "name": "  Eleanor Oliphant Is Completely Fine: Reese's Book Club (A Novel) ",
    "stars": [
        "64%",
        "27%",
        "7%",
        "1%",
        "1%"
    ],
    "pid": "0735220697",
    "ratings": "236,594 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Great book!",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered this book so I could have time to read it before our book club meeting; it was delivered very quickly and I finished it in no time. Great read!",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I learned so much about facing the past and seeing it in a new light.  This is a story about healing and growing.  Wonderful book!",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "0735220697"
},
{
    "title": "Great read",
    "rating": "5.0 out of 5 stars",
    "content": "Gals Family book club choice.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Well written for such a dark childhood themed story.  Loved the first person dialogue and quirky character.  Very sweet late, but  true coming of age story.  Can’t wait for the movie!",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "0735220697"
},
{
    "title": "Movie worthy!",
    "rating": "4.0 out of 5 stars",
    "content": "Well-written, engaging, poignant .....gives you insight to the effects of emotional and verbal abuses  that a young child suffers through to her adult life. Eleanor is a smart, incredibly naive woman who survives her trauma by using her imagination and neediness to complete her fantasy into a non-existent romance....unaware of a love and friendship that is right in front of her. She eventually opens  up and \"sees\" her potential as a woman and a human being with the help of friends and counseling. Wonderful book!",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a hard read but enjoyable. I don't know if I'd really recommend it as it is a very triggering read.",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "0735220697"
},
{
    "title": "Loved it!",
    "rating": "5.0 out of 5 stars",
    "content": "This is the most well written book I've ever read. The author's use of words was never forced, sentences following so naturally. Eleanor's own, special vocabulary seemed so natural for the character that I never questioned it. I had to look up A LOT of word definitions, though! Most of all, the author gave an excellent picture of what extent the human mind will go to protect us from such harmful memories. Kudos to Honeyman.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this book so much that I sent copies to my friends!",
    "post_time": "Reviewed in the United States on January 24, 2024",
    "pid": "0735220697"
},
{
    "title": "Wow",
    "rating": "5.0 out of 5 stars",
    "content": "Oh, I am so sorry to say goodbye to Eleanor. She stole my heart. I was rooting for her to become \"completely fine\" or even better, and she did not disappoint.  At first I was afraid this was going to be a predictable chick lit/romance.  But no, a much deeper, complicated story, and Eleanor is one of the most courageous, complicated, and lovable heroines I've come to know since Kya from Where the Crawdads Sing.  When I think of Eleanor, the phrase \"odd duck\" comes to mind, which is not a bad thing.  I am just so glad she came to embrace that part of herself, and all her other lovable, quirky traits.  This story made me laugh out loud and shed tears too.  That is a rare, but wonderful thing.",
    "post_time": "Reviewed in the United States on July 22, 2020",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One would think reading a book about depression, loneliness and abuse would certainly bring you down. Gail Honeyman’s novel, Eleanor Oliphant is Completely Fine is proof such a book can be funny, inspiring and heartwarming.",
    "post_time": "Reviewed in the United States on February 19, 2023",
    "pid": "0735220697"
},
{
    "title": "Great book!",
    "rating": "5.0 out of 5 stars",
    "content": "The first 60 or so pages was wavy, like it had gotten wet and dried but it was readable. Otherwise okay.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you know anyone on the spectrum, or anyone dealing with childhood trauma. this is a good way to glance into the mindset. I really enjoyed her vocabulary and humor too.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "0735220697"
},
{
    "title": "Loved it!",
    "rating": "5.0 out of 5 stars",
    "content": "This story has you rethink your subconscious vain and materialistic ways. Read it straight through to the end. Kept me curious.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Honestly, the best part of reading a book is the personal digestion of the sum of its parts. Yet here I am. Writing. I can confidentiality say, this book is going on my top 10 favorite books.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "0735220697"
},
{
    "title": "A great binge read",
    "rating": "5.0 out of 5 stars",
    "content": "Eleanor Oliphant is a rare and vulnerable character. It was a joy to partake in her journey.",
    "post_time": "Reviewed in the United States on October 24, 2022",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a wonderful novel, as we get to watch the \"evolution\" of Eleanor into a \"normal\" person.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "0735220697"
},
{
    "title": "I never write book reviews...",
    "rating": "5.0 out of 5 stars",
    "content": "The first section \"good days\" is misnamed.  Those days didn't seem \"good\" to me at all.  We're introduced to the robotic, empty life that Eleanor was leading, as if she were a picky upper-class person in the",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "1900s -- not understanding the world around her, not knowing any of what had become norms of social interaction.  And making amusing observations on how odd and illogical our taken-for-granted behaviors might seem  to someone who had just woken up from a hundred year nap.  And we get hints about her  facial scar and the painful weekly calls with her \"Mummy\"",
    "post_time": "Reviewed in the United States on May 19, 2019",
    "pid": "0735220697"
},
{
    "title": "A lovely story",
    "rating": "4.0 out of 5 stars",
    "content": "The second section, \"bad days\" is also misnamed -- it should have been called \"waking up\". It is fascinating  seeing Eleanor \"loosen up\" and start to understand and accommodate the goings on around her -- all  things we would just view as normal behavior.  Since I am an insane cat person, I was delighted to see that he actually welcomed the burdens [and messes] of having Glen in her household; another step toward her social normalcy. And learning to deal with her demons.",
    "post_time": "Reviewed in the United States on October 3, 2023",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The last section, \"better days\", is, indeed, better days.  Eleanor has completed her metamorphosis into being a feeling, emotional person. It is amazing to compare her developing [and refreshingly normal] relationship with Raymond with her first encounters back in \"good days\"",
    "post_time": "Reviewed in the United States on July 14, 2017",
    "pid": "0735220697"
},
{
    "title": "I loved it",
    "rating": "5.0 out of 5 stars",
    "content": "I read Eleanor Oliphant  in one day and  I loved it.",
    "post_time": "Reviewed in the United States on March 9, 2020",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The author, Gail Honeyman said, “It's a story of the -  transformational power - of  small  acts  of  kindness.”",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "0735220697"
},
{
    "title": "dark but wonderful",
    "rating": "5.0 out of 5 stars",
    "content": "Gail wrote Eleanor’s life, as a person:",
    "post_time": "Reviewed in the United States on July 9, 2019",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "\"that has been knocked off kilter by an unnamed childhood horror which she can only recall from her sense of , “before” and “after”,  and",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "0735220697"
},
{
    "title": "This book is much more than fine!",
    "rating": "5.0 out of 5 stars",
    "content": "“although she’s had a fairly catastrophic start in life,  Eleanor is still the agent of her own life.\"",
    "post_time": "Reviewed in the United States on December 6, 2021",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "She didn’t want to write  her  as a victim, and  didn’t want her to be self-pitying either.  She  tried to leave space in the narrative, so  the reader could feel those feelings on her behalf.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "0735220697"
},
{
    "title": "A must read",
    "rating": "5.0 out of 5 stars",
    "content": "It’s  written in first person and begins with Eleanor’s day to day life and her unfiltered description of herself and everyone she meets.",
    "post_time": "Reviewed in the United States on February 11, 2021",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Eleanor is 29, has no friends or social contacts,  is  eccentric, opinionated,  lives in Glasgow, Scotland, works as a finance clerk for a graphic design company, and every weekend consumes two bottles of vodka.",
    "post_time": "Reviewed in the United States on May 13, 2019",
    "pid": "0735220697"
},
{
    "title": "Excellent book",
    "rating": "5.0 out of 5 stars",
    "content": "She is academically intelligent, loves crossword puzzles, is socially awkward and leads a solitary lifestyle.",
    "post_time": "Reviewed in the United States on August 8, 2018",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "She does some really,  ill-advised  things  in the early chapters and she's oblivious to the way her shortcomings appear to those around her.  She blames any awkwardness on the other person's \"underdeveloped social skills.”",
    "post_time": "Reviewed in the United States on December 2, 2023",
    "pid": "0735220697"
},
{
    "title": "Good not great",
    "rating": "3.0 out of 5 stars",
    "content": "Enjoyable enough but Eleanor is not as funny as the author is trying to make her seem... I could surmise that the author thought Eleanor's random statements were funny... but really, she was annoying.  That is the author's fault not Eleanor.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A solid 7 on a 1-10 scale.",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "0735220697"
},
{
    "title": "This book was everything",
    "rating": "5.0 out of 5 stars",
    "content": "I love this book because I know someone who thinks just like her about many of her thoughts and beliefs. She is very practical. I will re read this book. It was that good to me.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "II had no idea what this book was about.The author did a beautiful job of developing a horrific story. The character, Eleanor, was such a likeable person",
    "post_time": "Reviewed in the United States on February 8, 2021",
    "pid": "0735220697"
},
{
    "title": "A Lovely Surprise",
    "rating": "4.0 out of 5 stars",
    "content": "Eleanor Oliphant is a 30-year-old loner. She has no social skills, no friends, no filter. Her days are all the same.  She goes to work Monday through Friday (is ignored by her co-workers), and from Friday afternoon to Monday morning, stays in her apartment drinking vodka and eating frozen pizza. Other than the grocery/liquor store clerks, she has no interaction with anybody.  That is, except for weekly phone calls with Mummy. But the reader will notice that something is off about their conversations…",
    "post_time": "Reviewed in the United States on January 13, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Eleanor’s world is very small. But she’s completely fine. She doesn’t know or expect anything different. Then one day her computer at work gets a bug, and she has to call the IT department. A new guy named Raymond comes to look at it. Little does Eleanor know, her world is going to change.",
    "post_time": "Reviewed in the United States on May 21, 2023",
    "pid": "0735220697"
},
{
    "title": "Don't judge a book by its cover!",
    "rating": "4.0 out of 5 stars",
    "content": "“Eleanor Oliphant was a book of the month selection for a reading discussion group I belong to on Goodreads. If not for that, I likely never would have picked up this book.  Generally, I avoid books with titles like this, and book covers like this one. So even with the 4.6 (out of 5) rating on Amazon, my expectations weren’t high.  And, as expected, I found Eleanor to be totally obnoxious and rude in the beginning chapters. But her quirkiness began to grow on me.  Slowly I saw there had to be reasons why Eleanor was the way she was, and I began to root for her.  I went from thinking this was a silly “fluff” book to discovering it’s a wonderfully written story about abuse, loneliness, healing, and connecting.",
    "post_time": "Reviewed in the United States on September 29, 2019",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this book. Much to my surprise, I’m giving it five stars.",
    "post_time": "Reviewed in the United States on March 22, 2024",
    "pid": "0735220697"
},
{
    "title": "Wholesome story",
    "rating": "3.0 out of 5 stars",
    "content": "Kind of a slow read but gives you feel good vibes at the end. Very cute book, took me a while to get into it.",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Eleanor Oliphant struggles with appropriate social skills. Her life is routine orientated and just plain lonely.  She is blunt and judgmental—not due to a specifically diagnosed disability but more due to the outcome of a horrendous but forgotten childhood.  Her life begins to spiral and with the help of a new ‘friend’ from work, she begins to recall moments of her childhood.  The highlight of the novel was seeing Eleanor blossom and come to the realization of her pain.  Strange as it seems, I appreciate how slowly the story of Eleanor’s past unfolded interjecting details in bits.  I will remember this story in its entirety and Eleanor in particular. This was a powerful, uplifting and often humorous book.",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "0735220697"
},
]