[
{
    "name": "  A Woman of No Importance: The Untold Story of the American Spy Who Helped Win World War II ",
    "stars": [
        "68%",
        "22%",
        "7%",
        "2%",
        "1%"
    ],
    "pid": "0735225311",
    "ratings": "22,728 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "A Woman if No Importance?",
    "rating": "5.0 out of 5 stars",
    "content": "This book abounds with unbelievable and cinema worthy life of Virginia Hall.  This woman achieved much in her life during the Second World War that should be celebrated as well as imitated by those who are looking for inspiration themselves!",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "If you would enjoy reading a boring, thoroughly documented 368-page newspaper article with some ham-fisted editorializing thrown in, then this book is for you. Reading this biography is a chore. If you somehow make it through, much like a root canal, or a bout of severe constipation, the only joy you experience arrives when it is finally over. I will say that this book is a decent sleep aid. It took forever to read this catastrophe, and I could barely remain awake toward the end of each sitting.",
    "post_time": "Reviewed in the United States on September 5, 2023",
    "pid": "0735225311"
},
{
    "title": "An Author of No Imagination... whose treatment of tragic events is quite bizarre",
    "rating": "5.0 out of 5 stars",
    "content": "The book attempts to document the life of an extraordinary woman, Virginia Hall, one of America's pioneering covert operatives in occupied France during WWII. How the author could take such a riveting and compelling topic and hammer the life out of it is beyond me. The book is written in the style of an academic thesis mashed up with a neverending newspaper article. There are perhaps one billion footnotes, although I might be exaggerating somewhat. The author evidently had access to an extraordinary trove of documentation and correspondence from the key players in the story, but the reader never gains any insight into what things must have been like for any of the participants. In fact, no attempt was made to gain any such perspective. Many tiny, obscure details are documented, with absolutely no regard for the overall meandering flow of the narrative. People and places are introduced, never to be heard from again. The elements of the story are presented with the emotional range of a recipe for a cake. Things like... They hiked into this valley. Here's the name of the valley. Here's the name of the stream they crossed. Here's the name of the road. Then they killed these Germans. Then they found a safe house. Then they went to sleep because they were tired. Then they woke up and dodged the other Germans looking for them. Then they learned their friends had been horribly tortured for weeks and had their faces smashed in. Then these other French people were rounded up and shot through the head for talking to Hall. Then Hall felt sad. Then Hall learned to make cheese, but the cheese wasn't very good cheese. Frankly, the tone was bizarre and almost sociopathic. The horrors of war were brushed over with the indifference one might have for an insignificant sporting event. Based on the author's odd tone, she evidently views the war as a game in which Hall performed quite well. The scores were documented, and a play-by-play account was given, but this reader felt like the recipient of an emotionless data dump.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The author reserves her most righteous indignation for her description of Hall's frustrations as the victim of the sexism of the time. This seems to bother the author quite a bit more than the slaughter of millions of people and the destruction of a continent. While Hall's treatment was obviously wrong, and culturally normal for the time, it is quite jarring to read page after page devoted to descriptions of Hall being short-changed in her paycheck or rank while glossing over literal war crimes. This author's priorities seem bizarre indeed.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "0735225311"
},
{
    "title": "Excellent read !",
    "rating": "5.0 out of 5 stars",
    "content": "The author is such a fan of Hall, that anything Hall ever stated is taken as fact, while all criticisms of Hall are instantly dismissed as sexist, lies, misunderstandings, or the result of jealousy. The sole criticisms of Hall the author can muster are that she was occasionally too strong-willed and determined and that she sometimes couldn't bear to follow the orders of stupid, arrogant, inexperienced superiors. Perhaps this was often true, but in the mind of the author, Hall was right 100.00% of the time, and the rest of the world was right 00.00% of the time.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book made it to the New York Times Best Seller List based on the very compelling subject. The author unfortunately did not live up to the high standard of performance set by Hall.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "0735225311"
},
{
    "title": "great book.",
    "rating": "4.0 out of 5 stars",
    "content": "I do not recommend this book.",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great read at a great price!",
    "post_time": "Reviewed in the United States on March 19, 2024",
    "pid": "0735225311"
},
{
    "title": "This was a great book about",
    "rating": "5.0 out of 5 stars",
    "content": "I loved the book but the type was kind of small, should have got it on my kindle.",
    "post_time": "Reviewed in the United States on December 20, 2021",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A very brave, heroic woman.  Wish Stephen Spielberg and Tom Hanks would make a movie about a woman hero of WWII.  A story well with the big screen.  I hope someone has bought the rights to film this great story.",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "0735225311"
},
{
    "title": "A Hero No One Knows!",
    "rating": "4.0 out of 5 stars",
    "content": "I found the life of Virginia Hall to be both shocking,  exhausting and a person I had never heard about. I finished this book with an extrodinary empathy regarding what every war veteran must go through. She was a super clandestine spy and antagonist who worked for well over 6 years during WWII, her job ended rather abruptly when the war closed to an end. She had worked tirelessly and overcame the perceived limitations of her disability and for the times, being a woman. She became the major leader of men in combat by working harder than everyone else. Now she had to go back and deal with a world that percieved her as a disabled woman. Most people who have faced her challenges would have most likely quit. However, she seemed to not have any quit in her.",
    "post_time": "Reviewed in the United States on December 23, 2021",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I did run across several editing errors but not to the degree of being a big distraction. I also got confused with all the alias' in the book. This was just my challenge and most readers may not have this problem. Many sentences were ended in french as well. Although one could probably figure out what the author was saying, I was still curious as to the actual meaning.",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "0735225311"
},
{
    "title": "Remarkable woman.",
    "rating": "5.0 out of 5 stars",
    "content": "Again, these were just my distractions and it should not limit the reader from buying this book.",
    "post_time": "Reviewed in the United States on December 31, 2021",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "She was a fascinating character. I had read her name and about her prosthetic leg in another book which prompted me to buy this book. She was way more than I expected.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "0735225311"
},
{
    "title": "A Woman of Extraordinary Importance",
    "rating": "4.0 out of 5 stars",
    "content": "Great history and worth reading.",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was one amazing story about one woman and her strength and courage.  I know I would never have been able to stand up against the evil that she did.  This book shows what the resistance did and it's ability to engage the army of Germany.  I was amazed by her strength and ability to engage them until the very end.  She should used as an example to everyone that shows how her belief in herself and courage was able to prove that she did deserve the respect. that she was denied.  I had never heard of her before now but I will never forget her now.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "0735225311"
},
{
    "title": "Well deserved tribute to a real heroine",
    "rating": "5.0 out of 5 stars",
    "content": "Virginia Hall justly deserves recognition as one of the most important covert operatives and strategists of the Second World War. Yet she was continually underestimated, underutilized, and thwarted for no reason other than she was a woman in a male-dominated game.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Sonia Purcell does us a great service by recovering some of the outlines of this remarkable woman and her career with the British SOE, the American OSS and then CIA. Thankfully others have done similar work for the pioneering and critical contributions of women in codebreaking, and in courageous and dangerous wartime service.",
    "post_time": "Reviewed in the United States on June 16, 2022",
    "pid": "0735225311"
},
{
    "title": "Learning more about WWII",
    "rating": "5.0 out of 5 stars",
    "content": "But, to infiltrate wartime France, and to become perhaps the most important single figure in organizing the French Resistance to German occupation and Nazi atrocities, is without parallel. To do this for three years and escape with her life is an unlikely result of great skill aided by good fortune. And to do this while coping with a painful disability (Virginia lost her lower left leg in a hunting accident) borders on unbelievable.",
    "post_time": "Reviewed in the United States on April 14, 2019",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "But nonetheless, there she is.",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "0735225311"
},
{
    "title": "A Woman on Resilience, Inner Strength, and Courage to Do the Right Thing",
    "rating": "5.0 out of 5 stars",
    "content": "There are some books that stay with you long after you read the last page – this is one of them. It is an inspiring and fascinating story of one woman who made a difference while in extreme danger. She persevered through challenges that few humans faced and helped the Allies win World War II. The story drew me in from the prologue and took me back to France in World War II. She was resourceful and determined to do all she could.",
    "post_time": "Reviewed in the United States on March 12, 2023",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Virginia Hall is someone that I can admire and can learn from, someone I can relate to (I am amputee who has not let the prosthetic leg limit me). She was a human who faced obstacles and overcame them because of her courage and resilience, pushing on despite pain and discomfort to do the right thing, without expecting any credit or recognition.  Despite pain and extreme discomfort, one can do things that seems impossible, like escape from France to Spain over the Pyrenees mountains November with snow and return to an occupied France to organize paramilitary forces.",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "0735225311"
},
{
    "title": "wonderful book for a newly recognized woman",
    "rating": "5.0 out of 5 stars",
    "content": "Really admire and enjoyed this book. A thoroughly researched book into the life in the Resistance of WWII in France through the actions of Resistance fighter and leader  of Virginia Hall. A leading spy in WWII bc of misogyny her tales of bravery and Resistance leadership have only rather widely bc known.",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What this American woman accomplished behind enemy lines in France during WWII was astonishing, and that she survived so many close encounters with the enemy amazing. Yet so very few people know her name today. This book rectifies that oversight.",
    "post_time": "Reviewed in the United States on July 1, 2023",
    "pid": "0735225311"
},
{
    "title": "Unbelievable Bravery",
    "rating": "4.0 out of 5 stars",
    "content": "What a book! I read this book for a book club review and the history I learned in this book about women participating in WWII. This woman, Virginia Hall, was intelligent, remarkable to do things men were afraid to do, and with one and a half legs. Great read, great woman. Highly recommend. She helped win the war, but afterward, she never got the promotions in her job(s) and was passed over by men of lesser means. This book gives her some recognition that she was entitled to in her day and time. I was proud and sad for her. Seemed she had demons chasing her mind after the war and her heart weakened due to the drugs given to her to stay awake for days at a time waiting for weapons and supplies. This story touched my heart. What opportunities Great Britain gave her - she contributed to the world being a better place today. Thank you, Virginia Hall - Very grateful for all you did.",
    "post_time": "Reviewed in the United States on August 28, 2020",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "When visiting the Washington, DC Spy museum, I read and saw a few snippets about Virginia Hall.  She was an amazing woman.  On the current CIA campus, she is the only woman to have a building named after her.  Virginia’s life was definitely a 5/5, but felt Purnell up-played this woman’s heroics while down-playing her faults and too often the author interpreted what she thought Virginia Hall was feeling rather than sticking to the facts.  Clearly an amazing amount of research went into this novel filled with numerous names and locations, in which I did sometimes get bogged down.  Am glad to see that a movie has been scheduled to be made about Hall’s extraordinaire life starring Daisy Ridley and I look forward to seeing how the director edits the material.  Virginia was born into a well-to-do family, but the money was lost in 1929 and she floundered as well.  While traveling in France, she fell in love with the country.  Since the USA only wanted her for her typing or ambulance skills, the British gratefully took her on as a spy against the Germans in WWII, this despite her missing foot.  She had a great capacity for disguise and inventiveness, charm to gather dedicated people to help her, and a strong ability to keep secrets.  I found it surprising that one of her greatest challenges was to keep the French from bickering with each other.  I would rate the book a 4.",
    "post_time": "Reviewed in the United States on September 28, 2019",
    "pid": "0735225311"
},
{
    "title": "Woman Warrior",
    "rating": "5.0 out of 5 stars",
    "content": "I can most highly recommend this book to anyone interested in World War II, true espionage, true stories of overcoming overwhelming obstacles, and how we all are capable of more than we believe.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the true story of Virginia Hall who survived an infected foot from a terrible accident resulting eventually in a below the knee amputation. The whole event which was before antibiotics should have resulted in her early demise. Throughout the book, men try to belittle her, prevent her from achieving, and take credit for her accomplishments. Despite the terrors of the Vichy police and the Gestapo, she succeeds in situations that all others had given up hope. Her exploits are nearly unbelievable and the reception by all male superiors except William 'Wild Bill' Donovan of the OSS is abhorrent. She had to battle the Vichy government, the Gestapo, misogyny in the resistance, and her command structure.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "0735225311"
},
{
    "title": "A Woman of a Great Deal Of Importance",
    "rating": "4.0 out of 5 stars",
    "content": "She succeeded in all her battles during World War II to achieve spectacular results despite having only one leg that made it more difficult to maintain her cover. Her battles for recognition and equity were not as successful. She was awarded a Distinguished Service Cross by Donovan and late awards by the French. Her battles in the CIA for recognition of her talents was not as successful. The CIA is very critical of itself in how she was treated - once again abhorrent treatment.",
    "post_time": "Reviewed in the United States on November 30, 2023",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book is well written, tells the story well, has many details without getting absorbed in small facts. It is well referenced. Virginia Hall should be revered for her amazing and important accomplishments in the liberation of Europe from the Nazi's. You will be moved by this woman. At the same time, you will be ashamed at how FDR, the State Department, the British SOE, and the CIA treated this woman.",
    "post_time": "Reviewed in the United States on April 1, 2020",
    "pid": "0735225311"
},
{
    "title": "Spectacular Account!",
    "rating": "5.0 out of 5 stars",
    "content": "This is a spectacular account of an incredible, generally unacclaimed, woman named Virginia Hall!  A WOMAN OF NO IMPORTANCE, The Untold Story of the American Spy Who Helped Win World War II is a fascinating biography that reads much like an adventure thriller.",
    "post_time": "Reviewed in the United States on January 5, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "  I became completely enamored with Virginia within the first few pages. Despite this, it took me quite a while to read the book because the story is so intense that I had to set it aside several times — especially after the brief reports of horrendous Nazi torture.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "0735225311"
},
{
    "title": "Fascinating. Sometimes it takes decades to allow a True story to be unearthed",
    "rating": "4.0 out of 5 stars",
    "content": "  The author’s research was copious and meticulous, the writing fast paced and clear, and the courageous brilliance of the subject unforgettable.",
    "post_time": "Reviewed in the United States on April 13, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am so glad she did all of the research; the book reads like historical fiction, it is so amazing and nicely-paced. Is a well-researched book and is a great read.",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "0735225311"
},
{
    "title": "Very interesting!",
    "rating": "5.0 out of 5 stars",
    "content": "A true tale very worthy of telling and very well told.",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a wonderful accounting of the most amazing woman’s courage and bravery equaling that of soldiers, sailors, and airmen, that fought all over the world in the Second World War.",
    "post_time": "Reviewed in the United States on October 31, 2023",
    "pid": "0735225311"
},
{
    "title": "An Incredible account of an amazing woman & her work during WWII",
    "rating": "5.0 out of 5 stars",
    "content": "I first bought the audio edition and found the book so compelling that I purchased a hard copy to have in my personal library, a rarity for me..",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The current generation should be required to read books like this to get a realistic understanding of what it means for hundreds of millions to lose their freedom, and what it takes to drive back totalitarian, fascist, socialist, communist, or what is now called Top Down government. Freedom is to precious to lose to individuals who want to make everyone else do what they want, their way, without individual choice.",
    "post_time": "Reviewed in the United States on February 25, 2024",
    "pid": "0735225311"
},
{
    "title": "A Most Remarkable Woman",
    "rating": "5.0 out of 5 stars",
    "content": "It is unbelievable that this hero of WWII should have escaped high recognition for her exploits as an agent of the British and American secret services, with her remarkable organizational abilities and important contributions to the French resistance during the war. She was frequently at tremendous risk of being discovered, arrested and tortured, but ignored the danger in order to complete her missions. This book is exceedingly well written describing her life as a less than famous hero of the Second World War.",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The biography of such an historic woman shows us where women were in the early part of the twentieth century in the cultures of nations around the globe. It also reveals the determination of the subject, Virginia Hall, that reflects the strength and determination of many women living in those times. Virginia chose a life doing things normally done by men. Like many women in history, she exceeded the expectations and overcame the challenges to achieve her goals. Inspirational read for anyone who has ever felt the oppression of biased judgements or handicaps.",
    "post_time": "Reviewed in the United States on April 1, 2024",
    "pid": "0735225311"
},
{
    "title": "A terrific fast paceed read of amazing courage and guts",
    "rating": "4.0 out of 5 stars",
    "content": "The well-researched story of Virginia Hall an amazing woman who worked many years behind enemy lines organizing spy rings, and resistance cells first for the British and then the Americans.  To cap it off she did this while fighting the old boy's resistance/discrimination to what women could do. She was relentless in her tasks, despite being thwarted many times by ignorant bureaucrats.  After the war, her deep experience seemed to threaten the less experienced bureaucrats so she spent many years having her talents wasted.  Lots of kudos and awards from the Brits, the US and France eventually found their way to her, which she shrugged off.",
    "post_time": "Reviewed in the United States on July 3, 2023",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great book, Great Person",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "0735225311"
},
{
    "title": "Wow!",
    "rating": "5.0 out of 5 stars",
    "content": "Having read a number of books on the history of espionage, and espionage in the Second World War in particular, I can say that this may be the most interesting and illuminating account of operations in Occupied and Vichy France ever written in English.  I would say that it “reads like a novel,” except no, it reads much better than a novel.",
    "post_time": "Reviewed in the United States on April 12, 2019",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Also a very important corrective to the lack of appreciation of female intelligence operatives during the Second World War.  It is not really surprising, but nevertheless infuriating, to see how badly female agents were treated by the men in charge of Allied intelligence operations.  Eventually, after her skill and heroism became so evident, SOE and OSS, and the French, did come around to recognizing Virginia Hall’s contribution.  But I have to suspect that there were many other women, making great sacrifices, who were never recognized.  (And then there was the shameful treatment of Josephine Baker, who was recognized by the French, but ignored by her own country because of racism as well as sexism.)  A Woman of No Importance is straight history, and no feminist rant.  But in the course of telling this story, Sonia Purnell has made a real contribution to feminist history.",
    "post_time": "Reviewed in the United States on January 19, 2024",
    "pid": "0735225311"
},
{
    "title": "History that's much better than fiction",
    "rating": "4.0 out of 5 stars",
    "content": "One of the best, most researched, most riveting books I’ve ever read. I was actually sorry to have it come to an end. The author brilliantly brought Virginia back to life and truly gave a great tribute to this heroic and amazing woman. Wow … her bravery, her brilliance, her accomplishments are all beyond measure and comparison. I will never forget this book, I will never forget Virginia, and I hope many will read it so Virginia will become known for the heroine she was. Excellent book and excellent author.",
    "post_time": "Reviewed in the United States on August 8, 2022",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The author, Sonia Purnell, has written about a very interesting subject, however, she introduces so many characters it's impossible to keep track of them. You should be able to key on three or four main characters to appreciate the story line. I'm sure Sonia wrote with the intention of not letting anyone be over-looked, which at times becomes very tedious for the reader.",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "0735225311"
},
{
    "title": "outstanding book",
    "rating": "5.0 out of 5 stars",
    "content": "Additionally, she gives Virginia constant accolades about what an extraordinary spy she was, where she could have let her story convince us of her awesome feats.",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I think the material for this stretch of history was meticulously researched. I know Sonia must have had a very difficult task in writing a biography about Virginia without being able to interview her personally, so I give her a lot of credit.",
    "post_time": "Reviewed in the United States on March 9, 2023",
    "pid": "0735225311"
},
{
    "title": "Too many characters and way too many accolades",
    "rating": "5.0 out of 5 stars",
    "content": "Other than the two items I mentioned above it was a great read, so that's all I'll say so I don't spoil it.",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Your average reader,",
    "post_time": "Reviewed in the United States on June 26, 2019",
    "pid": "0735225311"
},
{
    "title": "A Disabled Woman of Great Courage Fighting for Freedom!",
    "rating": "5.0 out of 5 stars",
    "content": "I do not want anyone to think war is great.  But sometimes when dictators take over war has to happen.  This is a factual book based on an American woman who was disabled (lost her leg) and worked to free France.  Even before WWII she could see democracy dying behind dictatorships in Germany, Italy, and Russia.  These countries especially Germany was on the move.  She tried to alert Americans by writing newspaper articles but no one paid attention.  As she was about to leave Europe she was recruited by the British for new department: espionage. This woman who was in pain due to a heavy prosthetic did things that even men were afraid to do.  She failed to get recognition by the USA until the 1980’s and most of the files on her were lost.  The author did a wonderful job of finding the information she did to write this true book about this extraordinary woman!  As a woman with disabilities I am amazed and awed at her determination and love for freedom!  She did what was needed and necessary in WWII to assist in freedom.",
    "post_time": "Reviewed in the United States on February 15, 2022",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Got this for my 91 year old retired Marine father as part of his Christmas gifts. He loves history. It is not uncommon for him to devour a book a day. It is challenging to find him material he is not already knowledgable about, but he went nuts over this book! He loved it so much that he re-read it a second time!  He served in the military for over 25 years. He served in war. He is not the type to get all fired up in awe over people, but he would not settle down until I also read this extraordinary and well researched book so we could talk about it. We are now both certified Virginia Hall fans and plan to actually drive to Baltimore to visit her grave. The woman is one of the most courageous, clever and principled I have ever read about. The book should be required reading in schools when studying World War II and the British spies who supported the French resistance during Nazi occupation. It reads like a thriller about a quarter of the way in, and then one just cannot put it down. This is the kind of story that will surely inspire a great film, but if I didn’t read this book first, I would assume was a Hollywood exaggeration. Virginia Hall is a true American hero and its shocking that few people know of her service to freedom.",
    "post_time": "Reviewed in the United States on February 3, 2021",
    "pid": "0735225311"
},
{
    "title": "An American socialite who becomes a hero in Britain, The US AND France",
    "rating": "5.0 out of 5 stars",
    "content": "Sonia Purnell has meticulously researched historical records and recently declassified documents to render a fascinating biography of Virginia Hall that reads like a spy novel except that it's \"real\". Virginia Hall was a truly remarkable person whose contributions to the French resistance during WWII were unsurpassed and, unfortunately unappreciated because of her sex. Because of her knowledge gained from living in France and driving an ambulance after the Fall of Paris, she secured a position with the covert Special Operations Executive (SOE) branch of British MI6. Operating in Vichy France, she proved herself adept at setting up safe houses and recruiting resistance allies organized as networks of cells. Virginia was hampered in her efforts by being made subordinate to male agents less competent than she, and sometimes incompetent. The Gestapo and SS certainly recognized her competence and made her the \"Most Wanted\" spy in France. After making a harrowing escape thought southern France over the Pyrenees to Spain, she rejoined the OSE in England. The OSE would not let her return to France because her identity was compromised. Virginia learned to be a wireless operator and was recruited by the Wild Bill Donovan's OSS. This allowed her to pursue her dream of being a covert field agent and contributing to the resistance effort in freeing France from German occupation. That she could accomplish so much (in spite of her subordinate status as a woman with a disability - Read the book) is a testament to her integrity, perseverance, and commitment. The author has incorporated personal insights gained through interviews with Virginia's niece. I highly recommend this book.",
    "post_time": "Reviewed in the United States on August 6, 2020",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Virginia is one-in-a-million! The extent she would go to to disguise herself is over-the-top. Her courage and ability to carry on with many odds against her and think on her feet was amazing every time it happened. She is such a heroine!  Her discernment of the qualities of people she just met is way above average and she is nearly always right. She demanded respect and usually got it-- except from the Americans! That was a big disappointment. Not many women could fill her shoes. The capability to keep going under stress and pain showed her determination, loyalty and loyalty to her cause.",
    "post_time": "Reviewed in the United States on November 3, 2023",
    "pid": "0735225311"
},
{
    "title": "A book of great impoetance",
    "rating": "5.0 out of 5 stars",
    "content": "This historically true story reads with interest and substance. Too many times these stories are dry with overbearing details. I enjoyed the read, and was fascinated to learn the roll this amazing woman played not only in helping win WWII, but her chutzpah and drive to succeed despite the life threatening adverse obstacles she faced.",
    "post_time": "Reviewed in the United States on February 23, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is an amazing book, so well-researched and written.  Unbelievable how this woman from Maryland suffered the hardships of occupied France during WW2 with great strength and willpower in spite of a disability.  She worked, initially for the British then the US precursor of the CIA, the OSS. Absolutely gripping!",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "0735225311"
},
{
    "title": "Excellent! Never heard of by our book club...",
    "rating": "5.0 out of 5 stars",
    "content": "good service",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Like most people, I had never heard of Virginia Hall, and the story goes that she is (or was) an unsung hero. Perhaps, but not to those in the intelligence service in the UK and CIA, where she is revered. She even has a training center in Langely named after her, and the agency uses (and teaches) her groundbreaking techniques to this day.",
    "post_time": "Reviewed in the United States on January 6, 2021",
    "pid": "0735225311"
},
{
    "title": "Amazing True Story",
    "rating": "5.0 out of 5 stars",
    "content": "It's not all that surprising Ms. Hall has flown under the radar, so to speak, as she was never one to toot her own horn, even turning down Truman's request to deliver her Distinguished Service Cross himself (Wild Bill Donovan, her biggest fan, placed it on her in a small ceremony). She was made an honorary member of the Most Excellent Order of the British Empire and was awarded the Croix de Guerre with Palme by France, neither of which she ever picked up.",
    "post_time": "Reviewed in the United States on May 5, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "That Ms. Hall was an astonishingly brave, competent person goes without saying, but to fully grasp this you really need to read this book. Her accomplishments seem superhuman, so much so that some people at the time simply did not believe that anyone, especially a woman with a wooden leg, could possibly have achieved them. But she did.",
    "post_time": "Reviewed in the United States on March 27, 2024",
    "pid": "0735225311"
},
{
    "title": "Great story but just a little too much",
    "rating": "3.0 out of 5 stars",
    "content": "Sonia Purnell, kudos to you for taking on the story of Virginia Hall.  The story is fascinating, and I am in awe of the amount of research it took to write this book.  There is always so much more to learn about WWII.  I feel guilty giving this book only 3 stars but here is why:  it is just too many people, too many places, somewhat dry, too much detail and it kind of rambles.  I found it hard to follow and by 30% started skimming the chapters.  I would have enjoyed knowing more about her life once she returned home.",
    "post_time": "Reviewed in the United States on October 15, 2022",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If I were Sonia, or her publisher, I would take the same terrific body of information and turn it in to a really interesting biography.  Slim it down, make it a story and more people will love it.  I felt the same way about David McCullough’s Path Between the Seas about the Panama Canal.  It is a great wealth of information but just too much.  I felt like I had a PhD in Panama Canal when I was done.  It was more than I really wanted or needed to know.  Just my humble opinion.",
    "post_time": "Reviewed in the United States on August 15, 2020",
    "pid": "0735225311"
},
{
    "title": "An Amazing Woman with an Amazing Story",
    "rating": "5.0 out of 5 stars",
    "content": "This book was well written, well researched and held my interest.  I am thankful the author wrote this book and it's one that I wish every person would read.  Virginia was a true hero who was motivated to prove herself and to help others.  She wanted adventure and for her life to mean something by helping others.  She wanted no recognition, just the authority to do the work during a time that was difficult for women to get jobs typically held by men.  She risked her life for others over and over and did the work that few others would be capable or willing to do.  The author also gave a very clear picture of what was happening in France, especially Southern France during the German occupation.  I had read about Virginia Hall before reading this book but learned so much more from this author.  At first, I didn't like the title of this book because Virginia Hall was a woman of great importance but she saw herself as a woman of little importance so the title made sense. Virginia's story is very well documented by Sonia Purnell.  Grateful to woman like Virginia who risked it all to make a difference in history and to women like Sonia Purnell who have the talent and drive to research and write the story.  Well done!",
    "post_time": "Reviewed in the United States on September 20, 2021",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As a reader of over 200 books related to WWII this one ranks as one of the most well written and compelling page turners. The little known story of a truly very important (despite the way she was treated during and after her clandestine service) and impacting person in WWII. The obstacles she overcame were incredible.  The results unparalleled by those of other men and women.",
    "post_time": "Reviewed in the United States on August 19, 2019",
    "pid": "0735225311"
},
{
    "title": "Excellent",
    "rating": "5.0 out of 5 stars",
    "content": "Overcoming the roadblocks set in place by, primarily, the  men on her side alone, warrants our admiration! But overcoming those merely gained her the opportunity to face and match wits with the sadistic gestapo, German army intelligence, and French collanorators -- including Klaus Barbie, the butcher of Lyon. Living for months at a time, living a lie, starving, trying to stay alive while also protecting the resistance cells she created, supplied, and trained was her goal -- to be and do something consequential for her the citizens beloved second home.",
    "post_time": "Reviewed in the United States on December 15, 2020",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A story all Americans  can truly be proud of. An example all citizens -- men and women -- might aspire to buy unlikely to equal!",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "0735225311"
},
{
    "title": "Jaw dropping courage",
    "rating": "5.0 out of 5 stars",
    "content": "A great read and highly recommended!!!",
    "post_time": "Reviewed in the United States on February 6, 2020",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Virginia Hall was a socialite who from an early age loved adventure, instilled by her beloved father.  Her mother wanted her to marry into high society but Virginia gravitated to France where she fell in love with the country. When the Nazis were taking over France she drove ambulances to save people despite great danger. She wanted to continue helping France in the formal diplomatic service but ended up being rejected at every turn because of her gender and her wooden leg. As the war darkened four  years before the Normandy landing, she was \"discovered\" by a British officer when she was driving ambulances through great danger. He believed in her extraordinary stamina, courage, and burning dedication to ridding France of the Nazis. Virginia was  the first person to work for the British Secret Service to start building a resistance force in France.  The story of how she recruited many hundreds of resisters and managed the disruption of countless Nazi war resources  is riveting. She is responsible for keeping the French Resistance alive despite harrowing events, loss of many heroic recruits, her own near death and starvation, and unbelievable physical pain as she walked hundreds of miles including over the Pyrenees Mountains. The descriptions of Nazi terror are a wake up call to the danger of authoritarianism gone wild. If you thought you knew what the word \"resistance\" means, you will think differently about it after you read this book.",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "0735225311"
},
{
    "title": "A Woman Of No Importance - Who Did Not Believe It Was True",
    "rating": "5.0 out of 5 stars",
    "content": "This was a fascinating book to read. Virginia Hall's strong independent character, and ability to defy the naysayers to accomplish the impossible were her forte. She overcame repeated setbacks to her career goals because women in those days of the 1930s and into the war years of WWII were not supposed to do those things she desired to do...and did do. Especially when she became an amputee in her early career. As an amputee she went behind enemy lines in France two times to lead and inspire the French Resistance against the Nazi occupation. She served brilliantly with both the British Special Operations Executive (SOE), and the US OSS. She was the first woman awarded the Distinguished Service Cross the second highest US award for valor in combat. After the war the discrimination against her moving up the ladder at the CIA was still in effect. But her strong will & determination coupled with her feisty demeanor finally ended her career at the CIA. Lastly, this book reveals to the reader what \"TOTAL WAR\" really looks like where the allies did what it took to win. This type of determination is now in short supply in the US and other western democracies because being bad to the bad guys ain't nice no more..",
    "post_time": "Reviewed in the United States on October 3, 2023",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is hard to believe no one has written the story of this courageous woman. Her strength and dedication seem fictional. Her contribution to the freedom we enjoy today cannot be measured in words.",
    "post_time": "Reviewed in the United States on December 20, 2023",
    "pid": "0735225311"
},
{
    "title": "An Unsung Heroine",
    "rating": "5.0 out of 5 stars",
    "content": "Bravo and hats off to you Sonia Purcell for bringing the extraordinary story of Virginia Hall to print.",
    "post_time": "Reviewed in the United States on December 4, 2021",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It was a gripping tale, at times almost defying the bounds of credibility such was the amazing courage and fortitude of this bravest of women.",
    "post_time": "Reviewed in the United States on March 27, 2024",
    "pid": "0735225311"
},
{
    "title": "This was a great bood, and I enjoyed it enormously",
    "rating": "5.0 out of 5 stars",
    "content": "It wasn’t enough to be a leader of men,  Virginia had to overcome a crippling, life threatening injury as well as scores of men who felt threatened by her indomitable spirit and passionate leadership abilities.",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Virginia overcame both physical and personal challenges to become the amazing leader she was in the darkest hours of the war in occupied France where one false move, careless action or word meant certain death.",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "0735225311"
},
{
    "title": "A must read.",
    "rating": "5.0 out of 5 stars",
    "content": "Her strength and perseverance were epitomised in her climbing and crossing the Pyrenees in winter with an old fashioned artificial leg, a feat which many able bodied and well equipped folk would find impossibly daunting!",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This incredibly well researched book was an enthralling read and an unforgettable and lasting testament to the brave and selfless woman who was Virginia Hall.",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "0735225311"
},
{
    "title": "Great story of a trailblazing woman",
    "rating": "5.0 out of 5 stars",
    "content": "he story itself was one of grit and determination, and it had such an on the edge sense I was amazed at how riveted I was",
    "post_time": "Reviewed in the United States on February 10, 2024",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Well written, informative, exciting and an eye opener as to what the French did and did not do during WW11.  A true story that should make everyone appreciate what others have done to save our way of life.  This is about a woman’s of great importance.",
    "post_time": "Reviewed in the United States on July 9, 2023",
    "pid": "0735225311"
},
{
    "title": "Readable , educational about black culture",
    "rating": "4.0 out of 5 stars",
    "content": "Many war heroes have achieved wonders despite being treated badly by their own side.  Virginia Hall was one such.  Her example of resilience in the face of obstacles is inspiring.  This book is well-written and exquisitely researched.",
    "post_time": "Reviewed in the United States on April 12, 2023",
    "pid": "0735225311"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Holds interest",
    "post_time": "Reviewed in the United States on September 16, 2020",
    "pid": "0735225311"
},
]