[
{
    "name": "  The Spy and the Traitor: The Greatest Espionage Story of the Cold War ",
    "stars": [
        "77%",
        "18%",
        "3%",
        "1%",
        "1%"
    ],
    "pid": "1101904216",
    "ratings": "32,676 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "A thriller and shows how close we came to nuclear war with Russia",
    "rating": "5.0 out of 5 stars",
    "content": "A fantastic read if you are into spy stories - and it's true. Given Putin's threat of nuclear attack, it's helpful to know that it nearly happened during the Reagan presidency. The double agent, Oleg Gordievsky knew that Andropov  believed that the US would strike first, and, like Putin, he was  looking for 'evidence' to back up his belief. Gordievsky's information was deemed so believable, that it influenced Reagan to calm the situation.",
    "post_time": "Reviewed in the United States on October 13, 2022",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "How the US blundered into blowing Oleg's cover and his rescue are fascinating.",
    "post_time": "Reviewed in the United States on October 28, 2023",
    "pid": "1101904216"
},
{
    "title": "A powerhouse of a story",
    "rating": "5.0 out of 5 stars",
    "content": "This book, while slow to read at times, picked up intensely during part III of the novel. It was well-written and incredibly intriguing. 4.5/5 stars, rounded up",
    "post_time": "Reviewed in the United States on February 13, 2020",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was very interested to read this account of the KGB Colonel who used his disenchantment of Communism and a Totalitarian regime to  effectively spy for the West. I have no use for someone who would betray their county for a better car or cash (Aldrich Ames, Harold James Nicholson) in hand but I do understand trying to bring about change for the country you love that you feel is on the wrong path. I really admire Oleg Gordievsky for the difficult choices he made. I was heartbroken for him that the KGB refused to release his wife and children for so long that their marriage didn’t survive. In a totalitarian state it’s sad that you can’t trust your own spouse not to turn you in. That type of regime turns brother against brother, children against parents and the family is the loser in the end. But the story was enthralling and especially the end.  I am passing this book along to my peeps.",
    "post_time": "Reviewed in the United States on July 31, 2023",
    "pid": "1101904216"
},
{
    "title": "Entranced from the first pages...",
    "rating": "5.0 out of 5 stars",
    "content": "I love it when l I am suggested books that are great.  This is a 007 movie for sure.",
    "post_time": "Reviewed in the United States on December 22, 2019",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is an amazing story showing someone shaping the world.",
    "post_time": "Reviewed in the United States on July 18, 2022",
    "pid": "1101904216"
},
{
    "title": "This is awesome",
    "rating": "5.0 out of 5 stars",
    "content": "It's an awesome history.  A breath of fresh air.  Wow following convictions.  Something lacking today.",
    "post_time": "Reviewed in the United States on September 23, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "“The Spy And The Traitor” is the riveting true story of Oleg Gordievsky, a high level KGB operative, exfiltrated out of the Soviet Union in July 1985 after years of spying for the Brits. Ben McIntyre, the author,  writes with extraordinary detail, dividing the spy world between “good guys” and “ bad guys,” naming names (not just of spies) but of British politicians and notables complicit with the KGB. McIntyre’s lengthy Part III, the actual exfiltration of the spy to Finland, is mesmerizing holding the reader’s attention  as if shackled to page after page of the clever disguise and artifice.",
    "post_time": "Reviewed in the United States on November 8, 2020",
    "pid": "1101904216"
},
{
    "title": "Riveting, thrilling !",
    "rating": "5.0 out of 5 stars",
    "content": "McIntyre ends with the capture and imprisonment of Aldrich Ames as the treasonous culprit; with ringing muteness of the quality,  or lack thereof,  of the intelligence resources in this country. The book has maps and telling informative color photos.",
    "post_time": "Reviewed in the United States on March 10, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The behind the scenes actions of a true hero, of the many spies within the KGB, MI6, MI5, CIA and others nation’s spy networks, was a revelation. As we conducted our day to day lives, little did we know that real wars were being conducted in secret.",
    "post_time": "Reviewed in the United States on May 27, 2019",
    "pid": "1101904216"
},
{
    "title": "Well written account of a spy who has profoundly impacted our lives",
    "rating": "5.0 out of 5 stars",
    "content": "Bottomline: This book offers a detailed account of possibly the most impactful cold war spy. While it’s a non-fiction book, it’s a page turner so well written that I found it impossible to put aside.",
    "post_time": "Reviewed in the United States on February 3, 2020",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book describes the collaboration of a highly ranked KGB spy with British intelligence during the cold war, the impact it had on the West-Soviet relations and the personal price he paid. It makes you reflect on how one person could impact the course of history as this man did, by exposing the West to Soviet thinking and by mitigating the chance of a nuclear war in the height of the cold war.",
    "post_time": "Reviewed in the United States on June 25, 2023",
    "pid": "1101904216"
},
{
    "title": "Thrilling! Scary! Brilliant!",
    "rating": "5.0 out of 5 stars",
    "content": "If you are intrigued with espionage, the work of the KGB, MI6, the cold war period, and the motivations, personal sacrifices, and values of intelligence officers you will enjoy this book.",
    "post_time": "Reviewed in the United States on February 12, 2019",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A book that provides clarity and insight about a person who had tremendous influence over a rapidly changing world. It also provides context about events during that period (70-80s) when headlines around the world were scary all the time.",
    "post_time": "Reviewed in the United States on October 10, 2022",
    "pid": "1101904216"
},
{
    "title": "The most compelling, intriguing and unbelievable true story that I've ever read!",
    "rating": "5.0 out of 5 stars",
    "content": "It's very hard to put into words how this story affected me. Other reviewers have done a very thorough job of outlining the story. I can only encourage you to read it, and then challenge you to be able to put it down! My only critique (not of the book, but the formatting) is if you're reading this on your Kindle, that during the climax of the story, it is interrupted by several pages of photographs that are spoilers, before you read the outcome! So, be warned to close your eyes and fast forward. I hope that someone such as Tom Hanks, Steven Spielberg, or one of the great directors that excels at bringing epic stories such as this to life will get to work on this excellent story. Thank you, Oleg Gordievsky,  for everything you've done for England and America in the name of democracy.",
    "post_time": "Reviewed in the United States on October 19, 2018",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love spy novels and movies, but this account of an actual KGB double agent was fantastic reading. An insightful glimpse into West vs. East espionage during the Cold War. Kept me on the edge of my seat during the interrogation and escape. Great read!",
    "post_time": "Reviewed in the United States on March 29, 2019",
    "pid": "1101904216"
},
{
    "title": "Better than Fiction",
    "rating": "5.0 out of 5 stars",
    "content": "Of the five Ben Macintyre true stories I've read, Spy and The Traitor is the best, and even the best fiction thriller cannot capture the realism this book does. If this book helps to keep the horrors of Socialism/Communism and the Soviet Union and Russia alive in the minds of those who were too young to know about it maybe that system will be less likely to ever re-emerge, although it would appear that Putin would like to have it all back. Deepest bows to MI6 and MI5 for their remarkable, dedicated work and continuing loyalty to Oleg Gordievsky, the KGB spy at the center of this who hated the evils of Communistic Russia and risked everything to help end it and was in fact pivotal in its demise. Don't miss this book. Note: Don't review the second set of photos/captions before finishing the book as they contain spoilers.",
    "post_time": "Reviewed in the United States on June 22, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I could not put this book down.  It is the true story of a rising star in the Russian KGB who became disenchanted with communism and methodically, planfully became a British spy who persevered, and survived, over decades.  He lived a double life and narrowly evaded detection and death numerous times.  The cloak and dagger machinations on both Russian and British sides are worthy of a John Le Carre or Ian Fleming novel.  The extraordinary courage of the hero is admirable, and insights into his thought processes are fascinating, as his deeply held principles guide him to make profound personal sacrifices for a greater ideal.  This true story gives us a fascinating glimpse into the world of espionage of which we are mostly unaware, but which can have enormous impact on our lives.  I highly recommend this book.",
    "post_time": "Reviewed in the United States on May 11, 2020",
    "pid": "1101904216"
},
{
    "title": "The Best Spy Book",
    "rating": "5.0 out of 5 stars",
    "content": "Outstanding! Very well written and I would recommend this book to anyone with a desire to learn more concerning Russia and the KGB! My hat is off to Ben McIntyre for compiling a truly historical review!",
    "post_time": "Reviewed in the United States on May 8, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I don’t often read spy stories or novels, but I was intrigued when I came across this book so I took a chance on it. I thought Macintyre did a fantastic job of conveying the story of a remarkable spy whose information and analysis during the Cold War hastened its end and literally shaped the world we live in today. The story of the exfiltration effort had me glued to the book and unable to put it down.",
    "post_time": "Reviewed in the United States on July 31, 2021",
    "pid": "1101904216"
},
]