[
{
    "name": "  Come Sundown: A Novel ",
    "stars": [
        "70%",
        "20%",
        "6%",
        "2%",
        "2%"
    ],
    "pid": "1250873800",
    "ratings": "28,638 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Too much dialogue",
    "rating": "3.0 out of 5 stars",
    "content": "My first Nora Roberts book and although it was OK,  I skipped several pages towards the end. In my opinion it was too much conversation between characters and a little boring.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Well developed characters, descriptive landscape; this is about family and love with drama and a crime element woven in. Ready for a sequel! Well done!",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "1250873800"
},
{
    "title": "A very good story",
    "rating": "3.0 out of 5 stars",
    "content": "Nothing unexpected. Ideal family, challenges they overcome as a family, etc.  I wanted a light read and that's what I got.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this story by Nora Roberts. The characters come alive and their interactions with one another are were at times humorous despite the severity of their situation. Highly recommend this book!",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "1250873800"
},
{
    "title": "Nice light read",
    "rating": "5.0 out of 5 stars",
    "content": "I truly enjoyed this book and couldnt wait to see what was gonna happen next.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this book! Had a different setting than a lot of Nora Roberts books.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "1250873800"
},
{
    "title": "Nora Roberts at her best!",
    "rating": "3.0 out of 5 stars",
    "content": "Too much detail about relationships I actually only read a few paragraphs in the boring chapters and skipped to the action scenes. Too Much romance for me.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is one of the best books I've read lately.  Definitely written for a mature audience,  but a really good story.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "1250873800"
},
{
    "title": "Come Sundown",
    "rating": "2.0 out of 5 stars",
    "content": "*sigh*",
    "post_time": "Reviewed in the United States on June 7, 2017",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a Nora Roberts, so of course I bought and read it—or tried to. Many people I’m sure do the same, and that’s why Roberts can afford to toss out this kind of crap. Brand recognition is priceless in marketing.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "1250873800"
},
{
    "title": "Maybe the old Nora IS still writing ...",
    "rating": "4.0 out of 5 stars",
    "content": "I own every single Nora Roberts and J.D. Robb book - I've been a loyal fan since her very first Harlequin romance.",
    "post_time": "Reviewed in the United States on June 15, 2017",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "That said, I've been pretty irritated over the last couple of years, because it has seemed to me that she's just gotten lazy, and worse, has been taking her readers for granted - ESPECIALLY with her most recent Cousins O'Dwyer and Guardian trilogies.  Wait - I DON'T own every one of her books, because I refused to buy books two and three of the Guardian set, since I'd already \"read\" them before, just with different titles..  She didn't even bother to tweak the plots for these books - they were just rewrites of the Stars of Mithra and Key trilogies.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "1250873800"
},
{
    "title": "Nora never disappoints",
    "rating": "5.0 out of 5 stars",
    "content": "However, I really really loved last year's The Obsession (5+ stars), and I disagree with the negative reviews of Come Sundown that compare it to Montana Sky.  I read Montana Sky when it first came out years ago and several times since, and it's just not as strong a book.  Come Sundown is set in the same state, and since it's in Montana of course it's on a ranch - but to me everything about this book is just better.  Roberts did a good job of fleshing out the characters, building the settings, secondary characters, and plot. Alice's story was agonizing to read - and it should have been.  In fact, my only quarrel and the reason for 4 stars instead of 5 is that Alice isn't angry - based on her character's early temperament, and her horrible horrible losses, I think fury might be the only healthy response.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In a way, all of Nora's books are going to be predictable.  Don't we read them because we know there'll be an HEA?  I love Bodine's family - love that they are strong and successful and not disfunctional because of their family ties.  I love that Cal's family are such healthy survivors of trouble.  I really hope that Nora will continue to focus on the new, and stop re-writing the old.  Meeting a release schedule is no reason to write a weak book - if her font of imagination can't come up with something that isn't a re-write, I strongly suggest she just consider changing the schedule.",
    "post_time": "Reviewed in the United States on March 24, 2024",
    "pid": "1250873800"
},
{
    "title": "Nora doesn’t disappoint!",
    "rating": "3.0 out of 5 stars",
    "content": "I just took a lovely break in Big Sky Country. I've always enjoyed this author and I still do. This story is about love - familial and romantic.",
    "post_time": "Reviewed in the United States on March 8, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Wow! Such a good story. Kept me reading late at night for weeks!",
    "post_time": "Reviewed in the United States on April 3, 2023",
    "pid": "1250873800"
},
{
    "title": "Tangled Mysteries and Deepened Secrets",
    "rating": "5.0 out of 5 stars",
    "content": "I need seven more words to post… sigh 😔",
    "post_time": "Reviewed in the United States on April 24, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nora Roberts excels in the art of catching ahold of the reader and taking you on journeys of mystery, love, murder, and secrets that are proven better left unaddressed. The book unravels the past as Nora Roberts continues to do with the reader. Immersing you within unraveled confusions and stories that involve characters and danger. This is a book that is like a woven web.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "1250873800"
},
{
    "title": "Wasn't what I expected...",
    "rating": "5.0 out of 5 stars",
    "content": "-Mordestia M York, Author of The Art of Poetry",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I usually love Nora Roberts. Even if I don't love one of her books, I usually like them. I'm crazy about J.D. Robb, and those are some really violent books sometimes. This one just hit me wrong. The backstory on the kidnapping, rape, and torture of the aunt just sickened me. I could barely stand to read those chapters that covered the past. I will finish this, even though I'm finding it difficult to keep reading. Nora Roberts does craft amazing stories. I'm just finding it really hard to stick with this one, and I'm afraid I will never read it a second time. I can not recommend this one to anybody. I'm on day three, and not even halfway through on a book I would normally finish in two days...",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "1250873800"
},
{
    "title": "I loved this book!",
    "rating": "5.0 out of 5 stars",
    "content": "So far I have never read a Nora Roberts I didn't enjoy, but this one is the cream de la creme. I'm not much of a western fan, however, between the setting, the spicy-deep-rich characters, and the story line I loved this one.",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It takes a little reading to get in to the characters in this book. But Nora Roberts has never disappointed me before ~ so, I reading on!",
    "post_time": "Reviewed in the United States on June 7, 2024",
    "pid": "1250873800"
},
{
    "title": "Good Author",
    "rating": "5.0 out of 5 stars",
    "content": "Yellowstone and Sparks?  A chillingly amazing love story packed with suspense, cowboys, and villains in a family-centered drama with a captivating finale. Couldn't put it down.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Didn’t think it was up to authors standards. Not my favorite of hers.",
    "post_time": "Reviewed in the United States on February 7, 2024",
    "pid": "1250873800"
},
{
    "title": "Love story suspense",
    "rating": "5.0 out of 5 stars",
    "content": "Deeper, darker,western and fabulous. Nora Roberts has been my favorite novelist for years but boy did she kick it up a notch this time. It started out so dark that I was a bit worried. But the engaging and endearing characters that I so love her for soon emerged with just a tad more edge to them.",
    "post_time": "Reviewed in the United States on February 27, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "  Thank you for an excellent adventure!",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "1250873800"
},
{
    "title": "Ok",
    "rating": "5.0 out of 5 stars",
    "content": "This book will keep you reading well into the night.  One of the best books I have read in years.  Nora Roberts never disappoints.  Just get the characters right in your mind at the beginning and then just enjoy the trip.  Great book - read it,you won’t regret it.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love her books",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "1250873800"
},
{
    "title": "Different but WOW!",
    "rating": "3.0 out of 5 stars",
    "content": "Great book",
    "post_time": "Reviewed in the United States on June 20, 2017",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been reading Ms. Roberts work for 20 years.  There will always be books that I like more than others.  This is in the others category.  I do not wish to spoil this for anyone else so I'll try not to give anything away.",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "1250873800"
},
{
    "title": "I'm enjoying the book, and happy that it arrived so quickly.",
    "rating": "5.0 out of 5 stars",
    "content": "No problems.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Typical Nora Roberts.  Suspenseful right to the end.",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "1250873800"
},
{
    "title": "An easy read.",
    "rating": "5.0 out of 5 stars",
    "content": "Only one downer wish we had had weddings and babies for all grannies that would have been wonderful thanks to great writer",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've read this book before, but its well worth the second go around.  It makes me want to travel to the big sky country state.  I've never been.  The parts about the scenery just seem to jump off the pages.",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "1250873800"
},
{
    "title": "A great Book",
    "rating": "5.0 out of 5 stars",
    "content": "Nora Roberts is always a good read. I just couldn't put this book down until it was finished. Well done Nora.",
    "post_time": "Reviewed in the United States on May 5, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nora Roberts transports you to whatever location she picks and this book was no exception.  The romance is believable, the suspense is heartstopping and  the emotions are so much more that I cried.  This is one of her best works by far.",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "1250873800"
},
{
    "title": "Kept you guessing.",
    "rating": "5.0 out of 5 stars",
    "content": "Omg!!! Nora!! I've been reading your novels for years and don't know how i missed this one!!!! So fantastic!! I literally had to take breaks from the intensity of this one. Had to put it down sometimes for an hour or so to get ready for the rest of it!!! Hands down....1 of my top 10 favorite novels that I've ever read!! Re introduce this one!! Publish it again!!! My heart was rocking through the whole book!! And your character Esther/Alice!! Wooooowwww!! Great job Nora!!",
    "post_time": "Reviewed in the United States on November 13, 2023",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I had to put this book down.  The characters were not what I expected.  It was too disturbing for me.  I can't even recommend it to anyone.  I wish I could have liked it because I like Nora Roberts for the most part.  I have read her for years.  I will try another one of her newer books and see what happens.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "1250873800"
},
{
    "title": "Riveting",
    "rating": "5.0 out of 5 stars",
    "content": "Great romance with intriguing mystery, great scenery detail . Puts you right in the spot.I never guessed the villain until he was revealed .",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "It's a compliment to Nora Roberts that I'm convinced she didn't actually write this story.  It's hard for a story be both disturbing and boring at the same time, but this one was.  It started off being a compelling horror mystery with an interesting, atypical character in Alice, but, when the story shifted to present day, all that premise was quickly buried under the routine minutiae of daily life in an overly perfect family.  Yawn.  I couldn't even bring myself to give a second star for Alice and the horse, Sundown, who were the only interesting characters.",
    "post_time": "Reviewed in the United States on July 6, 2017",
    "pid": "1250873800"
},
{
    "title": "Typical NR offering",
    "rating": "4.0 out of 5 stars",
    "content": "I find it incredible the number of people who claim to love Nora Roberts then come here to trash her. Is there some sort of weird satisfaction or thrill in that?",
    "post_time": "Reviewed in the United States on August 14, 2019",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Anyway, this is typical NR. Yes, it’s formulaic. Yes, it’s been tread before. But I like the formula, or I wouldn’t keep buying the books. It’s just how she does things. Accept it or move on.",
    "post_time": "Reviewed in the United States on June 1, 2017",
    "pid": "1250873800"
},
{
    "title": "It doesn't quite work",
    "rating": "5.0 out of 5 stars",
    "content": "And I kinda like that NR dusts off a theme and goes at it from a slightly different angle. It almost always ends up being better than the original. I like and appreciate the people she creates, the witty and pretty realistic dialogue, the pictures she paints with words. The detail of the settings.",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If this one reminds you of Montana Sky I can say yes, it’s set in Montana on a ranch. The similarities end there for me. I truly enjoyed the ride this time - I didn’t actually love Montana Sky tbh.",
    "post_time": "Reviewed in the United States on March 18, 2024",
    "pid": "1250873800"
},
{
    "title": "Roberts is one the best writers I have ever read.",
    "rating": "5.0 out of 5 stars",
    "content": "My only quibble with this one is that (SPOILER, I guess?) I knew immediately who and what and why because his name was like a big, giant, flashing neon arrow pointing down on his head. She might as well have named him He Did It. Otherwise, it’s money well spent and a book that I will read again.",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There's a classic -- and successful -- Nora Roberts romantic suspense formula. A strong, capable woman with a difficult past falls in love with an interesting man and must overcome the obstacles created by her past so that she can have a lasting relationship with him and a satisfying life. Some of those obstacles are psychological; others are, shall we say, practical problems -- like someone threatening her. Or him. Or both of them. The story takes place in an appealing location, usually a tight-knit community of some sort, where at least some of the characters have unusual and interesting occupations. And an animal -- usually a dog -- plays a significant role in the characters' lives.",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "1250873800"
},
{
    "title": "Great Book",
    "rating": "5.0 out of 5 stars",
    "content": "This time, Roberts has modified the formula. There's a woman who falls in love. There's a woman with a difficult past. But they're not the same woman. And that makes a difference.",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The woman with the difficult past (in this case, an absolutely harrowing past) does not fully recover from it (and it wouldn't have been realistic if she did). The woman who falls in love doesn't have huge issues in her life, and there are no major obstacles to her romance except for the expected episode of physical danger toward the end of the story. Roberts even throws in a second couple (perhaps because she realized that the first couple wasn't particularly interesting?), but they don't have any huge obstacles in their way, either. And it all doesn't quite add up.",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "1250873800"
},
{
    "title": "Outstanding story",
    "rating": "5.0 out of 5 stars",
    "content": "The appealing location -- a ranch/resort in Montana -- is there. The tight-knit community -- a large, close family that runs the ranch/resort and their employees -- is there. The interesting occupations -- a combination of cowboys and hotel managers -- are there. There's even an animal -- a memorable horse. The story is interesting, but it's not as compelling as most of Roberts' recent books, and I think it's because there are two central characters rather than one, and we never become fully invested in either of them.",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great read, as usual for Nora Roberts! I will re- read this one as I have the others.",
    "post_time": "Reviewed in the United States on February 27, 2024",
    "pid": "1250873800"
},
{
    "title": "Great read",
    "rating": "5.0 out of 5 stars",
    "content": "Nora Roberts does it again! Great storyline, keeps you going right up to the surprise ending! Couldn't put it down!",
    "post_time": "Reviewed in the United States on March 25, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nora Roberts doesn't need me to review her books here, nor to defend her against negative reviews here, but after reading some of the comments here, wanted to chime in. I loved this book, which I preordered automatically. I always preorder and read the \"big Nora\" every spring. Always enjoy them, some more than others. I don't usually get her \"trilogy\" stories, or haven't in many years, but I've read most of her work. This is a solid big Nora with its strong sense of place, well-drawn secondary characters and real-feeling family dynamics. I am also a big audiobook consumer, and often switch between listening while walking or cooking and reading on kindle. I seldom do the audio for Nora Roberts because I usually devour in a single day or two. In this instance my schedule sort of required the audiobook and it really worked for me for this book. Mainly because there's a key character who is introduced about a third of the way into the story whose behavior, understanding and conversation is very childlike and repetitive. Had I been reading, I would have for sure skimmed ahead, annoyed at the change to the expected snappy Nora dialogue. But the narrator does a superb job conveying the character 's challenges and I frequently had happy tears in my eyes as I rooted for this person as well as for the main and secondary love stories. This is somewhat darker storyline for a big Nora, but it really worked for me.",
    "post_time": "Reviewed in the United States on June 7, 2017",
    "pid": "1250873800"
},
{
    "title": "Great \"big Nora\" consider the audiobook for this one",
    "rating": "5.0 out of 5 stars",
    "content": "I love reading mystery novels by Nora Robert's because she keeps you in suspense all the way through the novel. Just when you think you know who the protagonist is, she turns and twists things around.",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This story was researched and well written. Some of the scenes were difficult to read  but well written and necessary to the plot. It's a story of two women . The first woman's story starts before the second is born. The first has a tragic life. The second with love and security in the heart of a loving family. A family that stands together in good times and bad.  That care for the people they love and the community of people who work for them at their resort and the people who come there as guests. This to me is the heart of the story. As the story unfolds you can feel the way the family stays strong thru good times and bad.sometimes I wondered if things would end the way I wanted and in the end the the characters I had come to care about had a happy ending and the evil ones got what they deserved.",
    "post_time": "Reviewed in the United States on September 8, 2021",
    "pid": "1250873800"
},
{
    "title": "Mystery Novels by Nora Roberts",
    "rating": "5.0 out of 5 stars",
    "content": "I thoroughly enjoyed reading this and I hope you will too.",
    "post_time": "Reviewed in the United States on September 7, 2023",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Every time I open a Nora Roberts novel I am transported to each place she writes about.  After reading this last book an getting so caught up in her characters.  I realized that I have tears in my eyes for every good or bad thing that happens.  Its one thing for a person to say she brings me to tears, another to actually feel what she must feel while she is writing.  I can't wait for her next book!!!",
    "post_time": "Reviewed in the United States on August 3, 2017",
    "pid": "1250873800"
},
{
    "title": "I would give more than  five stars if I could",
    "rating": "5.0 out of 5 stars",
    "content": "I read to escape.  Romance and mystery are usually reliable books to lose my self and the world's' problems.",
    "post_time": "Reviewed in the United States on January 26, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought the book bc I thought that Nora Roberts is a wonderful author.  I have not read her books for a few years mostly bc they cost more than other authors but I decided to splurge.  I am truly sorry that I broke down and bought it.",
    "post_time": "Reviewed in the United States on March 14, 2024",
    "pid": "1250873800"
},
{
    "title": "In awe",
    "rating": "5.0 out of 5 stars",
    "content": "I HATE graphic violence and there is plenty of it.  Every few chapters the book describes the rape, torture and imprisonment of the main character\"s aunt.  Over and over, repeatedly the same.  Birth, stolen babies, dying babies, mental torture are basically the complete chapter.",
    "post_time": "Reviewed in the United States on March 27, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I was also annoyed with the storyline bc I felt that the author had read People magazine and used recent stories of real life victims for the kidnapped chapters.  I could almost pick out which victim's description was used in each scene.",
    "post_time": "Reviewed in the United States on December 13, 2017",
    "pid": "1250873800"
},
{
    "title": "Romance Mystery",
    "rating": "5.0 out of 5 stars",
    "content": "Great Read, I could hardly put it down!  Wonderful family that had suffered many losses, but had persevered! Great characters, that made the community come to life.",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I don't usually bother writing a review unless I think it might save people some time, trouble, or money. So here I am. The short version of this review is: save your time and your money. If you must read it, go to the library, because you're likely to regret spending this much money on it, and because you're missing nothing by waiting.",
    "post_time": "Reviewed in the United States on June 9, 2017",
    "pid": "1250873800"
},
{
    "title": "Not a keeper. Use the library.",
    "rating": "5.0 out of 5 stars",
    "content": "This book does not even start to get interesting until about the halfway mark. Only because it is a Nora Roberts book did I even attempt to get through it. Any other author I would have walked away long before the middle of the book.  (I used to be a *huge* fan. Recently, I've been pretty disappointed, but I still gave this book the benefit of the doubt.) At the midpoint it ticked up just enough to keep me reading, but it never actually got \"good.\"",
    "post_time": "Reviewed in the United States on March 22, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This story is dark. Alice's storyline is like something you'd read in one of her JD Robb books - and if you don't like dark, then you probably won't like this at all - in my opinion, Alice's storyline is the best part of this book.",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "1250873800"
},
{
    "title": "Excellent book",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, I'd describe this book as \"flat.\"  The plot is predictable; the characters are two-dimensional, the chemistry is peanut butter and jelly - they go together just fine, but it's all very predictable and everyday.  The horse has more personality than most of the people - and more sense too. How much brain power does it take not to go out and pick a fight with someone who tried to kill you?  It might be one thing if they'd happened to run into him, but no - these geniuses tracked down a guy who had been arrested for the attempted murder of one of them, so that they could further provoke and inflame the situation, and not one out of the six of them ever said \"this is probably a bad idea.\"",
    "post_time": "Reviewed in the United States on April 10, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "But more than the issues with plot and character, this book is an example of what's happened with NR books in general lately - lazy writing. They all sound the same.  New books are nothing more than a new façade on old books. Retreads. Characters use the same phrases, have the same patterns of speech. ( Like some other reviewers, if I hear \"she wanted the ____ \" one more time...)",
    "post_time": "Reviewed in the United States on May 30, 2017",
    "pid": "1250873800"
},
{
    "title": "Not bad but definitely not my favorite.",
    "rating": "5.0 out of 5 stars",
    "content": "Seriously, use your local library - this one's not a keeper.",
    "post_time": "Reviewed in the United States on June 25, 2017",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "One of the best Nora Roberts book I’ve ever read.",
    "post_time": "Reviewed in the United States on October 3, 2017",
    "pid": "1250873800"
},
{
    "title": "Nora Roberts my favorite author:)",
    "rating": "5.0 out of 5 stars",
    "content": "It took way too long to get the story going. Full of “fill” parts were good but this book was no her best",
    "post_time": "Reviewed in the United States on April 1, 2023",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Excellent read:)",
    "post_time": "Reviewed in the United States on May 19, 2023",
    "pid": "1250873800"
},
{
    "title": "Triggering content",
    "rating": "3.0 out of 5 stars",
    "content": "I’m shocked the reviews her mention this as being a vacation read. It starts right out with a woman being kidnapped. Then it goes on to blithely and endlessly describe every outfit and cowboy hat on every family member in the west. Back to tortured imprisoned girl. Hard to read and slow to get into a point of the story. Might’ve helped to know any of the family’s thoughts about the missing girl instead of learning what color their shoes and vest and mustache are.  The hostage content is immensely upsetting. The other 8 million characters are tedious to have to keep reading descriptions of.",
    "post_time": "Reviewed in the United States on September 4, 2023",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I grew up on a ranch in Montana and I loved the characters and ranch setting. Wonderful read.",
    "post_time": "Reviewed in the United States on February 23, 2024",
    "pid": "1250873800"
},
{
    "title": "Authentic and accurate Montana setting and characters.",
    "rating": "4.0 out of 5 stars",
    "content": "Somehow I missed this one when it first came out, but now it’s one that I can see myself reading again.  A great read and another one knocked out of the park for Nora Roberts!",
    "post_time": "Reviewed in the United States on July 2, 2023",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The most interesting character in this book is Alice.  Her story was gripping.  The \"present day\" story did not fall under the heading of \"interesting\" until Alice was found and even then it was interesting only in the parts containing Alice.  I knew \"Easy\" was \"Sir's\" son when I first met him.  It was too easy.  Sorry.  And I felt like with Cal and Bodine, I was revisiting a mixture of other Roberts' characters.  And as one other reviewer pointed out, there are pet phrases Roberts uses that I wish she would change.  Or at least it \"seems like\".",
    "post_time": "Reviewed in the United States on June 3, 2017",
    "pid": "1250873800"
},
{
    "title": "A good one",
    "rating": "5.0 out of 5 stars",
    "content": "I often feel let down by the endings of Roberts' novels.  Often, very often, she tells a solid story (not necessarily in this case)  and then she hurries to finish it.  It's like she's done and she wants to shut it down and move on.  I don't believe for one minute that Bodine would have freed herself as quickly or that she would have escaped unharmed.  It was just wrapped up a little too quick and easily.  Ruined the momentum of the entire story - what there was of it.  After waiting for this publication I was disappointed.  Perhaps part of the blame is that with Kindle I am reading so many authors who have really been pulling me into their stories; writers I would not have purchased a hardcover from.  But I have read so many better stories recently with more developed characters than what is in this book.  Really not up to Roberts' standard.  And the bad news is, Come Sundown is now not up to mine.",
    "post_time": "Reviewed in the United States on January 1, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is really easy to sink into and become a part of the Bodine family. I was smitten with many of the characters. Really didn't want it to end.",
    "post_time": "Reviewed in the United States on February 9, 2024",
    "pid": "1250873800"
},
{
    "title": "Where has Nora gone?",
    "rating": "5.0 out of 5 stars",
    "content": "Nora Robert's never disappoints.  You don't want to put the book down!",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I listen to books in the car so traffic never bothers me.  Nora Roberts all always well written and well read.",
    "post_time": "Reviewed in the United States on February 28, 2024",
    "pid": "1250873800"
},
{
    "title": "A really great read.",
    "rating": "5.0 out of 5 stars",
    "content": "The book arrived in a timely manner and in excellent condition.",
    "post_time": "Reviewed in the United States on December 7, 2023",
    "pid": "1250873800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have never read a boring book by Nora Roberts! Sundown joins her other novels as entertaining, engaging and fun to read. I highly recommend this book by this wonderful writer!",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "1250873800"
},
]