[
{
    "name": "  Home Front: A Novel ",
    "stars": [
        "71%",
        "21%",
        "5%",
        "1%",
        "1%"
    ],
    "pid": "1250858232",
    "ratings": "43,312 ratings",
    "other_info": {},
    "discount_price": "$ 12.40",
    "normal_price": "$17.99",
    "about_this_item": []
},
{
    "title": "Couldn’t put it down!",
    "rating": "5.0 out of 5 stars",
    "content": "Read in one day. Interesting, captivating and emotional, totally engaging. Reality in its finest. Kristin Hannah is an exceptional writer.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was remarkable, I read it in two days. Your books are written so well,Kristin. I feel like I know these people and they have become part of my life. You write with such strong emotion, and I am grateful for your books.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "1250858232"
},
{
    "title": "Stunning",
    "rating": "4.0 out of 5 stars",
    "content": "REVIEWED BY SUNNY",
    "post_time": "Reviewed in the United States on May 1, 2013",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "HOME FRONT starts by giving us a look back at how Jolene Zarkades grew up, so we can understand who she becomes. This important glimpse into the heroine's early life provides a meaningful backstory that was critical for the development of this main character. Most of the story revolves around the evolution of Jolene and those that fill her life. She is married to Michael, has two daughters, Betsy (12) and Lulu (4), and a best friend, Tami. She is a wife, a mother, and a dutiful helicopter pilot for the Army National Guard. Kristin Hannah weaves these people and these roles into a beautiful story about a family just trying to survive all that life throws their way.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "1250858232"
},
{
    "title": "A great read that will stick with me!",
    "rating": "5.0 out of 5 stars",
    "content": "It took me some time to get into this book. I was frustrated with the pace of the story at first. What I understood later was the importance of all the early events. They created the full picture of how the characters were in pre-deployment life, and how it was different for them post-deployment. The news of Jolene being deployed is when this story really started picking up. Imagine being pretty much a full-time mother, then getting the directive to start putting your affairs in order. Hannah did such a beautiful job of writing Jolene's transition. She began writing things down to prepare her husband for the day to day, and more importantly, preparing her family for life without her. As a woman helicopter pilot, she told those she loved that she wouldn't be in harm's way, yet she created beautiful videos for her daughters, just in case leaving was her final goodbye. I was emotionally touched by the circumstances and suddenly overwhelmed that soldiers across the country are preparing their own videos every day and saying goodbyes to protect our freedoms.",
    "post_time": "Reviewed in the United States on February 13, 2012",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Things were difficult for everyone once Jolene left. Everyone was just trying to survive the circumstances and all of the new challenges at war and at home. This was when another special transition in the book occurred. Jolene protects her family from the truth while documenting actual events of war in a personal journal. A subplot for Michael has him defending a soldier, which provides him with clarity of Jolene's situation. This allows his character to develop into who he needs to be to support his post-deployment family.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "1250858232"
},
{
    "title": "So real ;-)",
    "rating": "4.0 out of 5 stars",
    "content": "All characters grow substantially in HOME FRONT. Oddly, I felt like and dislike for pretty much every character in the book at one time or another. At times, I was frustrated by the selfishness, the naiveté, the cowardice. Then I would be shockingly reminded of the reasons for those actions/feelings. Kristin Hannah plots out her storylines and characters well to weave a special story. The post-deployment life of the Zarkades family is another challenge that is beautifully written. How this family comes back together and starts healing is wonderful.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I can't say that I have much personal experience with this storyline as none of my close family or friends have ever gone to war. This book was truly an eye opener for me, and even though I had the utmost respect for our soldiers before, I had no idea what going to war was like. After getting a look into the life of a frontline soldier, it made me appreciate even more all who have fought for our freedoms. I am ashamed to say I wouldn't have the strength it must take to do what so many soldiers have. I am thankful to have read HOME FRONT to gain a better understanding of a soldier's sacrifice as well as the sacrifices of the family left behind. This story will stick with me for a long time!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "1250858232"
},
{
    "title": "Home Front by Kristin Hannah",
    "rating": "5.0 out of 5 stars",
    "content": "BOTTOM LINE",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is a slow starter, but if you are willing to put in a little time upfront to gain a better understanding of the impacts of war on a struggling family, you would enjoy this book. If you are interested in learning more about the life of a soldier, HOME FRONT portrays it well.",
    "post_time": "Reviewed in the United States on October 15, 2024",
    "pid": "1250858232"
},
{
    "title": "Brought me back 19 years",
    "rating": "5.0 out of 5 stars",
    "content": "I read a lot. A book or two a week. This is the first book review I’ve ever written. In 2005 my husband deployed to Iraq leaving me and our two children 5 and 8 for 15 months. I’m a teacher, structured and organized,  much like Jolene early in the book. I was sure that we’d get through it without a hitch. Boy was I wrong.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book brought me right back. I’m a huge Kristin Hanna fan but I was reluctant to read this book. She’s a master story teller and this book brought me back to many of my feeling and memories that I have somehow managed to suppress. The characters are so believable and the way she shifts perspectives creates a picture of how deployments affect each member of the family. She shows us how hard each of the roles is but that the easiest way through it is together. Well done Ms. Hanna.",
    "post_time": "Reviewed in the United States on October 15, 2024",
    "pid": "1250858232"
},
{
    "title": "A MUST READ!",
    "rating": "4.0 out of 5 stars",
    "content": "You will laugh, cry, and be mad all of the same time. Great book! Kristin Hannah knows how to put you in her character’s world.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love and appreciate KH’s books for what I learn and feel when reading them. I’ve rated others of hers a 5. This one has the same value for me of helping me understand more than I did. I gave it a 4 of 5 because some of in between lines and threads felt a bit expected or maybe trite, whereas other books of hers did not. Wonderful regardless— Thank you.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "1250858232"
},
{
    "title": "another wonderful Kristen Hannah book",
    "rating": "5.0 out of 5 stars",
    "content": "I probably picked a bad time to read this book. My son will be deploying to Iraq and Syria soon. He came home from Afghanistan several years ago with PTSD. But what a beautifully written novel that addresses the reality of PTSD and wounded warriors and the effects on both them and those who love them.",
    "post_time": "Reviewed in the United States on October 15, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Such a great store that makes you feel all the emotions! Will definitely be reading other books by this author",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "1250858232"
},
{
    "title": "Hard to Read for Personal Reasons",
    "rating": "5.0 out of 5 stars",
    "content": "This is probably one of the best books I have read in a while and touches upon a very real issue with our returning military personnel.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My wish is for this to be read by many so more people can be aware and help others be aware.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "1250858232"
},
{
    "title": "Great Read!",
    "rating": "5.0 out of 5 stars",
    "content": "I have never been so moved by a book. The depth of the main character is amazing!  Watching Jolene and her husband deal with her  devastating injury and the agonizing recovery became real to me. As the wife of a military veteran I identified with the difficulties of her children adapting to the new reality. Kristin Hannah, thank you!",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This has to be one of my favorite Kristin Hannah books. Intense and beautifully written book, it gave me an insight to women in the military and the battles of PTSD with our soldiers",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "1250858232"
},
{
    "title": "heartbreaking and heartwarming",
    "rating": "5.0 out of 5 stars",
    "content": "An incredible story that had me in tears a lot. Of sadness and of joy. Gives one a small part of what are hero’s did for the greater good",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A good read for couples who have allowed their careers to become their primary focus and left partner and children in secondary or tertiary positions. Good descriptions of our tendencies to blame others for what we have failed to resolve within ourselves.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "1250858232"
},
{
    "title": "Life, Loss, and Love",
    "rating": "5.0 out of 5 stars",
    "content": "Kristin Hannah never fails to write a great story.  It speaks to our souls .  It brings tears.  Iraq was different the same as Viet Nam was different.  We need to face these wars not hide their effect on our soldiers.  Well done.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love love love Ms Hannah’s books.  This one takes you on a harrowing adventure I would never have the kahonies for.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "1250858232"
},
{
    "title": "The Real Story",
    "rating": "5.0 out of 5 stars",
    "content": "It was hard to put down this book. Even though the tears fell. The love of family and friends brought her back.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Have the tissues close by.  This book is hard to read , once you start you can't stop. It grips you from the start.  I love  her books,her detail and insight.  this story needed to be told.  Its a beautiful book that will stay with you for a long time",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "1250858232"
},
{
    "title": "What a powerful story",
    "rating": "5.0 out of 5 stars",
    "content": "So powerfully written, so glad that it was based on female soldiers!  Long, detailed with things we have no idea about what our soldiers carry!",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have read a great many books but this one was one I will not forget.  Healing came to me along with hope. Please read it’s definitely the best",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "1250858232"
},
{
    "title": "heartbreaking story but with a hopeful message",
    "rating": "5.0 out of 5 stars",
    "content": "This book deserves a medal for its authenticity. I’m from a military background and it really touched me. Excellently written.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I certainly would recommend this book. Read it in a matter of hours,  could not put it down. Will read more of Kristin Hannah’s novels.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "1250858232"
},
{
    "title": "PTSD is so misunderstood",
    "rating": "5.0 out of 5 stars",
    "content": "Made me think of my dad in the Korean War and WWII and my brother and friends in Vietnam. How War has maimed us from the inside out. I love her story telling. What wonderful pictures they paint.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book. Made me reevaluate a family member’s PTSD and my relationship with my best friend who I also lost way too soon",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "1250858232"
},
{
    "title": "wonderful read",
    "rating": "4.0 out of 5 stars",
    "content": "We take so much for granted.  If you know or have anyone close to you who has served, is serving or going to serve show them gratitude.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kristin Hannah is a great writer you can’t fault her for not doing her research. Her ability to capture the essence of military life is uncanny. Her grasp of PTSD is heartbreaking. I highly recommend this book to anyone with family in the military dealing with this problem. She is truly an inspiring author.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "1250858232"
},
{
    "title": "Sacrifices",
    "rating": "4.0 out of 5 stars",
    "content": "Very well written.  Not sappy or beyond belief.  She hits every struggle, every emotion squarely and without a buffer for the reader.  It makes you hurt, cry, laugh, and feel love.  Well done Ms. Hannah.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A lovely story about love sadness family and loss  how determined one person can be in the face of danger and  I laughed and cried with these characters",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "1250858232"
},
{
    "title": "great story",
    "rating": "5.0 out of 5 stars",
    "content": "Amazing war/life book based in the Iraq war.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is about love, women power, friendship, loyalty, family and pain. Amazing!",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "1250858232"
},
{
    "title": "pleasant surprise",
    "rating": "5.0 out of 5 stars",
    "content": "I really thought The Women was the greatest Kristin Hannah book, but I think this one has it beat! I love how she makes the reader feel present in all her books.  I really felt like I too was on Jolene’s journey.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Heart wrenching! PTSD is real and something I've never experienced. It opened my eyes to the pain and heartache of war. Our leaders need to do more to help those returning from war. There is hope and healing.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "1250858232"
},
{
    "title": "I never cry in books, I did in this one!",
    "rating": "5.0 out of 5 stars",
    "content": "This was a lesson and how to accept radical changes in life. For anyone about anything.  The deepness of feeling, and the tenderness that she described will stay with me. Recommendation? To anyone has ever experienced pain, suffering or loss of love this is this book is a manual for survival.  Thank you, Kristin for sharing your heart and soul so eloquently!",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After reading The Women, I just had to read another Kristin Hannah book. I picked Home Front because it was included in Kindle Unlimited. This book is not historical like The Women, but I loved it oh so much!! A book about the trials and tribulations regarding military life. I even had a few “lightbulb moments” regarding my own husband who served in the Air Force. Give it a shot, you won’t be disappointed.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "1250858232"
},
{
    "title": "Another fantastic read!!",
    "rating": "5.0 out of 5 stars",
    "content": "More information about the losses in the military than I ever knew. Gut wrenching eye opener, worth your time, read it!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The story of individuals that are in our Nationzl Guard and how their service to our country can affect the people in their lives. Told so well you will swear you have lived next door to these characters. Keep a box of kleenex nearby for the second half of the book.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "1250858232"
},
{
    "title": "Sad but true",
    "rating": "5.0 out of 5 stars",
    "content": "An awesome moving book",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Such friendship, loss and love",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "1250858232"
},
{
    "title": "If you loved The Women you will love this book!",
    "rating": "5.0 out of 5 stars",
    "content": "Many lessons on life, strengths, family and forgiveness. And loyalty  Enjoy",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The author tells the story that so many of our service men and women experience and so many of the rest of us want to avoid. Her characters come to life and the book is almost impossible to put down. Excellent!",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "1250858232"
},
{
    "title": "a must read",
    "rating": "5.0 out of 5 stars",
    "content": "I didn't expect to basically finish this book in two settings. I didn't think I would get pulled into the story the way I did and I also didn't expect to cry as much as I did. This is just a phenomenal story and so worth the read.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book captured me immediately.  I felt like I was in the middle of the life of Jolene.  I rode every emotion that she experienced throughout the book.  You will, too.  I highly recommend this book.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "1250858232"
},
{
    "title": "A great story",
    "rating": "5.0 out of 5 stars",
    "content": "The book was as wonderful as her others books I have read. I couldn’t put it down.  As usual as always her books do, it helped to understand the difficulties faced by the characters.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Learning so much about what it took to leave your children and go to war was a big part of the story. PTSD was highlighted and the struggle to get back to your former self was heartbreaking. My emotions were a rollercoaster. All in all a page turner!",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "1250858232"
},
{
    "title": "I cried and cried, this book was so touching!",
    "rating": "5.0 out of 5 stars",
    "content": "I grew up a military brat. love of country and family were very important. This is such a good book about how military duty and family life often are at odds. Those who do not understand military life often do not see or realize how hard it can be to be true to both the military and your family. This book takes you on a journey of heartbreak and healing as the hero battles loss, struggles, and acceptance. This book is well written and the characters are well defined and real.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I believe this book would appeal to all who have lived the military life and those who like a good story.",
    "post_time": "Reviewed in the United States on July 29, 2023",
    "pid": "1250858232"
},
{
    "title": "Military and Civilian Lives",
    "rating": "5.0 out of 5 stars",
    "content": "The bond, closeness and absolute meeting of the souls that Jolene and Tami have had since they were 18 and the only women in their boot camp and at Fly school. These women flew Blackhawks they were warriors, their strength far more mighty and wiser than any man’s because she’s fought 10x harder to earn respect, recognition and the acceptance of the men she’s been training with and flying with in National Guard. Jolene, a mother of Betsy 12 and Lulu 4, lives right next door to her best friend and fellow fly girl, Tami who is a mother to Seth 12. These mothers are called to serve in Iraq shortly after 9/11. Their tour requires their service for 1 year. The atrocities, harrowing fear, unbelievable and undeniable bravery, fierce loyalty and love for the other 3 soldiers who fly with their on their missions is unwavering and inspiring. Kristin Hannah does an outstanding job of portraying the perils, graphic ugly terrifying haunting hellish moments a solidier is forced to endure every moment they are called for duty. While in Iraq these women were never safe were under fire from the minute they got off their plane and in their trailers where they sleep they are pummeled with explosions, live shelli by and while flying, these brave selfless angels if the skies are always exposed far more than any of their fellow soldiers on the ground- the author shows us the hell, the bone deep fear the soul crushing grief angst and despair that soldiers in war exposed to. Their anxiety is continuous and immense the fear of dying or a fellow soldier dying is all encompassing. These women prepared their family’s for their departure and how to cope without them. Yet bo one had told these women how to cope while there or when they got home. I very much loved this especially because women were the main characters and soldiers and flew Black Hawks fighting valiantly and far braver than any of us can ever imagine or do. The lack of resources and help for our vets, the very real PTSD most will have while coming back from war and they’re not given the very best and should have a myriad of resources and support not to mention to earn far more higher wages they give their lives, their mental health and sacrifice far more than the time spent in act duty- they give all of themselves to this country to our safety and freedom and they should be given an exorbitant amount of support money and respect than they ever receive. I appreciate that. Ms Hannah she’d a spotlight on these causes and very real issues that are affecting soldiers who’ve seen combat and hopefully they will be given these resources and recognition and rehabilitation for all their soldiers every need when they are back stateside. They certainly have earned that and far more.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Amazing read! From beginning to end, it held me in. Please take the time to read! It's an absolute must!",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "1250858232"
},
{
    "title": "A profound testament to the women soldiers in military",
    "rating": "3.0 out of 5 stars",
    "content": "This book gives a true portrayal of what veterans face upon their return home.  I laughed, cried profusely and learned so much in the process.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am a veteran myself. So it definitely intrigued me to read this story. Before this I read The women. Unfortunately, it left much to be desired. I struggled to form much connection to the characters. There was the constant show and not tell. “In no time” was used excessively at the end of the book. And I simply could not get over how obnoxious Betsy was. No emotional connection or understanding how this character was always seen as the victim and never reprimanded for her nasty attitude. Can’t imagine a women as strong as Jolene, who is also a soldier, allowing that kind of attitude in her home.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "1250858232"
},
{
    "title": "Amazing!",
    "rating": "5.0 out of 5 stars",
    "content": "I also realized this author used a lot of trauma dumping. It gets worse and worse and worse and then gets cleaned up within the last few chapters.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m sure this wasn’t very cohesive but I struggled to get through.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "1250858232"
},
{
    "title": "What a tear-jerker!",
    "rating": "5.0 out of 5 stars",
    "content": "This book was so heartwarming!  Not sure if I cried because I had a son previously deployed in Iraq, or it's just good writing. This book really shines a light on PTSD.  This is the second book I've read; both equally good.  Thanks for sharing!",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I learned so much about soldiers going off to war and its effect on loved ones . This is a story of family, friendship, love and tragedy. I cried so often, both because I was happy but also sad. A very memorable read. Loved it.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "1250858232"
},
{
    "title": "Another great book by Kristin",
    "rating": "5.0 out of 5 stars",
    "content": "Kristin Hannah has a magical way of telling a story that grabs your heart.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Home Front tells if best friends who are helicopter pilots in the Reserved.  They live next door to each other  They have children and fulfilling lives.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "1250858232"
},
{
    "title": "a winner",
    "rating": "5.0 out of 5 stars",
    "content": "Then they are called to active duty in Iraq.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What follows is the horror of war.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "1250858232"
},
{
    "title": "some of her best work",
    "rating": "5.0 out of 5 stars",
    "content": "One of the best books I’ve read in a long time. How she found a way to depict the love and dedication of motherhood, the love and hurt of marriage, the honor and dedication / devotion of military duty. KH has given me perspective and gratitude for the life and privilege we have.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had a hard time putting this book down. I cried and I laughed. Well worth the time!!! This is the second book I’ve read by this author. Love!!",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "1250858232"
},
{
    "title": "What a page turner!",
    "rating": "5.0 out of 5 stars",
    "content": "It is hard to read Kristin Hannah’s books and not be changed by them. Reading both “Home Front” and “The Women” helped me understand how difficult reentry is for returning veterans and medics. Reading “The Four Winds” helped me understand the Dustbowl and how four years of drought impacted so many lives. And reading “The Nightingale” helped me understand the many roles women played in fighting for peace during WWII. Most of all I learned to appreciate the author’s strong female protagonists who are forever forging their way and breaking barriers to survive. Love this author!",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a great book, definitely worth the read.  It will make you cry!  It will also help you understand what our military personnel go through after a deployment!",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "1250858232"
},
{
    "title": "the Real Truth of War",
    "rating": "5.0 out of 5 stars",
    "content": "Very intense, but a must read for a family facing a soldier with PTSD.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The characters were so genuine , the reader was drawn into their pain, grief, sorrows, frustrations.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "1250858232"
},
{
    "title": "Home Front: A novel about friendship and true live",
    "rating": "5.0 out of 5 stars",
    "content": "Real characters and so much emotion.  I felt like I was part of their story. I couldn’t put it down.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kristin Hannah can do no wrong! I felt every emotion reading Home Front. This was truly one  of the best.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "1250858232"
},
{
    "title": "Another amazing book",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book the story was so captivating. Well done",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It's One of the best books I have read.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "1250858232"
},
{
    "title": "Great story",
    "rating": "5.0 out of 5 stars",
    "content": "I went through so many emotions reading this book and it was so beautifully written. And the fact that there is a book of hers I would rate even higher than homefront says a lot (.The Nightingale). Hannah writes in a way where I feel like I’m there and can really empathize with the character. Michael pissed me off so much in the beginning that I almost launched my book across the room. But the character development he went through was so good well paced and made me kind of like him in the end.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book had a slow start but a great finish. The characters were well written and fleshed out. There was a point where I wanted to give up, but I’m glad I finished it.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "1250858232"
},
{
    "title": "I have yet to find a Kristin Hannah book I’d rank under 5 stars",
    "rating": "5.0 out of 5 stars",
    "content": "Great book as always. But boy you better have a box of Kleenex near by!  Very good war story with reality.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So realistic and honest feelings for veterans with PTSD and victims of war.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "1250858232"
},
{
    "title": "a soldiers",
    "rating": "4.0 out of 5 stars",
    "content": "Good tear jerking story of family and honor. It gives a good picture of PTSD. Be sure to have your box of Kleenex ready",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved both sides of this story. Far too often, the home front is a side thought. Thank you for sharing both sides of the stories. Showing people are human in a very raw way. True life!",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "1250858232"
},
{
    "title": "Amazing story!!",
    "rating": "4.0 out of 5 stars",
    "content": "Talks about a family and a vet who goes to the war.  Well written but difficult.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kristin Hannah does it again- the book is full and rich. The story sucked me in and would not let me go. A Ten",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "1250858232"
},
{
    "title": "Tough story",
    "rating": "5.0 out of 5 stars",
    "content": "Cudos on the research for this book.  I always find reading about issues and history ,even though fiction, is more enjoyable and enlightening.  I felt for these characters, so true in family interactions.  This was both a sad and happy ending.  I am sure many of the issues in this story should be discussed openly and our support for veterans must be unwavering.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Another great book by Kristin Hannah. I haven't read one yet that I didn't enjoy - even with the tears.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "1250858232"
},
{
    "title": "I could not put it down",
    "rating": "5.0 out of 5 stars",
    "content": "Great story, but heart wrenching. I haven’t cried at the end of a book like this in a long time",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a real tear jerker! War is hell. It is hell for the women and men fighting it and hell for the families of those serving. We need to do better for all of them.",
    "post_time": "Reviewed in the United States on June 5, 2024",
    "pid": "1250858232"
},
{
    "title": "Hard time putting it down",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed the book. The only thing that annoyed me was the author did not take the time to look up the actual name of the Topeka newspaper. It seems inconsequential but an easy enough find that it seemed unnecessary to make up the Topeka Gazette.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There were many times while reading this story that I thought, this is so depressing, but also great at the same time.  It so realistically portrayed the life of a soldier and most importantly, what happens to so many after serving in a war.",
    "post_time": "Reviewed in the United States on March 26, 2024",
    "pid": "1250858232"
},
{
    "title": "Excellent story of a wife/mother who is also a Blackhawk pilot who goes to the battle field.",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent read of a woman who loves her country and loves being a Blackhawk pilot. Loves her family and being a wife/mother.  Strives to balance and be the best at home and career.  A husband who doesn't understand her motivation and the military.  A realistic story line of a family coping with a parent leaving for the battle field. Only this time it is the wife/mother who goes. How miscommunication and feelings are affected.  How PTSD can and does tear apart a family apart. Joleen, the main character is a woman who struggles with her love of flying versus her love of family.  Her guilt of leaving her 2 young daughters.  I rated this a 5 Star as once I started reading I  could not put the book down.  The author did wonderful research on the military, making this story authentic and realistic.  First time reading this author and I will look forward to reading more of her books.",
    "post_time": "Reviewed in the United States on April 16, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Jolene is a Black Hawk helicopter pilot, who is married to Michael, a defense attorney. They have two daughters, 12 year-old Betsy and 4 year-old Lulu. Jolene is very dedicated to her family but is also dedicated to her role as a pilot. Her next door neighbor and best friend, Tami, is also a pilot. They trained together and fly together.",
    "post_time": "Reviewed in the United States on September 12, 2023",
    "pid": "1250858232"
},
{
    "title": "Hard Hitting",
    "rating": "5.0 out of 5 stars",
    "content": "Michael is anti war and doesn’t like his wife’s military job. He is dedicated to his job defending alleged criminals and leaves the bulk of the parenting and running of the house to Jolene. Michael has taken on the defense of Keith Keller a marine who was accused ok killing his wife.  Keith admitted to Michael that he committed the crime and couldn’t understand why Michael was defending him. Research showed that Keith had done two tours of Iraq and was suffering from PTSD, which became Michael’s defense.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "When Jolene and Tami are deployed to Iraq, Michael was angry that she had to be involved in a war he did not believe in. Their marriage appeared to be on the rocks, but in Jolene’s absence he had take on the role of full time parent, something he no experience in. As Michael struggled with his new role, Jolene was heavily involved in combat zones in Iraq. Michael was still working his PTSD defense case and gained a much better understanding of the effects of war on members of the military.",
    "post_time": "Reviewed in the United States on January 10, 2013",
    "pid": "1250858232"
},
{
    "title": "Wow, outstanding!",
    "rating": "5.0 out of 5 stars",
    "content": "Would Jolene return unscathed from her deployment? Will she return at all?",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The author pulls no punches in describing the effects of war and PTSD and also the effects it has on families of those affected. It will certainly give readers a greater understanding of the devastation it can have on military personnel and their families. It is recommended reading.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "1250858232"
},
{
    "title": "It's hard to come back home...",
    "rating": "5.0 out of 5 stars",
    "content": "I thought The Women was great, but this is right up next to it. It gives a great description of the true cost of war intertwined with individuals and their emotions, on the surface and in the mind. It’s a romance story and so much more. Having been a mentor for wounded and caregivers at WR and Bethesda NNMC, for 20 years, I totally endorse this wonderful book.",
    "post_time": "Reviewed in the United States on March 23, 2012",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Summary: Michael and Jolene's marriage is falling apart--they are not even sure they love each other anymore. Add to that a 12 year old moody almost teenager, and a 4 year old who likes to play kitten.  Oh let's not forget that Jolene is a pilot for the Army National Guard unit, and they are deploying. Deployment and homecoming throw this family through changes and realizations that will break and mend your heart in a very meaningful way.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "1250858232"
},
{
    "title": "Great read!",
    "rating": "5.0 out of 5 stars",
    "content": "Review: I am not a crier. I don't cry during movies, weddings, or even when my own husband deploys. I don't cry during a book. But I did cry in more than one place through this book by Kristin Hannah.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "1250858232"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I received mixed feedback for this book. I think a major problem a lot of people have is that a (military) family is not supposed to act this way! But I think focusing on that is missing the point entirely.",
    "post_time": "Reviewed in the United States on April 30, 2024",
    "pid": "1250858232"
},
]