[
{
    "name": "  The Wife Before: A Spellbinding Psychological Thriller with a Shocking Twist ",
    "stars": [
        "50%",
        "29%",
        "15%",
        "4%",
        "2%"
    ],
    "pid": "1496731115",
    "ratings": "7,723 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Good suspenseful book",
    "rating": "5.0 out of 5 stars",
    "content": "The suspense is amazing. You think you know what’s going to happen next and you’re not even close. One of my new favorite reads.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I initially felt that Samira married out of Desperation She didn't know much about Rowland and it really seemed as if he was trying to isolate her from her loved Ones. It's crazy that Melanie a dead woman was able to make a woman feel the way Samira was feeling , but that can be expected when you marry someone you barely know. There were a lot of Secrets in this book. Dylan had that much hidden hatred and Jealousy of his cousin and Melanie seemed delusional.  Rowland opened the door for infidelity by accepting it once before marriage. Good Read with a surprise ending.",
    "post_time": "Reviewed in the United States on February 7, 2024",
    "pid": "1496731115"
},
{
    "title": "Even the dead can cause insecurities in relationships",
    "rating": "4.0 out of 5 stars",
    "content": "This book is filled with twists and turns. The ending definitely wasn't expected. I can totally see this being made into a movie.",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book was a crazy ride for sure! I read it in like 3 days. I couldn't put it down! The end was such a twist and I loved this book!",
    "post_time": "Reviewed in the United States on January 4, 2024",
    "pid": "1496731115"
},
{
    "title": "Pretty good",
    "rating": "3.0 out of 5 stars",
    "content": "Good book! Not my typical taste, but enjoyable!",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Definitely great read..she is my new favorite romantic suspense author..plot and twist all the way. You will not be disappointed",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "1496731115"
},
{
    "title": "Wow!!! That's all I can say!",
    "rating": "4.0 out of 5 stars",
    "content": "I liked the twists and turns at every corner. Kept me in suspense. I really liked this book.",
    "post_time": "Reviewed in the United States on February 16, 2024",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This story kept you on the edge of your seat!",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "1496731115"
},
{
    "title": "Good Book",
    "rating": "5.0 out of 5 stars",
    "content": "Very well done!",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book was so good. Someone please tell me another Shanora Williams book to read.10 out of 10 recommend",
    "post_time": "Reviewed in the United States on December 24, 2023",
    "pid": "1496731115"
},
{
    "title": "Buy it!!",
    "rating": "5.0 out of 5 stars",
    "content": "I haven’t had this book for a full 24 hours yet and I’m already on chapter 45!!! Idk how it ends yet, but so far I AM HOOKED! Can’t wait to finish this book and order more from Shanora Williams!",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I credit the author having created a solid plot. The ending was not predictable as it is in many other thriller-style novels and it had a lot of potential. However, the character base completely ruined everything good that was going for this book. The main protagonist is a self-proclaimed freeloader who is equal parts delusional and empty headed. Admits to having no work ethic and relying on brother for financial support well past early adulthood. Is put out when finally, yes finally, she is “cut off” financially so the brother can support his own growing family, and instead of making something of herself, the lead role works a single shift to scrape money to cover utilities (since unashamedly, she won’t hold a steady job, so her roommate/friend pays all other bills) and doing so just happens to catch the eye of an incredibly wealthy athlete whom she proceeds to promptly marry, despite knowing he may be a murderer? What a win for woman kind. And notice how I said won’t hold a job.  Not “can’t”, the lead character lacks any sense of direction, purpose, or work ethic and is quite content having everyone else pay the bills. Then the counterpart is also incredibly self-centered and selfish female lead. You later learn there is past trauma that supposedly influenced the latter’s every life decision but even then, it’s just so incredibly difficult to get into. Throughout I became increasingly frustrated with the every single decision the key female leads made. Its just so incredibly unrealistic and in many cases irrational. Again, the overall plot was good, just so painfully weak in character composition.",
    "post_time": "Reviewed in the United States on March 4, 2023",
    "pid": "1496731115"
},
{
    "title": "Unfortunately difficult read",
    "rating": "5.0 out of 5 stars",
    "content": "Being an avid reader I was very happy I chose this book! It was so good and the suspense was amazing! I want to read more of her books!",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was my first book by this author and was highly impressed.  Part of the book are journal entries from a character we never meet but I was sucked in by her personal thoughts and my original view of her changed by the end. Perfect ending!",
    "post_time": "Reviewed in the United States on October 12, 2023",
    "pid": "1496731115"
},
{
    "title": "Great read",
    "rating": "3.0 out of 5 stars",
    "content": "I initially enjoyed the story and as I got through the story, I experienced a lot of moments when I could tell how it would generally unfold. I knew who the responsible party was from the beginning.",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Without giving too much away, there was little delineation between Samira and when she read Melanie’s journals. At times, the two characters’ voices melded too closely for me.",
    "post_time": "Reviewed in the United States on February 15, 2023",
    "pid": "1496731115"
},
{
    "title": "Hard to Put Down",
    "rating": "4.0 out of 5 stars",
    "content": "Not a bad read but nothing memorable either. It played out like a typical Lifetime movie.",
    "post_time": "Reviewed in the United States on October 25, 2023",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Not gonna lie, I only chose this book because I wanted to fulfill the \"Unlock this achievement when you complete one of our Amazon Editor's picks for Black History Month.\" I am so glad that I did! I've kinda gotten into a reading slump lately. I'll read for 10-30 mins and go to sleep. So it's been taking me weeks to finish a single book. I finished this book in three nights. I couldn't stop reading it. The storyline, the plot, everything about this book captured my attention and did not let it go until I knew the truth. This book is definitely worth the read. I've been sleeping on this author and I regret it. Now to see what other captivating books she's written! Read this one y'all! It's definitely worth it. It'll keep you guessing to the very end! Btw, the prologue is very misleading!",
    "post_time": "Reviewed in the United States on January 15, 2024",
    "pid": "1496731115"
},
{
    "title": "Predictable",
    "rating": "4.0 out of 5 stars",
    "content": "I really enjoyed reading this book.  It was easy to read and enjoyable.  The reason I gave it 4 stars is because the writing wasn't my favorite.  It felt a little childish at times. Great plot and twist!",
    "post_time": "Reviewed in the United States on February 28, 2023",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Okayyyyyy! This is my first read by this author and I was fully invested. I literally could not put it down. I just had to know what happened. This was insane. I knew that something wasn't right and somebody was lying. I just couldn't pinpoint who. I didn't trust Roland the entire book. Like down to the last chapter, I just knew he was involved in all this.",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "1496731115"
},
{
    "title": "ended well",
    "rating": "4.0 out of 5 stars",
    "content": "I read this book as a part of a book club. By chapter 4 I was ready to give up. The Fmc I still don’t like but the author did an amazing job with the mystery murder and mayhem within the storyline",
    "post_time": "Reviewed in the United States on October 8, 2023",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book was written good. I especially liked reading about the details of the Mansion. The identity of the real culprit kind of shocked me. I just know the husband did it and I was wrong.",
    "post_time": "Reviewed in the United States on October 28, 2023",
    "pid": "1496731115"
},
{
    "title": "Quick read",
    "rating": "4.0 out of 5 stars",
    "content": "Really great storyline, it did keep me turning the pages. But I will say the writing is a little amateur which at times made it just slightly annoying, BUT still worth the read! She did a great job coming up with this story.",
    "post_time": "Reviewed in the United States on October 4, 2023",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It was very intriguing, exciting and intense. It was an easy read, perfect for my plane ride. I didn’t see the twists coming. It was hard to put down. It was a bit over the top and the characters were not easy to relate with but that’s why it was enjoyable. I recommend this if you’re a fan of thrillers and mysteries.",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "1496731115"
},
{
    "title": "GREAT Storyline",
    "rating": "4.0 out of 5 stars",
    "content": "There she finds his dead ex wife’s diaries and begins to fear for her life.",
    "post_time": "Reviewed in the United States on July 30, 2023",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This book dragged in places although the premise was good.  I my opinion there was no closure with Dylan - we do not know what truly happened to him - which was disappointing with the detail attached to the rest of the plot.",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "1496731115"
},
{
    "title": "what a thrilling read!",
    "rating": "3.0 out of 5 stars",
    "content": "It’s the first book I’ve read by this author and I cannot in good conscience recommend it",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "And sophomoric writing. Not sure what book some of these other reviewers read. Main character and main “sub-character”’kept changing who/ what they were or wanted. Total waste of money.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "1496731115"
},
{
    "title": "A pro golfer with a tainted reputation remarries and moves his wife to a Colorado",
    "rating": "5.0 out of 5 stars",
    "content": "Great book!  Fast reading. Keeps you wanting more and I hated when it ended. Easy reading. Keeps u interested. Loved",
    "post_time": "Reviewed in the United States on March 22, 2023",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Yall...I ate this book up like it was my last meal! I started and finished it in under 24 hours. I was annoyed I had to stop reading to do things like work and drive lol. Shanora did it again! The Perfect Ruin was my first read by her and that one was spectacular! This one did not disappoint at all. I love that she tied the two books together a little. I love when authors do that. It's like a little treat. I thought I had the book figured out. I was certain I knew what happened but it turns out what I thought happened wasn't what happened at all. I do not want to spoil this book but yall have to read it! I cannot wait for her next release!!",
    "post_time": "Reviewed in the United States on January 12, 2024",
    "pid": "1496731115"
},
{
    "title": "What a thriller",
    "rating": "5.0 out of 5 stars",
    "content": "Oh my, the suspense in this book kept me going. I must admit the twists in the book were good. Samaria followed her instincts and her gut and was able to find all she wanted to know and a lot of what she didn’t want to know about the wife before. If you love thrillers I recommend this book.",
    "post_time": "Reviewed in the United States on January 31, 2024",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It started off a little slow but by half way through I was hooked and couldnt wait to read to the end!",
    "post_time": "Reviewed in the United States on November 5, 2023",
    "pid": "1496731115"
},
{
    "title": "Great read",
    "rating": "5.0 out of 5 stars",
    "content": "I picked this book because I wanted to earn a Kindle Challenge and this was in Kindle Unlimited.  I have to say I was intrigued at the beginning. Soon I was hooked and could not put this book down. I’m now a fan of this author! I usually pick out the the murderer early on and I did, sort of. I rarely gasp when reading but I did at the end of this one. Literally! The author did call golf tournaments a game (they are but they’re not called that) but that I overlooked. This is a super suspenseful book and I think you will enjoy it if suspense is your genre. I did!",
    "post_time": "Reviewed in the United States on February 3, 2023",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Omg job well done! I could not put this book down. I read this book within just a couple of hours and I’m honestly still shooked. Just when I thought I knew what was going to happen boom 💥 plot twist. 10/10 would recommend!",
    "post_time": "Reviewed in the United States on January 28, 2024",
    "pid": "1496731115"
},
{
    "title": "Riveting!",
    "rating": "2.0 out of 5 stars",
    "content": "I just didn’t like it",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wow. Romantic psychological thriller for sure. This was a great read. I was wishing there was a sequel!! Will be reading more of her books, this was a first for me and it didn’t disappoint. The story is intertwined and I would have never guessed the ending. Just wow!!!",
    "post_time": "Reviewed in the United States on February 24, 2024",
    "pid": "1496731115"
},
{
    "title": "👏🏾👏🏾👏🏾",
    "rating": "5.0 out of 5 stars",
    "content": "The wife before her was the first novel of this author. I loved it. The new wife can't seem to stop thinking about what happen to his other wife. Did he really kill her or was it all a lie?",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved the book, first you think he actually did it. Then you think she was crazy as a loon. Then the twin sister and the cousin. For a minute I thought the housekeeper was as suspicious too. Started the book at noon and with a few interruption finished it by 4PM.",
    "post_time": "Reviewed in the United States on January 25, 2024",
    "pid": "1496731115"
},
{
    "title": "Very uninteresting",
    "rating": "2.0 out of 5 stars",
    "content": "This just wasn’t written well. Parts dragged on, and it just fell short overall. I read a lot of drama and suspense and this wasn’t anything to write home about",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "1496731115"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was my first time reading anything by this author and let me tell you it was awesome. I was invested from the start. I expected some twists and turns, and this book did not disappoint. I will definitely be reading more books by this author.",
    "post_time": "Reviewed in the United States on January 24, 2024",
    "pid": "1496731115"
},
]