[
{
    "name": "  An American Beauty: A Novel of the Gilded Age Inspired by the True Story of Arabella Huntington Who Became the Richest Woman in the Country ",
    "stars": [
        "58%",
        "30%",
        "9%",
        "2%",
        "1%"
    ],
    "pid": "1496739426",
    "ratings": "10,633 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Fabulous Read",
    "rating": "5.0 out of 5 stars",
    "content": "Well written and the characters were so wonderfully captured. I felt like Much better than I expected. Highly recommend it.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Such a great storyteller and a fabulous subject! I really liked the book and will be reading more from this author.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "1496739426"
},
{
    "title": "Loved this book!",
    "rating": "5.0 out of 5 stars",
    "content": "Loved every word! Ended too soon!",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A historical novel detailing illustrious life of Arabella Huntington from poverty following the Civil War to a determined woman of immense wealth, talent and taste.  Most of the novel takes place in the Gilded Age on the outsides of the inner circle of the snobbish New York 400 set. Luxurious descriptions of European capitals, period costumes and family hostilities hampering for the highest perch governing the railroad and related companies.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "1496739426"
},
{
    "title": "Captivating",
    "rating": "5.0 out of 5 stars",
    "content": "Shana Abe brought to life the Gilded age in all its glory, with a magnificent telling of Belle Huntington a woman who rose from nothing to become a woman of great wealth and who lived by her own rules taking her life fully in to her own hands. I doubt I would have ever known about this true story if it weren’t for this wonderful book",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wonderful history about a little known story of a rags to riches story. I wish such a thing could happen to me.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "1496739426"
},
{
    "title": "An American Beauty by Shana Abe",
    "rating": "5.0 out of 5 stars",
    "content": "The story of the great railroad giant, H. P. Huntington and the woman who was most influential in his life. Arabella is one exceptionally motivated woman whose life is amazing to learn about. If you love history told in chapters that will keep you turning the pages, this book will not disappoint you. An excellent and enlightening book!",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was my second Gilded Age novel as I've previously read one about Alva Vanderbilt. It's been a while, and I forgot how intriguing this time period is! I love the descriptions of the opulent fashions and the homes!",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "1496739426"
},
{
    "title": "Amazing True Story, Beautifully written",
    "rating": "5.0 out of 5 stars",
    "content": "Immediately after finishing An American Beauty, I started researching the family. While I have heard of the Vanderbilts and Astors and Rockefellers, I had never heard of Collis P. Huntington, the railroad baron. The book provided for great discussion! My book club had some pretty strong feelings about the MC, Arabella!",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Read this if you like:",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "1496739426"
},
{
    "title": "Enjoyed",
    "rating": "4.0 out of 5 stars",
    "content": "Enjoyed the story. Very good condition. Fast shipping.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have never read anything by Shana Abe before, omg this was fantastic!! I love historical books, this was very educational. Love the plot, great setting, and strong intense interesting characters. I look forward to reading more from Ms. Shana Abe.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "1496739426"
},
{
    "title": "Beautifully written!!",
    "rating": "4.0 out of 5 stars",
    "content": "A fascinating read if you enjoy stories from the gilded age.  Glamorous.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A fascinating piece from war torn Richmond and not enough to eat to being",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "1496739426"
},
{
    "title": "Good story based on a fascinating era",
    "rating": "5.0 out of 5 stars",
    "content": "A wealthy woman. Great read, I couldn’t put it down.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Had never heard of her before.  What a woman, despite her indiscretions.  I couldn't put it down.  Am sure you won't be able to either.  Enjoy!!",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "1496739426"
},
{
    "title": "from rags to riches!",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed the book. It is not one I will remember vividly or ever return to but it has a certain satisfying curiosity that needs quenching. Some of the references about all the beautiful (now antiquities) objet’s d’art purchased felt like a heavy meal making one feel fat, uncomfortable and nauseatingly full. A little like the ending!.",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Arabella Huntington is a self-made woman who works her way out of poverty into opulence but is never accepted by high society. Love her qualities and her faults-her sacrifices made for her family as well as her lot in life as a home wrecker while knowing very clearly just who she is.  Good to the last page.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "1496739426"
},
{
    "title": "Excellent and surprising!!",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoy historical fiction about women who raise above and live productive lives.",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "An American Beauty tells the story of real-life mistress turned American royal Belle Huntington. I loved the honesty of Shana Abé’s portrayal of a smart, practical woman who had a steely determination to survive. Great settings, subtly emotional, all-around good book.",
    "post_time": "Reviewed in the United States on November 19, 2023",
    "pid": "1496739426"
},
{
    "title": "Recommended.",
    "rating": "5.0 out of 5 stars",
    "content": "Post Civil War and Gilded Age historical fiction about Belle Huntington. Rags to riches story while maneuvering family and societies pitfalls.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I could not put this book down! Since reading and loving The Second Mrs. Astor, I was greatly looking forward to An American Beauty. This novelized story of Arabella Huntington fulfilled my wish.",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "1496739426"
},
{
    "title": "Fascinating historical novel",
    "rating": "5.0 out of 5 stars",
    "content": "This book is beautifully written, displaying the pettiness and gossipy people of The Gilded Age in New York City.",
    "post_time": "Reviewed in the United States on June 7, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you have ever been to The Huntington Garden in Pasadena, CA, this book is for you.",
    "post_time": "Reviewed in the United States on September 17, 2023",
    "pid": "1496739426"
},
{
    "title": "Could not stop reading",
    "rating": "4.0 out of 5 stars",
    "content": "If you have not visited this exquisite exhibition of incredible art as well as gorgeous gardens, you are missing a most glorious piece of our history. And Arabella is at the center.",
    "post_time": "Reviewed in the United States on April 3, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Shana Abe paints a man and woman’s romance in lyrical phrases.",
    "post_time": "Reviewed in the United States on July 1, 2023",
    "pid": "1496739426"
},
{
    "title": "From poverty to riches.",
    "rating": "3.0 out of 5 stars",
    "content": "No sex or obscene language, just lovely, tear jerking language.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Please grace us with a new historical novel, Ms. Abe!!",
    "post_time": "Reviewed in the United States on February 25, 2024",
    "pid": "1496739426"
},
{
    "title": "American beauty",
    "rating": "5.0 out of 5 stars",
    "content": "I loved the main character in this story and knowing it is based on fact even made it more fun to read.  Plan to get the authors first book as that time period is interesting. .",
    "post_time": "Reviewed in the United States on May 12, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Arabella is Working to support her family in 1867 Richmond. The war is over but people have suffered and her father has died. She has 4 brothers and sisters to look after plus her mother. She meets Collis Huntington while working and one night hides herself and him from a raid. She goes to New York and her family goes with her but they are each settled into house with servants by Mr Huntington. So begins the life they will share even though he is married. This is the story of that life together and how it went from mistress to wife. How they had a son together and how she fell in love with his nephew. If you like history and you have visited the Huntington Library in California then you will be interested in the Huntington family. Thank you for the chance to win this book through Goodread.",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "1496739426"
},
{
    "title": "A very good read...",
    "rating": "4.0 out of 5 stars",
    "content": "This is a very good read about a historic person as long as you recognize that it is a fictionalized version.",
    "post_time": "Reviewed in the United States on February 17, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "An American Beauty immediately burst into a novel of the poor rising to wealth and power through her strong instincts and the determination to step into riches any way she could and finding love in the process.",
    "post_time": "Reviewed in the United States on January 18, 2024",
    "pid": "1496739426"
},
{
    "title": "A novel of that satisfied and captured my soul",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent author , well developed characters and great research done on the Huntington Family and close friends . Just all around a good book. Will be reading more of her books .",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was a quick read. Anything based on a real person catches my interest. I am sure to follow up with others by this author. I had loved her 2nd Mrs. Astor and this did not disappoint.",
    "post_time": "Reviewed in the United States on December 18, 2023",
    "pid": "1496739426"
},
{
    "title": "Great Book",
    "rating": "5.0 out of 5 stars",
    "content": "When I was a 5th grade teacher in Los Angeles I would take my classes to the Huntington Library in San Marino, California for field trips.  This book opened a world for me I never could have imagined and now I know the history of how the Huntington family came to create such a marvel.  The writer beautifully described in a very detailed way what life was like during this time period.  It is an enchanting story.",
    "post_time": "Reviewed in the United States on January 26, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I went into this read with very little knowledge of Arabella Huntington and was swept up in just a few pages. The writing is beautiful and immersive and transported me to the middle of each scene. Not only was the story fascinating to read, but the sociological observations of Gilded Age social mores and values were described with precision and detailed subtleties. Loved this so much I’m sad it’s over.",
    "post_time": "Reviewed in the United States on February 24, 2024",
    "pid": "1496739426"
},
{
    "title": "Great read/story!",
    "rating": "5.0 out of 5 stars",
    "content": "Great Read!",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this novel based on the life of a true strong woman who did so much for the world of art. Independent and resourceful character who can be an inspiration for today.",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "1496739426"
},
{
    "title": "The Huntington Library",
    "rating": "5.0 out of 5 stars",
    "content": "It took a little while to get used to the writing style - some chapters are diary-style some are first person, some are third person, etc. However, once I was accustomed, I really did enjoy this book wholeheartedly!",
    "post_time": "Reviewed in the United States on April 15, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Super speedy delivery 🌟🌟🌟",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "1496739426"
},
{
    "title": "A Truly Wonderful and Very American Story",
    "rating": "5.0 out of 5 stars",
    "content": "I don’t write reviews often but I want to for this fictionalization of the history if Arabella Huntington, and of the Huntington family and all that it gave to the country. If you have’s been to Huntington Library in Pasadena, CA, referenced in the last part of the book abut Edward’s success and his pour chase and development of this extraordinary house and gardens, you can’t imagine what people were able to do in that era when a few people had simply enormous wealth, and following the war, a lot of people had nothing.  Arabella’s ability trove through her awful circumstances and develop into an astute businesswoman, art collector, and finally, the assistance he provided",
    "post_time": "Reviewed in the United States on August 16, 2023",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Edward in California.  Hers is an extraordinary story and this is a highly readable and engaging fictionalization. I enjoyed every minute.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "1496739426"
},
{
    "title": "Great Book",
    "rating": "5.0 out of 5 stars",
    "content": "I liked the enjoyed the book. I highly recommend it to anyone who likes history, and romance and is curious about the Glided Age.",
    "post_time": "Reviewed in the United States on October 4, 2023",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In this historical novel of America’s Gilded  Age when America birthed millionaires while millions struggled to survive , the main character is a mistress who refuses to feel the moral guilt demanded by the prevailing culture. The reader is swept along as Belle is lifted from poverty to  an interesting life of wealth, opulence, and commitment, described by the author in beautiful language, as Belle tries to find the grace to live in a culture that reviles her. She values money, family, and beauty and strives to elevate those values by the choices she makes. Those of us who frequent Huntington Gardens and Museums get to enjoy her legacy and will particularly enjoy reading about this fascinating, independent woman.",
    "post_time": "Reviewed in the United States on November 14, 2023",
    "pid": "1496739426"
},
{
    "title": "The Gilded and the Guilted",
    "rating": "3.0 out of 5 stars",
    "content": "Dear Ms Abe,",
    "post_time": "Reviewed in the United States on September 1, 2023",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just two weeks ago I read your novel on the life of Isabella Stewart Gardner and relished the story ,but this is your Masterpiece!! Being from an old southern family who struggled greatly after the Civil War every detail “ rang true” in this odyssey of a young girl who saved her family in whatever ways were open to her . Having taught history for many years all of your small details are perfectly and accrately rendered. Thank you ,thank you , I will not soon forget this electrifying and brilliantly written tale . You have a great gift.",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "1496739426"
},
{
    "title": "Electrifyingly and brilliantly written !!!",
    "rating": "5.0 out of 5 stars",
    "content": "This book was very readable, but more speculative than much actual historic substance.  For an author to be in the mind of a real person is challenging, and the author did this quite well.  The late in the book, limited reveal about how awful it was for teenage Arabella was mostly left to the imagination.  Leaves one wondering what grit it must have taken for her to survive it at all, and sympathize more fully with the choices she made just to survive.  Having been entranced by the amazing Huntington Gardens near Pasadena, I was left wanting more real information about the Huntington’s, but honestly that wasn’t the point of this novel.  If one has an interest in gilded age New York and the toll this era took on poor women’s lives, Edith Wharton’s novels The House of Mirth and The Custom of the Country are highly recommended.",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "All through the book I looked for a certain thing to be revealed. The last chapter gave a surprising and good ending.",
    "post_time": "Reviewed in the United States on February 26, 2024",
    "pid": "1496739426"
},
{
    "title": "Readable",
    "rating": "5.0 out of 5 stars",
    "content": "I love historical fiction and this one was perfect in that genre, I have always been fascinated by the Huntington's, I live in Charleston WV about 50 miles from Huntington WV. Named after C P Huntington.  I love Brookgreen Gardens and Huntington Beach State Park in Merrills Inlet, SC. It was created by Archer and Anna Huntington in 1931. It's so much better when you can connect places and people with the stories you read.",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Another well written story from the Gilded Age.  You easily get lost in the that world from the very start.  Following the incredibly interesting and charming Belle through an Era that we will never see again.  It’s a romantic time in history of extreme wealth and decorum.  Shana is an excellent author.",
    "post_time": "Reviewed in the United States on March 23, 2024",
    "pid": "1496739426"
},
{
    "title": "Very good story.",
    "rating": "5.0 out of 5 stars",
    "content": "This story felt quite realistic with good pacing and kept me very engaged.",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After touring George Vanderbilt’s Biltmore in Asheville and then recently watching HBO’s Gilded Age I became very interested in learning more about that time period. I found the story of Arabella Huntington fascinating. The story kept my attention right to the end. I’m now looking forward to reading The Second Mrs. Astor by the same author.",
    "post_time": "Reviewed in the United States on February 18, 2024",
    "pid": "1496739426"
},
{
    "title": "Love The Gilded Age Stories",
    "rating": "4.0 out of 5 stars",
    "content": "I completely enjoyed this book. I love this genre of books. A novel, a work of fiction based on real life people. To learn how they became what they became. Great story telling.",
    "post_time": "Reviewed in the United States on November 14, 2023",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Shana Abe is a wonderful story teller. Her ability to tell the story from the perspective of four women added to the formation of the novel. A wonderful historical novel.",
    "post_time": "Reviewed in the United States on November 5, 2023",
    "pid": "1496739426"
},
{
    "title": "An American Beauty",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this book. I didn't know it was based on a real person. Just reminds us the things we do just to live. She had great strength. She did it all for her family. And better herself. Too bad society wouldn't accept her. She also gave back so much!",
    "post_time": "Reviewed in the United States on February 22, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Belle was an exciting charactor. She did what was necessary to survive and take care of her family. I liked learning about the elite and their lifestyle.",
    "post_time": "Reviewed in the United States on November 10, 2023",
    "pid": "1496739426"
},
{
    "title": "well done",
    "rating": "5.0 out of 5 stars",
    "content": "Beautifully written historic look at a strong young woman living through a unique time and her transformed life. I was happy to learn so much about the C.P.. Huntington story. I had no idea of his vast wealth and significant contribution to our country today. I am adding San Morino,CA to my list of places to visit to see more.",
    "post_time": "Reviewed in the United States on January 31, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I just finished this latest Shana Abe Historical romance set in the Gilded Age, at first in the South after the war, when everyone was just trying to survive, and later in New York and Texas with visits to Europe for shopping expeditions. Belle's story, with her affair and marriages and cunning plans to keep her entire family fed and sheltered in style, is amazing and a testament to what being a strong woman means, or meant in that time period (or really, in any time period...women hold up the world for so many). Abe's prose is pure gold, and it flows elegantly along her page-turner of a plot with it's brilliant characters to a pleasing finish. I've read everything Ms Abe has written, and I've yet to be disappointed. Excellent book, highly recommended.",
    "post_time": "Reviewed in the United States on May 10, 2023",
    "pid": "1496739426"
},
{
    "title": "Page turner",
    "rating": "4.0 out of 5 stars",
    "content": "I had never heard of Arabella Huntington before reading this book. I was blown away at how she charted her own way during times when women were not given that luxury. Plus now understanding the name, Huntington, and how it appears all over the country and why is really cool. Definitely would recommend this book.",
    "post_time": "Reviewed in the United States on September 3, 2023",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book turned out to be o e of my favorites.  Beautifully written.  I had no idea of who Bella was and her connection to the Huntington  Museum in Pasadena.  What a love she lead.  Truly remarkable.",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "1496739426"
},
{
    "title": "So admired Belle and her clever ways of surviving and prospering",
    "rating": "5.0 out of 5 stars",
    "content": "A wonderful portrait of a strong, intelligent woman who manages to throw off the shackles of a repressive, elitist society while protecting those dear to her.",
    "post_time": "Reviewed in the United States on April 10, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book lets you wander through the lives and mansions of the ultra-rich. Descriptive but not overly so. It is beautifully written, and I didn't want it to end. It, however, had a very satisfactory ending. Sign me up for more by Shana Abe.",
    "post_time": "Reviewed in the United States on February 26, 2024",
    "pid": "1496739426"
},
{
    "title": "Love Love Loved it",
    "rating": "4.0 out of 5 stars",
    "content": "I fell in love with Shana Abe with her Drakon series years ago. This book didn't disappoint. I had never heard of Arabella Huntington and I enjoyed her rags to riches, real life story. Worth reading and I enjoyed googling all her houses afterwards. Looking forward to more from Ms. Abe!",
    "post_time": "Reviewed in the United States on August 19, 2023",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Story was a bit lumbering. I wish the author didn't end the story so abruptly. Maybe there's a part 2??",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "1496739426"
},
{
    "title": "Real life rags to riches story...",
    "rating": "5.0 out of 5 stars",
    "content": "A novel of historical fiction that tells the sacrifices that Arabella Huntington did to support her poor family in 1867. From rags to riches was she a manipulative women or simply surviving the times. We enjoyed our discussion of Shana Abe’s well written book, An American Beauty.",
    "post_time": "Reviewed in the United States on February 5, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is my favorite book so far this year!  It was so well written and fascinating story telling. Arabella was a remarkable woman . I look forward to Shana Abe’s next book.",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "1496739426"
},
{
    "title": "A nice biography",
    "rating": "5.0 out of 5 stars",
    "content": "Amazing writing. Absolutely sucked me into the story. Plot twist at the end so subtle I had to re-read it a second (okay, third) time to make sure I understood it. Changed a lot of what I had read. I also spent a few hours reading what was known about the main characters in real life. Put Mrs. Chamberlain from The Gilded Age into perspective. Loved this book!!",
    "post_time": "Reviewed in the United States on December 4, 2023",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was thoroughly enjoying this book, assuming it was pure fiction. Then I come to find that it's true! I had never heard of the Huntington family before. Theirs is a fascinating story! I researched them afterwards and could not believe the many important contributions they made. Do yourself a favor and read this book!",
    "post_time": "Reviewed in the United States on January 10, 2024",
    "pid": "1496739426"
},
{
    "title": "Our Library Book Club pick",
    "rating": "5.0 out of 5 stars",
    "content": "This novel was so interesting and compelling. The moral complexities will be something I will think about for awhile. I appreciated that the prose did not distract from the story.",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Shana Abe wrote the perfect novel for my interests.  Historical documentation, detailed home descriptions to include the gorgeous furnishings, clothing and jewelry.  Personal relationships with all kinds of twists and turns.  She is a very talented writer, it was obvious she did her research.  I couldn’t put it down and now I’m sad it’s over.  Hope to find more of her books.",
    "post_time": "Reviewed in the United States on November 18, 2023",
    "pid": "1496739426"
},
{
    "title": "There are no wards …",
    "rating": "5.0 out of 5 stars",
    "content": "to do this book justice. It was a substantial read and that was perfect because it was wonderful.  Absolutely one of the best books I’ve ever read. I am from Virginia and have always been partial to Southern authors, e.g. Pat Conroy.  I’m not sure where the author is from but the attention to detail and the wonderful way the words are put together could not be more perfect. One could feel those rooms and situations.  Just lov this book and highly recommend it. My thanks to the author for writing it!",
    "post_time": "Reviewed in the United States on July 4, 2023",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This historical romance centered around the post Civil War period and into the Gilded Age was impossible to put down. Really poignant.",
    "post_time": "Reviewed in the United States on March 27, 2024",
    "pid": "1496739426"
},
{
    "title": "great read",
    "rating": "5.0 out of 5 stars",
    "content": "Great time piece. It is a great read if you like time period novels.",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is my second book by this author, and it did not disappoint! I read it around the clock because I simply couldn’t put it down. It was a very good read, and I highly recommend it.",
    "post_time": "Reviewed in the United States on January 31, 2024",
    "pid": "1496739426"
},
{
    "title": "Awesome",
    "rating": "5.0 out of 5 stars",
    "content": "I’m a personal sucker for any story based on true events. However, this book really wrapped me up and took me in. I even mailed it to my best friend across the country so she could also read it. I’m very much so looking forward to getting more books from this author. It’s so well written and makes you really see things from Arabella’s perspective. 10/10! Great read!",
    "post_time": "Reviewed in the United States on September 19, 2023",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great book! Couldn’t put it down.",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "1496739426"
},
{
    "title": "Couldn’t put it down!!",
    "rating": "5.0 out of 5 stars",
    "content": "I read the sample of this book and then found I could get it free from the library but it would be a. 8 week wait. I couldn't wait",
    "post_time": "Reviewed in the United States on January 22, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is amazing - the characters, the descriptions - you feel as if you’re in their world. I highly recommend it!",
    "post_time": "Reviewed in the United States on March 18, 2024",
    "pid": "1496739426"
},
{
    "title": "Captivating",
    "rating": "5.0 out of 5 stars",
    "content": "Well written !! Love that era .",
    "post_time": "Reviewed in the United States on April 2, 2024",
    "pid": "1496739426"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Enjoyed this book.  It was light reading but well researched and well timed after a trip to Newport to see the famous mansions.",
    "post_time": "Reviewed in the United States on April 1, 2024",
    "pid": "1496739426"
},
]