[
{
    "name": "  I Am Watching You ",
    "stars": [
        "50%",
        "33%",
        "12%",
        "3%",
        "2%"
    ],
    "pid": "1542046599",
    "ratings": "134,528 ratings",
    "other_info": {},
    "discount_price": "$ 8.89",
    "normal_price": "$15.95",
    "about_this_item": []
},
{
    "title": "3.5-4 stars",
    "rating": "4.0 out of 5 stars",
    "content": "At its core this book is fantastic! It took me a bit to get into it but once I did it was a great ride. I’m still unsure if I am happy with how it ended (and the slow start) which is why I can’t bring myself to give it five stars. I also was a bit disappointed in the lack of “thriller” feel. Yes, there is obviously a stalker, as it is titled, but I didn’t really FEEL the intensity. HOWEVER, I would absolutely recommend it. Book reviews are subjective and at its core it’s a very good read.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very sad and many twists and turns. Was very surprised at the ending but very touching ..I even shed a few tears.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "1542046599"
},
{
    "title": "Loved this book",
    "rating": "5.0 out of 5 stars",
    "content": "See comment above.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I am really sick of the many, many mysteries that have become best-sellers lately which don't have any suspense or mystery in them.",
    "post_time": "Reviewed in the United States on December 21, 2017",
    "pid": "1542046599"
},
{
    "title": "good mystery - didn't suspect who did it & was surprised",
    "rating": "4.0 out of 5 stars",
    "content": "I feel like warning other people who love mystery not to bother -- unless you are quite forgiving and don't expect any real surprises or things that make sense.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "So, SOME spoilers",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "1542046599"
},
{
    "title": "At a loss. Is this meant to be a mystery?",
    "rating": "5.0 out of 5 stars",
    "content": "*******",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The writing is flat, the characters are flat, but this didn't, at first deter me from reading it. Agatha Christie is not exactly a great prose writer, and she does manage to surprise the reader and to build interesting cliffhangers and plots.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "1542046599"
},
{
    "title": "Took me a handful of chapters.",
    "rating": "5.0 out of 5 stars",
    "content": "About 50% into the book I was getting a bit fed up, because there was NOTHING happening. There were chapters ending with stuff like \"She couldn't tell anyone what she knew\" or \"He had done something disgusting\" -- not exactly this, but this kind of attempt to create suspense.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Well, if you do that, then DELIVER. Instead, it just kept going on, and on and on in the same vein, with us not finding anything else, just more of these from the same characters.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "1542046599"
},
{
    "title": "So good!",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book! 😀 I did not expect the ending, and it's been a while since I have been surprised by an ending.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "There are elements that are very good in Teresa Driscoll’s book, “I Am Watching You.” At the same time, there are other aspects of the book that were bothersome.",
    "post_time": "Reviewed in the United States on September 1, 2017",
    "pid": "1542046599"
},
{
    "title": "Okay, But Could Have Been Better",
    "rating": "4.0 out of 5 stars",
    "content": "The book is composed of short chapters, with a number of characters relating the story. The main character is Ella, identified in her titled chapters as The Witness. Ella was on a train ride and thus became one of the last people to see Anna before she disappeared. She was also able to describe the two young men who had approached Anna and her friend, Sarah. Anna’s disappearance and probable murder haunts Ella throughout the book, as she blames herself for not doing anything to protect the young girls, who are both 16 years old.",
    "post_time": "Reviewed in the United States on March 28, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Other characters are introduced, and some are painted as the potential guilty party. Ms. Driscoll makes the guesswork murky as many of the characters have secrets that may or may not be connected with Anna. The overall plot is good, and the author continues to keep us questioning who might have been involved right up to the book’s end.",
    "post_time": "Reviewed in the United States on October 11, 2017",
    "pid": "1542046599"
},
{
    "title": "Fun, quick read.",
    "rating": "4.0 out of 5 stars",
    "content": "What bothered me about the book was the writing style and some plot specifics. Ms. Driscoll has a habit of using partial sentences, and while these can be effective, they lose their power when used excessively. At first, because the story started off with Ella relating everything in first person, I believed it to be more of a stream-of-consciousness thought process. However, when the author moved to subsequent chapters (everything else in third person), the phrases and partial sentences continued. While it would have worked for Ella to tell her story in that manner, having every character think the same way seemed to blur the characterizations. The other stylistic device used over and over was the introduction of a secret at the end of almost every chapter. Again, this can be a powerful tool, but when used constantly, the story becomes more bothersome than exciting.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Most of the story is told a year later, and the investigation into Anna’s disappearance is still being worked on by the police. When the guilty person is finally revealed, it was difficult to believe that the police would have neglected to perform a full investigation (the author tells us at the end that police only did a “cursory” investigation on the person). I hesitate to say more as it would potentially become a spoiler, but for me, this became a fatal flaw and made the ending feel forced.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "1542046599"
},
{
    "title": "A Slow Start With Two Apparent Main Storylines But May Be Worth a Read",
    "rating": "4.0 out of 5 stars",
    "content": "Coupled with the writing issues described a few paragraphs ago, I ended up with mixed feelings the book. I thought this could have been a great story, and there were elements – characters, a good plot idea, a number of misleading side stories, good dialogue – that might have added up to a fantastic read. Unfortunately, the writing style and the inefficient police investigation brought this down to a better-than-average tale. Three-and-a-half stars.",
    "post_time": "Reviewed in the United States on October 26, 2023",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I would rate this book somewhere between 3.5 and 4 stars. The premise is solid and I was hooked from the description alone.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "1542046599"
},
{
    "title": "Decent Read. Lazy Ending",
    "rating": "5.0 out of 5 stars",
    "content": "While most chapters ended with a cliffhanger, the story would pick back up (from that viewpoint) days later with just a summary of what happened. That frustrated me.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I also didn't see the point of some of the side stories. They didn't add value for me.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "1542046599"
},
{
    "title": "A great book",
    "rating": "5.0 out of 5 stars",
    "content": "Jumped right into the story, I was hooked from the start.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The story is told from multiple viewpoints, and you get the feelings of those connected to the missing girl.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "1542046599"
},
{
    "title": "Good Story",
    "rating": "3.0 out of 5 stars",
    "content": "It was difficult to put down, and the ending was shocking.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I Am Watching You was a good story. The characters were believable and the story moved right along. I would recommend this book.",
    "post_time": "Reviewed in the United States on December 11, 2017",
    "pid": "1542046599"
},
{
    "title": "Very slow moving - nothing happening. Drawn out...",
    "rating": "5.0 out of 5 stars",
    "content": "I'm just about halfway through this book.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "1.  Many English references which I am not familiar with.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "1542046599"
},
{
    "title": "A fantastic family thriller that ties up nicely in the end!",
    "rating": "5.0 out of 5 stars",
    "content": "2. Nothing happens in manh pages.  Lots of description for example, there was a fly in my jail cell, then 3 pages of how was he going to kill the fly and why it bothers him as well as memories about flies on the farm as a child.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "3. Another example, owner in the flower shop.  Describes what the flowers look like.  What kind of arrangement and why and did who.",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "1542046599"
},
{
    "title": "so good!!",
    "rating": "5.0 out of 5 stars",
    "content": "4.  Lots of pages of the past",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "5. The book jumps around. Chapter One, the Witness, Chapter Two the Friend ... Back and forth back and forth.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "1542046599"
},
{
    "title": "Compelling",
    "rating": "5.0 out of 5 stars",
    "content": "Once I got all the characters straight, since three families were involved in the story, it was an excellent read. Very different concept, with a lot of twists and turns and false leads. The families had several issues and were complex, but after a while, I began to enjoy reading about them. The author made every scene come to life and I was drawn in repeatedly. The change of Point of View was very well done. Often, I prefer that the story stays in the same POV, but the author did a masterful job of changing the point of view after a cliffhanger ended a chapter, so it went smoothly. I'll be looking for more books by Teresa Driscoll.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Teresa Driscoll writes a chillingly compelling page turner that is worth every bit of 5 stars.",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "1542046599"
},
{
    "title": "Outstanding Novel - Compelling Read!",
    "rating": "3.0 out of 5 stars",
    "content": "So many authors ruin stories with completely unbelievable characters and events. Here with \"I'm Watching You\", Ms. Driscoll gives a master class in the opposite. Everything adds up - events are well thought out and truly believable. The twist at the end is perfect and executed in a way that when finished I was left feeling nothing but amazed.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is NOT a novel where you end up hating every character - which seems to be in vogue now-a-days. As a matter of fact the way the character's backgrounds and personalities are revealed had me pulling for many of them - somehow feeling their pain even though they are fictional characters.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "1542046599"
},
{
    "title": "Ok read",
    "rating": "3.0 out of 5 stars",
    "content": "In this novel characters don't lie for no reason - which again you find in so many books now. Nice to see that there are many strong women included in this story as well.",
    "post_time": "Reviewed in the United States on January 17, 2019",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I can't wait to read more from Ms. Driscoll.",
    "post_time": "Reviewed in the United States on January 7, 2018",
    "pid": "1542046599"
},
{
    "title": "Love love love this book.",
    "rating": "3.0 out of 5 stars",
    "content": "It was an OK read. I enjoyed the different POV’s of the characters but in the end I found it to be sort of predictable. It was easy to see where it was going.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s hard for me to gain interest in a lot of books, mainly due to how things are worded and story lines going every which way. But this book was so great, I was wanting to pick it up and read it any spare minute I had.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "1542046599"
},
{
    "title": "give this book a try as the story was interesting!",
    "rating": "3.0 out of 5 stars",
    "content": "I Am Watching You by Teresa Driscoll is a mystery, thriller novel. The book is told in multiple points of view from the witness (Ella), the father (Henry), the friend (Sarah), and the private investigator (Matthew). Anna goes missing after taking a trip to London with her friend Sarah to go see Les Miserables. On the train they meet a couple of guys who were just released from prison. Overhearing the conversation, Ella feels uncomfortable for the girls but decides to stay out of the situation. After hearing the news of Anna’s disappearance she goes straight to the police to tell them what she heard on the train.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A year later is when the story takes place. Anna is still missing and the family is getting ready to do an anniversary appeal to help get any new information. Ella, the witness, has been overwhelmed with guilt feeling as though this is partially her fault because she kept to herself and let the girls be. However, Ella's name was slipped to the media and now she has started to receive threatening letters in the mail accusing her of not helping. Sarah, the friend, feels as though this is her fault because she left Anna alone the night she disappeared and may have some inside knowledge on who may have known what happened to her. In order to give this information to the police, Sarah has to reveal a huge secret from her past but is she ready to admit to it? Henry, the father, had a big row with Anna right before she left but does his secret have anything to do with her disappearance? Matthew, the private investigator, is hired by Ella to help find out who is sending the letters but will he be the one to figure out what really happened to Anna?",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "1542046599"
},
{
    "title": "great read",
    "rating": "5.0 out of 5 stars",
    "content": "I didn’t know where the author was going with the story but was quite intrigued by how the twists and turns led to the dramatic conclusion. I really enjoyed this book.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I Am Watching You was my first book by Teresa Driscoll.",
    "post_time": "Reviewed in the United States on August 10, 2022",
    "pid": "1542046599"
},
{
    "title": "I Am Watching You",
    "rating": "5.0 out of 5 stars",
    "content": "This book automatically made me reflect on my own approach to a given situation such as the one in the book. Would I have been quiet or would I have done something differently?",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It starts with Ella Longfield, a mom, and florist, on a train ride as she notices two teenage girls on their way to the city being approached by two guys that begin flirting with them. She doesn’t think much of it until she realizes they just got off from jail. She was on the verge of saying something but she changed her mind. Turns out that the next day, the news show one of the girls going missing and she instantly recognizes the moment she could have done something about it.",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "1542046599"
},
{
    "title": "great read!",
    "rating": "5.0 out of 5 stars",
    "content": "A year goes by, and Anna is still missing. Ella is filled with guilt. She could have done something about it but stayed quiet. The media releases her information with their opinions and all of a sudden, Ella begins getting letters threatening her, making her fear for her life. Someone is watching her. What is really happening?",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The story is told by several POVs (The witness, The Father, The Friend, The Private Investigator, and The Watcher). Through each chapter, we begin piecing together the events that happened on that night. How is everyone involved or connected? What happened to Anna? Who is this watcher and why is he watching Ella?",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "1542046599"
},
{
    "title": "Good storyline",
    "rating": "5.0 out of 5 stars",
    "content": "Overall an entertaining story. It had me guessing and changing my suspects and that is something I enjoy in a book.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Engaging characters that you care about from the drop. I do wish there was a little less side story on the secondary characters but it didn’t take anything away from the main plot. Great read. It left me wishing for more stories from Matthew and Melanie’s investigations!",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "1542046599"
},
{
    "title": "A very humanistic thriller!",
    "rating": "5.0 out of 5 stars",
    "content": "The story was very good, a little slow at times but definitely for the most part suspenseful, especially toward the end.  However I'm not a big fan of the British English.  The lingo is different and it takes a few references and context to understand what certain situations are about.  The author uses words like cross and row which seems to reference a conflict or disagreement.  Or takeaway, lie in, A-levels so it's a bit distracting to understandthe references.  Overall though the storyline was very good.",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Well written story, with characters that are so relatable. I recommend this to everyone who enjoys a well thought out suspense thriller will definitely keep Teresa Driscoll on my reading list!",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "1542046599"
},
{
    "title": "confused",
    "rating": "3.0 out of 5 stars",
    "content": "For me, there were so much unnecessary change of subject. It comes together good in the end thankfully, I decided to finish to make some sense.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This was a good story overall. Once I got to “know” the different characters, I enjoyed hearing their varying perspectives. As is so often the case in criminal matters, everyone has secrets and half-truths. That being said, some of the chapters (Ella’s especially) dragged on and the book got to be a bit of a chore to finish. Then the last 15% or so felt a bit hectic and rushed.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "1542046599"
},
{
    "title": "Good story overall- Slower read with a rushed ending",
    "rating": "4.0 out of 5 stars",
    "content": "Keeps the reader busy trying to decide the bad person.",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There were so many twists and turns in this book. Right as I thought I figured it out, wrong. That person was cleared. This book kept me on my toes until the very last chapter and I am now going to look up more books by Teresa Driscoll.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "1542046599"
},
{
    "title": "Good mystery",
    "rating": "4.0 out of 5 stars",
    "content": "Anna, a sixteen tear old girl who has a beautiful life with a seamingly beautiful family, goes missing in a trip to London with her best friend. Sara, living a less fortunate life than her best friend, has secrets in regards to Anna’s disappearance. Ella, a florist living a pretty average life, it’s on the same train as the girls witnessing their naïve interactions with a couple of good looking, troublesome men.",
    "post_time": "Reviewed in the United States on September 6, 2023",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Told from different character’s point of views, Driscoll’s weaves a tale full of suspense and mystery. You think you know who did it but then change your mind many times throughout the story. Every character could be a suspect, their lives intertwined in unique ways. I am watching you is a real page turner. A definite book to put in your TBR list.",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "1542046599"
},
{
    "title": "Talk about Twisty",
    "rating": "5.0 out of 5 stars",
    "content": "I think I found a new favorite author.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great book and made you feel for all of the characters in this book.  Minus the Villain.",
    "post_time": "Reviewed in the United States on January 14, 2024",
    "pid": "1542046599"
},
{
    "title": "Gripping, Full of Suspense and Mystery",
    "rating": "5.0 out of 5 stars",
    "content": "Would definitely recommend this book.",
    "post_time": "Reviewed in the United States on November 8, 2017",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very fast delivery and great condition.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "1542046599"
},
{
    "title": "Best book I’ve read in a while!!",
    "rating": "5.0 out of 5 stars",
    "content": "I could not put this book down. And I’m not a book person. I loved the fast-paced chapters and change in characters perspective per chapter. Kept me totally drawn in. I’ll be looking at her other books for sure! Don’t pass this one up.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I found I couldn’t put this book down, and when I did I couldn’t get it out of my mind. I read it in 2 days, I found it that good. Many people review a book and give a condensed version but I rarely do because I think giving too much of the story away kinda ruins it for the next reader. Teresa Driscoll is and excellent writer and she had me hooked by the very first pages. Her story kept me guessing right up until the end. Read it, you won’t be disappointed.",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "1542046599"
},
{
    "title": "I Am Watching You",
    "rating": "4.0 out of 5 stars",
    "content": "This was a great read as it keep me engaged. I couldn't wait to get to the end to see where this would lead. Many suspects to consider!",
    "post_time": "Reviewed in the United States on April 3, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Teresa Driscoll nailed it with this one. Great book and kept me wanting to keep reading. Thanks Teresa.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "1542046599"
},
{
    "title": "Lots of twists and turns",
    "rating": "3.0 out of 5 stars",
    "content": "The storyline was good but there is a lot of fluff in this book. It was almost a DNF for me, but I stuck it out. The ending was surprising though for sure.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "This was my first audio book. I got it for my husband and I to listen to while we drove from TX to AZ. I'm not sure if it was the narrators voice or the story I hated more. Hates a strong word....the story was ok. Not suspenseful at all. The narrators constant breathy tone trying to infuse suspense was annoying and really took away from the story. So, needless to say we'll just listen to Pandora on the ride home!",
    "post_time": "Reviewed in the United States on October 15, 2024",
    "pid": "1542046599"
},
{
    "title": "I am watching you",
    "rating": "5.0 out of 5 stars",
    "content": "I was drawn in from the beginning. There is such emotion and closeness in this book.  The decisions we make and the guilt we harbor shape our interactions with the world around us. This book was captivating; I was immersed in its tension and the eerie sensation of being watched. Every time I thought, the story was going in one direction. It went another!! It was exceptional, and I thoroughly enjoyed it!!",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed the story.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "1542046599"
},
{
    "title": "not great, not terrible",
    "rating": "4.0 out of 5 stars",
    "content": "A truly great book with an interesting ending.",
    "post_time": "Reviewed in the United States on January 22, 2018",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wish I hadn’t chosen to finish the book through right before bedtime as I’m going to have to watch a romantic comedy or a few episodes of Friends to help calm my nerves but I think that is the mark of a good thriller.",
    "post_time": "Reviewed in the United States on July 19, 2023",
    "pid": "1542046599"
},
{
    "title": "Edge-of-your-seat, intense, thrilling...a must read.....",
    "rating": "5.0 out of 5 stars",
    "content": "I Am Watching You by Teresa Driscoll",
    "post_time": "Reviewed in the United States on January 10, 2023",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Ella overhears two young men flirting with (two) teenage girls on a train, she thinks nothing of it. Then she realizes they are straight out of prison she is on guard, but says nothing.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "1542046599"
},
{
    "title": "Really Good",
    "rating": "3.0 out of 5 stars",
    "content": "The next day she hears the news that one of the girls (Anna Ballard) has disappeared. Ella is distraught and feeling guilty for doing nothing.",
    "post_time": "Reviewed in the United States on September 12, 2017",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One year later Anna is still is missing. Ella is getting threatening letters and worries about her safety. As the investigation continues seems everyone is hiding secrets, from Anna's family to her friends. Who knows the truth about Anna, who is watching Ella and why?",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "1542046599"
},
{
    "title": "Page turner, but ultimately not quite satisfying",
    "rating": "4.0 out of 5 stars",
    "content": "A fast paced story told from multiple points of view, brought me deep into the story. Intense, thrilling, edge-of-your-seat suspense, kept me engrossed from the first page until the end.",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall I found I Am Watching You quite enjoyable and highly recommend to those who enjoy a great (psychological) thriller. I look forward to reading more by Teresa Driscoll .",
    "post_time": "Reviewed in the United States on January 27, 2019",
    "pid": "1542046599"
},
{
    "title": "Nice mystery",
    "rating": "5.0 out of 5 stars",
    "content": "It’s was so good I read it in 3 days…and I’m dyslexic! I would definitely recommend this book…it’s worth it.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This page turning mystery is about the circumstances relating to a missing 16 year old girl who traveled to London with her best friend one year in the past. We start on the train where Ella, \"the witness,\" sees two teenage girls flirting with two men who were just released from prison. Her mothering nature kicks in and she thinks she should try to figure out who these girls are and warn their parents that they might be up to no good. She ignores that instinct and feels haunting regret the next day when the news reports one of those girls has disappeared. Each chapter of this story is told between the varying perspectives of Ella - the witness, Henry - the father of Anna, the missing girl, Sarah - the friend, Matthew - the private investigator, and occasional interludes by the \"watcher.\" The bulk of the book takes place around the one year anniversary of Anna's disappearance when everyone is hoping with renewed interest Anna will be discovered.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "1542046599"
},
{
    "title": "Fast moving and suspenseful",
    "rating": "4.0 out of 5 stars",
    "content": "Every single chapter in this book ended with a mini cliffhanger. They kept me reading late into the night, even though I could barely keep my eyes open. I like the shift of perspectives and learning more about what could have happened and who might have been to blame, but I ultimately found all of the characters a little bit dull. I thought the main premise around Ella's guilt was slightly ridiculous. Why would anyone think it was their responsibility to hunt down parents of total strangers she sees across a train car just to basically tattle on them? If they were a lot younger, then maybe...? It was interesting to see how each of the characters found blame in their own actions and thought they might be the reason Anna disappeared, even if they might have truly had nothing to do with it. While the cliffhangers definitely kept my attention, about halfway through I became frustrated with how they never really went anywhere. You're left in suspense, but nothing is ever answered until the final pages of the book. I wish we had been given a bit more satisfaction after so much enticement earlier in the story. Maybe elaborate and eliminate a couple of the suspects along the way.",
    "post_time": "Reviewed in the United States on March 4, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, I thought this was a pretty decent mystery. There were a couple of twists and turns you're not expecting. It's a fast read and keeps your attention. It's not one of my favorite books, but I recommend it if you like that genre.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "1542046599"
},
{
    "title": "Entertaining",
    "rating": "4.0 out of 5 stars",
    "content": "In the gripping psychological thriller known as \"I Am Watching You\" penned by Teresa Driscoll, readers are whisked away into a suspenseful tale that has garnered much acclaim. With its placement on the Amazon Bestseller charts and high ratings on Goodreads, it's no wonder this book has captivated the minds of so many. The story centers around Ella Longfield, who inadvertently overhears two young girls striking up a friendship with two convicts on a train. As events unfold, and one of the girls disappears without a trace, Ella is consumed by a deep-seated guilt over her failure to intervene. Through Driscoll's skillful prose, the reader is taken on a rollercoaster ride of emotions, unable to look away from the edge of their seat. \"I Am Watching You\" is a thrilling read that will keep you spellbound from start to finish.",
    "post_time": "Reviewed in the United States on April 13, 2023",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "4.3 stars",
    "post_time": "Reviewed in the United States on March 8, 2024",
    "pid": "1542046599"
},
{
    "title": "Get this if you like mystery books!",
    "rating": "4.0 out of 5 stars",
    "content": "A great book!this book is a great read. It’s very suspenseful you continue reading wondering what will happen next. It has 287 pages of suspense and thriller, for what will happen next would recommend to anyone who likes thriller and suspense books! What would you do if you saw two men on a train with a black bag in their hands, questions you to think what’s in the bag that’s all how the mystery starts. Could read this book all day great author.",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Interesting povs that keep you guessing throughout the book. I enjoyed being unsure of who was responsible. Enjoyed this good read.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "1542046599"
},
{
    "title": "keeps you guessing",
    "rating": "5.0 out of 5 stars",
    "content": "I loooooved this book! A touching thriller/mystery! Her writing superb and the storytelling was beyond!",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was a great book! Twists I wasn't expecting and we'll put together!!!",
    "post_time": "Reviewed in the United States on December 31, 2018",
    "pid": "1542046599"
},
{
    "title": "Amazing read!",
    "rating": "4.0 out of 5 stars",
    "content": "Ella Longfield becomes an unwitting sort of witness when she overhears a conversation while on the bus.  Two young teenage girls start flirting with two young men .. but then she realizes that they men are fresh out of prison.",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What to do?  Call the parents of the girls?  Tell the young men to leave the girls along?  Talk to the girls and warn them?  Just as she decides to call for help, she overhears something else that stops her in her tracks.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "1542046599"
},
{
    "title": "10/10",
    "rating": "3.0 out of 5 stars",
    "content": "The next day one of the girl's picture is splashed all over the media.  She disappeared the night before.",
    "post_time": "Reviewed in the United States on October 9, 2017",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A year later, Ella still feels guilty that she did nothing and someone else thinks she should pay, as well.  She's received a series of threatening letters.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "1542046599"
},
]