[
{
    "name": "  I Am Watching You ",
    "stars": [
        "50%",
        "33%",
        "12%",
        "3%",
        "2%"
    ],
    "pid": "1542046599",
    "ratings": "134,524 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Amazing thriller!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I like this book, didn’t like that it was passing from a person to another and sometimes it confuse me but I actually enjoyed it, it has a jealous friend who did everything to be better, a cheating had, a perv€rt which I hope is on jail for what he did to his daughter and a tormented witness, let’s not forgot the psycho friend that ended up killed our sweet Anna, I thought he had her in a room locked up but he was so obsessed that he ended up k¡ll!ing that poor girl, I didn’t expected to be him, at first I thought it was Sarah’s dad, since he had a history of abusing kids but Anna stood loyal and didn’t call him, but I gotta tell you something, I could meet you for years to the end but I am not getting in a random flat in the middle of nowhere just because you say to wait there for the cab, Tim was a surprise that I didn’t thought about until Ella mentioned the picture and that he was on the train I would have continue to think it was Sarah’s dad but overall an amazing thriller",
    "post_time": "Reviewed in the United States on July 19, 2023",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I Am Watching You by Teresa Driscoll",
    "post_time": "Reviewed in the United States on January 10, 2023",
    "pid": "1542046599"
},
{
    "title": "Edge-of-your-seat, intense, thrilling...a must read.....",
    "rating": "5.0 out of 5 stars",
    "content": "Ella overhears two young men flirting with (two) teenage girls on a train, she thinks nothing of it. Then she realizes they are straight out of prison she is on guard, but says nothing.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The next day she hears the news that one of the girls (Anna Ballard) has disappeared. Ella is distraught and feeling guilty for doing nothing.",
    "post_time": "Reviewed in the United States on September 12, 2017",
    "pid": "1542046599"
},
{
    "title": "Really Good",
    "rating": "4.0 out of 5 stars",
    "content": "One year later Anna is still is missing. Ella is getting threatening letters and worries about her safety. As the investigation continues seems everyone is hiding secrets, from Anna's family to her friends. Who knows the truth about Anna, who is watching Ella and why?",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A fast paced story told from multiple points of view, brought me deep into the story. Intense, thrilling, edge-of-your-seat suspense, kept me engrossed from the first page until the end.",
    "post_time": "Reviewed in the United States on January 27, 2019",
    "pid": "1542046599"
},
{
    "title": "Page turner, but ultimately not quite satisfying",
    "rating": "5.0 out of 5 stars",
    "content": "Overall I found I Am Watching You quite enjoyable and highly recommend to those who enjoy a great (psychological) thriller. I look forward to reading more by Teresa Driscoll .",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s was so good I read it in 3 days…and I’m dyslexic! I would definitely recommend this book…it’s worth it.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "1542046599"
},
{
    "title": "Fast moving and suspenseful",
    "rating": "4.0 out of 5 stars",
    "content": "This page turning mystery is about the circumstances relating to a missing 16 year old girl who traveled to London with her best friend one year in the past. We start on the train where Ella, \"the witness,\" sees two teenage girls flirting with two men who were just released from prison. Her mothering nature kicks in and she thinks she should try to figure out who these girls are and warn their parents that they might be up to no good. She ignores that instinct and feels haunting regret the next day when the news reports one of those girls has disappeared. Each chapter of this story is told between the varying perspectives of Ella - the witness, Henry - the father of Anna, the missing girl, Sarah - the friend, Matthew - the private investigator, and occasional interludes by the \"watcher.\" The bulk of the book takes place around the one year anniversary of Anna's disappearance when everyone is hoping with renewed interest Anna will be discovered.",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Every single chapter in this book ended with a mini cliffhanger. They kept me reading late into the night, even though I could barely keep my eyes open. I like the shift of perspectives and learning more about what could have happened and who might have been to blame, but I ultimately found all of the characters a little bit dull. I thought the main premise around Ella's guilt was slightly ridiculous. Why would anyone think it was their responsibility to hunt down parents of total strangers she sees across a train car just to basically tattle on them? If they were a lot younger, then maybe...? It was interesting to see how each of the characters found blame in their own actions and thought they might be the reason Anna disappeared, even if they might have truly had nothing to do with it. While the cliffhangers definitely kept my attention, about halfway through I became frustrated with how they never really went anywhere. You're left in suspense, but nothing is ever answered until the final pages of the book. I wish we had been given a bit more satisfaction after so much enticement earlier in the story. Maybe elaborate and eliminate a couple of the suspects along the way.",
    "post_time": "Reviewed in the United States on March 4, 2024",
    "pid": "1542046599"
},
{
    "title": "Best book I’ve read in a while!!",
    "rating": "5.0 out of 5 stars",
    "content": "I could not put this book down. And I’m not a book person. I loved the fast-paced chapters and change in characters perspective per chapter. Kept me totally drawn in. I’ll be looking at her other books for sure! Don’t pass this one up.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I found I couldn’t put this book down, and when I did I couldn’t get it out of my mind. I read it in 2 days, I found it that good. Many people review a book and give a condensed version but I rarely do because I think giving too much of the story away kinda ruins it for the next reader. Teresa Driscoll is and excellent writer and she had me hooked by the very first pages. Her story kept me guessing right up until the end. Read it, you won’t be disappointed.",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "1542046599"
},
{
    "title": "I Am Watching You",
    "rating": "4.0 out of 5 stars",
    "content": "This was a great read as it keep me engaged. I couldn't wait to get to the end to see where this would lead. Many suspects to consider!",
    "post_time": "Reviewed in the United States on April 3, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Teresa Driscoll nailed it with this one. Great book and kept me wanting to keep reading. Thanks Teresa.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "1542046599"
},
{
    "title": "Lots of twists and turns",
    "rating": "3.0 out of 5 stars",
    "content": "The storyline was good but there is a lot of fluff in this book. It was almost a DNF for me, but I stuck it out. The ending was surprising though for sure.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was drawn in from the beginning. There is such emotion and closeness in this book.  The decisions we make and the guilt we harbor shape our interactions with the world around us. This book was captivating; I was immersed in its tension and the eerie sensation of being watched. Every time I thought, the story was going in one direction. It went another!! It was exceptional, and I thoroughly enjoyed it!!",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "1542046599"
},
{
    "title": "I am watching you",
    "rating": "5.0 out of 5 stars",
    "content": "Well written and entertaining",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed the story.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "1542046599"
},
{
    "title": "not great, not terrible",
    "rating": "4.0 out of 5 stars",
    "content": "A truly great book with an interesting ending.",
    "post_time": "Reviewed in the United States on January 22, 2018",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wish I hadn’t chosen to finish the book through right before bedtime as I’m going to have to watch a romantic comedy or a few episodes of Friends to help calm my nerves but I think that is the mark of a good thriller.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "1542046599"
},
{
    "title": "Good mystery",
    "rating": "4.0 out of 5 stars",
    "content": "Keeps the reader busy trying to decide the bad person.",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I so enjoyed this book. It is well written. I love short chapters. Anyhoo, this book kept me reading. A definite page turner, I had to finish it. I was so intrigued and I had to solve the case🕵🏾‍♀️",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "1542046599"
},
{
    "title": "A page turner!!!",
    "rating": "4.0 out of 5 stars",
    "content": "I think I found a new favorite author.",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Great book and made you feel for all of the characters in this book.  Minus the Villain.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "1542046599"
},
{
    "title": "A Suspenseful Who done it",
    "rating": "5.0 out of 5 stars",
    "content": "Would definitely recommend this book.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "For me, there were so much unnecessary change of subject. It comes together good in the end thankfully, I decided to finish to make some sense.",
    "post_time": "Reviewed in the United States on September 6, 2023",
    "pid": "1542046599"
},
{
    "title": "confused",
    "rating": "5.0 out of 5 stars",
    "content": "There were so many twists and turns in this book. Right as I thought I figured it out, wrong. That person was cleared. This book kept me on my toes until the very last chapter and I am now going to look up more books by Teresa Driscoll.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Anna, a sixteen tear old girl who has a beautiful life with a seamingly beautiful family, goes missing in a trip to London with her best friend. Sara, living a less fortunate life than her best friend, has secrets in regards to Anna’s disappearance. Ella, a florist living a pretty average life, it’s on the same train as the girls witnessing their naïve interactions with a couple of good looking, troublesome men.",
    "post_time": "Reviewed in the United States on January 14, 2024",
    "pid": "1542046599"
},
{
    "title": "Talk about Twisty",
    "rating": "5.0 out of 5 stars",
    "content": "Told from different character’s point of views, Driscoll’s weaves a tale full of suspense and mystery. You think you know who did it but then change your mind many times throughout the story. Every character could be a suspect, their lives intertwined in unique ways. I am watching you is a real page turner. A definite book to put in your TBR list.",
    "post_time": "Reviewed in the United States on November 8, 2017",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very fast delivery and great condition.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "1542046599"
},
{
    "title": "Entertaining",
    "rating": "4.0 out of 5 stars",
    "content": "In the gripping psychological thriller known as \"I Am Watching You\" penned by Teresa Driscoll, readers are whisked away into a suspenseful tale that has garnered much acclaim. With its placement on the Amazon Bestseller charts and high ratings on Goodreads, it's no wonder this book has captivated the minds of so many. The story centers around Ella Longfield, who inadvertently overhears two young girls striking up a friendship with two convicts on a train. As events unfold, and one of the girls disappears without a trace, Ella is consumed by a deep-seated guilt over her failure to intervene. Through Driscoll's skillful prose, the reader is taken on a rollercoaster ride of emotions, unable to look away from the edge of their seat. \"I Am Watching You\" is a thrilling read that will keep you spellbound from start to finish.",
    "post_time": "Reviewed in the United States on April 13, 2023",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "4.3 stars",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "1542046599"
},
{
    "title": "Loving it",
    "rating": "5.0 out of 5 stars",
    "content": "Great book very enjoyable twists and turns",
    "post_time": "Reviewed in the United States on March 8, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A great book!this book is a great read. It’s very suspenseful you continue reading wondering what will happen next. It has 287 pages of suspense and thriller, for what will happen next would recommend to anyone who likes thriller and suspense books! What would you do if you saw two men on a train with a black bag in their hands, questions you to think what’s in the bag that’s all how the mystery starts. Could read this book all day great author.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "1542046599"
},
{
    "title": "Get this if you like mystery books!",
    "rating": "5.0 out of 5 stars",
    "content": "I loooooved this book! A touching thriller/mystery! Her writing superb and the storytelling was beyond!",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was a great book! Twists I wasn't expecting and we'll put together!!!",
    "post_time": "Reviewed in the United States on December 31, 2018",
    "pid": "1542046599"
},
{
    "title": "Amazing read!",
    "rating": "4.0 out of 5 stars",
    "content": "Ella Longfield becomes an unwitting sort of witness when she overhears a conversation while on the bus.  Two young teenage girls start flirting with two young men .. but then she realizes that they men are fresh out of prison.",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "What to do?  Call the parents of the girls?  Tell the young men to leave the girls along?  Talk to the girls and warn them?  Just as she decides to call for help, she overhears something else that stops her in her tracks.",
    "post_time": "Reviewed in the United States on October 9, 2017",
    "pid": "1542046599"
},
{
    "title": "10/10",
    "rating": "5.0 out of 5 stars",
    "content": "The next day one of the girl's picture is splashed all over the media.  She disappeared the night before.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "1542046599"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A year later, Ella still feels guilty that she did nothing and someone else thinks she should pay, as well.  She's received a series of threatening letters.",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "1542046599"
},
]