[
{
    "name": "  Think and Grow Rich: The Landmark Bestseller Now Revised and Updated for the 21st Century (Think and Grow Rich Series) ",
    "stars": [
        "86%",
        "9%",
        "3%",
        "1%",
        "1%"
    ],
    "pid": "1585424331",
    "ratings": "31,251 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "A Timeless Classic for Success Seekers",
    "rating": "5.0 out of 5 stars",
    "content": "I recently ordered this and I must say, it's an absolute gem. This book is a timeless classic for anyone on a journey to success.",
    "post_time": "Reviewed in the United States on January 26, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Napoleon Hill's wisdom and principles are as relevant today as they were when this book was first written. The updated edition adds a contemporary touch, making it even more accessible to modern readers.",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "1585424331"
},
{
    "title": "Believe and take action",
    "rating": "4.0 out of 5 stars",
    "content": "The book is a comprehensive guide to achieving your goals, not just in terms of wealth, but in every aspect of life. Hill's insights into the power of the mind, the importance of desire, and the significance of persistence are truly eye-opening.",
    "post_time": "Reviewed in the United States on March 17, 2020",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What I appreciate most about \"Think and Grow Rich\" is its practicality. Hill provides actionable steps and principles that you can implement immediately to start transforming your life. It's not just about accumulating wealth; it's about realizing your potential and achieving your dreams.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "1585424331"
},
{
    "title": "Let no one tell you NOT to buy this book!",
    "rating": "5.0 out of 5 stars",
    "content": "Whether you're an entrepreneur, a student, or simply someone seeking personal growth, this book is a must-read. It's a source of inspiration, motivation, and a roadmap to success. I've already started applying some of the principles, and I can see positive changes in my mindset and actions.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Don't hesitate to buy it. It might just change your life.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "1585424331"
},
{
    "title": "Book",
    "rating": "5.0 out of 5 stars",
    "content": "Some of the negative reviews mention how this book preaches “Magical thinking” to grow rich. These people clearly did not read the book and are biased against it for their own cynical reasons.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Now, when it comes to cynicism, I have been guilty of it to the utmost in almost every phase of my life.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "1585424331"
},
{
    "title": "Book",
    "rating": "3.0 out of 5 stars",
    "content": "However, this book, when read with an open mind and an open heart, holds the keys to unlocking an infinite and prosperous way of thinking and of taking action that I wish I had discovered 25 years ago.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "THIS BOOK PREACHES ACTION AS MUCH AS THOUGHT! That is what the cynical negative reviews tend to leave out. There is no way to get rich through magical thinking. Think and Grow Rich says this almost word for word. It does provide a blueprint of how positive thinking combined with meticulous planning will help one to achieve their goals.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "1585424331"
},
{
    "title": "Must read & live Chapter 2!!!",
    "rating": "5.0 out of 5 stars",
    "content": "Napoleon Hill’s Think and Grow Rich is a timeless classic on personal development and success. Chapter 2, ‘Desire,’ stands out as particularly impactful. Hill emphasizes the power of a burning desire to achieve one’s goals, illustrating how this foundational principle is the starting point for all great achievements. Through compelling anecdotes and practical advice, Hill inspires readers to harness their desires as a driving force for success. This chapter is a must-read for anyone serious about transforming their ambitions into reality!.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book narrows down a main goal and focus that no other book seems to do, plenty of good books that give a generalised picture of a direction to head towards but this one describes the combination of desire put into plan and faith using words to plant into Subconscious mind, quite unique and simple, but so very true to alter any problem caused by fear which repels wealth",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "1585424331"
},
{
    "title": "I’ve only read it once and my life has changed dramatically already for the better",
    "rating": "4.0 out of 5 stars",
    "content": "The text is readable and book came in great condition, some of the pages do have these marks, doesn’t make text ineligible",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Meet expectations",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "1585424331"
},
{
    "title": "Good book, some “damage”",
    "rating": "5.0 out of 5 stars",
    "content": "I finally decided to buy this book though I am still in the process of reading however so far so go, I dont wanna put it down each chapter is simply explained but yet so deep.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wonderful book for those looking to gain knowledge",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "1585424331"
},
{
    "title": "Meet expectations",
    "rating": "5.0 out of 5 stars",
    "content": "Think And Grow Rich is a curation of the 13 most common habits of wealthy and successful people, distilled from studying over 500 individuals over the course of 20 years. If The Intelligent Investor is the bible for investing, then Think And Grow Rich is the bible for successful people in general. This book examines the psychological power of thought and the brain in the process of furthering your career for both monetary and personal satisfaction. Originally published in 1937, this is one of the all-time self-help classics and a must-read for investors and entrepreneurial types. It seamlessly draws out the basic instinct or says the inborn pattern of great leaders, entrepreneurs, blatant determined people who changed the world we live in. For ages, great leaders, entrepreneurs have been transited from mediocrity to exceptionally talented. And I think this is why you should read this.",
    "post_time": "Reviewed in the United States on July 4, 2021",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Five Big Ideas are as following..",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "1585424331"
},
{
    "title": "Informative",
    "rating": "4.0 out of 5 stars",
    "content": "1. The starting point of all achievement is desire.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "2. You are the master of your destiny.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "1585424331"
},
{
    "title": "Adults guide to financial balance",
    "rating": "5.0 out of 5 stars",
    "content": "Great guide for anyone looking to monitor their expenses and find balance in life.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is great advice.  As a retired teacher I believe it should be a high school course no matter your field of study.  I wish I would have found it earlier in life.  Read it, you will not regret.",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "1585424331"
},
{
    "title": "Every teen should read.",
    "rating": "5.0 out of 5 stars",
    "content": "My husband loved it",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Many of the claims in this book are highly exaggerated claims (aka lies) that are unverified and some being just pure imagination, the book speaks of “manifesting” and willing money to you by thinking your way into the attraction of money, which is a pure lie, you cannot “attract” money to you, mindset is important to the foundation of success, but without discipline and hard work you are nothing no matter how much you think about money. The author was a conman who was never in his life actually rich when you look into his background and had a history of running scams during his lifetime. Now I will not completely bash this book for I only read 6 chapters and despite me being ready to throw the book in the trash after only  reading half of it, there are still a lot of positive things you can take from the book, as I mentioned earlier, mindset is key for the foundation of success, and this book speaks all about mindset. I would not recommend this book to anyone reading it with the intention of actually learning to become successful, But I will recommend it to those seeking to better their mindset but I will advise that you read the book critically and not to take everything that is said in the book at face value.",
    "post_time": "Reviewed in the United States on January 15, 2024",
    "pid": "1585424331"
},
{
    "title": "Nice book",
    "rating": "5.0 out of 5 stars",
    "content": "I will read this book over and over!!",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This information is priceless. Eye opener",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "1585424331"
},
{
    "title": "A book of fallacy",
    "rating": "5.0 out of 5 stars",
    "content": "This book is a timeless classic that never grows old, with many antidote and stories that gives lessons in becoming the best version of yourself! Would recommend this book for anyone  who are ready to think past their situations!",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is very motivational worth a read !!!",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "1585424331"
},
{
    "title": "Must read",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect condition and fast delivery.",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was particularly impressed by Hill's emphasis on the power of the subconscious mind and the role of visualization in manifesting one's goals and desires. His practical exercises and affirmations provide readers with tangible tools for reprogramming their minds and harnessing the unlimited potential within.",
    "post_time": "Reviewed in the United States on October 17, 2016",
    "pid": "1585424331"
},
{
    "title": "Book",
    "rating": "4.0 out of 5 stars",
    "content": "Good",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great book. Easy read.  Friends want it when I'm done.",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "1585424331"
},
{
    "title": "Great read",
    "rating": "5.0 out of 5 stars",
    "content": "I've been reading this book I've been listening to the tapes for over 40 years. I get something new every time. Everyone just starting out should read this book. And those that have been going along and things have been working right ought to read this book.",
    "post_time": "Reviewed in the United States on March 5, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I’ve really been enjoying this book! But I didn’t even get past page 20 before the pages started falling out. I don’t crease the spines aggressively so not sure why it’s falling apart. Wish the binding was stronger.",
    "post_time": "Reviewed in the United States on June 7, 2024",
    "pid": "1585424331"
},
{
    "title": "It's a great book",
    "rating": "5.0 out of 5 stars",
    "content": "Good read for anyone want to boost their wealth.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was surprise to see this book on Amazon at such a reasonable price. Great book and worth reading. This deserves more than 5 stars",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "1585424331"
},
{
    "title": "Great Content - Not Great Stitching",
    "rating": "5.0 out of 5 stars",
    "content": "This is the kind of book you’ll read twice a year. I would recommend to all my friends and family",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great book to enhance your mind.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "1585424331"
},
{
    "title": "Mind opening read",
    "rating": "5.0 out of 5 stars",
    "content": "\"Think and Grow Rich\" by Napoleon Hill is a powerful book that has had a profound impact on my mindset and approach towards achieving success. This timeless classic delves into the principles of success and provides practical guidance on how to cultivate a mindset geared towards achieving one's goals and ambitions. Hill explores the power of positive thinking, persistence, and the importance of setting clear goals. By applying the principles outlined in the book, I have witnessed significant personal growth, increased motivation, and a heightened sense of purpose. \"Think and Grow Rich\" is a must-read for anyone seeking to unlock their full potential and create a life of abundance and fulfillment. I highly recommend this book to those who are ready to embark on a transformative journey towards success.",
    "post_time": "Reviewed in the United States on July 3, 2023",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great book",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "1585424331"
},
{
    "title": "Must have this classic",
    "rating": "5.0 out of 5 stars",
    "content": "I've read this book about three times and I've also listened to the audiobook probably the same.",
    "post_time": "Reviewed in the United States on March 13, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's a must have for anyone who wants to grow",
    "post_time": "Reviewed in the United States on April 29, 2024",
    "pid": "1585424331"
},
{
    "title": "I love this book",
    "rating": "5.0 out of 5 stars",
    "content": "Gave Me knowledge and it’s very cheap",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love it",
    "post_time": "Reviewed in the United States on October 2, 2023",
    "pid": "1585424331"
},
{
    "title": "Love it",
    "rating": "5.0 out of 5 stars",
    "content": "The teachings of Think and Grow Rich is valuable but, someone too clever decided to use a tiny gray font. The strain to focus and be able to read it, is terrible. I  definitely recommend the book for its teachings but, at the same time, suggest to keep in mind that the font used makes the reading extenuating.",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Be fully committed to this book and it will show you so many possibilities.",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "1585424331"
},
{
    "title": "Exceptional book but awful tiny gray font",
    "rating": "5.0 out of 5 stars",
    "content": "Quality pages and cover .... the book is so enlightening and educational",
    "post_time": "Reviewed in the United States on February 7, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After you read this book you should feel more motivated then ever to achieve your goals and conquer your mind. I truly believe anyone who reads this will have a life-altering experience",
    "post_time": "Reviewed in the United States on August 26, 2023",
    "pid": "1585424331"
},
{
    "title": "Great book especially paired with the work book.",
    "rating": "5.0 out of 5 stars",
    "content": "I was recommended this book in one of my Facebook friends live and I listened to him and decided to buy myself this and it definitely helped me to understand myself a whole lot better and I’m so greatful that the people that put this together as well as the sellers the book was in great condition and I believe this is the second book I bought since I gifted the first one to someone who looked like they needed it for a change in their life! 💜",
    "post_time": "Reviewed in the United States on February 27, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was so profound that I had to reread several times! I will definitely be reading it again and again.",
    "post_time": "Reviewed in the United States on February 22, 2024",
    "pid": "1585424331"
},
{
    "title": "Tiny print",
    "rating": "4.0 out of 5 stars",
    "content": "This book is the size of my palm. The print is small and hard to read.",
    "post_time": "Reviewed in the United States on November 28, 2023",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this book because it was praised and recommended by Bob Proctor who I had a chance to listen to in a video. Now seeing Bob Proctor was very special, everyone knows he is famous, but yet he sounded so genuine and real that I was quite taken by him and what he said about the book by Napoleon Hill, it turned his life around many, many years ago when he wasn't rich. Now I thought, I have to read this book. I have to apologize, I am not even half through the book yet, but this book is intense and I love reading intense books. The story Napoleon Hill relates about his son is unbelievable, but yet to be believed, because he bases his concept about his knowledge of the human mind on it and backs it up with this story. The subconscious mind can be trained and influenced from birth in order to achieve incredible things in life, or when it is trained and influenced badly in early life, it will exactly accomplish this in later life, it will end up as criminal, unsuccessful, unrewarding, or simply as a botched up life. Yet, the conscious mind, that we are aware of, can do nothing about that and will have to just follow along with what the subconscious mind has been set up with in early childhood.",
    "post_time": "Reviewed in the United States on October 24, 2013",
    "pid": "1585424331"
},
{
    "title": "The best book one can read",
    "rating": "5.0 out of 5 stars",
    "content": "But, that's not all what the book is about, the book is about, once the conscious mind knows and understands what's going on, we can change the content of the subconscious mind and how. I am excited to read the rest of the book, it is awesome and I am expecting it will change my life.",
    "post_time": "Reviewed in the United States on February 27, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Thank you I just got it and I’ll Start to read it. I’ll edit my review later",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "1585424331"
},
{
    "title": "Arrived well, it’s lightweight",
    "rating": "5.0 out of 5 stars",
    "content": "Apart from the Holy Bible, Think and Grow Rich is the next book that has the most impactful life-changing experience in me.",
    "post_time": "Reviewed in the United States on December 22, 2023",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book re-wired my thinking. One of the powerful lessons early on manage to elicit a tear; about his son… such an amazing story and give secrets of how great people succeed. Highly recommend and especially try to share it!",
    "post_time": "Reviewed in the United States on February 9, 2024",
    "pid": "1585424331"
},
{
    "title": "This a book of life.",
    "rating": "5.0 out of 5 stars",
    "content": "Awesome book for someone who’s looking at where to start. Very helpful. This can really help someone achieve their goal.",
    "post_time": "Reviewed in the United States on March 4, 2023",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Did Napoleon Hill really know all of those rich people? Did he really advise presidents, save lives, and cure deafness? Does the Law of Attraction really work? The book makes me feel good. In Think and Grow Rich, the author repeatedly states that all great riches start with an \"idea\". That makes me feel good, because I've got tons of ideas. I love sharing ideas and thinking. The book also said that it's impossible to get something for nothing. If you want something out of life, you have to provide something in return. I dodged the question of whether or not the Law of Attraction works. I don't know. I use it, but I'm not sure if it works.",
    "post_time": "Reviewed in the United States on March 1, 2024",
    "pid": "1585424331"
},
{
    "title": "Learn it, live it",
    "rating": "5.0 out of 5 stars",
    "content": "I have found this book to be very educational",
    "post_time": "Reviewed in the United States on December 29, 2023",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this book to change the mindset. This has been one of my favorite gifts to give others to recharge and regular the mind. Love that it’s a quick read and gets to the point.",
    "post_time": "Reviewed in the United States on July 31, 2023",
    "pid": "1585424331"
},
{
    "title": "Love",
    "rating": "5.0 out of 5 stars",
    "content": "Amazing book a must read",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Dive into Napoleon Hill's 'Think and Grow Rich' for a life-changing journey to prosperity. This classic masterpiece unravels the secrets of wealth accumulation and success through Hill's 13 proven principles. Backed by compelling stories of achievers, it imparts actionable wisdom for personal growth and financial abundance. Elevate your mindset, embrace opportunity, and embark on a path to lasting prosperity. HIGHLY RECOMMEND 🥰🥰🥰🥰🥰🥰",
    "post_time": "Reviewed in the United States on August 29, 2023",
    "pid": "1585424331"
},
{
    "title": "Highly recommend 🔥🔥very good book",
    "rating": "5.0 out of 5 stars",
    "content": "The book talks about different era from Andrew Carnegie, Henry Ford and Thomas Edison. The moral of the book is dream big and do not fear failure. Failure will be part of the process to success. Thomas Edison failed 1,000 times until he was able light up lower Manhattan which was his goal. J.P. Morgan was able to Finance Thomas Edison and Henry Ford in achieving there goals as well.",
    "post_time": "Reviewed in the United States on August 17, 2023",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My new favorite book",
    "post_time": "Reviewed in the United States on November 26, 2023",
    "pid": "1585424331"
},
{
    "title": "Napoleon Hill interviewed Henry Ford and some of the most successful to discover there secret.",
    "rating": "5.0 out of 5 stars",
    "content": "Think and Grow Rich by Napolean Hill is an all-time classic. It should be a must read for anyone looking to improve themselves, whether in business or life.",
    "post_time": "Reviewed in the United States on February 26, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book can help answer the question What do you want Most? Is it Money, Fame, Power, Contentment, Happiness?  Even though the book was written more than 70 years ago the philosophies Mr. Hill wrote about still apply today.",
    "post_time": "Reviewed in the United States on July 26, 2010",
    "pid": "1585424331"
},
{
    "title": "Can’t wait to read the book only complaint is my book came damaged 🥹",
    "rating": "5.0 out of 5 stars",
    "content": "In this book he discusses the Thirteen Steps to Riches which is the secret to money making and success that had made fortunes for some of the most successful people of his time. To gain this secret he was given an assignment by Andrew Carneige to go out and interview five hundred of these successful men and learn what it was and what they had in common that made them successful.",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These were men such as Henry Ford, Thomas Edison, Alexander Graham Bell, John D. Rockefeller, George Eastman, William Wrigley Jr. and Charles Schwab. This book conveys their expereince and philosophy and not only describes what to do but how to do it.",
    "post_time": "Reviewed in the United States on July 20, 2023",
    "pid": "1585424331"
},
{
    "title": "Nice!",
    "rating": "5.0 out of 5 stars",
    "content": "One takeaway I got from this book was that all of these men followed the habit of exchanging ideas through conferences. When they had a problem to solve they got together and talked freely until they came up with a plan that would help them. Today this is commonly called a Master Mind principle and is practiced by many groups and organizations all over the world.",
    "post_time": "Reviewed in the United States on February 8, 2024",
    "pid": "1585424331"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You may not need all the ideas that are in this book but somewhere in this book you will find one idea or one suggestion that will help you tremendously. This one of those books that can literally change your life.",
    "post_time": "Reviewed in the United States on February 1, 2024",
    "pid": "1585424331"
},
]