[
{
    "name": "  The Orphanage By The Lake: A Captivating Psychological Crime Thriller With A Twist ",
    "stars": [
        "47%",
        "35%",
        "14%",
        "3%",
        "1%"
    ],
    "pid": "1737646390",
    "ratings": "16,140 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Great Read",
    "rating": "5.0 out of 5 stars",
    "content": "This book will keep you on the edge. Hazel is a breath of fresh air.",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a great read. I usually don't read thrillers but this was good.",
    "post_time": "Reviewed in the United States on October 15, 2024",
    "pid": "1737646390"
},
{
    "title": "A thrill ride",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first time reading from this author ,I really enjoyed it so much. ! I would highly recommend this book and I’m really looking forward to the second one coming out. Can't wait to read it !",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a good read. I love crime thrillers and had not read a book by Daniel G Miller. I’m now a fan. I read it in less than two days, that’s a record for me. I really like that he talked with an actual missing person investigator, a PI, and learned Korean culture for accuracy when writing the book. This is the first of two books. Cant wait for The Red Letter. I have pre-ordered.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "1737646390"
},
{
    "title": "Excellent book !!",
    "rating": "4.0 out of 5 stars",
    "content": "This book really has you thinking.  Is it all connected? Was she manipulated,  kidnapped, or left voluntary?? The whole book has you guessing. Either you know or have no idea what's going on.  It's a steady pace book that builds the story. The last couple of chapters take it there!! That's how you FIGHT OR FLIGHT!! Great and easy read!",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Will she perserve through the unknown, danger, and suspicion? Follow the never-ending journey with Hazel Cho.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "1737646390"
},
{
    "title": "Great crime thriller",
    "rating": "5.0 out of 5 stars",
    "content": "This book has been in my kindle/amazon queue for purchasing for many months.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Somehow I thought it would be a horror novel which is my favorite read and  because it came up on my algorithm to purchase. It was a pleasant mystery read and I am glad I read it.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "1737646390"
},
{
    "title": "Even paced read, then boom !",
    "rating": "5.0 out of 5 stars",
    "content": "The Orphanage By The Lake is a book that is hard to put down. Full of intriguing characters that all seem to have some guilt, P.I. Hazel works on a deadline to find a missing girl. It's a great plot with a thrilling end.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I was immediately taken aback to discover this book was written by a male in the first person POV of a female protagonist. I wondered how a man could possibly express the emotions of the opposite sex, but Daniel Miller did so magnificently. A true page-turner mystery. I will be reading more by this author.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "1737646390"
},
{
    "title": "Enjoyed this book",
    "rating": "5.0 out of 5 stars",
    "content": "I read this book in a few days, it was good, I was not surprised by the ending. I will order the next one in this series.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "1737646390"
},
{
    "title": "Randi's Review",
    "rating": "5.0 out of 5 stars",
    "content": "I rated it 5 stars because it kept my interest, there were some twists and turns and the story was developed over time.  Some aspects a little over the top in terms of believability but a goid PI mystery never gets old.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I almost put the book down in the very beginning but was curious enough to keep reading. It got more interesting as I kept reading. Overall a good read. I’m going to read the next one in the series.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "1737646390"
},
{
    "title": "Slow Start But Better asI Kept Reading.",
    "rating": "5.0 out of 5 stars",
    "content": "What a great storyline & page turner. Hazel Cho! Bad ssa. I laughed wowed and talked with myself. Ready for part 2",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Orphanage by the Lake is a haunting and contemplative novel that lingers long after the final page. It’s perfect for readers who appreciate slow-burn mysteries with emotional depth and atmospheric storytelling.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "1737646390"
},
{
    "title": "Wow!",
    "rating": "5.0 out of 5 stars",
    "content": "I was searching for a book to select for our book club and hit the jackpot with this fabulous book!  I wanted a page turner that was suspenseful and entertaining, and this book did not disappoint.  I can’t wait for “The Red Letter” next year.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm an avid reader and when I ordered a set of books a month ago, I was thrilled to start reading them. Not having known much about Mr. Miller, I decided to give this book a try just based on the title as well as the illustration on the cover. Boy, I did not realize how good of a book I would be picking up and reading. The story was an interesting read and kept you turning the page to find out what happens. In this review I'm not going to divulge any details of the actual plot since that's the reason you're buying the book but, in general, it is a very vivid adventure story based upon crime and the compelling narrative to seek out the truth. In general, I highly recommend this book. So much so that I'm writing a review which I usually never leave for products",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kept me wanting more, hard to put down. Great sense of humor added in to the excitement of the story!",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "1737646390"
},
{
    "title": "Great read!",
    "rating": "4.0 out of 5 stars",
    "content": "I liked this book very much. I liked that the author injects his sense of humor into the characters to lighten up a bit the darkness of the main story. I'm looking forward to reading the second book of Detective Cho's series.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Every time it was getting good... It gets better! Definitely not something you want.to put down at all!! Great read!",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "1737646390"
},
{
    "title": "A very good thriller",
    "rating": "5.0 out of 5 stars",
    "content": "Wow!!!! Amazing story line and a super easy read! I love the story finished it within the week (only because of work) caught myself wanting to get off and read lol I definitely recommend this book!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book was a fun ride!  Lots of intrigue and action. There were a couple of predictable outcomes but still fun and engaging.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "1737646390"
},
{
    "title": "Intense Draws You In",
    "rating": "4.0 out of 5 stars",
    "content": "Highly recommend. I just got back into reading and stumbled across this book! Looking forward to book 2!",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Liked main character is a young woman.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "1737646390"
},
{
    "title": "Must Read!!!",
    "rating": "5.0 out of 5 stars",
    "content": "Young readers will enjoy this book, it holds your after well.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is a good rrad",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "1737646390"
},
{
    "title": "Good Read",
    "rating": "4.0 out of 5 stars",
    "content": "Starts off slow, and was unsure if I was going to even finish it. Towards the middle, it picks up and makes you question every person in the book. With the twist I wasn't expecting for it to end the way it did. Can't wait for the next book.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So, I consume books like potato chips and downloaded this one with minimal expectations. And it is one of the best stories I’ve read in a long time. The main character Hazel is very compelling— she is sympathetic, smart, imperfect, and driven— and the story was riveting. My heart was pounding when the story reached its pinnacle and all I want to do now is read the next book in the series. As a Gen Xer with Gen Z kids, I don’t always relate to Millenial characters but that was not an issue in the case of this heroine and the world the author created for her. Bonus that the book provides compelling yet casual glimpses into Korean American culture.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "1737646390"
},
{
    "title": "You’ll love it!",
    "rating": "5.0 out of 5 stars",
    "content": "This book kept me intrigued from the start page turner and thrilling. I love have Hazel talked to the reader and had tid bits of little fun jabs that make you laugh.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excited for book two I need to pre-order as I’m old school and want the hardcover in handle no Kindle for me!!! Excited to hear when pre-orders start.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "1737646390"
},
{
    "title": "Good read",
    "rating": "4.0 out of 5 stars",
    "content": "I’m enjoying this book.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This Book is hard to put down.....can't wait for book 2... Daniel G. Miller can't wait to read all your books!!!!",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "1737646390"
},
{
    "title": "Must Read",
    "rating": "5.0 out of 5 stars",
    "content": "Great  book, love the way the author wrote it.  You won't regret!",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I don’t usually read these kind of books, but after reading the first couple of pages, I was sucked in. Love it. It kept you wanting to know what’s going to happen. Definitely will check out his other books.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "1737646390"
},
{
    "title": "Great Read",
    "rating": "4.0 out of 5 stars",
    "content": "Where do i begin…first the book took forever to get my attention but it finally did and then it was slow. Then picked up and threw me all over the place. This ending of this book, makes all the slow events worth it. If it wasn’t for the ending, I don’t think this would have been a four star book for me. I did NOT expect the suspects and what was happening!",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "At first I wasn't to sure, but the more I read but it got. Great story I'd give 8 out 10. Way to go Daniel Miller.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "1737646390"
},
{
    "title": "caught off guard",
    "rating": "5.0 out of 5 stars",
    "content": "Could not put it down, and I like Hazel Cho as much as Kinsey Milhone!  Ready for more from this author.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve never written a review for a book. Typically, I read them and put them on the shelf when I’m done, but I couldn’t with this. I was hesitant to buy this at first, but I am so glad I did. The character building and plot escalation is timed perfectly imo. When I’d put the book down and went about my day, I found myself unable to stop thinking about what happens next or all the “what ifs.” 10/10 recommend",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "1737646390"
},
{
    "title": "a place of secrets",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoy a good fast paced mystery and The Orphanage by the Lake was perfect! Hazel Cho is not your typical PI protagonist as she shows a very human/feminine side while still maintaining a strong character. I originally picked this title for our book club based off of other recommendations but I’m now hooked on the series!",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Detective Cho is a great character!! I loved her and her roommate’s friendship Great who done it!! Looking forward to the next",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "1737646390"
},
{
    "title": "This book!",
    "rating": "5.0 out of 5 stars",
    "content": "I had high hopes going into this book after seeing so many reviews and I am happy to report it paid off! I couldn’t put this book down! Finished in 24 hours!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I took this book with me on my honeymoon in Fiji. I wanted to see what would happen next. Luckily for me, we had a beautiful place to read. This book was very easy to read, and got me hooked quick. Even my husband was wanting to know what was happening in the story. I enjoyed Hazel Cho and the other characters. I’m looking forward to reading the next book in the Hazel series, The Red Letter.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "1737646390"
},
{
    "title": "I loved this 📖",
    "rating": "5.0 out of 5 stars",
    "content": "Page turner with a twist ending. Definitely keeps you wondering. Easy read with a who dunnit approach…..you will keep guessing up to the end.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was looking for a few books to read this summer, saw this one and had low ball expectations for it, to be honest.  I was definitely proven wrong!  The writer kept you engaged the whole time, the characters were all interesting and I didnt predict the ending, which was refreshing.  My only disappointment is that I went to order another book by this author, but it wont be released until Feb 2025!",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "1737646390"
},
{
    "title": "Captivating read",
    "rating": "5.0 out of 5 stars",
    "content": "Great book! Finished in a day, I couldn't put it down. Finally a great book from start to finish.  I highly recommend this book! Thumbs up to the author!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed the plot of this book and the build-up. The ending caught me by surprise. Truly enjoyed! I was engaged from the beginning.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "1737646390"
},
{
    "title": "Very well written",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed reading this book! It had all the twist and turns I enjoy. I recommend this book to anyone who loves thrillers",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m always amazed to find another excellent author just by happenstance. I will be reading everything she has written. Such a good book and a great beginning to a series I plan on reading.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "1737646390"
},
{
    "title": "Great book!",
    "rating": "4.0 out of 5 stars",
    "content": "This story takes so many turns. Absolutely worth the read. No typos. Great character building. Impressive plot and scene detail. Great job!",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Didn’t know what to expect and had a hard time guessing who was the bad guy. I liked that for once there was an Asian lead.",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "1737646390"
},
{
    "title": "Great read",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed this book.  Some profound parts that I highlighted.  Grabbing the second book now!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wasn’t happy with the opening chapter but the book went on to build interesting and entertaining characters while telling a good story. A great fiction read!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "1737646390"
},
{
    "title": "Great fiction read!",
    "rating": "5.0 out of 5 stars",
    "content": "I was engaged from the first page. Strong female lead PI character & great story! Looking forward to more by this author.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Definitely a must read , I read it in one day.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "1737646390"
},
{
    "title": "Great characters",
    "rating": "5.0 out of 5 stars",
    "content": "The plot twist was *chefs kiss* ..",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Can't wait to read the next book .",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "1737646390"
},
{
    "title": "Really great read",
    "rating": "4.0 out of 5 stars",
    "content": "I really enjoyed this book, I was a PI with Hazel but I was wrong. Lol",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I could not put this book down!",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "1737646390"
},
{
    "title": "Great Read",
    "rating": "5.0 out of 5 stars",
    "content": "Can't wait for Book 2!",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "For me this is a page turner, loved the story and the ending, definitely looking forward to reading the second book.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "1737646390"
},
{
    "title": "Great read.",
    "rating": "5.0 out of 5 stars",
    "content": "Definitely a page turner! Will be looking into other books by this author.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Starts out good but middle is a longish slow burn but by the time its towards the ending it had me shook i did not expect it and it was delightful… mostly lol",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "1737646390"
},
{
    "title": "A little bit of a slow burner",
    "rating": "4.0 out of 5 stars",
    "content": "I thought it was a very interesting story but I didn’t love the writing style. Too detailed and slow paced for me. However, I thought the plot and characters were very good",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a really good read from start to finish. It was mysterious and had me guessing what was about to happen next!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "1737646390"
},
{
    "title": "Enjoyed the plot but not the writing",
    "rating": "5.0 out of 5 stars",
    "content": "I’m looking forward to the next one! This book was amazing! I never saw it coming! I love mystery books!",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s after 10:00 and past my bedtime.  I just finished this roller coaster ride and am now coming back down to earth.  The story flowed in normal time without flashbacks, which on occasion can be distracting.  Hazel is formidable and able to get past her hang  ups to do what is necessary to get through a difficult situation . Can’t wait for the follow up in 2025.  I’m ordering it now.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "1737646390"
},
{
    "title": "Great read!",
    "rating": "5.0 out of 5 stars",
    "content": "Recommended",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wow, this was SUCH a good book! I started reading it after finishing a series and was still getting over the sadness of finishing the last series... this IMMEDIATELY captivated me and I was sucked right into Hazel's world and wondering what was going to happen next! I kept trying to predict what was going to happen, to read what clues might lie between the lines of the words I was reading, but it was unexpected turn after unexpected turn!! VERY good read - I wish I had more books just like this in my library. Already purchased the pre-order for the second book!",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "1737646390"
},
{
    "title": "Mystery Books",
    "rating": "5.0 out of 5 stars",
    "content": "I bought cause it just popped up and I was like why not.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is:",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "1737646390"
},
{
    "title": "great page turner",
    "rating": "4.0 out of 5 stars",
    "content": "Fun story with a twisted and satisfying ending. I had a hard time putting it down even though some of the plot was a bit predictable.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book.  Great story. Could not put it down. “Just one more chapter” nope had to finish it.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "1737646390"
},
{
    "title": "Now one of my favorite authors.",
    "rating": "5.0 out of 5 stars",
    "content": "Griping.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Full of suspense",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "1737646390"
},
{
    "title": "Page turner",
    "rating": "5.0 out of 5 stars",
    "content": "Story is a page turner and well written.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You won't regret reading.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "1737646390"
},
{
    "title": "Phenomenal!",
    "rating": "4.0 out of 5 stars",
    "content": "Will be reading more from this author.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One of the best books I have read in a long time! It kept my interest and the twist at the end was not what I was expecting! Definitely add it to your reading list!",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "1737646390"
},
{
    "title": "Excellent",
    "rating": "5.0 out of 5 stars",
    "content": "The book was great!  Pulled you in and one you couldn’t put down!",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "1737646390"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love this book! Couldn’t put it down!",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "1737646390"
},
]