[
{
    "name": "  One Italian Summer: A Novel ",
    "stars": [
        "44%",
        "33%",
        "18%",
        "4%",
        "1%"
    ],
    "pid": "1982166800",
    "ratings": "15,313 ratings",
    "other_info": {},
    "discount_price": "$ 9.75",
    "normal_price": "$17.00",
    "about_this_item": []
},
{
    "title": "More than just a memory",
    "rating": "3.0 out of 5 stars",
    "content": "What if you could relive the life of another person? Katy is so distraught over losing her mother that her mind allows her to relive her mothers dream trip. Rebecca Serle has a way with time travel! The what ifs that we wonder about are played out in her books. Characters are believable but the author fails to smoothly blend the two stories into a competent plot. If you enjoy exploring the past you never knew about, you'll enjoy this one.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Happy Pub Day!",
    "post_time": "Reviewed in the United States on March 1, 2022",
    "pid": "1982166800"
},
{
    "title": "A must read of 2022",
    "rating": "4.0 out of 5 stars",
    "content": "One Italian Summer has been my favorite read of 2022 thus far. This story will whisk you away to Italy and is sure to capture your heart. It’s a book about living your most authentic life, self discovery, and taking chances. I’m so grateful for the opportunity to have read this one early. I hope you enjoy it as much as I did! It’s now available anywhere you purchase books. It’s also a Book of the Month Option for March. Below is my original review.",
    "post_time": "Reviewed in the United States on July 9, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "•",
    "post_time": "Reviewed in the United States on June 30, 2023",
    "pid": "1982166800"
},
{
    "title": "My Mother, Myself",
    "rating": "5.0 out of 5 stars",
    "content": "You guys…this book hit home for me. First off thank you so much to Atria books for giving me the opportunity to read and review this book. This was my first ARC and it did not disappoint.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "•",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "1982166800"
},
{
    "title": "Four stars for the story & author.....one star for the publisher",
    "rating": "2.0 out of 5 stars",
    "content": "At the heels of her mother’s death, Katy Silver  takes a summer trip to Italy. A trip she was supposed to go on with her mother. Katy decides to leave everything behind and take the trip solo. Once she arrives she will discover more about herself in 2 weeks, than in her entire lifetime.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "•",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "1982166800"
},
{
    "title": "what a beautiful reminder and gift",
    "rating": "2.0 out of 5 stars",
    "content": "I related to both female characters Katy and Carol. While at very different places in their life, I felt parallels between their reality and my own. Katy and Carol are complex characters who are both at a crossroads in their life. These women didn’t always make the best decisions, but they are human after all. If you have ever questioned whether you are on the right path in life I think you will relate to this story. I don’t want to share too much more with risk of giving away spoilers.",
    "post_time": "Reviewed in the United States on April 18, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "•",
    "post_time": "Reviewed in the United States on August 10, 2023",
    "pid": "1982166800"
},
{
    "title": "Beautiful story that takes you away.",
    "rating": "5.0 out of 5 stars",
    "content": "I picked this book because I was going to my friends wedding on the Amalfi coast. I heard about this book from a podcast episode of What Should I Read Next and they did a book flight and this was one for Italy. While my intention was to read it there, I was to busy experiencing my first trip to Europe. I started this book on the way home and boy was it the right book at the right time. It was great to be taken back to the place I just got to visit. While we didn't stay in Positano, we got to visit it a couple times on our trip and did and saw a lot of what was described in this book. Also, while it wasn't the loss of my mom, my family lost a very close friend and this book does a beautiful job of capturing what it means to find yourself again after loss or even just your day to day life. Sometimes it feels like you wake up and realize wait what is happening and where did the time go and this book reminds you that it's important to not lose yourself in your life. And in know it might be cliche, but Italy and the Amalfi Coast is magical and has this was of taking you out of your life and taking you to another time all the while reminding you to stay present. While this book may not be for everyone, it was the perfect book at the perfect time for me.",
    "post_time": "Reviewed in the United States on September 19, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this book! I did the audiobook but bought this for my daughter because I loved it so much.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "1982166800"
},
{
    "title": "Great book!",
    "rating": "5.0 out of 5 stars",
    "content": "Rebecca Serle writes books that stick with me. In Five Years is one that I will never forget, and now One Italian Summer is another. Also, I now want to drop everything and go to Positano immediately.",
    "post_time": "Reviewed in the United States on October 26, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This novel makes you feel like you are in Italy, which is one of the things I love most about it. I imagined myself there with sun kissed skin, eating all the pasta, and drinking all the wine. I could also feel Katy’s grief over losing her mother. It made me think about how lost I will probably feel when I lose mine someday.",
    "post_time": "Reviewed in the United States on April 27, 2022",
    "pid": "1982166800"
},
{
    "title": "Rebecca Serle Does It Again",
    "rating": "4.0 out of 5 stars",
    "content": "The best stories allow you to lose yourself in them. This one, as quick of a read it was, did just that for me. I wanted to linger on every page, in every scene.",
    "post_time": "Reviewed in the United States on December 14, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Katy's mom is her best friend, and when she dies Katy feels completely lost and alone. Although she's married, she believes her mom was the love of her life and doesn't know how to live without her. She decides to take the trip to the Amalfi Coast they had planned to take together and when she's there, she runs into her 30 year old mother. They travel around Positano together and she learns about her mother's life before she was a mother. She also learns about herself.",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "1982166800"
},
{
    "title": "absolutely amazing",
    "rating": "3.0 out of 5 stars",
    "content": "I am such a big Rebecca Serle fan. I love how she writes about love and how it doesn't just exist in romantic relationships.",
    "post_time": "Reviewed in the United States on July 6, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This one did not disappoint. I am dreaming of visiting Positano. This book was so beautiful and the ending left me crying. I just can't give it 5 stars because we were never really left with a reason of how Katy saw her mother in Italy",
    "post_time": "Reviewed in the United States on September 1, 2022",
    "pid": "1982166800"
},
{
    "title": "A nice, summer story",
    "rating": "5.0 out of 5 stars",
    "content": "4.5 stars",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "For the most part, I enjoyed this book. I had mixed feelings about Katy as a character, but thought the storyline was interesting. I especially liked the scenery descriptions of Italy; and all the food and drinks mentioned, of course.",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "1982166800"
},
{
    "title": "Traveling, Timeless Traveling",
    "rating": "4.0 out of 5 stars",
    "content": "****Perhaps, what we most forget about loss and grief is love. The greater the love, the greater the grief. And when a daughter loses her mother, a mother who has been her best friend, the grief is so great that it creates a chasm, a void that threatens to suck all love, all her life, all that has defined her including her marriage. Fortunately, she chooses to travel to Italy and complete the trip she and her mother had been planning before her illness and inevitable demise. And there in Italy, she begins to experience life again, to reawaken and realize truths about her mother, about herself, and about her choices.",
    "post_time": "Reviewed in the United States on August 23, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The Amalfi coast, and the town of Positano in particular, provide the beauty and joyful spirit a grieving woman needs to move forward and embrace life on her own terms. Surprising characters and unexpected twists deepen the emotional tug on the reader’s heartstrings. This tale will definitely put Positano on your Bucket List.",
    "post_time": "Reviewed in the United States on August 6, 2023",
    "pid": "1982166800"
},
{
    "title": "A Touch of Magic in Italy",
    "rating": "4.0 out of 5 stars",
    "content": "I detest magical realism in stories and never would have bought this book if I had know it was a weird combination of time traveling magic. I also could do without the “love” interest of the main character and, without giving away any spoilers, I found that part unnecessary. Now let’s talk about what the author does well: describe Italy in such a way that I was obsessively googling images of the hotel, restaurants, hikes, and coastline for days. It is a true escapist novel and for that I give it a significant bump in rating. I would read more by this author because she is talented at really setting the scene.",
    "post_time": "Reviewed in the United States on August 30, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book made me feel that I was almost back in Positano, one of the remarkable fairy tale towns on the Amalfi coast. I could almost feel the sun & the water spray, hear the natives chatting, smell the heady flowers that bloom everywhere, seemingly right out of the stone. And the food! The seductive, delightful, almost decadent food! The relationship between Katy and her friend, Carol, adds such deep emotion & passion that the reader knows there's more happening than what is seen on the surface. Like Italy itself,it's layered, and peeling them back reveals histories that creates truth.",
    "post_time": "Reviewed in the United States on August 16, 2023",
    "pid": "1982166800"
},
{
    "title": "3.5 stars. Good writing. Kind of weird storyline",
    "rating": "5.0 out of 5 stars",
    "content": "Especially if you’re going to Italy, this book is a must read! My friend recommended it to me and it was so descriptive and such a great story. When I was in Positano, I happened to walk past the hotel where a lot of the story took place. It was like a movie scene! It’s so well written. I loved it!",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was a refreshing change to books I’ve been reading recently. The imagery of beautiful Italy makes me want to plan a trip. The story is fun and thought provoking. I liked Katy and enjoyed her self exploration.",
    "post_time": "Reviewed in the United States on August 3, 2023",
    "pid": "1982166800"
},
{
    "title": "Love, life, Italy",
    "rating": "5.0 out of 5 stars",
    "content": "looks great. so glad I added to my collection",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I haven’t finished the book yet but if I’m crying on page 2 and I don’t even have a vested interest in these characters yet then the book has to be good.",
    "post_time": "Reviewed in the United States on March 19, 2024",
    "pid": "1982166800"
},
{
    "title": "Read this book!",
    "rating": "4.0 out of 5 stars",
    "content": "This book was different.  So far fetched!  But I kept reading it.  Not a fan for sure.",
    "post_time": "Reviewed in the United States on August 31, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am usually not a reader but Positano is one of my favorite places in the world and after randomly coming across this book… I knew I needed to read it. I am also in the middle of planning a trip back to Italy for the end of the summer and felt that this book would inspire me.. it obviously did! This novel brought me back to Positano with the restaurants I ate at while vacationing and also the nearby places of Naples, Capri, Sorrento and etc. I loved the storyline but I really enjoyed Katy's story to self-discovery and her new perspective on the world. This was such an easy read and I never wanted to put the book down. Thank you for a beautiful story.",
    "post_time": "Reviewed in the United States on June 29, 2022",
    "pid": "1982166800"
},
{
    "title": "heart warming story of a young woman coming to terms with grief, life, love and loss",
    "rating": "4.0 out of 5 stars",
    "content": "Gorgeous setting in Positano Italy, personal touches make the story come alive - you become surrounded by Positano, Capri, Naples, juxtaposition of past and present",
    "post_time": "Reviewed in the United States on August 12, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Everything went so slow and when the book hit the climax, it climaxed in like two pages",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "1982166800"
},
{
    "title": "Not what i expected",
    "rating": "4.0 out of 5 stars",
    "content": "Item delivered intact and on time.  It is exactly as described by the seller and what I was looking for.  Thank you",
    "post_time": "Reviewed in the United States on August 6, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My granddaughter suggested this book after finding out I was going to Italy later this year.  It’s a delightful book and a fun read.",
    "post_time": "Reviewed in the United States on March 26, 2024",
    "pid": "1982166800"
},
{
    "title": "Item Received",
    "rating": "5.0 out of 5 stars",
    "content": "It was a fun and easy read.  Relatable in many ways for me.",
    "post_time": "Reviewed in the United States on May 2, 2024",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Brilliantly written story about a woman who loses her mother, doubts her marriage, and spends a summer in an Italian coastal town looking for answers.  I couldn't put it down.",
    "post_time": "Reviewed in the United States on February 14, 2024",
    "pid": "1982166800"
},
{
    "title": "One Italian Summer",
    "rating": "4.0 out of 5 stars",
    "content": "This book was a get away from current life for characters and the reader. The setting was amazing and had me contemplating my future trips. The mother daughter relationship is complicated and this book details it well. We don’t often really know our parents, and when we realize that we wish we knew - they are gone. My advice is to appreciation your family and tell them how you feel! Ask questions and make memories while you have time.",
    "post_time": "Reviewed in the United States on July 9, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Extremely well-written.  Incredible descriptions of Italian locales, food, clothing, and friends.  I just couldn't figure out the time warp that got me to Carol and then back home.  Gave the book to my full-blooded Italian wife who raved about the location and food, etc. but also asked, \"but how did Katy get to Carol and back again?\"  So we let our daughter read it who was also quizzical with how this all worked.  So my advice to you is to read and enjoy the book; just don't try to figure out the obvious.  After all, when a princess kisses a frog and it turns into a prince, we just smile and say. \"What a great ending.\"  Do the same with \"One Italian Summer.\"",
    "post_time": "Reviewed in the United States on August 3, 2022",
    "pid": "1982166800"
},
{
    "title": "Easy and fun read - relatable",
    "rating": "3.0 out of 5 stars",
    "content": "I could never quite figure out what was going on in real time, dream, fantasy, wishful thinking - and the connections between characters. Nice descriptions of Positano and the Amalfi Coast, but strange storyline. Not a page turner that grabbed my interest. I love all things Italy, so I kept reading simply for that and hoping the storyline would come together and make sense.",
    "post_time": "Reviewed in the United States on September 11, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a wonderful book.  Recommend!!",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "1982166800"
},
{
    "title": "realistic path that grief tends to take with a bit of magic",
    "rating": "4.0 out of 5 stars",
    "content": "A realistic path that grief tends to take with a bit of magic those of us who have lost a parent wish for set in a beautiful Italian setting.  Just enough mystery that keeps it a page turner and in return a fast read.",
    "post_time": "Reviewed in the United States on March 7, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’m rating this a 4 in spite of its flaws. I read most of it in one sitting because I really wanted to see what happened next. The premise was intriguing and for awhile I wasn’t sure if this was time travel or a case of mistaken identity.  As with time travel plots, some things do not add up.",
    "post_time": "Reviewed in the United States on March 19, 2022",
    "pid": "1982166800"
},
{
    "title": "Italy is the star of this story",
    "rating": "3.0 out of 5 stars",
    "content": "I liked the characters, the romance was interesting, and the Positano setting spectacular. Italy is really the main character in this novel. I would recommend for that alone.",
    "post_time": "Reviewed in the United States on September 11, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I thought this book was about something else, however I read it nonetheless. I found the characters annoying (Katy especially) I get what the author intended with this book and I understand where the book was going but I just couldn't get past that. It felt rushed and like too much happened too fast.",
    "post_time": "Reviewed in the United States on May 27, 2023",
    "pid": "1982166800"
},
{
    "title": "Not for me.",
    "rating": "5.0 out of 5 stars",
    "content": "I just didn't really like it.",
    "post_time": "Reviewed in the United States on March 19, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered this book as my first *beach* read of the summer. It never made it to the beach, I read it in one day. I haven’t had a book capture my attention and hold it like that in a really long time. Rebecca Serle does an amazing job of explaining the love and complexities of a mother-daughter relationship. And her wonderful, picturesque descriptions of Positano and the Amalfi coast made it feel like a beautiful vacation.",
    "post_time": "Reviewed in the United States on December 10, 2023",
    "pid": "1982166800"
},
{
    "title": "Loved this book!",
    "rating": "5.0 out of 5 stars",
    "content": "My mother passed away on New Years Eve and I'm pretty sure she arranged, from her new home in heaven, to make sure I read this beautiful book. She took me on my first trip to Italy when I was in college and she knew that it became my favorite place on earth.  And, she read all of my books (on how to find and be love and my Hot Chocolate For The Mystical Soul series) so she knows that reading anything about mystical, magical occurrences wrapped in delicious food and a love story is a formula for bliss for me.  Reading this filled me up on every level. Yummy, yummy, yummy.",
    "post_time": "Reviewed in the United States on July 19, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is super cute.  It is a light, fun, easy read.  Perfect for a summer read and if you are on a trip.  This book makes me want to go to Italy, haha!",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "1982166800"
},
{
    "title": "A nourishing read for the stomach, soul and spirit",
    "rating": "5.0 out of 5 stars",
    "content": "This is such a charming and lovely read. I had been hearing a lot about it, and though the description made me think it might be gimmicky, I went ahead and purchased during a promo. Somehow the gimmick works, and I fell in love with Katy and her mother. And the staff at Hotel Poseidon! The settings came alive too, and I wanted to eat all the food. I read it in less than 24 hours and was swept away by the characters and the setting. Kudos too to the gorgeous jacket design, especially the cover illustration. Loved, loved, loved this.",
    "post_time": "Reviewed in the United States on July 30, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy read, great book. Don’t care for the ending.",
    "post_time": "Reviewed in the United States on July 21, 2023",
    "pid": "1982166800"
},
{
    "title": "I felt like this was my journey 🫶",
    "rating": "5.0 out of 5 stars",
    "content": "This book is now one of my top favorite books of all times. I have that deep connection with my mom as well and can’t fathom a time without her here. This story hit home and how the journey and the friendship is there in the midst of her grief. Just beautifully written! ❤️❤️",
    "post_time": "Reviewed in the United States on September 14, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book was great. There are very few books that have actually played out like a movie in my head. I wanted to play this in the background while I work, but it's not a movie!",
    "post_time": "Reviewed in the United States on April 21, 2022",
    "pid": "1982166800"
},
{
    "title": "Like a movie playing in my mind",
    "rating": "5.0 out of 5 stars",
    "content": "I was a bit confused and turned off by the intensity of Katy's emotions in the beginning, but it made sense in the end. She needed to feel those emotions immensely in order to find herself.",
    "post_time": "Reviewed in the United States on July 17, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One Italian Summer is written beautifully. The story takes place in a magical place. Positano Italy. This story is filled with love, happiness, sadness, betrayal and a great deal of magic. You won’t be able to put it down. Page by page  makes you feel like you are right there with the characters feeling the wind in you hair and the salty sea on your skin. Makes you feel like you are in a different time and place. Highly recommend you buy a ticket to One Italian Summer you won’t want to leave.",
    "post_time": "Reviewed in the United States on July 23, 2022",
    "pid": "1982166800"
},
{
    "title": "A beautifully written book!",
    "rating": "5.0 out of 5 stars",
    "content": "I adored this book. The relationship between Katy and her mother. The choices we make. The memories of our life and how it makes us who we are. Ms. Serle brought all that to life in this book. The writing brings so many images of Positano and the characters all become beloved friends. This book is wonderful! Enjoy this book and the love and memories of family it brings while you read. I felt like received a warm hug when I finished. Thank you for the joy of reading this book Ms. Serle!",
    "post_time": "Reviewed in the United States on September 26, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Having recently lost my own mother, I had a highlighter out marking the passages that really hit my heart. This was a great book! I shared it with my daughter... now we are planning a trip to Italy together in 2025. Absolutely hit ALL the feelings.",
    "post_time": "Reviewed in the United States on October 24, 2023",
    "pid": "1982166800"
},
{
    "title": "So many memories…",
    "rating": "5.0 out of 5 stars",
    "content": "The journey we take after losing a parent and learning how to carry on.  If only we could all take this trip so our hearts and eyes could open more fully.  The trip in this story was beautiful.",
    "post_time": "Reviewed in the United States on August 5, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Such a well written book - I was absorbed from the very beginning. I thought it would end in a certain way (won’t say what for fear of it being a spoiler), but it didn’t. The ending was not what I expected at all and I was 100% okay with that.  I just finished this and am kinda sad I can t continue reading - I was truly transformed, as if I was in Italy with Carol and Katy. Definitely read this great book by Rebecca Serle!",
    "post_time": "Reviewed in the United States on April 7, 2022",
    "pid": "1982166800"
},
{
    "title": "Planning a vacation with my daughter",
    "rating": "3.0 out of 5 stars",
    "content": "The primary character (Katy) on this book was so off-putting. I couldn’t find much to like about her. She has this amazing mother on whom she depends for everything. While her mother is actually alive, she seems to have taken her for granted and learned nothing from her. Then she blames her mother (Carol) for not having taught her how to do the things Carol does so well.",
    "post_time": "Reviewed in the United States on August 15, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Katy isn’t passionate about anything. Not her job, her home or her husband. She isn’t really even passionate about her mother whom she claims to love so very much. She does let’s her mother take care of everything for her.",
    "post_time": "Reviewed in the United States on December 30, 2023",
    "pid": "1982166800"
},
{
    "title": "Keep some Kleenex nearby",
    "rating": "5.0 out of 5 stars",
    "content": "Having lost my mother a decade ago and still missing her profoundly, I found this book about a close mother-daughter relationship to be very touching. The descriptions of Italy were beautiful as well and the author really captured that footloose feeling of being on a true vacation. I probably could have done without the romance and just had the character hang out with awesome Carol (that's what I would have done had I been Katy). This is a good read for sure, but warning, don't read it around others as it will leave you in tears.",
    "post_time": "Reviewed in the United States on March 27, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wanted to pack everything and move to Italy after this book. I really enjoyed it - at first I didnt know the direction it was going but it turned out really good. It made no sense at all LOL but it's a book and I honestly I enjoyed how different it was. It was a book about healing and self discovery.",
    "post_time": "Reviewed in the United States on March 21, 2023",
    "pid": "1982166800"
},
{
    "title": "Refreshing and Simple",
    "rating": "4.0 out of 5 stars",
    "content": "Appreciating what you have in life isn’t always that easy.  Sometimes it takes loosing someone to truly know what they meant to you.  Perhaps this book is about taking a good look at yourself and making the most out of each day!",
    "post_time": "Reviewed in the United States on July 22, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Delivered in a timely manner and book was in great condition",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "1982166800"
},
{
    "title": "Katy and Carol",
    "rating": "5.0 out of 5 stars",
    "content": "This book is gripping, honest, vulnerable; you are truly transported to the Amalfi coast and experience every emotion the author conveys. The twist is smart, witty, and pulls at your heart strings throughout the entire journey. The perfect summer read, I’m glad I picked this up to kick off my summer reading list.",
    "post_time": "Reviewed in the United States on June 26, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I hesitated to read this, lost my Mom when I was 37. I am so glad I finally did. It is so beautifully written and so touching. So many of the the things Katy and her Mom said and did, were so similar to me and my Mom. I miss her so much! Lovely book!",
    "post_time": "Reviewed in the United States on April 14, 2023",
    "pid": "1982166800"
},
{
    "title": "Great source for used books",
    "rating": "5.0 out of 5 stars",
    "content": "I chose this for my book club.  This was a wonderful read!  I felt like I was in Italy.  Everyone of us enjoyed the storyline and toasted with wine to Rebecca Serle. 🍷",
    "post_time": "Reviewed in the United States on September 30, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Definitely worth reading. It transports you just for a short time. Loved it!",
    "post_time": "Reviewed in the United States on January 14, 2024",
    "pid": "1982166800"
},
{
    "title": "Transports you to Amalfi",
    "rating": "5.0 out of 5 stars",
    "content": "This was just so so good! At first, I had hesitations because her relationship with her mother was too much for me. I mean, who says the love of their life is their mother and not their significant other? But as the book went on, it just became more beautiful. 10/10 read.",
    "post_time": "Reviewed in the United States on May 27, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I really enjoyed the book.  I would have given it five stars but I felt that the use of the four letter word  that was used several times detracted from the book overall.  It just was not required to use them.  It was disappointing!",
    "post_time": "Reviewed in the United States on March 20, 2022",
    "pid": "1982166800"
},
{
    "title": "Absolutely beautiful",
    "rating": "5.0 out of 5 stars",
    "content": "This book forced me to come to grip with massive changes I made in my life and the melancholy that has occurred since. Death of parents, marriage and friendship will cause many to give up. This book spoke to me on so many levels.",
    "post_time": "Reviewed in the United States on April 6, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Thanks a d job well done.",
    "post_time": "Reviewed in the United States on March 22, 2022",
    "pid": "1982166800"
},
{
    "title": "Positano is Paradise, the book not quite",
    "rating": "5.0 out of 5 stars",
    "content": "PS Read my email about bookclub talk, purchased my book and then read 30%, before it was time watch the talk.  l enjoyed the  B and N Author's bookclub talk today.",
    "post_time": "Reviewed in the United States on September 17, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed this book because of the memories of my trip to Positano. I struggle with the seeing her mom back in time element but it’s not to say I didn’t enjoy the book. I found her clinging-ness to her mother when she was alive annoying.",
    "post_time": "Reviewed in the United States on October 23, 2023",
    "pid": "1982166800"
},
{
    "title": "beautiful setting, unusual story line",
    "rating": "5.0 out of 5 stars",
    "content": "First of all the descriptions of the area were stunning. They made me want to see it for myself ! The story was a tribute to all mothers . Overall a very enjoyable book .",
    "post_time": "Reviewed in the United States on July 9, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I liked the people in the book, the setting of the book, and the idea of the \"possibilities\". Would have loved to meet my mom when she was a girl.",
    "post_time": "Reviewed in the United States on September 7, 2023",
    "pid": "1982166800"
},
{
    "title": "grabbed my attention and kept it through the book. Couldn't put it down.",
    "rating": "1.0 out of 5 stars",
    "content": "I enjoyed the book very much. The author kept my interest and was hard to put down. She's very talented in her style of writing, (not to give anything away) going back and forth and super easy to follow. I would recommend this book for a great summer read.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I just finished this read and I am all over the place.",
    "post_time": "Reviewed in the United States on April 4, 2022",
    "pid": "1982166800"
},
{
    "title": "Great read!",
    "rating": "1.0 out of 5 stars",
    "content": "I like the idea behind the book but I didn’t like the execution. I think it is because and just did not connect with the main character Katy.",
    "post_time": "Reviewed in the United States on June 2, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I honestly am not a fan of Katy! I understand she is grieving and I know that people grieve in different ways.",
    "post_time": "Reviewed in the United States on October 21, 2023",
    "pid": "1982166800"
},
{
    "title": "Great book",
    "rating": "4.0 out of 5 stars",
    "content": "This was  a wonderful story. I just love a good happy ending. It is great for a summer beach read.",
    "post_time": "Reviewed in the United States on June 29, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Una excelente guía antes de viajar a nuestra segunda o tercera o yo no se cual lina de miel. Muy descriptivo. Hoy salimos rumbo a Positano",
    "post_time": "Reviewed in the United States on September 10, 2022",
    "pid": "1982166800"
},
{
    "title": "previa a viaje a Positano",
    "rating": "5.0 out of 5 stars",
    "content": "Picked this for my downtime read while in Italy and it was so perfect. I was with my father on my trip for our father daughter trip and I will say this book made me appreciate every second of our trip. With cherish forever 💖",
    "post_time": "Reviewed in the United States on July 6, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed the book very much. I am undergoing grueling chemo treatment for breast cancer right now. This story had such significance for me with regards to my only son. I’ve also had type 1 diabetes for 60 years so we both know our time together isn’t forever. My greatest fear is that he will be too consumed with grief that it blinds him to the beauty and joy in his life without me.",
    "post_time": "Reviewed in the United States on April 8, 2022",
    "pid": "1982166800"
},
{
    "title": "Such a great quick summer read,  even better while in Italy",
    "rating": "5.0 out of 5 stars",
    "content": "At first I couldn't get into it as time travel wasn't explained till later at which point,all made sense. it was a lovely read that made me want to book a trip to Positano .grab a copy you won't be sorry",
    "post_time": "Reviewed in the United States on August 1, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In Five Years was my first Rebecca Serle read. I was totally immersed from page one until the last page. How Rebecca weaves the past & present is fantastic & makes for a wonderful ride! Keep them coming Rebecca, I'm a fan for life! 💜",
    "post_time": "Reviewed in the United States on February 17, 2023",
    "pid": "1982166800"
},
{
    "title": "Touched my soul",
    "rating": "4.0 out of 5 stars",
    "content": "How does one cope with the loss of a mother? Katy travels to Italy to learn about her mother’s love, and actually finds herself.",
    "post_time": "Reviewed in the United States on August 12, 2022",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was an easy read that truly depicted a real mother/daughter bond, and showing the importance of discovering who you are independently.",
    "post_time": "Reviewed in the United States on August 17, 2022",
    "pid": "1982166800"
},
{
    "title": "Interesting book",
    "rating": "3.0 out of 5 stars",
    "content": "This book mad me want to book the trip! Definitely a cute quick summer read to meet your reading goal.",
    "post_time": "Reviewed in the United States on August 21, 2023",
    "pid": "1982166800"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good summer read. Love that the story was based on a real location. Made me want to take a trip immediately.",
    "post_time": "Reviewed in the United States on July 10, 2022",
    "pid": "1982166800"
},
]