[
{
    "name": "  The Dictionary of Lost Words: A Novel ",
    "stars": [
        "59%",
        "28%",
        "10%",
        "2%",
        "1%"
    ],
    "pid": "1984820745",
    "ratings": "32,175 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Loved it.",
    "rating": "5.0 out of 5 stars",
    "content": "Great historical fiction of a time and subject I knew nothing about.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you care about language, about words, you will love this book.  I thoroughly enjoyed this book and think most will.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "1984820745"
},
{
    "title": "Words",
    "rating": "5.0 out of 5 stars",
    "content": "Very interesting & an unusual topic.  Well",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Written.",
    "post_time": "Reviewed in the United States on January 9, 2024",
    "pid": "1984820745"
},
{
    "title": "We read for this months’ bookclub.",
    "rating": "5.0 out of 5 stars",
    "content": "The attention to detail is both a plus and a minus. Gave four stars because a good editing would have helped the pace. That said, I still enjoyed the book and how seamlessly the author incorporated facts into the lives of fictional characters. Esme’s journey is inspirational - enjoy the read.",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "If you like words, read this book. If you like the magic of scholarship, read this book. If you like the juxtaposition of life and work, of deep friendship and eternal love, of war and peace, read this book. It will give you more to think about than you can imagine. It will touch your soul.",
    "post_time": "Reviewed in the United States on March 28, 2024",
    "pid": "1984820745"
},
{
    "title": "Good read for historical fiction lovers",
    "rating": "5.0 out of 5 stars",
    "content": "To read",
    "post_time": "Reviewed in the United States on March 25, 2023",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "In one way or another, my life's work always involved words and how they could be best used.  Not once do I recall ever thinking about how the dictionaries I used came into existence.  That process is the heart of The Dictionary of Lost Worlds, by Pip Williams. This book starts slowly, back to a world without technology, spreadsheets, and even readily available telephones.  It is beautifully written with characters, some fictional and some historically documented.  She tells the story of Esme, who grew up in the creative center of the first Oxford Dictionary of the English Language.  Esme's life reflects the turbulent times in which she lived. She collected words from those around her, some which made it into the dictionary and many which did not. The New York Times review accurately characterized the view as \"slyly subversive.\"  Read this book and you will forever question why some words are acceptable and proper and others are not.  The reasons may surprise you.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "1984820745"
},
{
    "title": "Read this book.",
    "rating": "5.0 out of 5 stars",
    "content": "Nope, so disappointing. I get wrapped up in how fun the story about the words are and then creepy modern human interactions spoil the atmosphere and sense of time.  Coulda, woulda, shoulda filtered out the pulpy storylines.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I thoroughly enjoyed this book...the characters and their thoughts actions and commitment to their work was undoubtedly what kept me wanting more. I absolutely loved this book!!!",
    "post_time": "Reviewed in the United States on December 31, 2023",
    "pid": "1984820745"
},
{
    "title": "One of the most boring books I ever read.",
    "rating": "2.0 out of 5 stars",
    "content": "I had to read this for book club. I think the dictionary would have been more exciting to read. Sometimes you think the book is going somewhere and then nothing. If you like reading an entire book about words, pigeon holes and slips of paper than this is your read. I think this book is dull and boring and had good potential to be interesting and then it just wasn’t. Don’t waste your time.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Dictionary of Lost Words is an engrossing and poignant novel that  touches the heart of the reader. Each character is drawn in such a way as to feel fully real.  The reader is immersed in the details of what it took to complete the Oxford Dictionary while at the same time completely enveloped in the parallel enterprise of creating A Dictionary of Lost Words.  Esme is the character that we take into our hearts as she grows to become a self made scholar as well as all the interesting and endearing people who love and admire her.  There is the theme of the importance and power of words when they are defined and recorded for all time, and the equally important theme to illuminate the struggle for women to be seen and treated with respect.  A beautiful novel, all the more amazing in that it’s the author’s first.  I look forward to the next one.",
    "post_time": "Reviewed in the United States on February 10, 2023",
    "pid": "1984820745"
},
{
    "title": "Beautiful Novel",
    "rating": "5.0 out of 5 stars",
    "content": "Unparalleled: having no parallel or equal; exceptional.",
    "post_time": "Reviewed in the United States on November 20, 2022",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book covers a gap in history that is truly astounding. The concept (which is based on very real events and mostly real people) is so intriguing, and Pip has fastened it all together with such literary grace. I WILL SAY, that for the first half of the book I was considering giving it a 3 star rating. I liked the storyline but it was a bit slow paced for me. KEEP READING. It really picks up and by time you get to the end you will “get the morbs” (a definitions stolen from the book, which means you will be struck with melancholy) due to the beauty and truth of Esme’s story. So many times the endings of stories disappoint, but not this time. If you love a healthy dose of feminism, are intrigued by words, or just want a good story that will suck you in, then you should most certainly order this book.",
    "post_time": "Reviewed in the United States on February 21, 2023",
    "pid": "1984820745"
},
{
    "title": "Exceptional",
    "rating": "5.0 out of 5 stars",
    "content": "There are so many good things that can be said about this book, but the best might just be that, if you’re looking to fall into another world for awhile, and enjoy doing such a thing more when you know you have a trusted guide, trust Ms. Williams, and trust this book. The storyline is wonderful and creative, while staying true to its course. The characters, both real and imagined, are indistinguishable and fit as if they all actually lived in this time. The consciousness of the themes in the book is great, so much so that you as reader are given the chance to absorb those themes as if you newly discovered them, rather than being force fed the themes, all because the author curated them so well for you/us. And the writing is as thoughtful as the work that those who compiled the OED gave, but far more enjoyable to read:) Kudos.",
    "post_time": "Reviewed in the United States on August 18, 2023",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed the book. I had read the summary  enough times that I thought I had already read it when my book club this was our book. Glad I went back & actually read it. I knew putting together a dictionary would be no easy task but never really thought about how it was actually done. Also I knew the process was not short but never imagined it took that long. Of course the war didn't help. The gathering of words and printing them into the first dictionary is told from a woman's point of view in a man's world. Not only do you understand the way the dictionary came about but the surrounding events that had  an effect on it's coming to publication. I thought it an interesting read and would recommend it to friends.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "1984820745"
},
{
    "title": "A well crafted, deeply thoughtful book",
    "rating": "4.0 out of 5 stars",
    "content": "Couldn’t put it down.  Shared with several people.",
    "post_time": "Reviewed in the United States on December 16, 2023",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was a good read.  It makes you think about how the first dictionary was put together. It was an easy read. Slow to start, but informative.",
    "post_time": "Reviewed in the United States on October 8, 2023",
    "pid": "1984820745"
},
{
    "title": "Lost Words",
    "rating": "2.0 out of 5 stars",
    "content": "The reading of this book was sometimes slow, but that was what it required.  Slow down to understand it’s significance.",
    "post_time": "Reviewed in the United States on April 26, 2023",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I will never take a dictionary for granted again.  I now understand a bit of what it required and what a gift it has been all my life.",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "1984820745"
},
{
    "title": "Loss for Words",
    "rating": "5.0 out of 5 stars",
    "content": "I am at a loss on how to start my review (I usually stop at my star rating) 😊.",
    "post_time": "Reviewed in the United States on March 23, 2023",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As a young child the doctors told my mother that I had a speech developmental delay. Turns out that I was just overwhelmed by my older brothers speech and sometimes I still feel that way when too many people are talking I get quiet. It’s like there’s no room for my words when others can say it better or louder. That being said, I have always been fascinated by language and books.",
    "post_time": "Reviewed in the United States on February 24, 2024",
    "pid": "1984820745"
},
{
    "title": "extraordinary",
    "rating": "5.0 out of 5 stars",
    "content": "There are so many more layers to this book that I will be thinking about. Like the role that women had in our history. Thank you Pip for bringing to life of how the OED was created!",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful, insightful and unique. These are not often associated with stories, yet here they are hyperbole. This is a beautiful story of words and what they mean to people.",
    "post_time": "Reviewed in the United States on February 15, 2023",
    "pid": "1984820745"
},
{
    "title": "Unputdownable",
    "rating": "5.0 out of 5 stars",
    "content": "Amazing story telling of facts and fiction. Loved it. Hard to put it down. I never imagined that this book will be my friend and teacher for all the time I read it. Highly recommend it!",
    "post_time": "Reviewed in the United States on April 22, 2022",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "All of the words listed above describe this book which is primarily a story about the composition of the Oxford English Dictionary as experienced by the fictional protagonist. Words matter to each of us in different ways, our meanings slightly shaded by our experiences. Loss is such a word and rendered in the book through the experience of losing a parent, losing a slip of paper, losing one's virginity, losing perspective. The loss of a life, the loss of language, the loss of purpose.",
    "post_time": "Reviewed in the United States on March 18, 2024",
    "pid": "1984820745"
},
{
    "title": "Abide, endure, love, loss",
    "rating": "3.0 out of 5 stars",
    "content": "I cried at the last chapters for the loss of this book. It is beautiful in way few others are because it mirrors life as we experience it. Life comes unexpectedly brings love and loss when we are seldom prepared. But, we live, abide, and endure.",
    "post_time": "Reviewed in the United States on December 15, 2021",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Abashed - embarrassed and ashamed because of something that you have done. \"I was greatly abashed to realize I was quite wrong about this book.\"",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "1984820745"
},
{
    "title": "I almost put this book down. I'm so glad I didn't.",
    "rating": "4.0 out of 5 stars",
    "content": "Enchant - to fill with great delight; charm. \"The young protagonist surprised and enchanted me; I could see her clear as day underneath the sorting table studying fallen slips.\"",
    "post_time": "Reviewed in the United States on August 2, 2021",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As frustrating as certain formulaic situations can be in historical fiction books, this one surprised the heck out of me. I almost put it down due to a certain challenge the protagonist has to deal with near the halfway mark, just due to personal experiences. But oh my goodness, I'm so glad I gave it  chance and finished it. Essy, Lizzie, Ditte, Mabel, Tilde, all of these women will stay with me for life.",
    "post_time": "Reviewed in the United States on July 27, 2021",
    "pid": "1984820745"
},
{
    "title": "Slow start but worth it",
    "rating": "4.0 out of 5 stars",
    "content": "It took me awhile to get into this book. I’m typically not a fan of 1st person narrative. I felt removed from the story, in spite for the first person.  I’m glad I stuck with it. The premise was one I hadn’t seen before , nor ever considered. By the time I’d finished the book, I had to wipe away tears.  All humans deserve to be heard.",
    "post_time": "Reviewed in the United States on August 1, 2023",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "\"Dictionary of Lost Words\" delicately navigates through sensitive topics like women's rights, traditional gender roles, abortion, and adoption. Through its nuanced exploration, it amplifies voices often silenced. This meticulously crafted book is a poignant reminder of the power of language in shaping narratives and reclaiming lost stories. A compelling read that resonates long after the final page is turned.",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "1984820745"
},
{
    "title": "A compelling read.",
    "rating": "4.0 out of 5 stars",
    "content": "Good book. Interesting story line. Good character development and keeps you interested in their welfare.",
    "post_time": "Reviewed in the United States on December 22, 2023",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was recommended by a friend and was a delight to read. The main character is a woman lexicographer in England. The reader is drawn into her life when she is a child working alongside her father, one of the lexiographers responsible for creating the dictionary that determined which words would describe the English world. As a historical novel the work is laudable. The narrative is engaging with a sub-text that philosophical calls into question the early practice of letting only formally educated white men catalog which words were historically worth preserving and passing on into common usage. A sheer delight for the manner in which it uncovers and sheds light on how the words, and therefore the worlds, of women, the poor and the pedestrian among us, became distorted or lost (hence the dictionary of lost words). Oe of the best books of the decade, IMHO.",
    "post_time": "Reviewed in the United States on December 6, 2022",
    "pid": "1984820745"
},
{
    "title": "Good story line",
    "rating": "5.0 out of 5 stars",
    "content": "While this is a novel about words, I find myself at a loss for them to describe the beauty and achievement of this novel. And a novel it is; yet it feels more like a song, a blanket, a hug (“sekura”) from a long since deceased relative.",
    "post_time": "Reviewed in the United States on June 18, 2022",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I read it as I would a book, from cover to cover, and yet I felt enveloped, entranced, and steeped in its power until I had finished it. It was a book like no other I’ve read: it lingers still in my mind.",
    "post_time": "Reviewed in the United States on March 1, 2024",
    "pid": "1984820745"
},
{
    "title": "Amazing Book on Women and the History of Words in the West",
    "rating": "5.0 out of 5 stars",
    "content": "The idea of the voice of women being cast aside in a series of some of the most important books about history is a giant endeavor. Williams delivers with elegance and a sense of effortlessness. It may be one of the best books I’ve ever read.",
    "post_time": "Reviewed in the United States on January 3, 2024",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Esme will haunt a part of my mind forever; as a pivotal character, and a lost companion.",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "1984820745"
},
{
    "title": "A profound and masterful work.",
    "rating": "5.0 out of 5 stars",
    "content": "This is a shelf-keeper in my collection.",
    "post_time": "Reviewed in the United States on October 18, 2023",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My husband made fun of me for reading a book about words becoming a book but this has much more depth than that! It’s a great story of women’s rights and place in society and equality for all.",
    "post_time": "Reviewed in the United States on November 28, 2023",
    "pid": "1984820745"
},
{
    "title": "Wonderful!",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book. As a retired publisher, the focus on word choice, editing, typesetting, printing, & binding alone would have been enough. But this story about the painstaking efforts of both real & fictional editors and compilers was engrossing. The story encompassed a range of social and historic issues, from class and gender roles to the women's suffrage movement and WWI.",
    "post_time": "Reviewed in the United States on April 24, 2021",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Raised by her widowed father, Esme lives a sheltered childhood in Oxford, England, accompanying him to his work as a senior editor for the new Oxford English Dictionary. Words chosen for inclusion must be vetted, researched, and finally approved. The process is slow, and the story unfolds by years and sections of the alphabetical dictionary entries. As a child and later an assistant to the editorial team, Esme comes to realize that discarded words without literary attributions (or those deemed inappropriate by the men who make the final decisions) deserve recognition, and that most of them are commonly used by women.",
    "post_time": "Reviewed in the United States on March 2, 2023",
    "pid": "1984820745"
},
{
    "title": "What a beautiful story",
    "rating": "4.0 out of 5 stars",
    "content": "There are several love stories -- among dear friends, colleagues, family, and true love -- and heartaches, deftly written as Esme matures. Highly recommend this to anyone who enjoys a rich historical novel based on the esteemed reference dictionary. Who knew there might be such an interesting backstory?!",
    "post_time": "Reviewed in the United States on August 12, 2023",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It definitely moves at a slow pace and took me a few chapters to get into but once I knew the characters I really wanted to see how the ir journey went.",
    "post_time": "Reviewed in the United States on January 9, 2023",
    "pid": "1984820745"
},
{
    "title": "Deserves 4 1/2 stars",
    "rating": "5.0 out of 5 stars",
    "content": "This is a woman's journey in a time when women still didn't have much legal power and yet found a way to make a difference, starting small and eventually encompassing so much.",
    "post_time": "Reviewed in the United States on April 27, 2024",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A woman with a love for words and eventually finding herself within them.",
    "post_time": "Reviewed in the United States on October 19, 2023",
    "pid": "1984820745"
},
{
    "title": "Enjoyed it greatly",
    "rating": "4.0 out of 5 stars",
    "content": "It was much more emotional than I expected a book about the dictionary to be but being an avid reader I think I know first hand how amazing words put together in the right order can be.",
    "post_time": "Reviewed in the United States on January 30, 2023",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Highly recommend this book.",
    "post_time": "Reviewed in the United States on November 13, 2022",
    "pid": "1984820745"
},
{
    "title": "Great Read!",
    "rating": "3.0 out of 5 stars",
    "content": "Wonderful book. Beautifully researched and written. The end was a bit too abrupt for me. But the final resolution was heartwarming. I strongly recommend this book and believe you will enjoy reading it.",
    "post_time": "Reviewed in the United States on January 23, 2022",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "*The Dictionary of Lost Words* is lovely.",
    "post_time": "Reviewed in the United States on February 25, 2024",
    "pid": "1984820745"
},
{
    "title": "different Kind of Story",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed this novel about the creation of the Oxford Dictionary of the English Language. It was a time consuming project, and the author places young women in the midst of the older gentlemen editors. They editors decided which words were worthy of inclusion and which were not. Esme, one of the young women, felt all words should be included so she compiled her own Dictionary of Lost Words. The book passes through times of women trying to get the vote and the 1st World War.  The best parts were about Esme’s quest to finds women”s words.  It was an enjoyable as well as thought-provoking read.",
    "post_time": "Reviewed in the United States on May 19, 2022",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The title immediately drew me in, and from the first word I was hooked. The bond of a father and daughter over words spoke to me. The fight for womens rights through the book weighed heavy on my heart yet made me proud to be a woman. This book takes the reader on a journey. As a journalist, words are beautiful things and this book makes you appreciate that.",
    "post_time": "Reviewed in the United States on July 9, 2022",
    "pid": "1984820745"
},
{
    "title": "A beautiful testament to words",
    "rating": "4.0 out of 5 stars",
    "content": "I appreciate the timeline of this book, how the author chose to write it. How they hung onto details of somethings and let others be what it was.",
    "post_time": "Reviewed in the United States on April 4, 2023",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I highly recommend this book because it’s an easy read. It’ll make you appreciate the dictionary a little more even if it took decades to get all the words where they should be.",
    "post_time": "Reviewed in the United States on November 11, 2022",
    "pid": "1984820745"
},
{
    "title": "A Heartbreakingly Beautiful Story",
    "rating": "5.0 out of 5 stars",
    "content": "Truly a beautiful book.",
    "post_time": "Reviewed in the United States on February 2, 2022",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Esme, Lizzie, Tilda, Gareth, Dr. Murray and all the other characters come to life in through Ms. Williams’ words. It is a story of heartbreak and triumph. At times, I found some of the reading a bit slow, but overall a wonderful story of the coming of age of the feminist movement through the hardships of the women and even the men who fought for equal (not equitable) rights.",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "1984820745"
},
{
    "title": "Moving and illuminating",
    "rating": "5.0 out of 5 stars",
    "content": "I just finished reading the book and I'm ready to start reading it again. That rarely happens for me. Of late I've read a number of period and historic novels with female protagonists.  They were well written, but none of them reached in and grabbed my heart as this one did.  It is a book about words, and those who love words, and the writing style is both poetic and succinct. Visual. Visceral.  Glorious use of words to tell both the history of the Oxford Dictionary and the complex life story of Esme.  What a wonderful film or limited series this would make, and I can imagine a sequel. Looking forward to more novels by Pip Williams,",
    "post_time": "Reviewed in the United States on November 15, 2022",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As with any major undertaking, intended to be thorough, there is success. And wanting. In this, the earlier edition of the OED failed to embrace a significant group of words, excluded because the defining terms were not sufficiently elastic to accommodate them. Ms Williams has given us splendid story of how many of those sidelined words were collected, using the same meticulous scrutiny and standard of the 'official' group.",
    "post_time": "Reviewed in the United States on April 23, 2021",
    "pid": "1984820745"
},
{
    "title": "This is an extraordinary book!",
    "rating": "5.0 out of 5 stars",
    "content": "I have, in my recent reading, settled upon a fascination with books, libraries...and now, the words...that are woven & crafted into books, populating libraries. This book is highly recommended: it is well-written, better: well-crafted. The characters are animated, dimensional. It provides a history of the words that far-too-often have been dismissed, for (in hindsight) spurious and negligent reasons. The book doesn't make any sort of reparation; it does, however, add texture, substance, to a hitherto unrecorded history. Well done, ma'am, well done!",
    "post_time": "Reviewed in the United States on September 14, 2021",
    "pid": "1984820745"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A bit too drawn out!",
    "post_time": "Reviewed in the United States on July 23, 2022",
    "pid": "1984820745"
},
]