[
{
    "name": "        Breville BJE200XL Juicer, 10\" x 10.5\" x 16\", Silver       ",
    "stars": [
        "77%",
        "12%",
        "5%",
        "3%",
        "3%"
    ],
    "pid": "B000MDHH06",
    "ratings": "12,463 ratings",
    "other_info": {
        "Brand": "Breville",
        "Color": "Silver",
        "Special Feature": "Cord Storage",
        "Product Dimensions": "9.84\"D x 9.06\"W x 15.75\"H",
        "Finish Type": "Glass,Silver,Steel"
    },
    "discount_price": "$ 79.95",
    "normal_price": "$5.00",
    "about_this_item": [
        " The Breville Juice Fountain Compact may be small but it is packed with power. The compact electric juicer features a 3 inch wide chute allowing you to juice whole fruits and vegetables and conveniently collects pulp within the footprint of the unit to conserve counter space  ",
        " UNIQUE EXTRACTION SYSTEM: The compact centrifugal juicers titanium reinforced disc and Italian-made micro mesh filter basket are made out of stainless steel and together are designed for optimum juice and nutrient extraction  ",
        " SHORT PREP TIME: The Breville juicer machines unique 3 inch extra wide chute feed allows you to juice whole fruits and vegetables without pre-cutting  ",
        " BUILT-IN FROTH SEPARATOR: Certain fruits or vegetables create froth when juiced; The juice jug features an integrated froth separator to pour more juice, less froth into the glass  ",
        " COMPACT DESIGN & CONVENIENT STORAGE: The Juice Fountains compact design makes it suitable to store in small spaces and the power cord wraps around under the base making storage neat and simple  ",
        " INCLUDED ACCESSORIES: 25 fl oz Juice Jug with Froth Separator and Cleaning Brush  ",
        " CAPACITY: 25 fl oz Juice Jug and 1.6 qt Pulp Container  ",
        " WARRANTY: 1 Year Limited Product Warranty; Power: 700 Watts; Voltage: 110 to 120 Volts  "
    ]
},
{
    "title": "Better than the JE98XL!",
    "rating": "5.0 out of 5 stars",
    "content": "I LOVE this juicer!  I wanted to get into juicing, wanting to get healthier, thinking I would like it, so I did my research on amazon and ultimately ended up with the BJE200XL Juice Fountain Compact due to reviews/price.  I was considering getting one of the higher end/more expensive Breville models, but ultimately decided on this one...and I am very happy that I did.  It is compact, it is powerful, and it is relatively easy to clean (which cannot be said for all juicers).  I basically just \"rinse\" my juicer parts rather than thoroughly wash them, as it gets all the vegetables off, and I'm always using it for the same purpose every time!  I read somewhere that a quality juicer should have a minimum of 400 Watt motor, so the 700 Watt motor on this juice fountain is more than adequate.",
    "post_time": "Reviewed in the United States on April 27, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My mother purchased the one step up Juice Fountain Plus JE98XL, and while I was home over Thanksgiving I gave it a try, and believe it or not I prefer my Compact Juice Fountain much more.  While the Juice Fountain Plus has 2 speeds, 150 more Watts, and a slightly larger vegetable waste capacity, it is significantly more difficult to clean with more pieces, it isn't as compact, and the pieces don't fit together as nicely...it leaked slightly!  It just doesn't seem as sound of a design as the Juice Fountain Compact, and wouldn't recommend it personally.",
    "post_time": "Reviewed in the United States on July 18, 2017",
    "pid": "B000MDHH06"
},
{
    "title": "Good enough",
    "rating": "4.0 out of 5 stars",
    "content": "I've used my machine well over 100 times by now, and my only complaints are that the container for the juice could be slightly larger...when I juice I like to make enough for now, and then 1 or 2 cups to store in the fridge for later or the following morning.  So if I'm making a large batch of juice, I may have to stop in the middle, empty the containers contents into the glass pitcher I'm going to store it in, and then continue, and add the second batch in the same pitcher for storage.  Not a huge deal, just an inconvenience.  Additionally there is a rubber nozzle piece on the spout where the juice flows from, and it fell of after my third or fourth time juicing, and I lost it.  It hasn't compromised the use of the machine at all, and won't stop me from highly recommending this machine.",
    "post_time": "Reviewed in the United States on April 28, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My goto power juice has been celery, cucumber, kale, carrot, green apple, beet, lemon, ginger.  It's delicious.",
    "post_time": "Reviewed in the United States on July 19, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Makes Juice and Noise",
    "rating": "5.0 out of 5 stars",
    "content": "I'm a juicing advocate from way back so I wanted to write as accurate a revue as possible. First this juicer is not compact. It's slightly smaller as my old LaLane. Just doesn't have the catch all container on the outside. It is very quite for a juicer. My old Champion could wake the dead. I'd compare it to my Omega. This jucier is easy to clean and assemble. Cleaning took me under 3 minutes. I timed it. Then less than 1 minute to put it back together. Timed that too. The catch all canal is narrow. I have small hands so I was able to scoop up the pulp but I can see why people would have a hard time. Just use a flexible spatula. The first run I juiced 1 medium red delicious, one large cucumber, 3 smaller celery stocks, and 3 thin carrots. That made 10 oz of juice. The catch all was 3/4 full. The pulp was on the wet side. I squeezed out 3 T. Out of 10 oz if that's too much juice to loose just get a bit of cheese cloth or use your hand. I make my dog's food so safe veg and fruit pulp go into it. The rest the soil gets. The foam, using the cup provided was 1/3\" high. After stiring it was about 1/8\". The juice is clean, no sludge. This jucier is a grater not a smusher. I've read several reviews saying graters will kill your juice because of temperature. Old research says enzymes are rendered inactive at 110 degrees. The latest I've read is 140. I didn't take the juice's temp but I do know it was quite cool. I'd say if the second it takes for the produce to run over the blades, if that heats your juice to even 110, you better unplug that machine quick. I do recommend this machine for single glasses of juice. Or if you're not an anal prefectionist. I've had 5 juicers. High end smushers to mid-priced graters, there's something wrong with all of them. The one I do want, that anyone giving you a hard time about their stellar jucier compaired to your little compact, you can throw this at them... a $2k hydrolic press. It presses the produce breaking the cell walls. If someone doesn't have that kind, they have no room to crisis. Which they shouldnt do anyway but there are too many juicing \"purists\" who need to get over themselves.",
    "post_time": "Reviewed in the United States on January 1, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I used this to make a variety of juices involving carrots, oranges, beets, kale, celery, cucumbers, lemons, apples, etc. I sometimes felt like if I didn't get the pushing tool in fast enough the juicer would throw large chunks of food out into the pulp bowl, which was somewhat disconcerting. I tried a couple of times to rejuice the pulp just in case I was missing out on something, but I wasn't, so the juicer was doing its job.",
    "post_time": "Reviewed in the United States on December 21, 2023",
    "pid": "B000MDHH06"
},
{
    "title": "Amazing Product, Outstanding Customer Service",
    "rating": "5.0 out of 5 stars",
    "content": "I did have a few items try to come flying back out at me. Leafy greens will work in this, but you have to bunch them up.",
    "post_time": "Reviewed in the United States on October 6, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It is somewhat noisy because the thing is spinning at something like 14,000 RPM. I'm not saying the noise was unbearable, but be mindful if you have anyone in your home sleeping nearby (especially in an apartment).",
    "post_time": "Reviewed in the United States on February 11, 2021",
    "pid": "B000MDHH06"
},
{
    "title": "Awesome juicer as long as you understand it's limits",
    "rating": "5.0 out of 5 stars",
    "content": "Cleanup is fairly easy. Not too many parts to get it clean. The juicer includes a spatula/brush tool that works perfectly for scraping out the pulp bowl. The brush is meant for the filter basket. I did find scrubbing that thing to be somewhat irritating because of how fine the mesh is, but it has to be to do its job correctly. I did not find putting the filter basket in the dishwasher to be helpful at all. If you use this regularly just rinse everything out thoroughly in hot water and that should be adequate. Don't let any of the pulp sit for long or else you will be using a washcloth every time. I would typically put it in the dishwasher once every few days to get a more thorough cleaning.",
    "post_time": "Reviewed in the United States on January 26, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The juice cup is adequate for a single person such as myself.",
    "post_time": "Reviewed in the United States on November 10, 2014",
    "pid": "B000MDHH06"
},
{
    "title": "Exactly what I expected",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first juicer. If you have done any research you will know that this is a great price for a serious juicer. I checked many stores both online and on location and its hard to find this kind of machine for this price. Some go for as high as $500! Way out of my price range for a juicer. Not sure what a $500 juicer does that this juicer doesnt do. Maybe you can stuff an entire apple tree into it without a hiccup. Who knows.",
    "post_time": "Reviewed in the United States on November 1, 2011",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Right out of the box the Breville Juicer is easily assembled and ready to whip up some fresh juice. It helps to read up on tips on how to prep the fruits and vegetable prior to juicing. Operation is simple. Turn it on and go. No fiddling with speeds or power level. The strength of the juicer has been sufficient to grind up everything I have put in there. Carrots, celery, and radish are easily handled. Not sure if there are any harder produce that I would be testing. So its power is perfect for what I use it for.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Perfect",
    "rating": "5.0 out of 5 stars",
    "content": "The sound level is moderate. I very much dislike loud appliances. All this technology and we cant make a quite vacuum cleaner! The juicer however isnt too loud at all. Comparable to a average blender. It is at its loudest when tackling carrots and such - but it makes such quick work that you dont even notice. The only gripe I have is the design of the spout and juicer cup. When pushed right up against base of the juicer the cup handle gets in the way of the ON/OFF switch. Unfortunately the cup only goes on one way. The cup lid design prevents you from facing it any other way.",
    "post_time": "Reviewed in the United States on August 24, 2007",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "One thing I strongly recommend to extend the life of the juicer is to clean it straight away after each use. Cleaning is a breeze. All the parts that get dirty come apart from the base. A quick run through the sink easily washes off the pulp. The hardest part is scrubbing off the mesh filter. This is made easier with the brush that comes with the juicer.",
    "post_time": "Reviewed in the United States on August 9, 2020",
    "pid": "B000MDHH06"
},
{
    "title": "WOW - Way better than expected - XLNT daily juicer",
    "rating": "5.0 out of 5 stars",
    "content": "Very happy with my purchase of my first juicer. Compared to the prices of others I strongly feel that the Breville BJE200XL is a great value for its capability.",
    "post_time": "Reviewed in the United States on June 28, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Perfect price for this amazing product.",
    "post_time": "Reviewed in the United States on January 14, 2015",
    "pid": "B000MDHH06"
},
{
    "title": "This thing is amazing - So much better than the other type of juicers!",
    "rating": "5.0 out of 5 stars",
    "content": "Love it and it really works great.",
    "post_time": "Reviewed in the United States on August 13, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I juice at least once a day as I primarily eat raw foods.",
    "post_time": "Reviewed in the United States on December 7, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Great first juicer!",
    "rating": "5.0 out of 5 stars",
    "content": "My Jack LaLane juicer finally wore out after 2.5 years of daily use. I was tempted to buy another - but I liked the way everything including the pulp catcher is all in one unit. So glad I got the Breville.",
    "post_time": "Reviewed in the United States on May 30, 2023",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This thing is POWERFUL, especially compared to \"Jack LaLanne\". It is so powerful I usually don't even use the pusher except to cover the top so your ceiling doesn't get covered with stuff. Other reviewers have mentioned that tendency. What wasn't mentioned is that the reason it does that is because the motor is so beefy that stuff will shoot straight up.",
    "post_time": "Reviewed in the United States on July 22, 2011",
    "pid": "B000MDHH06"
},
{
    "title": "A good juicer for the price",
    "rating": "4.0 out of 5 stars",
    "content": "We've used this juicer daily for over a month, juicing for up to 4 people.  It works well on carrots, beets, apples, etc. and works pretty well on greens.  Some tips:  immediately follow up greens with something juicy like apple or cucumber -- by which I mean push the greens down with something in the chute with it, it does help get more out of the greens.",
    "post_time": "Reviewed in the United States on July 31, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There are chunks of fruit/vegetable in the pulp, but the pulp is pretty dry for veggies & thicker than applesauce for apples/fruits.  You might want to send the pulp through twice.  I feed the pulp to my chickens, so they like the chunks, and I found I only got a tiny bit more juice out of the pulp.",
    "post_time": "Reviewed in the United States on June 9, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Compared to Jack LaLane",
    "rating": "5.0 out of 5 stars",
    "content": "You can make about 10 ounces of juice for up to 4 people before the pulp portion of the container is bursting at the seams and you must empty it out....depending on what you're juicing (we juice mostly vegetables.  Fruits will take up less room in the pulp container versus the liquid extracted.).  Keep glasses on hand to pour out the juice-catching container if you're juicing a lot of moist foods -- the foam will eventually escape forcing you to pour it out to continue.",
    "post_time": "Reviewed in the United States on December 12, 2019",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you clean it immediately after juicing, it cleans up pretty easily -- use, don't lose, the plastic brush they include.  It's a lifesaver for scrubbing the screen.  Our plastic is getting discolored inside (probably from abrasion with the cleaning tool), but that's OK with us.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Overall a Great Jucer",
    "rating": "5.0 out of 5 stars",
    "content": "If you want foamless, this isn't your juicer.  If you want perfect dry pulp you can start a campfire with, this isn't it.  If you want a juicer that's good, reliable, and affordable -- this is a very good choice.  If you want a starting juicer before a more expensive purchase later, this is a very good choice; you'll get to try out juicing.",
    "post_time": "Reviewed in the United States on July 11, 2023",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I've had a more expensive juicer before, one that produced nearly foamless juice, that easily let me put the pulp through twice, etc.  So I'm spoiled, and I still like this juicer.",
    "post_time": "Reviewed in the United States on December 7, 2009",
    "pid": "B000MDHH06"
},
{
    "title": "The best! 💚💚💚💚💚",
    "rating": "4.0 out of 5 stars",
    "content": "After watching and reading numerous reviews, I decided to buy the Breville juicer over the Jack LaLane (JLaL) juicer. I absolutely love my Breville! I loved it so much that when I went to visit my parents, I convinced them they, too, needed a juicer. Unfortunately, the JLaL was the only juicer available at the time. It was about $20 more than the Breville, so I decided it had to be a pretty good competitor. I do like the JLaL, however, I LOVE my Breville!",
    "post_time": "Reviewed in the United States on March 17, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Breville pros:",
    "post_time": "Reviewed in the United States on October 31, 2010",
    "pid": "B000MDHH06"
},
{
    "title": "I would highly recommend this powerful juicer!",
    "rating": "5.0 out of 5 stars",
    "content": "*The storage container is much bigger and more practical.  Since the collector is on the side of the JLaL, the pulp comes into the spinning part of the machine making it harder to clean and overall just messy.",
    "post_time": "Reviewed in the United States on December 29, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "*Easy to assemble with three parts.",
    "post_time": "Reviewed in the United States on December 14, 2017",
    "pid": "B000MDHH06"
},
]