[
{
    "name": "        Crocs Unisex-Adult Classic Clogs       ",
    "stars": [
        "87%",
        "8%",
        "3%",
        "1%",
        "2%"
    ],
    "pid": "B0014BYHGC",
    "ratings": "591,769 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "When I was a kid, I thought they were stupid",
    "rating": "5.0 out of 5 stars",
    "content": "When I was a kid, my parents made us all wear Crocs, and I thought they were stupid. Now that I'm an adult, I understand how truly awesome these are. The perfect shoe for a quick walk outside, or as an all-terrain shoe. I often wear them out because I might want to walk in a river or something, and they are perfect for whatever I want to do. Originally purchased to wear when I went fishing, but I've been wearing them more than any other shoe since.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "When ordering Crocs, always know they are supposed to fit a little \"big\". I ordered 1/2 size larger than my regular size so my heal isn't hanging over the edge. These are perfect! Now, keeping the white clean is a challenge.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Just what I ordered!",
    "rating": "5.0 out of 5 stars",
    "content": "I am absolutely thrilled with my new crocs! I was a bit skeptical at first, but these crocs have exceed my expectations in every way. The moment I put them on, I knew I had made the right choice. First of all, they are incredibly soft & comfortable. The material is like warm hug for my feet, & I can wear them for hours on end without any discomfort. The softness is not just limited to the insoles, but the entire shoe is flexible& gentle on my skin.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Not only are they comfortable, but  they are also pretty! I got the black ones, and they are add a pop of fun to my outfit. The design is sleek and modern, and I love how they come in a variety of color to match my mood & style. But what really impressed me is how durable they are. The material is easy to clean, and they dry quickly, making them perfect for any adventure. They are a game changer in comfort & style, I highly recommend them to anyone looking for a reliable & cozy footwear option.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "A Game Changer in Comfort & Style",
    "rating": "5.0 out of 5 stars",
    "content": "First time Crocs buyer and i can see why everyone loves them. Very comfortable and airy. Seems like one would slip out of them with the extra-wide soles but you do not. The nodules on the top of the sole help with traction and are not uncomfortable to step on. They are a little squeaky when walking around, but maybe they need to be broken in a little.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am generally a half size, and ordered a size up and have no complaints.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Great Casual and Comfortable Shoes",
    "rating": "5.0 out of 5 stars",
    "content": "i really like these pair but they were a bit big on me so i wont be wearing them yet, my size is 38 but they didnt have my size, other than that they are very stylish and cute",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This came even quicker than I expected.  It replaces a pair that had the heel strap come off.  What can I say?  It's crocs and if that's not what you expect you shouldn't buy it.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "very comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "I have always thought Crocs were hideous.  Everyone wore them, EVERYWHERE and I didn't get it at all. I've seen people in NYC walking around in Crocs (sometimes with socks um OK). I just didn't get it. I never would have thought of wearing them, ever! But as I've learned, from recently moving from a lifetime in the city to a very remote rural property that came with gorgeous landscaping and a beautiful natural lawn, that I am now tasked with keeping gorgeous (OMG!), that sneakers are not appropriate footwear for that type of work, not when you're kneeling in the dirt and walking in water. So, I gave in. I own Crocs now. I got the red pepper color because I still want to look cute even if I'm just gardening. That color certainly grabs your attention, I must let you know that they are a bright red. Like a real red pepper, red. Keep that in mind if you're looking for a subtle color.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The way they size them without 1/2 sizes threw me off, but I read that they run a bit larger. My feet are size 8.5 women, so I bought size 8 and they fit perfect. They are so comfortable!!",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "I'm never one to jump on trends, so I'm kind of late to the party, but they're nice",
    "rating": "4.0 out of 5 stars",
    "content": "They fit a little bit more snug than I liked but they are loosening up a little bit and the knobs on the inside of the shoe where your foot rests when they're brand new does kind of bother my feet. But they relax a little bit over time. They grab your socks if you wear with socks and it makes it hard to take these things off.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall I like them and would probably buy them again. They are quite comfortable.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Bought for my Mum",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect for my mother, she's ill and blind and these are super easy for her to put on, they don't fall off and they're safe for her to wear in the shower so she doesn't fall.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought these for my husband. He loves them. He said they are so comfortable. He likes the air on his feet because he always has to wear work shoes or boots. They are true to size.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Comfortable",
    "rating": "4.0 out of 5 stars",
    "content": "This is my first pair of crocs, and I am ready to buy more! Super lightweight and comfortable to wear for long periods. Allow my feet to breathe and stay cool in the summer heat.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Yes I am in fact a once upon a time Croc hater. And I'm not going to say I love the way they look because I don't. BUT they are highly convenient for soccer practices and quick runs to the store. This is now the third pair I've bought in a month since my kids and I wear the same size and fight over who gets to wear them :P",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Super light and comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "My crocs are my absolute favorite shoe. They’re so versatile and comfortable. The foot area is extremely roomy and the massaging nubs help keep your feet from hurting throughout your the day. They have fantastic traction so they’re great to wear at work. The material is both lightweight and durable. They have been beat up and still held up very well! I love the ability to add jibbitz and really show your personality. The first of many pairs!",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My kids both wear crocks and I always thought they were so ugly. I needed something over night for a trip to a water park so I ordered these fully expecting to return them. Boy was I wrong!",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Croc hater",
    "rating": "5.0 out of 5 stars",
    "content": "I wear these things everywhere. I don’t even care what I look like lol. They are clearly waterproof. The arch support is good. They are super durable. They feel warm once your feet are in them for a bit. Greta thickness and support.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I got black ones and I actually think they look cool now. After your feet get used to them for a day, they become so comfy.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Great Croc's fit perfectly",
    "rating": "5.0 out of 5 stars",
    "content": "Who doesn't love crocs. These are so great for people of all ages there are so many colors and options from a baby to senior. You can use the option for the back strap or slide it up and use it as sandals great product great gift",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I spend a lot of time in a wheelchair. I  am in the kitchen a lot  I would spin around and I was always banging my toes underneath the cabinets or under the dishwasher or the refrigerator and finally I found a pair of Crocs that would fit my foot and they have protected my toes every time I have them on. I went one size larger because my feet tend to swell and i will probably go two sizes larger because the one size up feels so good I think two sizes would be better!",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Crocks protect my toes",
    "rating": "5.0 out of 5 stars",
    "content": "I know, I thought these things were an eyesore too... but then I found my favorite color, and I told myself to try it. It's the best for around the house walking, and I rock them only in 4x4 mode. They are rad, and you get used to the little bumps quickly, and if you don't throw some socks on.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the 3rd pair of slides I have gotten from  Amazon.  I have worn the others out as I wear them almost every day.  I have one pair that has more paint on them than the dark blue color and I got them over 10 years ago. Very comfortable and durable.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Welcome to PlushTown",
    "rating": "5.0 out of 5 stars",
    "content": "Genuine Crocs, we got them at a great price and they were available when other stores were out. Shipping took longer than expected but it was Christmas time so we didn’t mind.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So these were my very first pair of crocs. Only purchased because I saw they were on sale. Oh my goodness how did I go my entire life without crocs?! So good with my plantar facitus-idk how to spell lol. Good size. Good style, good arch support. Very functional.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "3rd pair",
    "rating": "5.0 out of 5 stars",
    "content": "Bought these for my daughter as she is attending Veterinary school and with all the standing she does, she loves them.  The order arrived on time, promised and delivered.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great product the Classic Crocs !!! The most amazing was the delivery arriving sharp a day before!!! We are soooo happy that I am ordering another one different color!💙",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Perfect!",
    "rating": "5.0 out of 5 stars",
    "content": "\"I'm absolutely in love with these Crocs! They're incredibly comfortable and I appreciate the versatility of the two wear modes. I was surprised at how well they held up on a casual hike - no leg fatigue at all! I highly recommend this product.\"",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have always loved crocs, my crocs last for years  my old ones finally wore out so bought these same exact fit awesome durable great coloring. I did have to break them in for a day before the back strap fit the way I wanted but it finally did!",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Crocs are awesome",
    "rating": "5.0 out of 5 stars",
    "content": "I wear these around the house, at the beach and when on the boat. These are really comfortable. I suggest a slightly loose fit.  Definitely worth the money.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My dad asked me for a white crocs for his bday, he was very happy with this one,  he said are comfortable and match with all his outfits",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Classic and comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "I'M 65-year-old Man blue collar worker wear boots every day. Off work Weres my crocs when I enter the house. These things are the best 2nd pair I got.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought as a gift for my son. These are his go to shoes. The durability and appearance are exactly as stated in the purchase picture. He loves these Crocs.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "crocs reveiw",
    "rating": "5.0 out of 5 stars",
    "content": "Fantastic gift choice for anyone. Crocs are not only comfortable and easy to wear but also perfect for any man on your shopping list. They are perfect for outdoor activities, easy to keep clean, and durable with a thick sole. They can be worn two ways and help keep blisters from occurring.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wear these when I'm working near water. They are fantastic non-slip shoes. Also super easy to clean. Not the most stylish of shoes, but very useful nonetheless.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Go to Crocs",
    "rating": "5.0 out of 5 stars",
    "content": "I really like the pair of crocs that fit however the second pair was distinctly smaller. I wondered why they didn't fit so I took pictures and, voila! I sent the company these pictures and requested to be made whole by issuing the larger sized crocs. Waiting on response and will follow up.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The sizing is always consistent. Comfortable and helps his injured back due to the cushioning. I buy them for myself as well. Amazon has great prices on Crocs",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Men’s Crocs",
    "rating": "5.0 out of 5 stars",
    "content": "Love them wear them everyday, I work at Amazon so I'm on my feet 10 hrs a day I put these on right when I get to my car because I wear safety shoes all day at work these help so much after work and days off",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Crocs are notoriously sized wrong but I was able to go by a pair my 14 year old son already had. I measured his foot and, knowing that they run about 1 size big, I went with the size it suggested because I wanted him to have some room to grow. His foot measured at exactly a men’s size 10 which is his accurate size in shoes, BUT a size 10 in crocs fits like an 11. Now, he has just enough space in them that they’ll fit for at least a little while. If your foot is finished growing, I’d recommend sizing down 1 full size for a perfect fit.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Ugly and comfortable, just like me",
    "rating": "5.0 out of 5 stars",
    "content": "I've been making fun of these things and the people who wear them for a decade at least. Well now the payback is here and I have terrible neuropathy in my feet. I caved in and decided to give these a try after going through numerous other options. Yep, I wish they were better looking but they are incredibly comfortable. I wear them as house slippers now and will be buying more pairs if they last, which it seems like they will.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved how easy to slip on when gardening,watering my lawn or need something to skip on over Pilate socks. Easy to keep clean and a fun color",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "My daughter loved her crocs great price, true to size, very durable and comfortable can wear them with any out fit. Love the thickness on the bottom.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this for my husband. It's his first pair of crocs. He really likes them, the way they feel when he walks, east to clean and actually looked good on him. He wore them to the beach recently and had no problem with getting the sand and saltwater off. So far no blisters. Was a great buy.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Loved",
    "rating": "5.0 out of 5 stars",
    "content": "Bought these for my anti-cric husband for around the house. He wears the mess out of them now! They are very comfortable and keep his footing stable.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My daughter has always loved her crocs!!! She just needed a bigger size because her feet grew (; They are comfy for her and grip the ground so she doesn’t slip.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Their great!",
    "rating": "5.0 out of 5 stars",
    "content": "Have several pair in several colors. My son, husband and I wear them. Don’t buy the knock off brands Crocs are not that expensive and will last for years for everyday wear and tear! I bought my first pair 20 yrs ago and they are still in good condition and comfortable!",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought these for my 92 year mother.  She loves them. The soles help grip the floor as she uses her wheelchair to scoot around.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Croc Believer (lol)",
    "rating": "5.0 out of 5 stars",
    "content": "This is the second pair I have ordered for my teenager.  I do wish the buttons on the straps were sturdier.  He lives in them.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Finally caved and bought a pair.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Perfect fit",
    "rating": "5.0 out of 5 stars",
    "content": "Just like the in store purchase really nice easy to clean and really help my feet breath and have lasted for a while with me walking everywhere",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Yes everyone seems to wear crocs but not all are comfy. This definitely are. I wear them all the time. Not just for young people. I’m elderly and find walking in them great. Non slippery so I feel confident. Use them outside and all around house.  Great for the price. Will last a long time.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Comfy",
    "rating": "5.0 out of 5 stars",
    "content": "There is nothing better than the old classic pair of crocs. I have worn these since the early early 2000's before crocs offered anything else in their shoe line. These were my go to shoes for deployments overseas and travel.  For some reason I can buy a $120 or more shoe and they wear out in about 6 months. These last years for me and I don't know why. I tend to wear my crocs in the worst environments, such as to the beach, in rain, in mud, even doing heavy yard work.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "He wore a hole through the sole of #1 pair so after 4 years of steady wear, I got him a new pair. Great product for the price.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "My all time favorite.",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve noticed that all crocs run 1 side larger than what they advertised. I still wear them because the added room works well in the cooler months.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They were as expected. They are wonderful crocs made to last they a black solid color and the nice tbing is you can easily wash them too.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "#2 pair for my son",
    "rating": "5.0 out of 5 stars",
    "content": "I like the fact that they are very comfortable and they slide on and off with ease.  They also come in a variety of colors.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love Crocs. They are the only shoe I can walk in with comfort. These are the same size as my old, worn ones but fit tighter and a tad shorter. I'm assuming they will loosen up a bit with wear since they don't come in half sizes. Wish they did. Love the moon jelly color.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Feels great!!",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased the Bone colored crocs in M8/W10 ( I am a men's 8 and they are true to size if not a bit roomy). I love them, they are my outdoor crocs and I have another pair that I wear indoor as slippers. Throw these puppies in sport mode and you can do anything.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I got these for my grandpa and he has worn them for MONTHS. He loves them they are the only shoe he will ever wear lol",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Needed it badly lol",
    "rating": "5.0 out of 5 stars",
    "content": "Had the red one for years, i needed/wanted something new, so i went with the black ones. True to size, fits well and feels new omg",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These shoes are great for both indoor and outdoor activity. Great space for toes!  Not much support for ankle so would not use for long walks but perfect for gardening and running short errands. Very satisfied with this purchase and wear them often.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Great Toe Space",
    "rating": "5.0 out of 5 stars",
    "content": "So comfortable... got these for my son...he loves them!!! Super fast shipping I just ordered them and here they are!!!  Everyone in my house loves crocs!!!",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's a croc. It's comfy but ugly. Gets the job done so I can squeak across the house floors. I mean what else can be said?",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Super fast shipping!  Cant go wrong with Crocs!!",
    "rating": "5.0 out of 5 stars",
    "content": "I use these for going out shopping and to appointments. I love the easy on and off. I have difficulty getting regular shoes on and off.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Crocs are great for kids on the go. The quality is good, they are easy to get on and off, and they can personalize them.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Meets expections",
    "rating": "5.0 out of 5 stars",
    "content": "the size fits just right. my boyfriend has worn them basically 6/7 days for the past 9 months and they’re still in great condition. they’re also very comfortable to walk in (in sports mode for more athletic stuff), great for the beach and water sports too. versatility is 10/10. he also loves to mix and match with other colors. also they’re very easy to clean and go with pretty much any outfit!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had been waiting for the peachy color to come back in my size. As soon as I saw it in stock I bought them.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "CROCS",
    "rating": "5.0 out of 5 stars",
    "content": "They were a birthday gift for my son-in-law, so I haven't worn them.  He put them on after unwrapping. Said they are very comfortable.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love crocs I have 4 other pairs all size 7/9. I bought this black pair size 7/9 and they are so small! Tighter fit it’s so weird.  I spent $50, they were for the new school year so I didn’t open them right away and now I missed my window for exchange",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Right on trend and my son loves them",
    "rating": "5.0 out of 5 stars",
    "content": "This particular plastic is smooth to the touch and the color is spot on - similar to the white trend but not so stark. My middle school son really like them and says they are comfortable and not as stiff as other crocs he's worn.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was disappointed when my Crocs arrived,",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "I could have gone down a size",
    "rating": "5.0 out of 5 stars",
    "content": "Sometimes you need to go up a size which is what I have had to do in the past.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So I just ordered a 9 which is what I had been buying.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Perfect Everything",
    "rating": "5.0 out of 5 stars",
    "content": "Now these came 9 and I could have used an 8.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "But I have noticed that over the years that they have been made in different countries.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Exactly what I ordered.",
    "rating": "5.0 out of 5 stars",
    "content": "They are still good Quality.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They 👀 look the same.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Great shoe",
    "rating": "5.0 out of 5 stars",
    "content": "The weight is the same.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0014BYHGC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just the size was off a little for me.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0014BYHGC"
},
]