[
{
    "name": "        Oster Cordless Electric Wine Bottle Opener with Foil Cutter, FFP, One, Silver       ",
    "stars": [
        "74%",
        "12%",
        "5%",
        "3%",
        "6%"
    ],
    "pid": "B003YFI0O6",
    "ratings": "47,597 ratings",
    "other_info": {
        "Material": "Plastic",
        "Color": "Silver",
        "Finish Type": "Brushed",
        "Brand": "Oster",
        "Item Weight": "1 Pounds",
        "Product Dimensions": "14.96\"L x 5.51\"W",
        "Is Customizable": "No",
        "Manufacturer": "Oster",
        "UPC": "885447861472 793052437435 769194046934 034264439948",
        "Number of Items": "1"
    },
    "discount_price": "$ .",
    "normal_price": "$34.99",
    "about_this_item": [
        " Cordless electric bottle opener removes the cork in seconds  ",
        " Opens upto 30 bottles on a single charge(6 8 hours); Simple push button operation  ",
        " Foil cutter for easily removing seals; Comfortable soft grip handle  ",
        " Sleek, sophisticated design; Recharging base included; UL approved for 110-120 voltage  "
    ]
},
{
    "title": "LOVE IT!",
    "rating": "5.0 out of 5 stars",
    "content": "Great product! Been using for approximately a year now. Love it - highly recommend. Easy to use and convenient.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "When it worked it was fine.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Planned obsolescence!",
    "rating": "5.0 out of 5 stars",
    "content": "But after a year, it began to slow down.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just a bit at first, but dramatically soon after.",
    "post_time": "Reviewed in the United States on May 5, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Wine time",
    "rating": "3.0 out of 5 stars",
    "content": "Can only get half way thru now, so I've replaced it.",
    "post_time": "Reviewed in the United States on February 8, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Planned obsolescence!",
    "post_time": "Reviewed in the United States on February 7, 2021",
    "pid": "B003YFI0O6"
},
{
    "title": "Effortless Cork Removal with Style",
    "rating": "5.0 out of 5 stars",
    "content": "Very stylish wine opener. Black and silver. Works well and charges fast.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Tired of struggling with corkscrews? This Cordless Electric Bottle Opener is a game-changer! With just a push of a button, it removes corks in seconds—no more wrestling with manual openers.",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "bright annoying red light on top that you can't turn off",
    "rating": "5.0 out of 5 stars",
    "content": "Enjoy the convenience of opening up to 30 bottles on a single charge. The sleek design adds a touch of sophistication to your kitchen or bar.",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Included is a handy foil cutter for easy seal removal and a comfortable soft grip handle for effortless operation. Upgrade your wine-opening experience with this cordless electric opener. It's perfect for everyday use or entertaining guests!",
    "post_time": "Reviewed in the United States on February 27, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Looks nice",
    "rating": "5.0 out of 5 stars",
    "content": "Came as described and works perfectly without taking up too much room on countertop",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My old opener just lost power and couldn't pull the cork out of the bottle. This one is so much easier to use and there is no problem pulling the cork or removing it.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Power!",
    "rating": "3.0 out of 5 stars",
    "content": "Even at full charge, it acts as if it’s having a difficult time extracting the cork",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is an item that sits on our counter since it is used several times a week and you must keep it charged. There were many brands to choose from—I chose Oster since it has been around for a long time and also because the price was right. I see one problem—after charging it for the first time, overnight to be sure, the red light was still on. So was there a problem? I went to the written info to find out that it stays red. It would have been better if they had used a different color since we have been programmed to think red means stop, not ready, don’t proceed, or trouble.",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "OK, but",
    "rating": "5.0 out of 5 stars",
    "content": "Only have used it a couple of times. It opens a bottle fine. However, I cannot attest to the longevity of the battery.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I received one as a gift many years ago, and now purchase them as gifts for friends.  Very good item to have on hand.",
    "post_time": "Reviewed in the United States on June 7, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Very convenient",
    "rating": "5.0 out of 5 stars",
    "content": "I have enjoyed mine for many years.  This opener is very easy to use.  These were purchased as gifts.",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The foil cutter was missing from the package.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "It is easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "Opens wine bottles smoothly. I bought it because I have a broken wrist and I’m not able to use a regular corkscrew. I was asking my neighbors to open wine For me until I got this electric opener, which I am thrilled with. Highly recommend.",
    "post_time": "Reviewed in the United States on April 30, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this wine opener. Durable and easy to use. Charging never has a problem",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "My favorite appliance in the kitchen",
    "rating": "5.0 out of 5 stars",
    "content": "I'm almost embarrassed to say I lived almost 28 years before owning this electric wine opener. Wow. What a game changer. Life is hard enough, you should not have to break a sweat to enjoy a glass (or 4) of wine. Am I right? I love it so much, it is now the only gift I give. Getting married? You're getting an electric wine opener. Baby shower? You're definitely getting an electric wine opener. It is honestly my favorite appliance in the kitchen. It has earned the coveted permanent spot on the counter. (You know how you have a closet full of crockpots but would never dream of actually storing them on the kitchen counter? Not this little treasure. Nope. Always on the counter.)",
    "post_time": "Reviewed in the United States on February 17, 2021",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I will say though the instructions leave something to be desired. I definitely struggled the first time I used it. (Like I'm college educated but the instructions are confusing, ok?) So I have written my own instructions that I recite along side this electric wine opener every time I gift it:",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "When it works",
    "rating": "5.0 out of 5 stars",
    "content": "1. Charge it the minute you get it out of the box.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "2. Once it's charged, hold it on top of the wine bottle",
    "post_time": "Reviewed in the United States on September 15, 2021",
    "pid": "B003YFI0O6"
},
{
    "title": "It works",
    "rating": "5.0 out of 5 stars",
    "content": "3. Hold the arrow down. hold it down until you can't go down any lower (pretend you're at the Club)",
    "post_time": "Reviewed in the United States on October 21, 2023",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "4. Once it stops, lift the opener. The cork will be inside.",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Crumbly corks",
    "rating": "3.0 out of 5 stars",
    "content": "5. Hold the up arrow until the cork pops out.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "6. Store the corks somewhere, lie/assure yourself someday you're going to make a craft or something out of all these used wine corks when in fact you'll just keep them on display offering your friends and family further reason to worry you have a problem.",
    "post_time": "Reviewed in the United States on September 21, 2023",
    "pid": "B003YFI0O6"
},
{
    "title": "Best product I've ever bought on the Amazon",
    "rating": "5.0 out of 5 stars",
    "content": "When it works, it’s very convenient.",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Exactly what I wanted.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Eas.y to use, works well",
    "rating": "4.0 out of 5 stars",
    "content": "This wine bottle opener works well and is easy to use. I've had several, and they last about two years. I don't want to use any other type of opener. I replace them when they fail, they aren't expensive. But now I'm having a new problem! Could be the sea air here in Hawaii. The black material on it is deteriorating. When I used it, my fingers came away with a heavy black coating that doesn't wash off. I had to use a scratcher sponge to scour off the black rubber coating on my fingers! I have wrapped it in a paper towel, so I don't have to touch it! I bought it in September of '21, so I've used it 15-16 months. It's now Jan '23. My friends won't use it. They dig in a drawer for a cork screw.",
    "post_time": "Reviewed in the United States on January 18, 2023",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I really liked this opener. It worked really well and looked pretty sleek. I'm in the unique position where I've purchased quite of few of these as gifts for family members and two for myself (my family loves wine). Why two for myself? Well, as it gets older the batter stops holding a charge quite like it used to and we had one run out battery with a cork in it. I'm sure that you're sitting there thinking \"LopsidedMidget, don't be a dummy. Just recharge it and *poof* you are absolved of your issue.\" This would be true.. with nearly any other brand. However, Oster charges by sitting on the stand and a cork gets in the way of that happening. You either have to take the whole thing apart, or invest in a new opener once this happens to you. Of the five that I have purchased for myself and family only one of them is still functional - and that's because my father quit drinking a year ago.",
    "post_time": "Reviewed in the United States on February 26, 2016",
    "pid": "B003YFI0O6"
},
{
    "title": "Great while it lasted",
    "rating": "5.0 out of 5 stars",
    "content": "So, why do I still give it three stars? Well, it's $20 and works well until it's inevitable failure. You'll very likely get between 1-2 years out of this guy (hopefully) and you won't regret your purchase once you use it... until you need to open wine and don't have an opener.. I've since moved on and now use the Onzeri one and have realized that this Oster model feels a lot more solid. The Ozeri sounds/feels like it's wheezing out its final breath whenever we use it to open wine. It has lasted longer, but it's feels like it has the motivation of a teenager being forced to do its chores whenever we use it. The saving grace for the Ozeri is that the charge is a cable that attaches to the outside and it doesn't rely on a base to do this, so even if it does with a cork in it we can still charge the opener and eject the cork.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Had this same one for 10 years it finally quite charging,  hope this one last as long. So easy to use and removes the most stubborn corks!",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Replaced mine from 10 years ago",
    "rating": "4.0 out of 5 stars",
    "content": "Wife is getting arthritis in hands.  She loves her wine.  She loves this item.  So easy to use.",
    "post_time": "Reviewed in the United States on November 2, 2023",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We open , on average,  3 bottles a week. This has been going strong for 3+ years. Last week, it started being slow... then slower.. then stopped with the Tip on the screw in the cork (Just the Tip). Total lime of ownership 3 years and 11 month. Price increase in that time,  X 3.",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Works perfectly",
    "rating": "5.0 out of 5 stars",
    "content": "Purchased another one as a gift. Went to get together and using manual wine opener I had to purchase this wine opener. I bought same one I have in my home. Recommended for those wine drinkers.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works well, can open about 30 bottles on a charge.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "4 years and the battery is dead",
    "rating": "3.0 out of 5 stars",
    "content": "Love it!  Nothing to dislike as of yet.  Works as advertised",
    "post_time": "Reviewed in the United States on May 31, 2024",
    "pid": "B003YFI0O6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It works... but it sometimes struggles to open wine bottles.... even when keeping on the charging unit.",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "B003YFI0O6"
},
]