[
{
    "name": "        Religious Gifts Saint Joseph Statue Home Seller Kit with Prayer Card and Instructions       ",
    "stars": [
        "83%",
        "8%",
        "5%",
        "2%",
        "3%"
    ],
    "pid": "B007XG6B2K",
    "ratings": "9,697 ratings",
    "other_info": {},
    "discount_price": "$ 7.68",
    "normal_price": "$9.88",
    "about_this_item": [
        " SAINT JOSEPH THE WORKER small statue is meant to be buried in the ground and thought to bring good luck when buying or selling a house  ",
        " INCLUDES prayer card and burial instructions for use. Making it easy and effective.  ",
        " BEAUTIFUL kit that makes the perfect gift for friends and family in your life who are in the process of buying or selling their home.  ",
        " STATUE burial is a long standing tradition in the Catholic faith where you pray to Saint Joseph's good will in hope for a fast, smooth, and profitable sale.  ",
        " BRING GOOD LUCK to those in your life who are in the home selling process.  "
    ]
},
{
    "title": "St. Joseph Status is perfect size with Prayer cardSt. J",
    "rating": "5.0 out of 5 stars",
    "content": "St. Joseph Statue works, pray using the card and pray with your heart. Don't just say the words believe the words.  I have used St. Joseph to sell my RV Camper that wasn't selling and my Townhouse.  Once I used St. Joseph my house sold.  I told a guy at work and he couldn't sell his house until he used St. Joseph statue and prayer.  I just told my sister who couldn't sell her lake house.  She said the prayer 9/30/24 and she just got an offer on her lake house.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We use this before and it really works",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Saint Joseph",
    "rating": "5.0 out of 5 stars",
    "content": "After I started praying to St Joseph, I received and accepted an offer and sold the home (within a week). This isn't a guarantee to happen so quickly but praying to him sincerely, for help, usually helps.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We bought this statue in the summer of 2020 in hopes to sell our home during the pandemic, when home tours were restricted and we were hoping for a miracle that someone would buy the home sight unseen.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Prayer works",
    "rating": "5.0 out of 5 stars",
    "content": "We ended up getting multiple offers and sold it for tens of thousands above asking price  A++ would buy again.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have sold three houses in the last decade within10 days of listing.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Bought this to help sell our house",
    "rating": "5.0 out of 5 stars",
    "content": "Not much I can say about this, it is a statue and looks nice. It came with interesting paperwork. My wife thinks it worked in selling our house fast but I think it was a coincidence.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "He as never let us down….❤️",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Uncannily Successful",
    "rating": "4.0 out of 5 stars",
    "content": "Have bought numerous statues for friends who want to sell their homes ,,AND THEY ALL DID! St Joseph to the rescue!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "We understand the St. Joseph statue brings luck when selling your house. We will see. Update soon.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Buying this next and every time we sell a home!",
    "rating": "5.0 out of 5 stars",
    "content": "We were in the middle of a weird market, my husbands job was taking us out of state and we were moving in 1 month… we were nervous our home wouldn’t sell and it would sit empty while we were paying the mortgage. There were many homes sitting for months in our neighborhood.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A friend told me about the St. Joseph statue so we thought we’d give it a try! Kid you not… we got an offer the day we buried it in our front yard!! Only on the market 10 days. Buy it!!!",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "good product",
    "rating": "5.0 out of 5 stars",
    "content": "was here ASAP, Thanks",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Viene con medalla oración figura y bolsita de regalo es precioso!",
    "post_time": "Reviewed in the United States on July 1, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "Muy lindo",
    "rating": "5.0 out of 5 stars",
    "content": "If you're reading this, you are familiar with the belief/idea/thought that if you want to sell your house fast, planting a statue of St. Joseph will get it done.  I purchased this for just that purpose.  In spite of Prime shipping, the statue did not arrive in time for the first open house, but I figured, better late than never.  The statue arrived the same day as the first open house, just after it was over.",
    "post_time": "Reviewed in the United States on June 6, 2022",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I took the little statue out to the front of the house and picked a spot in the flower bed in front of the house.  I had some words with St. Joe (there is a prayer card that comes with the statue if you prefer).  I then dug a hole about twice as deep as the statue is tall and then placed good ol' St. Joe upside down facing the house (as directed by friends who have used this method).",
    "post_time": "Reviewed in the United States on December 10, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Read for a non traditional approach to the use of St. Joe in the home selling process",
    "rating": "5.0 out of 5 stars",
    "content": "Nothing happened.  Not. A. Thing.  Multiple showings over 3 weeks but no offers.  Broker's open house was not very informative.  I made some minor changes in the house and said some prayers for help from St. Joe.  Waited.  And waited.  And...you get the picture.",
    "post_time": "Reviewed in the United States on September 18, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After 4 1/2 weeks on the market, I decided to dig up ol' St. Joe and have a face to face, heart to heart convo.  I had a showing scheduled for 4:15 that afternoon. At ~ 3:45, I went out to the flower bed and dug up St. Joe.  We had a little conversation, I asked for his help, reminded him that I was simply trying to sell for what I owed, not trying to make a fortune or anything.  I figured that perhaps I needed to plant him a little deeper, perhaps a tad closer to the house.  Now close to 4pm, time was against me.  I dug through the mulch with my hands and then into the soil.  I hit some resistance (rock? tree root?  I don't know); I did not have time to get anything to help with digging.  Instead, I took St. Joe and used HIM...and succeeded in decapitating him.  His little head fell into the hole, leaving me holding his torso.  Oh. My. Gracious...now I've done it.  I've decapitated a saint...this cannot be good.  Now 4:05, I have no choice but to drop the torso into the hole and cover up the evidence.  Grabbed my dogs and shot out of the house.",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "It really does work - I'm shocked",
    "rating": "5.0 out of 5 stars",
    "content": "I returned to the house at 5:10...almost an hour after the scheduled showing.  The potential buyers were still there...talking with their real estate agent in the yard.  Hard to believe but they presented an offer that night.  The selling process has been pretty smooth and we close in 10 days.",
    "post_time": "Reviewed in the United States on February 14, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Now I'm not telling you to decapitate your St. Joe's statue, I'm just relating to you what my experience was.  Take it at \"face\" value.  I either released some pent up energy in St. Joe or scared the dickens out of him.  Regardless, I find it more than a coincidence that minutes after I decapitated him, a couple toured the house and bought it.",
    "post_time": "Reviewed in the United States on June 6, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "No magic here",
    "rating": "3.0 out of 5 stars",
    "content": "Product arrived as expected, but it didn’t aid in selling the house. Imagine that!",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Amen & Amen!!! 😊",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "SOLD in leas than a week...",
    "rating": "5.0 out of 5 stars",
    "content": "Last Fall (2019) we were desperate to sell our large home. It had been on the market since April with only 16 showing appts, and no offers. The realtor said we had to add another bathroom, and really should build a pool to make more buyers interested. Those ideas were out of the question! My daughter found this statue on Amazon and sent the link to me. I purchased the statue in late Nov, but with the holidays and all, we never did anything with it. So on Jan 9 my hubs & I buried the St Joe statue out next to the For Sale sign.  On Jan 13 we had a verbal offer for less than asking. The next day, a previous party came to look again. Well there was a bidding war between these two parties - Party #2 being the winner. Fast forward to summer.  We've had an acre lot for sale down the street from our old house for 2 years.  Three different deals were started but fell through. In mid-August we received an insulting offer 30% under asking, to which we countered at 10K under asking. We didn't hear back on that, so three days later we finally decided to drive out to bury the statue again (it had been sitting \"in a place of honor\" up on our mantle since we moved to the new house). We buried it next to the For Sale sign, and 7 days later we received a FULL ASKING PRICE offer from the party who previously low-balled us!  That was too weird!  Amazing - we believe!",
    "post_time": "Reviewed in the United States on September 6, 2020",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So upon arrival of this little guy I kept him on a shelf while I prepared my house for sale. There were multiple repairs that needed done and I would pray to this little figure to help keep me motivated for the heck of it. I got all those repairs done in a time frame I felt I wouldn’t have normally obtained. Was it the St. Joseph? No clue.",
    "post_time": "Reviewed in the United States on June 9, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "St Joseph is an excellent realtor!",
    "rating": "5.0 out of 5 stars",
    "content": "Anyhow it was then time to list the house. Realtor put sign in the yard and we buried and prayed to him. House went up online the following evening. Two hours after being online it had two late night showings at 7 and 8 pm. Got an offer that night. Following day it had THIRTY FOUR showings!!! I’m not exaggerating. I left my house the entire day and as it’s off a main road I had to drive by about three times. The entire street was flooded w people. The house was surrounded by so many people it looked like an auction was going on. We had six offers that night. Took our best one. Had to cancel the showings coming up the remainder of the week bc there was just too many and we had an accepted offer under contract.",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I will add the old house was in a prime location and was priced right I’d say but other homes were too and I’ve never seen the type of attention like ours did. I kept him buried until right before closing and he now is displayed in our new home across the country. Could be coincidence but I’m going to thank St. Joseph for helping us get to where we dreamed of being for many years.",
    "post_time": "Reviewed in the United States on April 12, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "I believe in it!",
    "rating": "5.0 out of 5 stars",
    "content": "This was a nice little \"kit\" with a St. Joseph figurine, guidelines, and a prayer. We hadn't sold our home for 5 months.  Had 2 offers the day after burying St. Joseph and sending our prayers His way.",
    "post_time": "Reviewed in the United States on November 24, 2021",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "He really works!!! Here's my story....we were under contract a couple weeks ago until the people backed out due to the house being too big and they were worried about trying to take care of it all. So, we were back to square one. We had a few showings the first week with it being back on the market and then NOTHING for almost a week...no showings, no interest, nothing and we are on a timeline needing to sell it. So, I got on here and read through all the amazing reviews and stories and thought, why not?! I received him in the mail a couple days later and then literally the moment, JUST as my son and I were reading the instructions and prayer and getting ready to go outside and burry him, my realtor called saying there was a showing the next day AND a possible offer coming in. The next day, the people who looked at the house wanted to put an offer in, but weren't preapproved for enough, but the other people who had looked at it the week before did send an offer over...we negotiated and agreed on a price today (which is the price we were hoping for) and will be signing the contract tonight!! The timing and everything of it is just too crazy and bizarre for it NOT to be St. Joseph!! I'm a believer for sure!! I will leave him buried until closing and will definitely put him in a nice place at our next house and will use him again in the future. THANK YOU, ST. JOSEPH!!!",
    "post_time": "Reviewed in the United States on March 1, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Truly was a blessing",
    "rating": "5.0 out of 5 stars",
    "content": "I am a religious person and I believe in the power of prayer. I had a house for sale and during 5 weeks I had 1500 views and 60 saves on Zillow alone. Several showings but no offer. I came across a link for Saint Joseph’s prayer and the ritual of placing the Saint statue upside down. I did not have a sale sign or a front lawn; I live in a big city and I decided to place the statue in a flower vase facing my entrance door on top of my front steps. Prayed every day not always at the same time, 3 days after starting the ritual  I received an offer. I continued to pray every day even when I traveled to Europe for 2 weeks, and yesterday we closed on the house. Today I removed the statue from the vase. I am not  superstitious but I believe that this ritual along with the consistency of praying every day brought me the right buyer. Someone that was extremely happy in buying the house.  Thank you Saint Joseph I am grateful for your assistance.",
    "post_time": "Reviewed in the United States on July 14, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect to bury to sell your home!  Love that it comes with the prayer card to say to St. Joseph while burying him.  Praying we sell our home soon with his help!",
    "post_time": "Reviewed in the United States on July 29, 2021",
    "pid": "B007XG6B2K"
},
{
    "title": "Whoa!",
    "rating": "5.0 out of 5 stars",
    "content": "A coworker had told me about the awesome powers of the St Joseph statue, but I was skeptical. It seemed a little gimmicky (which, it probably is). But, after our house was on the market for a month, we were getting a little desperate (we wanted to be out before winter set in). So, we decided to pick one of these little guys up. We knew we had an open house the next day, and we had a showing a little before that - so, while we were doing the final pickup around the house the morning of the showing and open house, I ran out in my t-shirt and shorts and planted this little dude according to the directions. I said the little prayer and hoped for the best. We went thru our normal day until we get a call from our realtor around 4pm - we had an offer! And it was a pretty decent! We countered, and by the next morning, that was accepted. Holy smokes! Now, I'm not a very spiritual person, but that made me almost go to church that day. I definitely drove by one or two and thought about it. We are still working thru the final contingencies, but all indications are good that we're going to close on the deal.",
    "post_time": "Reviewed in the United States on November 1, 2017",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Was it the power of St. Joseph, or just a big hairy coincidence. I'll never know. But I do know if I ever have to sell another house, St Joseph will be planted in the front yard immediately.",
    "post_time": "Reviewed in the United States on October 28, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "I’m not superstitious , however….",
    "rating": "5.0 out of 5 stars",
    "content": "I’d had my house listed for 3 months which is an eternity in this market, and I was so frustrated I was willing to try ANYTHING! Well, I had come across an article saying to bury him by your for sale sign and he will bring you luck/help your house sell faster, and boy did he ever! The SAME say I planted him, I received THREE offers on my house and just closed on it today!!",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I used this to bless my granddaughter’s new house. It makes me feel better about her choices.",
    "post_time": "Reviewed in the United States on August 17, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "St Joseph.",
    "rating": "5.0 out of 5 stars",
    "content": "My mom wanted this for her bf. His place ended up selling 4 months later. I’m not sure if I believe in it because I’ve seen other places sell a lot faster, but it’s better than having no buyer at all! So I think it worked.",
    "post_time": "Reviewed in the United States on August 10, 2021",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Believe me when I tell you that I purchased this item as a complete last resort for a listing I had that was not moving for no reason! It was the biggest listing of my career so far and I wanted to do a good job so badly, but despite my investment in time and marketing, my calls and follow ups and showings and private tours, it simply wouldn't move. My seller began asking about a price reduction and I was so against it, because there was just no reason this home wasn't getting offers, it was fantastic and we were definitely not overpriced! We were on the market over a month, and mere HOURS after planting Saint Joe and reciting the prayers, I had a full price offer in my email and a very happy seller. This offer seemed to come out of nowhere as the buyer's agent showed it only once several weeks prior. We sold last week for $27,000 more than our competition and 58 days faster than comparable properties. Thank you saint Joseph!!!",
    "post_time": "Reviewed in the United States on October 19, 2020",
    "pid": "B007XG6B2K"
},
{
    "title": "Smaller than I thought but ok anyways!",
    "rating": "5.0 out of 5 stars",
    "content": "A deal had all ready fallen through on my Condo and it had been two months since the condo went on the market. I was at my uncles house and he suggested this. I had never heard of it before but was desperate and would try anything. It was only $6 on amazon so figured why not? Its been two weeks and only two showings and the open house was a bust. I thought maybe being born on St josephs day (march 19) would bring me better luck but it just seemed to counteract it. I noticed that it tends to work within 2 weeks -month by other reviews I read so will update if something changes but as of now it hasn't worked for me.",
    "post_time": "Reviewed in the United States on May 10, 2020",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Update so after I posted this, the day after I got an offer from the open house! Unbelievable! Guess it does work and should have waited to write the review lol. I've had a deal fall through so if I don't update again u can assume it did the trick and within two weeks nonetheless! Thank you st joseph truly, I feel so relieved now not having to pay two mortgages for a length of time.",
    "post_time": "Reviewed in the United States on February 5, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "I am now a true believer!!!!!",
    "rating": "5.0 out of 5 stars",
    "content": "We had our house on the market for about a month right before the pandemic started and into the start of the pandemic. Had lots of showings initially, but then they ran dry after the first week. Crickets. Purchased Saint Joseph and had a family burial with the prayer. We got a couple more showings after that, but no offers. After about a month and a half, took the house off the market. We dug him up and cleaned him off. We made some small changes to the listing and put the house back on the market two weeks later. We buried him again with a prayer as soon as the listing went back to active. At this point, we were fully into the pandemic. All essential businesses were shut down. We get a phone call from our realtor two days after the listing had become active with a full priced offer SIGHT UNSEEN!!! Person saw it online and fell in love. 30 day settlement. Settled yesterday. We kept him buried until the house settled then we came home, dug him up, and cleaned him. Was it luck? Coincidence? Saint Joseph? Not sure. All we know is that Saint Joseph will have a special spot in the new house.",
    "post_time": "Reviewed in the United States on June 22, 2020",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "St. Joseph statue was used to draw in buyers for a house that was being sold.  Had 13 offers in 24 hours.  It worked.",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "As advertised",
    "rating": "5.0 out of 5 stars",
    "content": "Exactly as expected and it came with a St Joe card along with home selling instructions for how to bury the statue.",
    "post_time": "Reviewed in the United States on February 6, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought a starter house in 2006 before the economy collapsed at 24.  I recently got married last summer.  After the wedding i spent all summer fixing the house up.. hardwood floors, new paint, re-did the basement.  I put the house on the market at the end of Oct.  The area i was selling the house in had only sold 6 houses in a year within my houses price range.  I did not want to sell as i wanted to put it up for rent because i was very sure the house would sit on the market for at least a year.  My wife really wanted to at least try to sell so i agreed.  After two months, we had our FIRST showing.  My Mom, Grandmother, neighbor.. all suggested the St Joseph statue and my Mom swore by it.  So i purchased it and hoped to have it before the showing.  I got it in on Friday, the person saw the house on Sat and made an offer that day.  i gave to my Mom to have blessed on Sunday morning mass, and countered Sat afternoon.  Right after the statue was blessed, the person accepted my counter offer an hour after.  Not only was i very surprised to even have sold the house in the first place, but the fact that it wall worked out like that within days of the offer was very eerie.  I've heard from several friends and family members how it worked for them as well.  At the very least it doesn't hurt to try!",
    "post_time": "Reviewed in the United States on April 10, 2013",
    "pid": "B007XG6B2K"
},
{
    "title": "Sold House the same week the statue arrived.",
    "rating": "5.0 out of 5 stars",
    "content": "Y'all. I am by no means a particularly religious or superstitious individual. But in the course of trying to sell my house, I was willing to try anything. My neighbor stopped me one day while I was mowing to ask me how the house selling was going. I told her I had had several showings, but no one demonstrated any real interest. She tells me I need to bury a St. Joe. Well, she's a little crazy so I brush this off and decide not to do this. Then about 2 weeks later, a bottle of wine deep, lamenting my woes of how my house won't sell, I find myself on Amazon with this little statue in my cart. What can it hurt....right? Got the statue on a Friday. Buried him on a Saturday. Nothing happens Sunday (mind you, I'm diligently reciting the prayer that comes with him every day, just as instructed, because I'm not going to mess with the juju). Monday, someone comes to view the house. Tuesday, they return to view it again. Wednesday, they put an offer in for my asking price. Thursday, we were under contract. Seems awful coincidental, no? Thanks St. Joe for turning this skeptic into a believer!",
    "post_time": "Reviewed in the United States on September 6, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Sorry it took me so long to write this review but I had to test it and see for myself, this absolutely works, if you believe it definitely works, like the other reviewers noted, we purchased Saint Joseph, said the prayer and buried him, we did this on a Monday and had an open house  for the following Sunday, I kid you not we had 3 offers, the night of and next day of the open house!!",
    "post_time": "Reviewed in the United States on September 26, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "Skeptic turned believer",
    "rating": "5.0 out of 5 stars",
    "content": "Another important thing to note is that this also works with the right timing as in when it’s meant to be, if it’s not the right time to sell your home, you will have obstacles but don’t get frustrated because this is for the best, it happens when it should as things are in order and work out better.",
    "post_time": "Reviewed in the United States on November 17, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As the saying goes, when one door close another open with better opportunities, Saint Joseph works in that manner as he seeks the best interest of the individual, he prepares a path for success so don’t get upset if it’s taking too long.",
    "post_time": "Reviewed in the United States on December 13, 2013",
    "pid": "B007XG6B2K"
},
{
    "title": "Thank you Saint Joseph",
    "rating": "4.0 out of 5 stars",
    "content": "We found the perfect house, I love Saint Joseph, we took him to our new house b/c he is so amazing, hope your life is filled with opportunities like We have🙏🏽🙏🏽😇😇",
    "post_time": "Reviewed in the United States on September 7, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My friend had her Colorado ranch for sale for 2 yrs without a single bite. She is a religious Catholic, so tried Saint Joseph. She was in Calif & planned on taking Saying Joseph to Colorado with her. She opened the package, held him in her hand and within minutes, her phone rang with a good offer.. She was shocked to say the least.",
    "post_time": "Reviewed in the United States on May 20, 2017",
    "pid": "B007XG6B2K"
},
{
    "title": "I wasn't a religious person, but Saint Joseph certainly did his job in our case.",
    "rating": "5.0 out of 5 stars",
    "content": "So when I was having trouble selling my olace, she suggested it. I wasn't personally religious, but bought the statue. As I was reading the prayer, my husband came in from the mailbix. Turns out the gov used a lighting company for false advertising. They distributed 14 million$.. We got a Check for about $150.00.. I thought \"this is a good sign\".. Then two days later, my house sold.",
    "post_time": "Reviewed in the United States on November 29, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We took him to our new home and are filling remodeling. It's almost done in less than two months and though we've put in a lot of sweat equity, we're below budget and the results are high end. I don't know if it's a fluke or not.. I'm thinking not... We have had excellent results.. I'm spending more time contemplating band praying.. a good thing😇  Give it a try.",
    "post_time": "Reviewed in the United States on October 18, 2022",
    "pid": "B007XG6B2K"
},
{
    "title": "The Day we Buried it , we Received an Offer",
    "rating": "5.0 out of 5 stars",
    "content": "The Day we Buried it , we Received an Offer.",
    "post_time": "Reviewed in the United States on July 8, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I thought that it would have fallen through, but it did not. It worked! We have moved out and are settled in our new home after having a smooth sale, thanks to Saint Joseph. We keep the statue on our fireplace to honor him.",
    "post_time": "Reviewed in the United States on May 11, 2017",
    "pid": "B007XG6B2K"
},
{
    "title": "Joe comes through!!",
    "rating": "5.0 out of 5 stars",
    "content": "Saint Joseph, buried upside down, facing my house and close to the 'for sale' sign in front of my beloved Cozy Cottage. I marked the spot with this little house, lest I forget where I left him. And I promised - if he blessed me - I would visit three times each day, and ask for his intervention in the selling and buying of my homes.",
    "post_time": "Reviewed in the United States on June 5, 2022",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Six hours after the first prayer, I received my first offer.",
    "post_time": "Reviewed in the United States on June 15, 2022",
    "pid": "B007XG6B2K"
},
{
    "title": "Believe and St Joseph may help.",
    "rating": "5.0 out of 5 stars",
    "content": "I say 'first' because my home became the object of a lovely bidding-war, and I sold in a matter of days.",
    "post_time": "Reviewed in the United States on May 3, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Joe, however, remained underground -- receiving my visits, my praise and my prayers for a new home I might love as much as the one I leave behind.",
    "post_time": "Reviewed in the United States on July 2, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "St. Joseph really works",
    "rating": "5.0 out of 5 stars",
    "content": "The saint responded with a dropped seller's price on the only house I saw and loved -- and last week my offer was accepted!",
    "post_time": "Reviewed in the United States on October 22, 2020",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "When all deals close, I'll bring Saint Joseph in from his place of blessing and promise -- and install him on the fireplace mantle of my adorable Park side home!",
    "post_time": "Reviewed in the United States on May 28, 2020",
    "pid": "B007XG6B2K"
},
{
    "title": "Sold my house in four days!",
    "rating": "3.0 out of 5 stars",
    "content": "Yes, friends. Miracles happen!  Thanks, Joe!  I won't forget the blessings!!",
    "post_time": "Reviewed in the United States on September 30, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have slight At. Joseph's help many times. I sent my son  one when his house wasn't selling. He waited and was discouraged after doing more repairs and took out the statue and read the prayer and buried it and opened his soul. The next day someone had come to view the house and made an offer. It ended up selling . Thank you Saint Joseph. The early father of Jesus. I am buying one tomorrow on Sunday with a30 day novena to pray my home is sold fast and fairly priced. Amen",
    "post_time": "Reviewed in the United States on November 18, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "St. Joseph really works",
    "rating": "5.0 out of 5 stars",
    "content": "This is my third purchase of a St. Joseph statue. I am not a particularly religious person but was told that if you bury a statue of St. Joseph upside down with next to your house for sale sign facing your house and say the prayers that accompany the statue, your house will sell. I have done this three times and it has worked all three times , I did not bury him immediately when I put the houses on the market but would bury him only when I felt there was no interest in my houses or they were listed for to long.Hey if it works why not try it.",
    "post_time": "Reviewed in the United States on September 29, 2021",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had heard from several people this had worked for them.  Thought I have nothing to lose since the price is so low.  My house was on the market for 2 1/2 months with very little traffic.  I got this statue delivered on a Sat afternoon and followed the instructions and buried it.  Sunday afternoon I had a showing (and hadn't had one in over 3 weeks!) and never heard anything about that showing. Come Tuesday morning I got an offer!!!!  I swear it might be coincidental but somehow it freaking worked!!!  I unburied him when I moved and he is displayed in my new home for good luck.  I have no idea how this worked but it did.  I would def do it again if I ever move again and recommend anyone else having trouble selling to get this!  I really am skeptical about this stuff but cant deny the result!",
    "post_time": "Reviewed in the United States on January 19, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "I was skeptical but it worked!",
    "rating": "5.0 out of 5 stars",
    "content": "The realter put the sine up in my front Yarde and I put Saint joseph next to the sine  .",
    "post_time": "Reviewed in the United States on August 2, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The very next day the house wase sold. For my price. It made a believer of me.",
    "post_time": "Reviewed in the United States on December 15, 2016",
    "pid": "B007XG6B2K"
},
{
    "title": "I don't think it a Mirical. but it worked ?",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this after my home had been on the market for a few weeks and very little interest had been expressed (our home was in a very desirable area and was fairly priced). I got nervous as we had already made and agreed upon an offer on an another home and therefore, we needed to sell our home ASAP. I bought this St. Joseph statue and buried in the back yard upside down facing the house. Within a week of doing this our showings went up. Then we had two showings on the same day and two offers made. We accepted an offer that was above our asking price! Everything else went as smooth as one could hope for (inspection, appraisal, etc.) and I completely attribute it to this statue and the prayers that we said. However, I must say that I think you need to have faith and be a true believer of a higher power above us as that is really key. But I would recommend this statue to anyone looking to try to sell their home.",
    "post_time": "Reviewed in the United States on September 5, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I live in New York City and life circumstances led me make the decision to leave my apartment ASAP. However, I have a year and a half remaining on my lease. After finding out from my leasing company that I could sublease, I bought this statue knowing how time after time, St. Joseph has helped my family quickly sell property (I figured it would work on a rental, too!). Sure enough, he pulled through! I received the statue Thursday night while I was at my parent's house in New Jersey, said the prayer, and woke up to an inquiry from a person with the last name JOSEPH! I hadn't even buried it yet at that time! Needless to say, the potential renter is absolutely amazing -- i'm just waiting for my other roommate to meet her so we can sign the papers. I know this will all work out -- Thank you, St. Joseph! I am forever grateful for your intercession!",
    "post_time": "Reviewed in the United States on January 16, 2021",
    "pid": "B007XG6B2K"
},
{
    "title": "But I would recommend this statue to anyone looking to try to sell ...",
    "rating": "5.0 out of 5 stars",
    "content": "Three years ago my sister had her house up for sale 6 months, only had 3 people look at the house and no offers.",
    "post_time": "Reviewed in the United States on December 17, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A friend told her about St. Joseph, so she bought the statue and followed the instructions.",
    "post_time": "Reviewed in the United States on May 12, 2020",
    "pid": "B007XG6B2K"
},
{
    "title": "A True Godsend",
    "rating": "5.0 out of 5 stars",
    "content": "One week later they had a couple look at the house and put an offer on the house the next day.",
    "post_time": "Reviewed in the United States on April 2, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Last month my Granddaughter put her house up for sale, I bought the statue for her but had put it in the kitchen windowsill so she could put it in the proper place when they put the sign up.",
    "post_time": "Reviewed in the United States on December 30, 2017",
    "pid": "B007XG6B2K"
},
{
    "title": "Rating based on product only-will update if we sell",
    "rating": "5.0 out of 5 stars",
    "content": "We have a house on the market with zero interest for the last year. We are strapped to pay the 2 mortgages and don't want the hassle of making it a rental. I had 2 people in a weeks time tell me about St. Joseph. I'm not Catholic but I am Christian. We have prayed over the house and given it to God. I figure I would make a little extra effort with the statue. The statue arrived with head intact but a broken head doesn't bother me as there is always super glue. For the price I paid it was exactly as described. I will update the review if we sell the house. I'm going to say another prayer over the house and maybe I need to step back and REALLY give it all to God as I do like to save a little piece to make me feel like I'm in control.",
    "post_time": "Reviewed in the United States on October 8, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As executor of an old friends estate I was required to sell her 28 year old mobile home as soon as possible after her death. Following numerous repairs, I put it on the market during the four peak selling months without success. I had several offers in the neighborhood of $5,000 to $12,000.  Since there were many estate related bills to pay, I decided to call on help from St. Joseph. I purchased this statue ( placed it in a sealed ziplock bag) and buried up side down facing the house. I prayed the novena daily as instructed and sold the house in less than three weeks for a \"very\" substantial profit. I made sure to retrieve the statue, thank St Joseph and place him prominently in my own home.",
    "post_time": "Reviewed in the United States on January 8, 2021",
    "pid": "B007XG6B2K"
},
{
    "title": "St Joseph never fails",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this statute and immediately followed the instructions the week I put my house up for sale.  I prayed the prayer every day.  My house was priced just right and the remodeling job is fabulous.  Everyone thought it would sell in days.  NOT.  Its almost 70 days later and Joe is freezing in the ground.  I received 1 low ball offer that went away.  I'm going home to dig him out the cold ground, clean him up and beg for forgiveness!  I'll stick with saying my prayers go God. UPDATE:  Dug Joe up out of the ground on Tuesday. Cleaned him up nicely and put him in my altar cabinet!  Wednesday got a full price offer and they love the house!  Closing in 3 weeks!  Don’t go burying him upside down in the ground. Be nice.",
    "post_time": "Reviewed in the United States on November 19, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Prayers always work out",
    "post_time": "Reviewed in the United States on November 28, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Saint Joe is pissed with me.  I have to dig him out of the cold ground today!",
    "rating": "5.0 out of 5 stars",
    "content": "I ran into a woman at Sam's Club who told me about this. So, I bought 4... Buried those bad boys and said the prayer. Our house sat on the market for 6 months (a fully remodeled home from top to bottom).",
    "post_time": "Reviewed in the United States on February 6, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Here is the deal, your house will sell when its supposed to. If you actually believe in God, you know it's in his hands.",
    "post_time": "Reviewed in the United States on March 27, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "It worked !",
    "rating": "5.0 out of 5 stars",
    "content": "Also, my friend buried one in her yard... Her house was on the market a year, off for 3 months during remodeling, on again for 6 months.",
    "post_time": "Reviewed in the United States on July 9, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Another friend, buried one, her house didn't sell at all, she had to put it up for rent.",
    "post_time": "Reviewed in the United States on May 4, 2017",
    "pid": "B007XG6B2K"
},
{
    "title": "Let's Be Realistic...",
    "rating": "5.0 out of 5 stars",
    "content": "If you're looking for this to sell your house for you, don't count on it.",
    "post_time": "Reviewed in the United States on April 6, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If it \"worked\" for you... Congrats!! Your house that you had listed for sale, SOLD!!",
    "post_time": "Reviewed in the United States on September 24, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "It works!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I sell Real Estate. Anytime I have a challenging property I buy a Saint. Works every time :)",
    "post_time": "Reviewed in the United States on September 6, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Used him to sell our house. And saint Joseph answered my quest. Dug him back out of my yard after the sale, he rides in my car.",
    "post_time": "Reviewed in the United States on July 24, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Shipped as promised",
    "rating": "5.0 out of 5 stars",
    "content": "Our house has been on the market for about 4 months with lots of showings (almost 50) but not one offer. A friend suggested that we get one of these statues. We chuckled and I thought for $5, what the heck.",
    "post_time": "Reviewed in the United States on September 15, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The statue was delivered on Tuesday. We had 3 showings scheduled for that day.  The statue was delivered during the second appointment (my realtor called to let me know).",
    "post_time": "Reviewed in the United States on August 15, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "I wouldn’t have believed it if I didn’t see it for myself",
    "rating": "5.0 out of 5 stars",
    "content": "The 3rd showing says they want to schedule a second showing for next week!! BUT WAIT, IT GETS BETTER!",
    "post_time": "Reviewed in the United States on September 1, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We now have a full-price offer from a different party that came out yesterday. We could potentially end up with multiple offers! We haven’t changed a thing- not the price, not the house nothing.",
    "post_time": "Reviewed in the United States on March 29, 2020",
    "pid": "B007XG6B2K"
},
{
    "title": "Did the trick",
    "rating": "5.0 out of 5 stars",
    "content": "Crazy!",
    "post_time": "Reviewed in the United States on April 15, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "For $5, I’d say give it a try!",
    "post_time": "Reviewed in the United States on August 31, 2020",
    "pid": "B007XG6B2K"
},
{
    "title": "Saint Joseph Statue Home Seller kit",
    "rating": "2.0 out of 5 stars",
    "content": "After 90 days on the market, 5 days after putting this in the ground, house is under contract",
    "post_time": "Reviewed in the United States on April 10, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was getting desperate to sell my condo unit.  Six months on the market and not even one offer.  I placed the Saint Joseph statue standing upright in the living room area out of sight but had him facing the room.  Since it is a condo unit there was no place I could bury him upside down in the ground like the instructions said.  I placed him in my unit on August 3.  On August 27 I had a call from my realtor saying someone had made a cash offer for just a little under my asking price.  There were other units on sale for the same price in the building with a better view (ocean) but the buyer decided to go with mine.  I know this works!",
    "post_time": "Reviewed in the United States on May 1, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "It was worth a try",
    "rating": "4.0 out of 5 stars",
    "content": "I had a friend who used a Saint Joseph statue and it allowed them to sell their house in time (they had a contingent offer). We also were in the process of selling our house and had 3-months and burned one month with little result. We gave this a try, and actually saw the number of \"saves\" on Zillow drop almost immediately. We rode it out anyway and ran out of time to sell our house and I dug poor Saint Joseph up today. It was a fun effort, but can't work every time I suppose.",
    "post_time": "Reviewed in the United States on July 7, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had heard about st Joseph through a friend, and I though what the check I will give it a try. Now I am not sure if it really works, but it is a nice idea. Trying to sell a house is really a stressful time and being able to pray and say some of your worries is nice. We had our house on the market for 4 months and we needed to sell it lighting fast. We had to lower the house price by 10,000 grand, but got it sold. Our st Joseph sits in our kitchen window now in our new house it feels nice to feel like someone is watching over you.",
    "post_time": "Reviewed in the United States on June 15, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Give it a shot what do you got to lose",
    "rating": "4.0 out of 5 stars",
    "content": "The product itself is fine. Looks exactly like the image and is easy to follow the instructions. I will say I’m not sure how well it actually works, but if you believe in it then that belief may be what carries you through. For me, it hasn’t been a game changer yet. I thought it was worth a try for the price though. It certainly couldn’t hurt. ☺️",
    "post_time": "Reviewed in the United States on September 24, 2020",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I followed directions and planted in front of my home the day the for sale went in.  I was specific in my prayers.  My realtor suggested our home before we even officially listed it and they asked to see it a week before we were going to put it on the market.  They put an offer in same day!  So we sold our home before we even listed it!  Yes the house is beautiful and an easy sale, but when you put your faith in God and turn it over to him, if it is his will, it will be done.  Through faith your worries can melt away.",
    "post_time": "Reviewed in the United States on November 15, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Easy to follow instructions",
    "rating": "5.0 out of 5 stars",
    "content": "Nice statue and comes with the prayer",
    "post_time": "Reviewed in the United States on September 1, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "After following the instructions, he has yet to bring us a buyer!",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Sold before we listed our home on the website!",
    "rating": "5.0 out of 5 stars",
    "content": "Yes, faith is a powerful ally.  After we decided we were going to move across country and had found the home we wanted to buy in late July, we needed to sell our home in So Cal.  We felt we might be facing an uphill battle with a 1930's home in need of renovation $$$, located on beautiful acreage in a rural area where there were many homes for sale. While not Catholic, we put the power of St Joe and true faith to work.  We sold our home to the first person who looked at it prior to being listed on the MLS.  After escrow, packing, shipping and traveling across country, we moved into our NC home on Halloween!  We always kept the faith, followed the directions and believed it was possible. Yes, we feel indeed blessed and ever so thankful to St. Joseph, who moved with us and has a special little spot in our new home.",
    "post_time": "Reviewed in the United States on December 29, 2014",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been a Catholic for 52 years and I have a strong Catholic faith but I had never heard about burying St Joseph to sell your home until a few years ago. Our grandson put his home on the market the Monday before the St Joseph Novena started and St Joseph was buried.  They had many showing and their home was sold in one week of being on the market. St Joseph the Worker pray for us.",
    "post_time": "Reviewed in the United States on March 24, 2021",
    "pid": "B007XG6B2K"
},
{
    "title": "Worked once before",
    "rating": "5.0 out of 5 stars",
    "content": "All I can tell you is this; we listed the house on Oct 10th.  There were plenty of showings within the first 2-3 weeks plus an open house in late Oct.  I believe about 15 showings during that time, but not a single offer. Things were looking a little grim and headed into the holidays, we were getting concerned.  I heard about this kit from people at work so I bought it.  We buried St. Jo Nov 6th, following the instructions to the letter.  5-6 days later, we got two offers on the same day, one of which was accepted at full listing price….",
    "post_time": "Reviewed in the United States on November 25, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I own 2 properties in a beach town and want to sell one to my renters. I planted St Joe & said the prayer. Meantime, my friend had just put his house on the market. Well, his house sold in 24 hours!! My renters contacted me 2 weeks later & said they’ll contact me this summer about buying my condo as a cash sale. Still not a done deal for me, but I’m hoping St Joe helps out.",
    "post_time": "Reviewed in the United States on May 3, 2019",
    "pid": "B007XG6B2K"
},
]