[
{
    "name": "        Religious Gifts Saint Joseph Statue Home Seller Kit with Prayer Card and Instructions       ",
    "stars": [
        "83%",
        "8%",
        "5%",
        "2%",
        "3%"
    ],
    "pid": "B007XG6B2K",
    "ratings": "9,696 ratings",
    "other_info": {},
    "discount_price": "$ 7.68",
    "normal_price": "$9.88",
    "about_this_item": [
        " SAINT JOSEPH THE WORKER small statue is meant to be buried in the ground and thought to bring good luck when buying or selling a house  ",
        " INCLUDES prayer card and burial instructions for use. Making it easy and effective.  ",
        " BEAUTIFUL kit that makes the perfect gift for friends and family in your life who are in the process of buying or selling their home.  ",
        " STATUE burial is a long standing tradition in the Catholic faith where you pray to Saint Joseph's good will in hope for a fast, smooth, and profitable sale.  ",
        " BRING GOOD LUCK to those in your life who are in the home selling process.  "
    ]
},
{
    "title": "St. Joseph really works",
    "rating": "5.0 out of 5 stars",
    "content": "This is my third purchase of a St. Joseph statue. I am not a particularly religious person but was told that if you bury a statue of St. Joseph upside down with next to your house for sale sign facing your house and say the prayers that accompany the statue, your house will sell. I have done this three times and it has worked all three times , I did not bury him immediately when I put the houses on the market but would bury him only when I felt there was no interest in my houses or they were listed for to long.Hey if it works why not try it.",
    "post_time": "Reviewed in the United States on September 29, 2021",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had heard from several people this had worked for them.  Thought I have nothing to lose since the price is so low.  My house was on the market for 2 1/2 months with very little traffic.  I got this statue delivered on a Sat afternoon and followed the instructions and buried it.  Sunday afternoon I had a showing (and hadn't had one in over 3 weeks!) and never heard anything about that showing. Come Tuesday morning I got an offer!!!!  I swear it might be coincidental but somehow it freaking worked!!!  I unburied him when I moved and he is displayed in my new home for good luck.  I have no idea how this worked but it did.  I would def do it again if I ever move again and recommend anyone else having trouble selling to get this!  I really am skeptical about this stuff but cant deny the result!",
    "post_time": "Reviewed in the United States on January 19, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "I was skeptical but it worked!",
    "rating": "5.0 out of 5 stars",
    "content": "The realter put the sine up in my front Yarde and I put Saint joseph next to the sine  .",
    "post_time": "Reviewed in the United States on August 2, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The very next day the house wase sold. For my price. It made a believer of me.",
    "post_time": "Reviewed in the United States on December 15, 2016",
    "pid": "B007XG6B2K"
},
{
    "title": "I don't think it a Mirical. but it worked ?",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this after my home had been on the market for a few weeks and very little interest had been expressed (our home was in a very desirable area and was fairly priced). I got nervous as we had already made and agreed upon an offer on an another home and therefore, we needed to sell our home ASAP. I bought this St. Joseph statue and buried in the back yard upside down facing the house. Within a week of doing this our showings went up. Then we had two showings on the same day and two offers made. We accepted an offer that was above our asking price! Everything else went as smooth as one could hope for (inspection, appraisal, etc.) and I completely attribute it to this statue and the prayers that we said. However, I must say that I think you need to have faith and be a true believer of a higher power above us as that is really key. But I would recommend this statue to anyone looking to try to sell their home.",
    "post_time": "Reviewed in the United States on September 5, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I live in New York City and life circumstances led me make the decision to leave my apartment ASAP. However, I have a year and a half remaining on my lease. After finding out from my leasing company that I could sublease, I bought this statue knowing how time after time, St. Joseph has helped my family quickly sell property (I figured it would work on a rental, too!). Sure enough, he pulled through! I received the statue Thursday night while I was at my parent's house in New Jersey, said the prayer, and woke up to an inquiry from a person with the last name JOSEPH! I hadn't even buried it yet at that time! Needless to say, the potential renter is absolutely amazing -- i'm just waiting for my other roommate to meet her so we can sign the papers. I know this will all work out -- Thank you, St. Joseph! I am forever grateful for your intercession!",
    "post_time": "Reviewed in the United States on January 16, 2021",
    "pid": "B007XG6B2K"
},
{
    "title": "But I would recommend this statue to anyone looking to try to sell ...",
    "rating": "5.0 out of 5 stars",
    "content": "Three years ago my sister had her house up for sale 6 months, only had 3 people look at the house and no offers.",
    "post_time": "Reviewed in the United States on December 17, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A friend told her about St. Joseph, so she bought the statue and followed the instructions.",
    "post_time": "Reviewed in the United States on May 12, 2020",
    "pid": "B007XG6B2K"
},
{
    "title": "A True Godsend",
    "rating": "5.0 out of 5 stars",
    "content": "One week later they had a couple look at the house and put an offer on the house the next day.",
    "post_time": "Reviewed in the United States on April 2, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Last month my Granddaughter put her house up for sale, I bought the statue for her but had put it in the kitchen windowsill so she could put it in the proper place when they put the sign up.",
    "post_time": "Reviewed in the United States on December 30, 2017",
    "pid": "B007XG6B2K"
},
{
    "title": "It works!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I sell Real Estate. Anytime I have a challenging property I buy a Saint. Works every time :)",
    "post_time": "Reviewed in the United States on September 6, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Used him to sell our house. And saint Joseph answered my quest. Dug him back out of my yard after the sale, he rides in my car.",
    "post_time": "Reviewed in the United States on July 24, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Shipped as promised",
    "rating": "5.0 out of 5 stars",
    "content": "Our house has been on the market for about 4 months with lots of showings (almost 50) but not one offer. A friend suggested that we get one of these statues. We chuckled and I thought for $5, what the heck.",
    "post_time": "Reviewed in the United States on September 15, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The statue was delivered on Tuesday. We had 3 showings scheduled for that day.  The statue was delivered during the second appointment (my realtor called to let me know).",
    "post_time": "Reviewed in the United States on August 15, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "I wouldn’t have believed it if I didn’t see it for myself",
    "rating": "5.0 out of 5 stars",
    "content": "The 3rd showing says they want to schedule a second showing for next week!! BUT WAIT, IT GETS BETTER!",
    "post_time": "Reviewed in the United States on September 1, 2018",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We now have a full-price offer from a different party that came out yesterday. We could potentially end up with multiple offers! We haven’t changed a thing- not the price, not the house nothing.",
    "post_time": "Reviewed in the United States on March 29, 2020",
    "pid": "B007XG6B2K"
},
{
    "title": "Did the trick",
    "rating": "5.0 out of 5 stars",
    "content": "Crazy!",
    "post_time": "Reviewed in the United States on April 15, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "For $5, I’d say give it a try!",
    "post_time": "Reviewed in the United States on August 31, 2020",
    "pid": "B007XG6B2K"
},
{
    "title": "Saint Joseph Statue Home Seller kit",
    "rating": "2.0 out of 5 stars",
    "content": "After 90 days on the market, 5 days after putting this in the ground, house is under contract",
    "post_time": "Reviewed in the United States on April 10, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was getting desperate to sell my condo unit.  Six months on the market and not even one offer.  I placed the Saint Joseph statue standing upright in the living room area out of sight but had him facing the room.  Since it is a condo unit there was no place I could bury him upside down in the ground like the instructions said.  I placed him in my unit on August 3.  On August 27 I had a call from my realtor saying someone had made a cash offer for just a little under my asking price.  There were other units on sale for the same price in the building with a better view (ocean) but the buyer decided to go with mine.  I know this works!",
    "post_time": "Reviewed in the United States on May 1, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "It was worth a try",
    "rating": "4.0 out of 5 stars",
    "content": "I had a friend who used a Saint Joseph statue and it allowed them to sell their house in time (they had a contingent offer). We also were in the process of selling our house and had 3-months and burned one month with little result. We gave this a try, and actually saw the number of \"saves\" on Zillow drop almost immediately. We rode it out anyway and ran out of time to sell our house and I dug poor Saint Joseph up today. It was a fun effort, but can't work every time I suppose.",
    "post_time": "Reviewed in the United States on July 7, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had heard about st Joseph through a friend, and I though what the check I will give it a try. Now I am not sure if it really works, but it is a nice idea. Trying to sell a house is really a stressful time and being able to pray and say some of your worries is nice. We had our house on the market for 4 months and we needed to sell it lighting fast. We had to lower the house price by 10,000 grand, but got it sold. Our st Joseph sits in our kitchen window now in our new house it feels nice to feel like someone is watching over you.",
    "post_time": "Reviewed in the United States on June 15, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Give it a shot what do you got to lose",
    "rating": "4.0 out of 5 stars",
    "content": "The product itself is fine. Looks exactly like the image and is easy to follow the instructions. I will say I’m not sure how well it actually works, but if you believe in it then that belief may be what carries you through. For me, it hasn’t been a game changer yet. I thought it was worth a try for the price though. It certainly couldn’t hurt. ☺️",
    "post_time": "Reviewed in the United States on September 24, 2020",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I followed directions and planted in front of my home the day the for sale went in.  I was specific in my prayers.  My realtor suggested our home before we even officially listed it and they asked to see it a week before we were going to put it on the market.  They put an offer in same day!  So we sold our home before we even listed it!  Yes the house is beautiful and an easy sale, but when you put your faith in God and turn it over to him, if it is his will, it will be done.  Through faith your worries can melt away.",
    "post_time": "Reviewed in the United States on November 15, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Easy to follow instructions",
    "rating": "5.0 out of 5 stars",
    "content": "Nice statue and comes with the prayer",
    "post_time": "Reviewed in the United States on September 1, 2023",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "After following the instructions, he has yet to bring us a buyer!",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B007XG6B2K"
},
{
    "title": "Sold before we listed our home on the website!",
    "rating": "5.0 out of 5 stars",
    "content": "Yes, faith is a powerful ally.  After we decided we were going to move across country and had found the home we wanted to buy in late July, we needed to sell our home in So Cal.  We felt we might be facing an uphill battle with a 1930's home in need of renovation $$$, located on beautiful acreage in a rural area where there were many homes for sale. While not Catholic, we put the power of St Joe and true faith to work.  We sold our home to the first person who looked at it prior to being listed on the MLS.  After escrow, packing, shipping and traveling across country, we moved into our NC home on Halloween!  We always kept the faith, followed the directions and believed it was possible. Yes, we feel indeed blessed and ever so thankful to St. Joseph, who moved with us and has a special little spot in our new home.",
    "post_time": "Reviewed in the United States on December 29, 2014",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been a Catholic for 52 years and I have a strong Catholic faith but I had never heard about burying St Joseph to sell your home until a few years ago. Our grandson put his home on the market the Monday before the St Joseph Novena started and St Joseph was buried.  They had many showing and their home was sold in one week of being on the market. St Joseph the Worker pray for us.",
    "post_time": "Reviewed in the United States on March 24, 2021",
    "pid": "B007XG6B2K"
},
{
    "title": "Worked once before",
    "rating": "5.0 out of 5 stars",
    "content": "All I can tell you is this; we listed the house on Oct 10th.  There were plenty of showings within the first 2-3 weeks plus an open house in late Oct.  I believe about 15 showings during that time, but not a single offer. Things were looking a little grim and headed into the holidays, we were getting concerned.  I heard about this kit from people at work so I bought it.  We buried St. Jo Nov 6th, following the instructions to the letter.  5-6 days later, we got two offers on the same day, one of which was accepted at full listing price….",
    "post_time": "Reviewed in the United States on November 25, 2019",
    "pid": "B007XG6B2K"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I own 2 properties in a beach town and want to sell one to my renters. I planted St Joe & said the prayer. Meantime, my friend had just put his house on the market. Well, his house sold in 24 hours!! My renters contacted me 2 weeks later & said they’ll contact me this summer about buying my condo as a cash sale. Still not a done deal for me, but I’m hoping St Joe helps out.",
    "post_time": "Reviewed in the United States on May 3, 2019",
    "pid": "B007XG6B2K"
},
]