[
{
    "name": "        Conair Ceramic Hot Rollers for Long, Medium, and All Hair- Hair Curler - Hair Roller Clips Included - 1 1/2-inch and 1 3/4-inch Rollers - Amazon Exclusive       ",
    "stars": [
        "56%",
        "15%",
        "12%",
        "6%",
        "10%"
    ],
    "pid": "B007S69QAY",
    "ratings": "26,564 ratings",
    "other_info": {
        "Item Form": "Clip",
        "Hair Type": "Curly",
        "Number of Items": "1",
        "Material": "Ceramic",
        "Size": "1 Count (Pack of 1)"
    },
    "discount_price": "$ .",
    "normal_price": "$39.99",
    "about_this_item": [
        " Ceramic Hot Rollers For Voluminous Curls: The ceramic flocked jumbo and super jumbo rollers in this 12 piece hairsetter heat quickly for a natural, high powered shine and voluminous curls and waves  ",
        " Easy To Use: These rollers use Ceramic technology to provide consistently even heat transfer for long lasting curls; They heat up quickly and evenly in 85 seconds; Velvety covering on the rollers helps protect hair from heat damage.Clean the unit and the heating strips with a cloth  ",
        " Full Set: Includes 12 ceramic flocked rollers of two different sizes; Four 1.75 inch super jumbo rollers and eight 1.5 inch jumbo rollers; This special set includes 12 super clips to hold the rollers in place  ",
        " Gorgeous Curls of All Types: Check out our rollers for the big, bouncy curls, voluminous waves and fullness that only hot rollers can deliver; Just roll ‘em, apply makeup, get dressed, unroll and go  ",
        " Conair Hair Care: Since 1959, we have made innovative small appliances, hair styling tools, and more; Our hair care line includes high quality hair dryers, brushes, styling tools, and hair accessories  ",
        " Note : Hot Roller Set should be placed on hard, flat surface (ie: bathroom counter), Lid must remain closed tightly to ensure proper heat up, If too much hair is put around 1 roller, clip will not hold in place as roller is too heavy  "
    ]
},
{
    "title": "Mine didn’t even work",
    "rating": "2.0 out of 5 stars",
    "content": "Like another review I saw, my rollers never fully turned on. The light went red and never turned white. They were hot, but clearly not as hot as they should be. Still, I tried to curl my hair anyway. The reviews are right about the clips — they’re awful and you definitely need stronger ones to hold the roller where you want it to be. My hair barely got a wave and I left them in for over 10 minutes. Granted I don’t think mine even heated up all the way. Returning…",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The curlers do give a smooth curl for long hair but are EXTREMELY difficult to hold in your hair with the clips provided.  I am in the process of ordering the u-clips in hopes that it will help.  If you have no intention of moving after setting your hair you may be okay but I don't have that luxury.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "hard to hold",
    "rating": "2.0 out of 5 stars",
    "content": "I used hot curlers years ago and loved them. I thought these would be perfect since they’re larger and wouldn’t give a super tight curl. Nope. Volume and curl held for about 30 min after taking them out. Yes, I let them heat 30 min, left them in 30 min even though they were totally cooled by 20, and still barely worked. My hair is thick, but the individual strands are fine, so I think if I had 2 sets, it’d go better, but who wants to buy and store 2 full sets of curlers… also annoying the clips have no storage bag or compartment in the base, so I could losing them easily. Curling iron is much faster for me. Returned it.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Just to throw this out there, because I know some people think that the T3s offer something really unique or superior, but in my opinion, they function the exact same as these.  I have completely straight hair and have used traditional hot rollers for years (still have a set I purchased in college 20 years ago that provide a tighter curl).  I had big hopes and visions for these jumbo rollers yielding gorgeous, huge, soft, 90s era Victoria's Secret model hair and....not so much.  Maybe for someone with a natural wave or curl.  Both these and the T3 do give soft, subtle volume but my crown gets \"piecey\" and you can see each division of where I rolled a section; these yield a much better nice, natural curl to my very long hair (almost to my natural waist), mostly just a light curl at the ends.  Each time I roll it I get a little better at it and get better results.  But overall, I like these so much, and they are every bit as good if not better than the ones that cost 4 times as much.",
    "post_time": "Reviewed in the United States on February 18, 2022",
    "pid": "B007S69QAY"
},
{
    "title": "I just couldn’t get them to work right",
    "rating": "3.0 out of 5 stars",
    "content": "Too many small rollers. I needed the bigger rollers.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is my first time trying hot rollers so I wasn't sure what to expect, and I've had to play around for a while. I ordered some alternative pins because the clips were accomplishing nothing at all, but then I cancelled my order because after some practice, I realized it was user error. The clips shouldn't be a problem if you use all of the rollers and try to layer them tightly, starting with the lowest sections. That way each roll can sort of bear the weight of the one above it, especially if you angle the clips so that the butterfly part (I don't know words, I'm sorry) is pressed against your head. As far as performance goes, I'm still playing around with how long to heat them up before using, and how long to leave them in. They don't get hot enough to hurt my fingers when handling, and I have very fine hair, so I might need to use more product to have lasting volume. This won't give your ringlets but if you want to look like the mom-who-is-also-a-lawyer in a 90's kid movie, this is perfect.",
    "post_time": "Reviewed in the United States on May 20, 2022",
    "pid": "B007S69QAY"
},
{
    "title": "Work as well as $130 luxury rollers, stick-straight hair review",
    "rating": "4.0 out of 5 stars",
    "content": "This rollers in this set was the perfect size for what I wanted for my long hair (almost to elbows) and thick, frizzy hair. It heated quickly, and the clips were easy to use. The large curls/waves were nice but didn’t last long- I used gel and hairspray. But the look was nice!",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Wife bought this to replace an older model which finally gave up after 8 years.  Works great for her purposes.",
    "post_time": "Reviewed in the United States on May 1, 2013",
    "pid": "B007S69QAY"
},
{
    "title": "Roller",
    "rating": "2.0 out of 5 stars",
    "content": "She uses it to smooth out her wavy, almost shoulder-length hair, which has a tendency to frizz, and to give it volume.  The jumbo and super jumbo rollers (and large rollers, if you have some) work well for this purpose, necessary in hot humid Florida.  (Don't need those wimpy medium and small rollers you find on other hair setters.)  It doesn't have enough rollers (12) so she adds extra rollers (6 more) as she uses the hot ones.  (Always save your old setter's rollers and clips for this reason.)  This works out because the setter heats so quickly.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "She doesn't like the \"claw\" clips so she uses the clips from two old hairsetters.  One style resembles wooden clothespins (came with the old model); the other style resembles a large hairpin (came with an even older hair setter).  The hairpin style works well for that front roller on the top of your head; put the clip on the roller backwards, open end towards your forehead (clip is too small for the super jumbo roller, use the jumbo roller).  Also, be sure to hairspray each segment of hair before you roll it and spray your whole head after all the rollers are in.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Electric rollers",
    "rating": "3.0 out of 5 stars",
    "content": "I find the clips are difficult to use",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I am so disappointed with the holding power of the clasps  for the curlers.  Used them once .  they are not a tight hold and  the rollers  can fall out or droop.  If I had not thrown the box away  I would return  them.",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Need to improve on clasps",
    "rating": "4.0 out of 5 stars",
    "content": "I've never used hot rollers before but these rollers are cute and convenient. These rollers always make my hair so bouncy and I love that there is a variety of sizes. When I went to Ulta to look for these, they only had one size or the other. The amount of rollers it comes with is not enough to do all of my hair ( have very thin hair but alot of it) in one go, but I normally do it by sections and it works fine. These curls also do hold long too, I never use hairspray or hair products really and my curls hold. I will say though, these rollers do get pretty hot if you let them sit in there too long before use. These also come with roller clips, which I will say are a bit flimsy but work. I probably will buy something different in the future for the clips. Overall great product.",
    "post_time": "Reviewed in the United States on January 7, 2023",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "These rollers work fine and add body to my hair. However, the curl is not very lasting so they give my hair decent body but not much curl.  I went to non-heated rollers to get more curl and they work better on my hard-to-hold-curl hair.  The rollers heat up fast and are easy to use.",
    "post_time": "Reviewed in the United States on January 1, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Gets pretty warm",
    "rating": "4.0 out of 5 stars",
    "content": "Rollers heat up very well and work really great with curling my hair. The pins that come with it absolutely suck and do not hold them in place. So I had to use some other types of clips that I have. If your wanting to buy this buy the separate metal pins for it.",
    "post_time": "Reviewed in the United States on January 12, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Who creates an electrical product and doesn't put an on/off switch on it? I have to plug and unplug this every time I use it. Not convenient when its on a dresser and I have to pull the dresser out from the wall or go plug the curlers into a socket in the kitchen or hall! Never even thought to look in the description because in the 30 years I've used electric curlers, there's always been an on/off switch.",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Work Well",
    "rating": "4.0 out of 5 stars",
    "content": "Thank God they came out with just jumbo and super size rollers!.I have wasted so money on these units because they always had too many small and medium roller and only one or two jumbos. Companies took FOREVER to think of us long hair stylers and made too many smaller sizes. Only recently did I find them at my favorite place...AMAZON!. My one COMPLAINT/problem is I hate those plastic clips that fall out 100 times before you finish rolling your entire head.I like the old wire ones that stick around the roller to hold them in place but they sell them plastic breakable clip, (most manufacturers at least) for a fortune  and, once again, you don't have enough clips for the curlers, all small and smaller by the bulk after buying so many sets, and the bigger ones aren't enough to wrap around the  newborn's one curl at the top of their head.I guess no one told the manufactures that big ones also helped pull the friz out of those of us that have hair that frizzing to their nap of their NECK.  Personally I like two wire holders for each curlers. The plastic ones always slip and pop off in the toilet where you have to fish it out with a hanger and throw it away. One less clip! I think I GOT OFF THE SUBJECT, Conair thank you for finally giving us sets in different sizes and at prices that are affordable to go and buy two sets of clips to finish a style. Don't skimp on your quality though, you are the best. You have the perfect flocking, perfect heat and with a few wire clips they wont fall out ! And for that matter they are priced just right. Good job conair!",
    "post_time": "Reviewed in the United States on December 3, 2015",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Good quality material on the rollers. Clips are to soft and combs are too short for the weight and width of the roller.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Great Rollers!",
    "rating": "3.0 out of 5 stars",
    "content": "The rollers are the perfect size for hair volume. The clips are horrible! The rollers are large and heavy; the clips don’t support them. I have watched the videos showing how to secure the rollers, but I still can’t make it work properly. I have been using hot rollers since the 1980’s. These are definitely the worst clips I have ever encountered. Be prepared to stay very still for the length of time you leave these rollers in your hair. The good news is your hair will look great!",
    "post_time": "Reviewed in the United States on February 17, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It did not get as hot as my old rollers that broke.  I am bummed it does not make the curls as well.",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "B007S69QAY"
},
]