[
{
    "name": "        L'Oreal Paris Revitalift Triple Power Anti-Aging Eye Cream Treatment, with Pro Retinol, Hyaluronic Acid & Vitamin C to Reduce Wrinkles, De-puff and Brighten Skin, 0.5 fl. oz.       ",
    "stars": [
        "63%",
        "18%",
        "11%",
        "3%",
        "4%"
    ],
    "pid": "B008CT12G2",
    "ratings": "11,804 ratings",
    "other_info": {
        "Brand": "L'Oreal Paris",
        "Item Volume": "0.5 Fluid Ounces",
        "Item dimensions L x W x H": "1.26 x 1.93 x 5.71 inches",
        "Age Range (Description)": "Adult",
        "Special Feature": "Anti Aging"
    },
    "discount_price": "$ 18.33",
    "normal_price": "$36.66",
    "about_this_item": [
        " Revitalift Triple Power Eye Treatment visibly reduces wrinkles, de-puffs and brightens skin around the eye area  ",
        " This anti-aging eye cream has been formulated with 3 of the top derm-recommended ingredients - Pro-Retinol, Hyaluronic Acid and Vitamin C  ",
        " After use, skin feels softer, smoother and is hydrated for 24 hours - After 1 week, it visibly reduces wrinkles, firms and brightens skin  ",
        " Our luxurious texture with a metal tip applicator absorbs quickly, is non-greasy and does not clog pores - Paraben free, Mineral Oil free, Allergy tested, Fragrance Free  ",
        " Revitalift Triple Power Eye Treatment packaging and formula may vary - Always read the ingredient list on the product label before use  "
    ]
},
{
    "title": "It works!",
    "rating": "5.0 out of 5 stars",
    "content": "The before is on the left the after is 2 wks later. I have no make up on I the pics. I am happy with the results!",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Es refrescante y fácil de aplicar, tiene un aroma agradable.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Muy bueno",
    "rating": "5.0 out of 5 stars",
    "content": "Great",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The metal applicator tip has a cooling sensation. Very pleasant.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Great",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use.. I like the texture and it’s what I was looking for. Perfect for my trips with one handbag!",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve spent a lot of money on skin routines. But this product is by far the best! And thankfully the most affordable. It reduces wrinkles and puffiness. I’ve been using this product for over a year now.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Nice",
    "rating": "5.0 out of 5 stars",
    "content": "Revitalift anti-aging eye cream reduced the appearance of the fine lines just under my eyes.  Be careful when squeezing the tube since I have squeezed too hard and way too much came out (and can't put it back in.) I will be buying more since this price is less than the drug stores.",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It really works.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "I love it!",
    "rating": "2.0 out of 5 stars",
    "content": "I've given up thinking any of these products work.  Have tried different brands and no change at all. Won't be buying anymore of these, a waste of time and money! It goes on smoothly and smells good that's why I gave the 2 stars.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The metal tip is some thing I never knew I needed, but it helps my puffiness in the morning tremendously",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "would recommend",
    "rating": "5.0 out of 5 stars",
    "content": "I've been using this product for about 3-4 days and i can totally see a difference. If you are looking to switch from the Cerave repair cream this is the way to go! It moisturizes and leaves your undereyes looking hydrated.",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I purchased my L'Oreal Paris Revitalift Triple Power Anti-Aging Eye Cream Treatment with Pro Retinol, Hyaluronic Acid & Vitamin C from my Amazon wishlist last year. Ive used it several times a week since and it works magnificently to reduce wrinkles, brighten skin around the eyes and treat puffiness in the occipital areas of the face. Let me tell you something, on the days I didn't use it I could tell a tremendous difference in the appearance of my face. I recommend this wonderful treatment to anyone getting over 35 in age. It will be a god send to you.",
    "post_time": "Reviewed in the United States on May 12, 2023",
    "pid": "B008CT12G2"
},
{
    "title": "Great for dark circles and puffiness",
    "rating": "4.0 out of 5 stars",
    "content": "L'Oreal Paris Revitalift Triple Power Anti-Aging Eye Cream Treatment, with Pro Retinol, Hyaluronic Acid & Vitamin C to Reduce Wrinkles, De-puff and Brighten Skin, 0.5 fl. oz.",
    "post_time": "Reviewed in the United States on July 28, 2023",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m still looking for that miracle, but I don’t think it exists.  This under eye cream works.  I am plagued by eye bags, but I can count on this cream to give me a boost, a tightening.  I follow it with the collagen filler (seems to work better at night, but I reapply the Revitalift anyways).  It has a great scent, it smooths on with the metal applicator, and it absorbs relatively quickly.  Best price than anywhere else.  I have purchased anew and will continue to do so.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Pleased",
    "rating": "5.0 out of 5 stars",
    "content": "Great product!!",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love it a lot",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "Awesome product for your eyes!",
    "post_time": "Reviewed in the United States on May 23, 2023",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I used this product years ago and it worked then after long Hrs and exhausted from the night shift going into day shift.  I ran out, forgot about it then came across it.  I began using it again I am 60 and within a few hours the undereye puffiness went away and I noticed personally the dark circles went down.  I also put it on as I am priming my face before makeup, let it sink in and dry ( 2 rolls) and the concealer goes on perfectly, no caring, no pulling ect. It last a good night out. Remove your makeup before sleep and put on your night sleep cream and your good to go.  Pretty darn tooting happy with this along with the New application process from the roller to this, you are in control and not wasting anything.  Thumbs up 👍",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Very good",
    "rating": "3.0 out of 5 stars",
    "content": "El producto es una crema para el contorno de ojos y vino abierto sin ningún sello de protección",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This cream feels nice and light, but it didn't really do much for my dark circles, unfortunately. I was hoping it would lighten them up a bit, but no. Also, not a big fan of the applicator.",
    "post_time": "Reviewed in the United States on December 7, 2023",
    "pid": "B008CT12G2"
},
{
    "title": "It's ok",
    "rating": "3.0 out of 5 stars",
    "content": "Doesn't work great for my under eye puffiness. I'm just doomed to have puffy eyes forever.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Me ha encantado, soy de piel atopica (sensible) y me ha funcionado de maravilla, muy humectante y el aplicador es cómodo y se mantiene frío",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Excelente textura",
    "rating": "5.0 out of 5 stars",
    "content": "I really liked it, I just bought it again. I feel that the cream is very hydrating in the eye area. I've always had genetically deep-set dark circles, but this cream at night is wonderful; I wake up with my dark circles less pronounced and the eye looks brighter. Less dull. I use it in the morning and before going to bed!",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have only been using this for 2 weeks and I already see a dramatic difference. My eyelids were very wrinkly and now there is only a faint wrinkle. I’m amazed how well this works!! If you are on the fence about buying it just do it, you won’t regret it",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "It works! I re-purchased",
    "rating": "5.0 out of 5 stars",
    "content": "I actually see a difference!!  I was shocked.  This in my buy again cart for sure!!",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excelente para ojeras.  Las mías son oscuras y han aclarado",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Amazing",
    "rating": "5.0 out of 5 stars",
    "content": "Great product",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Yeah!!",
    "rating": "3.0 out of 5 stars",
    "content": "I have been using the product for several weeks. Unfortunately I do not see any improvement. Maybe it takes longer?",
    "post_time": "Reviewed in the United States on April 26, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Plus, price is steep for the amount of product.",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Under eye bags",
    "rating": "3.0 out of 5 stars",
    "content": "I'm 41 starting to get a little puffiness under my eye. I reached for this product to see if it could hwlp. Been using one week daily haven't seen a diff unfortunately for that. It does feel nice and cold going on seems to hydrate ok just doesn't seem to work for wrinkles nor puffiness",
    "post_time": "Reviewed in the United States on March 14, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wish I'd started using this eye cream sooner!  I am seeing results for the lines and darkness under my eyes.  I always had issues using any products near my eyes because it would seem to migrate into my eyes and cause irritation, tears, etc.  This product does not seem to do that and the applicator is so refreshing and cooling .  I am liking it very much.  I also apply it to my 'squint' crease on my forehead and I can see it helps there too.",
    "post_time": "Reviewed in the United States on November 5, 2023",
    "pid": "B008CT12G2"
},
{
    "title": "This eye cream works!",
    "rating": "3.0 out of 5 stars",
    "content": "I hate the tip. Feels good but does nothing. Too expensive",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wish I took a before photo. I was skeptical because I had yet to find an eye cream that looks like it’s working within a year of using it. I’ve been using for almost a month now and have seen a huge difference in my crows feet. I have sensitive skin and this did not irritate it.",
    "post_time": "Reviewed in the United States on February 6, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Ecpensive",
    "rating": "3.0 out of 5 stars",
    "content": "I tried for a week.  I did not notice any difference, sad to say.",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Es una buena crema hidratante para el",
    "post_time": "Reviewed in the United States on November 22, 2023",
    "pid": "B008CT12G2"
},
{
    "title": "Best by far",
    "rating": "4.0 out of 5 stars",
    "content": "Contorno de ojos yo la recomiendo más por la noche porq para el día queda un poco grasosa",
    "post_time": "Reviewed in the United States on January 10, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "You use it consistently. I’m not sure about long-term results yet.",
    "post_time": "Reviewed in the United States on January 23, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "The eyes have it",
    "rating": "5.0 out of 5 stars",
    "content": "Me gusta la sensación que deja en mi piel",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great as advertised",
    "post_time": "Reviewed in the United States on March 1, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Christmas gift",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for my sister as a Christmas gift and she loves it! She says she likes the ‘cold feeling’ of the applicator and uses it every night. I’m not sure how the product has worked for her but glad she’s enjoyed using it!",
    "post_time": "Reviewed in the United States on February 23, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My eyes feels so much better after using this product. It's so soft against the skin and I love to use it in the morning first thing but also in my evening routine. My puffiness has totally disappears. Will definitely buy again.",
    "post_time": "Reviewed in the United States on February 22, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "soft for my eyes",
    "rating": "5.0 out of 5 stars",
    "content": "I'm always seeking the ultimate eye cream that works to get rid of puffy eyes. In my case it's age but mostly allergies causing water retention. By far this eye cream works better than anything else. It even worked to stop my right lid from sagging. It started working right away and continued to get better over a period of a couple of months and it seems to be restored to normal, however I do continue to use it everyday. It doesn't claim to work on sagging lids but it does. In fact, I've never found another eye cream that does. Evidently one or more ingredients is different than what's in most other eye creams.",
    "post_time": "Reviewed in the United States on July 3, 2023",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I didn't know that there would be just one cream in the package. Did the other get lost in packaging?",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "A 1st Rate Eye Cream",
    "rating": "2.0 out of 5 stars",
    "content": "I don’t recommend purchasing this product. When I have attempted to apply it to my under eye area, it squirts out haphazardly everywhere when I attempt to it on the eye area I’m not successful.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I normally like L’Oreal products, but this is not one I can recommend. Find a different product.",
    "post_time": "Reviewed in the United States on March 26, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Only one tube of cream.",
    "rating": "3.0 out of 5 stars",
    "content": "It’s got all the ingredients that are supposed to work at a really great price! 🤞🏻 that it works on me. Too early to tell, right now it’s great moisture for my face skin.",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The texture is too sticky for me. But the design is very handy",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "B008CT12G2"
},
{
    "title": "Impossible to Apply",
    "rating": "4.0 out of 5 stars",
    "content": "Everything remains the same as before with my EYE Areas. No miracle Cream",
    "post_time": "Reviewed in the United States on October 28, 2023",
    "pid": "B008CT12G2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It works.  Removes some of the puffiness from my eyes, which I really need in the morning.  I would buy it again.",
    "post_time": "Reviewed in the United States on January 6, 2024",
    "pid": "B008CT12G2"
},
]