[
{
    "name": "  Fava: A Francine Vega Investigative Thriller (Vega Thriller Book 1) ",
    "stars": [
        "48%",
        "32%",
        "15%",
        "3%",
        "3%"
    ],
    "pid": "B00I54TIW4",
    "ratings": "725 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$21.83",
    "about_this_item": []
},
{
    "title": "Fast Paced and Intriguing Story",
    "rating": "5.0 out of 5 stars",
    "content": "Francine Vega shines as a news reporter uncovering a plot to foster a world War while being falsely accused as being responsible. Read how she and Wil an FBI special agent foil the plot.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very entertaining although the plot was pretty improbable. Very likeable characters and fast paced action. I enjoyed the story and will read more by this author.",
    "post_time": "Reviewed in the United States on December 10, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Entertaining if improbable",
    "rating": "5.0 out of 5 stars",
    "content": "The current divisive political rhetoric is absolutely abhorrent to me, so when I read this book, I was happy to see that it addressed the issues in a fictional story.  It seems impossible for an author to anticipate what might arise in politics, but John Hazen's prescient portrayal of the damage that bombastic language can do in our society was fascinating.  Who were the heroes?  Interesting to even imagine that a news reporter might actually team up with the FBI to be more effective than either on their own.  This was a terrific book that is perfect for our uncertain times. It is suspenseful, but in the end, it is uplifting and hopeful.  How can we all learn to live together?  Should we distrust government because of a few bad apples? Having traveled to Israel, it was a pleasure to read the descriptions of the country, and the good heartedness of the people.",
    "post_time": "Reviewed in the United States on March 18, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Was this even edited?  There are so many spelling errors in this book, it really detracts from what could be a great story.  There are a few areas where it's evident the author changed his mind about how he wanted to write, to the point where certain sentences change meaning.  The plot, while not very believable, is at least developed enough to be entertaining.  Suspend what you know about reality, and just go with it.",
    "post_time": "Reviewed in the United States on January 5, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Where will all this divisive political rhetoric take us?",
    "rating": "4.0 out of 5 stars",
    "content": "Fast paced story. Frightening to think that someone might want to destroy a whole religion and think that it is patriotic.",
    "post_time": "Reviewed in the United States on December 26, 2023",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This one will keep you on your toes and holding your breath as Francine Vega tries to stop either the end of the world or WWIII from occurring. Special Agent Will Allen accompanies her-he is one of the few people who believe the threat is real. There are just too many high officials in a couple of different countries all in on this--can they stop it all--will they survive it.",
    "post_time": "Reviewed in the United States on August 29, 2018",
    "pid": "B00I54TIW4"
},
{
    "title": "Editing?  What's that?",
    "rating": "5.0 out of 5 stars",
    "content": "The twists and turns will keep you reading. This can also be read as a stand alone--although I would suggest you start with the first book in the series! Do as I say--not as I do!! But in any case--read it!!",
    "post_time": "Reviewed in the United States on December 3, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a dangerous book. Are there people who think this way? Fortunately this is a novel, namely a work of fiction. Yet it is also  a story with romance and unpredictable actions. The characters are so well described that one can easily imagine them. Writing style is excellent and filled with suspense. It has more twists and turns and ups and downs than a roller coaster. I could not put it down and highly recommend it.",
    "post_time": "Reviewed in the United States on February 20, 2021",
    "pid": "B00I54TIW4"
},
{
    "title": "Exciting",
    "rating": "2.0 out of 5 stars",
    "content": "The TV reporter finds the lottery winner and gets an interview.  He's on the down and out, not what she expected.  And when he said he was going to get revenge for his brother's death, that raised some alarms which she decided to investgate further.  Think hajj, Israelis, 9-11, FBI, TV reporting, WW III, and love.  Love?",
    "post_time": "Reviewed in the United States on December 12, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A fast read and and an interesting story.",
    "post_time": "Reviewed in the United States on December 3, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Enjoyable",
    "rating": "4.0 out of 5 stars",
    "content": "I loved this story for the most part.  The  last quarter of the book was lost on me although some would be into it.",
    "post_time": "Reviewed in the United States on October 26, 2019",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I'm sure I'll get bashed for this but when an author misrepresents the beliefs of Christian's and makes the first one in the story to be a nut job, he has lost my interest.",
    "post_time": "Reviewed in the United States on May 3, 2021",
    "pid": "B00I54TIW4"
},
{
    "title": "Nope",
    "rating": "4.0 out of 5 stars",
    "content": "Check your information John.  Islam is very little like Christianity or Judaism.  Yes, Abraham was the father of all three but Allah and God are VERY different.  Jesus is VERY different between Christianity and Islam.  Also, read the Quran.  It is all about conquering and war.  Read what Jesus says... love.  Huge difference.",
    "post_time": "Reviewed in the United States on November 23, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "A wild turn of events befall a determined journalist who stumbles into the middle of an international crisis. Determined to get to the truth behind what is going on, Frannie finds herself in grave danger. Bodies begin turning up everywhere and things really start heating up.",
    "post_time": "Reviewed in the United States on December 11, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Going to Help and Back",
    "rating": "5.0 out of 5 stars",
    "content": "Fava meets the action genre requirements for a beautiful, lucky heroine with just the right contacts, and the plot is riddled with anti-islamic sentiments. The combination might make an uncomfortable cliché, but author John Hazen manages to pull it back into something more intriguing.",
    "post_time": "Reviewed in the United States on December 17, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A few proofing issues, but otherwise an easy read with plenty of angles, aspirations, and action, though I certainly wouldn't call it a thriller.",
    "post_time": "Reviewed in the United States on November 7, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Improbable but nonetheless intriguing, though by no means a thriller",
    "rating": "5.0 out of 5 stars",
    "content": "This was a story that was too close to true in a world that we live in today the action entry the investigating that the reporter had done was phenomenal . The author did a great job of portraying each of the characters in a good light and provides a lot of excitement and intrigue . Definitely a must read book",
    "post_time": "Reviewed in the United States on November 9, 2019",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Lots of twists and turns. Although the heroine seems to easily share her heart and her bed, she charms the reader too with.her courage and determination to save the world.",
    "post_time": "Reviewed in the United States on November 13, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Exciting great read hard to put down",
    "rating": "3.0 out of 5 stars",
    "content": "Starts off fairly simple and just gets more and more complex. The characters have to persevere as roadblocks mount up at every turn. A good read with strong interesting characters aggressively fighting to prevent a catastrophe.",
    "post_time": "Reviewed in the United States on February 13, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good read. Interesting concept for the plot. Slow in parts and some areas seem a bit far fetched, but generally entertaining.",
    "post_time": "Reviewed in the United States on December 21, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Unique story.",
    "rating": "4.0 out of 5 stars",
    "content": "Great book fuel of suspense but also personal and romantic. Great characters and creative plot. I would highly recommend this book to a friend.",
    "post_time": "Reviewed in the United States on November 17, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I thought I would not like it with a woman as central character but found I just couldn't put it down. Great read!!",
    "post_time": "Reviewed in the United States on December 12, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Gathered me up a sucked me in. nailed it for keeping one's interest",
    "rating": "5.0 out of 5 stars",
    "content": "An FBI Special Agent and a tv reporter from New York City are caught up in a plot to destroy Mecca. Read along as they try to foil the plot before innocent lives are lost. An interesting story line and good character development make this worth your time to read.",
    "post_time": "Reviewed in the United States on December 23, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "While the story line holds some interest, the many grammatical and spelling errors were so disruptive, I would not read another book by this author. There were paragraphs that did not make sense. Was this even spell checked let alone edited and/or proofread.",
    "post_time": "Reviewed in the United States on January 15, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Interesting thriller",
    "rating": "5.0 out of 5 stars",
    "content": "Very interesting and entertaining storyline about a tv reporter and an FBI agent trying to stop a crime while being targeted themselves.",
    "post_time": "Reviewed in the United States on February 14, 2020",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book started out fast n furious and continued from page one to the end (happy ending).",
    "post_time": "Reviewed in the United States on November 22, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Too many errors",
    "rating": "5.0 out of 5 stars",
    "content": "The plot was great and followed a trend that let you know what was happening all the time.",
    "post_time": "Reviewed in the United States on August 12, 2019",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Take time to buy this 📚.",
    "post_time": "Reviewed in the United States on January 23, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Fava",
    "rating": "4.0 out of 5 stars",
    "content": "Should be at least an ✳️✳️✳️✳️✳️✳️✳️✳️star.",
    "post_time": "Reviewed in the United States on January 4, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Jerome",
    "post_time": "Reviewed in the United States on December 6, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Good read",
    "rating": "4.0 out of 5 stars",
    "content": "Was an easy read. Not great suspense but I enjoyed the book.",
    "post_time": "Reviewed in the United States on December 17, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good book, will definitely look for more stories written by this author.",
    "post_time": "Reviewed in the United States on December 17, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Four Stars",
    "rating": "5.0 out of 5 stars",
    "content": "Novel plot, well-developed characters, and good pacing. A small demerit for referring to the grips of a handgun as a \"handle\" but, since that designation came from a character who is a TV reporter, it may have been intentional. Thanks Mr. Hazen!",
    "post_time": "Reviewed in the United States on November 25, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "the results may be predictable but fast paced with interesting points",
    "post_time": "Reviewed in the United States on December 9, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "A good read for a lazy day.",
    "rating": "5.0 out of 5 stars",
    "content": "I recommend this book to everyone. John Hazen has written a book full of intrigue taking you with reporter Francine around the globe to save the world from war. I so enjoyed this I hope it becomes a best seller.",
    "post_time": "Reviewed in the United States on November 23, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "shows how a few people can cause world disaster.",
    "post_time": "Reviewed in the United States on January 16, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "good tale",
    "rating": "5.0 out of 5 stars",
    "content": "This book had intrigue, powerful relationships, danger of WWIII, and most of all, love. It provided insight to a reporter's life and what can happen if a person doesn't give in to fear in order to do the right thing.",
    "post_time": "Reviewed in the United States on December 12, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Excellent story and weii written.",
    "post_time": "Reviewed in the United States on September 14, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Love this book",
    "rating": "5.0 out of 5 stars",
    "content": "This is the second book that I've read of the Author John Hazen and I am even more impressed with his story telling abilities now than before.  I was captivated by the characters and the story and recommend it to anyone.",
    "post_time": "Reviewed in the United States on May 16, 2014",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "like it",
    "post_time": "Reviewed in the United States on July 13, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Typical chick book!",
    "rating": "3.0 out of 5 stars",
    "content": "Everything works out nice and clean and no one gets hurt except the bad guys.  Never again!  What crap!  ~",
    "post_time": "Reviewed in the United States on December 1, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fava is a great book and a wonderful read. I couldn't put it down! I look forward to reading more books by this author and (please!) a sequel to Fava. I  highly recommend this book. Jane Brickner",
    "post_time": "Reviewed in the United States on September 16, 2014",
    "pid": "B00I54TIW4"
},
{
    "title": "Fava is a great book and a wonderful read",
    "rating": "4.0 out of 5 stars",
    "content": "Easy read",
    "post_time": "Reviewed in the United States on August 29, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "eh",
    "post_time": "Reviewed in the United States on December 12, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Thriller",
    "rating": "3.0 out of 5 stars",
    "content": "Interesting concept. Clancey would have gone into more depth, been more technically detailed but this was a good story overall.",
    "post_time": "Reviewed in the United States on February 4, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent gripping narrative as Francine Vega pusues journalism. The story has great twists and turns and keeps you reading until you reach the end. Great plot and character development! Congratulations, John Hazen!!!",
    "post_time": "Reviewed in the United States on February 14, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Four Stars",
    "rating": "5.0 out of 5 stars",
    "content": "Amazing read that I thoroughly enjoyed. I couldn't stop reading it - it was a real top-notch thriller that I recommend to all who enjoy surprises, thrills and excitement.",
    "post_time": "Reviewed in the United States on December 6, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A great plot, almost surreal.  An author who superbly intertwined plot with enough technical knowledge to provide a never-ending, power-packed literary ride.  A great read!",
    "post_time": "Reviewed in the United States on December 26, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Light read",
    "rating": "5.0 out of 5 stars",
    "content": "Story reflects possible current events. Well developed characters. Keeps moving well right to the end. Captured the locations well.  I will read more from John Hazen.",
    "post_time": "Reviewed in the United States on December 23, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Spunky Hispanic TV reporter saves the world from WW3. Suspend belief and enjoy the story..",
    "post_time": "Reviewed in the United States on December 22, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "A nice good-guy-wins story",
    "rating": "5.0 out of 5 stars",
    "content": "Very satisfying.  Good character development.  Plausible storyline.  Just weird that a potential WWIII scenario is kept at a low-level agent and reporter level.",
    "post_time": "Reviewed in the United States on November 25, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "did not like ending",
    "post_time": "Reviewed in the United States on September 14, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Three Stars",
    "rating": "5.0 out of 5 stars",
    "content": "Great story,the FBI, a pretty reporter save the world from World War III, and raise their family of 3. Lots of twists & action!",
    "post_time": "Reviewed in the United States on November 11, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Lots of action and all over the world.  Interesting plot, not too much detailed sex to interfere with the story and good characters,",
    "post_time": "Reviewed in the United States on November 21, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Excellent",
    "rating": "5.0 out of 5 stars",
    "content": "After winning 450 million dollars in a lottery, an individual plans on avenging his brothers death (which occurred in 9/11) by destroying Mecca.",
    "post_time": "Reviewed in the United States on November 29, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A little slow at first but it picked up the pace and became a mind blowing READ. Lots of suspense, danger and romance!",
    "post_time": "Reviewed in the United States on November 14, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Great",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great read. Exciting story that keeps you wanting to read just a couple more pages before you put it down.",
    "post_time": "Reviewed in the United States on November 11, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Ok",
    "post_time": "Reviewed in the United States on September 27, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Very interesting!",
    "rating": "3.0 out of 5 stars",
    "content": "To far fetched.",
    "post_time": "Reviewed in the United States on November 7, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed this! It was an exciting mystery. The story line kept my interest to the solution of the problem!",
    "post_time": "Reviewed in the United States on January 22, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "A bummer",
    "rating": "2.0 out of 5 stars",
    "content": "Too far fetched,  detonating an atomic bomb and getting away from it etc.... there is fiction and fiction..this was lame",
    "post_time": "Reviewed in the United States on December 9, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great story, one of the best, another page turner deluxe. Well written, kept me involved in the action page after page.",
    "post_time": "Reviewed in the United States on December 1, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Great story, one of the best, another page turner deluxe",
    "rating": "5.0 out of 5 stars",
    "content": "Very well layed out plot! Unfortunately it could probably be considered a possible event with current politics in place today.",
    "post_time": "Reviewed in the United States on November 10, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "story was far fetched, not something that we believe could happen.",
    "post_time": "Reviewed in the United States on December 1, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Very well layed out plot!",
    "rating": "5.0 out of 5 stars",
    "content": "Wonderful post 911 thriller that keeps the conspiracy theories alive! A real nail biter!",
    "post_time": "Reviewed in the United States on February 7, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Awesome story!  Good, fast-moving plot with great characters! Interesting premise and terrific follow-through.",
    "post_time": "Reviewed in the United States on November 14, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Two Stars",
    "rating": "1.0 out of 5 stars",
    "content": "The Amazon comment editor is forcing me to add 20 more words to my comments. More time wasted on this book.",
    "post_time": "Reviewed in the United States on December 3, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "This is far from being an OK book, the characters are simplistic and not believable at all.",
    "post_time": "Reviewed in the United States on November 24, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Five Stars",
    "rating": "5.0 out of 5 stars",
    "content": "A nicely crafted book that keeps the reader turning pages",
    "post_time": "Reviewed in the United States on December 2, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great product and Great Customer Service. Thank you much.",
    "post_time": "Reviewed in the United States on November 26, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "One Star",
    "rating": "1.0 out of 5 stars",
    "content": "I never read or purchased this book.",
    "post_time": "Reviewed in the United States on January 7, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Well written with good plot layout and character development.",
    "post_time": "Reviewed in the United States on November 22, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Good read!",
    "rating": "5.0 out of 5 stars",
    "content": "Could not put it down!",
    "post_time": "Reviewed in the United States on December 15, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved the writer's style, very interesting.",
    "post_time": "Reviewed in the United States on April 25, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Very good book",
    "rating": "5.0 out of 5 stars",
    "content": "Good read",
    "post_time": "Reviewed in the United States on January 16, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great read!",
    "post_time": "Reviewed in the United States on November 13, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Five Stars",
    "rating": "5.0 out of 5 stars",
    "content": "Loved it.",
    "post_time": "Reviewed in the United States on November 6, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great story and premise.  I would certainly call Fava a page turner.  A TV news reporter, international intrigue, corrupt government officials, and a plot to blow up Mecca with hundreds of millions of dollars in lottery winnings!  I could certainly see this being turned into a movie or series, with our  Francine Vega battling crime and corruption through her job as a reporter.",
    "post_time": "Reviewed in the United States on September 11, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Five Stars",
    "rating": "3.0 out of 5 stars",
    "content": "We see women writing in first person as a male character quite a bit.  I mean, start with modern day and go back to Bronte sisters, or countless other classic literary works from past centuries.  Anytime a man writes a novel in first person, and the character is a woman, then I'm fascinated.  Hazen does an interesting and insightful job with that part of the story.  The writing is to the point, and not flowery and drawn out.  The story moves.",
    "post_time": "Reviewed in the United States on April 25, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "That said, my only issues were some of the plot pacing.  I won't go into plot details, or what leads up to what, but I feel like Francine moves on to FBI Agent Will a bit too quickly after a prior romantic attachment, but she's a modern woman, so who am I to judge?  The verb tenses seemed to shift strangely in a couple of instances.  I couldn't tell if this was a tone-setter or an oversight.",
    "post_time": "Reviewed in the United States on January 27, 2018",
    "pid": "B00I54TIW4"
},
{
    "title": "If you enjoy a good paced suspense with plenty of intrigue then I recommend this book.",
    "rating": "4.0 out of 5 stars",
    "content": "Suspense, spies, espionage, and military cover ups all feature in this book.",
    "post_time": "Reviewed in the United States on April 26, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "being a local reporter at the worst station in New York isn’t going to stop the ...",
    "rating": "5.0 out of 5 stars",
    "content": "The thing that stood out the most for me was how the main character, Fava, didn't have all the contacts or resources to hand that she needed as she tries to prevent WW3. This makes the plot come across as more plausible and realistic. I'm put off a book if the protagonist overcomes hurdles or solves problems too easily!",
    "post_time": "Reviewed in the United States on December 9, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "A great surprise by a new author!",
    "rating": "4.0 out of 5 stars",
    "content": "Fava as a character was good too. Her personality and working relationship with Will also came across well.",
    "post_time": "Reviewed in the United States on September 6, 2014",
    "pid": "B00I54TIW4"
},
{
    "title": "Fine",
    "rating": "4.0 out of 5 stars",
    "content": "If you enjoy a good paced suspense with plenty of intrigue then I recommend this book.",
    "post_time": "Reviewed in the United States on July 3, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Fava review",
    "rating": "3.0 out of 5 stars",
    "content": "Fava by John Hazen is a high energy, action-packed international conspiracy theory thriller.",
    "post_time": "Reviewed in the United States on February 2, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "Page Turner From The Start",
    "rating": "5.0 out of 5 stars",
    "content": "The story begins innocently enough with our heroine, Francine Vega, interviewing excited New Yorkers who think they might have a chance at a 700-million-dollar lottery jackpot.  Francine is New York’s “hottest” news reporter two years running—hot in appearance, not so much in career achievements.  However, being a local reporter at the worst station in New York isn’t going to stop the motivated woman from trying to find the inside scoop.",
    "post_time": "Reviewed in the United States on August 19, 2015",
    "pid": "B00I54TIW4"
},
{
    "title": "Not Your Typical Thriller",
    "rating": "5.0 out of 5 stars",
    "content": "It seems innocent enough when Francine uses her connections to get an early scoop on the lottery winner, an introverted down-on-his-luck former lawyer, Allan Starbuck Westbrook.",
    "post_time": "Reviewed in the United States on January 23, 2015",
    "pid": "B00I54TIW4"
},
{
    "title": "Francine Vega rocks",
    "rating": "5.0 out of 5 stars",
    "content": "The story quickly takes a turn after Francine interviews Westbrook and discovers that he intends to use his winnings to avenge the tragic death of his twin brother, who was killed at the Pentagon during 9/11.",
    "post_time": "Reviewed in the United States on August 30, 2020",
    "pid": "B00I54TIW4"
},
{
    "title": "Fast-paced and well-plotted!",
    "rating": "5.0 out of 5 stars",
    "content": "In an attempt to avoid any spoilers let’s just say his revenge will take Francine and various male companions including her loyal cameraman Jonas, a dependable talented FBI agent, Will, and a sophisticated worldly consultant, Farad, on a frantic mission to try and stop one of those most elaborate, horrifying Islamophobic schemes ever concocted.  The more Francine digs the higher up in the ranks of the government and military she finds the hatred lives.",
    "post_time": "Reviewed in the United States on May 23, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Did not come together!",
    "rating": "2.0 out of 5 stars",
    "content": "Fava  kept me on the edge of my seat the entire read.  If you discount the improbability of a mentally unstable man with plans of this magnitude winning a 700-million-dollar lottery, it’s pretty darn scary thinking that this time of terrorism could actually happen.  If I had one concern in the novel, it would be with Ms Vega’s fast-paced love life—she finds nearly as much action as there is throughout the mission to stop WWIII.",
    "post_time": "Reviewed in the United States on November 15, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Excellent thriller",
    "rating": "5.0 out of 5 stars",
    "content": "What an excellent story to read, especially in times of islamophobia and racial hatred.",
    "post_time": "Reviewed in the United States on August 17, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "A thrill ride from start to finish",
    "rating": "5.0 out of 5 stars",
    "content": "A man, whose brother was killed in 9/11, wins the lottery and swears to avenge the death by using the money for terror against Muslims. A news anchor woman gets involved in preventing this from happening in a fast paced and very well written thriller.",
    "post_time": "Reviewed in the United States on March 20, 2015",
    "pid": "B00I54TIW4"
},
{
    "title": "This would make a great movie!",
    "rating": "5.0 out of 5 stars",
    "content": "There are may turns and twists in this story, and, as with Hazen's other work, an inherent instinct for justice and humanity.",
    "post_time": "Reviewed in the United States on November 14, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Edge of your seat reading.",
    "rating": "5.0 out of 5 stars",
    "content": "Setting the record straight on some wrong believes about Islam and Muslims on the way, this is an excellent polit-thriller, an engaging page turner with depth and a solid plot.",
    "post_time": "Reviewed in the United States on January 29, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "A Most Worthy Read",
    "rating": "5.0 out of 5 stars",
    "content": "Highly recommended.",
    "post_time": "Reviewed in the United States on February 12, 2016",
    "pid": "B00I54TIW4"
},
{
    "title": "Five Stars",
    "rating": "5.0 out of 5 stars",
    "content": "New York TV reporter Francine Vega gets the scoop on the largest lottery winner, but little does she realize the terror those winnings will unleash. Before she knows it she's knee-deep in an effort to prevent World War III with the help of only a small handful of people. This book is well-written and very clever. I couldn't put it down, wanting to know what was going to happen next. The only complaint I could find would be a number of proof-reading mistakes. But all-in-all a fantastic, edge-of-your-seat thrill ride. I highly recommend it!",
    "post_time": "Reviewed in the United States on January 11, 2017",
    "pid": "B00I54TIW4"
},
{
    "title": "I loved this book!",
    "rating": "5.0 out of 5 stars",
    "content": "This is a fast paced story that covers a lot of ground. From a lottery winner in NYC to a plot to destroy Mecca",
    "post_time": "Reviewed in the United States on December 17, 2014",
    "pid": "B00I54TIW4"
},
{
    "title": "Five Stars",
    "rating": "5.0 out of 5 stars",
    "content": "I loved reading this book. It kept me on the edge of seat through out the whole story. The plot drew me in and kept me intrigued the whole time i was reading it. The characters were well thought out and developed. I would recommend this book for anyone that enjoys the spie/crime thriller.",
    "post_time": "Reviewed in the United States on September 29, 2015",
    "pid": "B00I54TIW4"
},
{
    "title": "A can't put it down read !",
    "rating": "5.0 out of 5 stars",
    "content": "What's not to like about this intriguing thriller?  The plot is well-crafted; the action exhilarating; and the characters compelling. John Hazen is fully in command throughout the book--of his facts and characters, particularly Francine Vega.  More than that, Hazen is a most imaginative story-teller.  An excellent book!",
    "post_time": "Reviewed in the United States on June 5, 2014",
    "pid": "B00I54TIW4"
},
]