[
{
    "name": "        Beauty by Earth Self Tanner - USA Made with Natural & Organic Ingredients, Moisturizing Self Tanning Lotion with Aloe Vera & Coconut for a Natural Glow, Streak-Free Fake Tan, Medium to Dark       ",
    "stars": [
        "69%",
        "13%",
        "7%",
        "4%",
        "6%"
    ],
    "pid": "B00L2PB3BW",
    "ratings": "22,167 ratings",
    "other_info": {
        "Item Form": "Lotion",
        "Skin Type": "All, Combination, Sensitive, Dry, Normal",
        "Material Type Free": "Paraben Free",
        "Brand": "Beauty by Earth",
        "Product Benefits": "Hydrating"
    },
    "discount_price": "$ 35.99",
    "normal_price": "$4.80",
    "about_this_item": [
        " A NATURAL, SUN-KISSED GLOW: Goodbye to orange hues and hello to a natural-looking tan. Our bronzing tanning lotion comes in fair to medium & medium to dark shades for all skin types.  ",
        " CLEAN BEAUTY: Trust Beauty by Earth for a natural self tanner organic made with organic aloe vera, shea butter, and botanical extracts without any harmful additives or dyes.  ",
        " SUITABLE FOR FACE & BODY: Our organic tanning lotion can be used on both face and body for a seamless, all-over tan. For acne-prone skin, use our tanner lotion for glowing skin.  ",
        " OPTIONS FOR EVERYONE: We offer a variety of USA-made best self tanning lotions and formats, including mousse, spray tan, tanning drops, tanning mist, and more. Find your perfect match!  ",
        " EASY APPLICATION, NO STREAKS: Our best self tanner for body is easy to apply & goes on clear, without leaving any streaks or patches. You'll have a beautiful, even tan in no time. And no staining your sheets or clothes!  ",
        " LONG-LASTING RESULTS: Our natural tanning lotion self tanner delivers a beautiful tan that lasts for days. With proper care, maintain your gorgeous glow without any sun damage.  "
    ]
},
{
    "title": "Nice color and application",
    "rating": "5.0 out of 5 stars",
    "content": "I am extremely happy with my purchase of this self tanner moisturizer, I had been looking for a self tanner with natural ingredients and I happened to see this one. The fact that the ingredients are also organic is a HUGE plus for me.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I started applying this self tanner moisturizer with my hands and while it is better than applying a regular self tanner I found using a self tanner mitt a better way to make sure it was spread evenly.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Good and less than good!? I’m confused!",
    "rating": "4.0 out of 5 stars",
    "content": "I am very happy with this product and will be repurchasing when I run out based on the results and ease of application.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Ok, I love the ingredients and I have the mousse by this brand. That application seemed easier but I wanted to try the lotion because the mousse tanners cling to dry areas and look funky (think wrists and feet!). So this seemingly would solve this problem for me.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Love but leaves residue",
    "rating": "5.0 out of 5 stars",
    "content": "The color deposit was STRONG! I’m a pale freckled redhead and I look TAN YALL! But if you miss a spot or one spot gets too much attention it’s super obvious. I was really careful with application so not sure how it happen.",
    "post_time": "Reviewed in the United States on June 7, 2016",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So it’s Saturday morning, I tanned Thursday evening and slept overnight in it, washed it off Friday morning and could smell the tan kinda “coming out” all day Friday. Took a shower last night and can still smell the tanner smell (not the lotion smell) this morning.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Medium to dark",
    "rating": "5.0 out of 5 stars",
    "content": "So the catch: GREAT color but kinda like lingering tanner smell and inconsistent application using the mitt.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "*attached an underarm photo but cropped out my armpit lol you can see how the inside and elbow is spotty? as well as how my feet are funky and I already used a harsh soap to get most of it off.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "PALE GINGER PRODUCT REVIEW - This is the tanner you've been searching the internet for!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product. I get compliments all the time about my tan. I mix a little bit with my regular lotion and use it nightly to keep a subtle glow. My only complaint is that it comes off on my white towels and sheets. So there is a brown residue on them. It does wash out so it’s not that big of a deal but just an FYI. Shouldn’t be an issue if you don’t have white towels or sheets.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I had to stop using self tanners bc of my eczema bc it was never even. This tanning lotion is AMAZING‼️ You get what you pay for 💯‼️ So worth it",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Great Product",
    "rating": "5.0 out of 5 stars",
    "content": "I was a bit hesitant when I order this because I’ve always used Nuetrogenas Tanning spray. I was getting tired of Nuetrogena never having anything available at my local stores as well as on Amazon. Once I tried Beauty By Earth Self Tanning Lotion it exceeded my expectations..I will be a customer for life .",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the best self tanner I have ever used. My skin color is about fair light and I bought fair to medium. My skin looks does not look orange after using it.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "I’m obsessed",
    "rating": "4.0 out of 5 stars",
    "content": "I have used a different tanning mousse, but wanted to try something cleaner.  I ordered the lotion & was pretty impressed with the color.  I don’t love the “sticky” feeling of the lotion, but it works great.  I ended up getting the mousse in this brand & was disappointed in the lack of color it gave me. I went back to using the lotion only to realize that I am very allergic to something in the lotion.  I didn’t realize it was related the first application.  I used it for the second time & ended up with the same red, itchy rash as the first one.  It didn’t show up the day of, but the next day when I woke up.  I do have very sensitive skin, but find it comical that the “clean” version is the one that I am allergic to.  I’m not sure if I will try out the mousse again or just move on.  I’m super sad because I did like the color it gave me, but it isn’t worth the 2-3 days of redness & itching on my arms & chest.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use, does not take much, no smell, lasts about 3 to 4 days.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Works great, but…",
    "rating": "4.0 out of 5 stars",
    "content": "Loved how easy it was to apply and it made my skin so soft. Only drawback is that it rubbed off on white clothes even after letting it dry for 30 minutes.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I am naturally tan and purchased the Medium to Dark. Since this product is a lotion it's super easy to apply compared to foam tanners, and does not streak or rub off on clothes. A little goes a long way - takes awhile to rub it in all the way. Don't forget to wash your palms after; it stains!",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Works!",
    "rating": "4.0 out of 5 stars",
    "content": "Tried for the great reviews and glad I did but I feel unsure if I’ll continue after this bottle. I’ve used it about 5-6 times so far and maybe half way through it.",
    "post_time": "Reviewed in the United States on May 2, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My boyfriend said it looked super natural compared to St. Tropez (even though I didn’t think that looked bad). I do think it looks nice, but it’s just not super reliable time wise how long it stays on.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Even color",
    "rating": "5.0 out of 5 stars",
    "content": "It does smell. I do think doing it before bed to rinse off in the morning is best but I have felt it takes two showers to get rid of the smell. It’s a weird texture to rub in but works. I use regular lotion on my ankles, knees, elbows and wrists before so they aren’t as absorbent. After I apply to my body and wash my hands, I mix a tiny amount with my regular lotion to smooth out the tone between my hand/wrist/arm which has helped.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There’s been times it’s lasted 4 days while one or two seemed like it faded super fast, in a day or two. It over emphasizes where my skin doesn’t typically see sun, I can see where my shorts typically go to and my stomach and lower back is much lighter than my legs, arms and upper back that’s usually exposed. It’s beginning of the season, I don’t absorb color easily and I don’t see it when it all fades away. I wish it evened the skin tone out for my whole body, it’ll feel awkward when it comes to being in a swim suit.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Minimal scent",
    "rating": "5.0 out of 5 stars",
    "content": "I’m on my second tube and use the light to medium coverage. It’s perfect for my fair complexion. I especially like that I barely notice any after smell, unlike most tanning creams.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I decided to order this product on prime day because it was on sale. I am always seeing self tanners but have never found a brand with clean ingredients! I use this once a week and I look like I sit in the sun daily! Everyone compliments me on my tan and I never go in the sun. Great product you only need a very little bit for quick results! Bonus its easily removed if you make a mistake by adding too much to a certain area with a good loofa or wash cloth and some warm water. Highly suggest!",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Love this product!",
    "rating": "4.0 out of 5 stars",
    "content": "I originally tried the darker lotion but it was too dark for my light skin tone. The lighter lotion gave me a very nice color. It is very creamy and easy to apply. There is no smell when applying it, but it did have the fake tanner smell the next day, which lasts about a day even with showering. The color lasted a few days. I’m overall pleased with the results and will apply it when I’m not going to be up close to anyone the next day!",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to apply and looks very natural.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Nice color, but does smell",
    "rating": "5.0 out of 5 stars",
    "content": "I love this stuff. I turn orange/yellow very easily and because of that I've had a terrible time finding a sunless tanning product that I liked. This lotion turns my skin a lovely golden color that looks extremely natural on me. The smell is just fine. There is always that sunless tanning lotion smell, but this one is very, very mild. I have received a lot of compliments since I've been using this stuff. People can't figure out what it is, but they keep telling me I look really healthy or just really good. When I've told some of them that I have been using sunless tanner they have all be extremely surprised, which was impressive to me.",
    "post_time": "Reviewed in the United States on August 2, 2019",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Tips for application (these probably work with most products, not just this brand) :",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Very natural looking on my skin",
    "rating": "5.0 out of 5 stars",
    "content": "1. Don't shave the same day that you use the lotion, apparently you can end up a little spotty.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "2. Exfoliate the heck out of your skin. Because sunless tanning products basically work by staining dead skin cells, exfoliating evens out the dead skin cells so that you don't end up with dark spots where there was more dead skin.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Doesn't turn me orange/yellow!!",
    "rating": "5.0 out of 5 stars",
    "content": "3. This is also why it is important to pay attention to joints that stick out, like knees, elbows, and knuckles. I usually run the lotion in everywhere else and then just spread a the little extra on those spots.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "4. Always apply a layer of lotion (one that absorbs well) before applying the tanner.  I always lotion my skin heavily because I am so fair, but others don't have to.  I have to build slowly (and not go too dark) in order for it to look natural, so when my skin is really hydrated it doesn't absorb quite as much of the tanner.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Most Realistic Tan and I've Tried Many Others",
    "rating": "5.0 out of 5 stars",
    "content": "I really like Beauty by Earth self-tanner. I've used numerous brands over the years with varying results. These are so natural, no orange, just a nice glowing brown. You can adjust the shade based on how frequently you apply. Best part - there is no streaking! I get an even tan every time. I suggest using a mitt for sure and applying in a circular motion. Highly recommend!",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "never tried self tanner I’m a sun girl but after having a baby it’s harder to lay out so I tried and I love this. Easy to apply no orange tent. Recommend this",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Love",
    "rating": "4.0 out of 5 stars",
    "content": "Bought this product because it’s one of the few non toxic self tanners. Tried it once 4 days ago… the hype is real, it works amazingly well. I make sure to blend it in really really good and use sparingly around the knees/ankles. There are no streaks or orange spots and the tan looks great and natural IMO. However it’s 4 days later and my skin STILL has that GROSS self tanner smell like every other self tanner I’ve used throughout my life. Right out of the bottle it smells good, but wait til later that day and on. It’s so terrible and one of my least favorite smells. I had higher hopes for this brand, but I don’t think there is any way around it if you use a self tanning lotion so you just have to decide if you can take the smell or not.",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Obsessed!!!! I don't know why it took me so long to try their sunless tanner because their tinted SPF moisturizer is my daily Holy Grail- I blend the toffee and natural beige together to get the perfect shade depending on how tan I am, and use that in place of foundation. I love their coffee bean eye cream too! Actually, I've loved everything I've tried by this company. But I'd lost hope of organic sunless tanners looking good on my already supper yellow undertoned skin. I've tried Ecotan, Isles of Paradise, Clarins, Tan Organic, Et.",
    "post_time": "Reviewed in the United States on July 3, 2020",
    "pid": "B00L2PB3BW"
},
{
    "title": "Clean & Really Works, but AWFUL skin smell!",
    "rating": "4.0 out of 5 stars",
    "content": "and a toooon of brands here on Amazon that aren't well recognized or established. And most of them left me horribly orange (with the exception of Isles of Paradise- but it doesn't last long and is very tricky to apply evenly). As a result I turned to the standard beauty industries top sunless tanners filled with drying/aging chemicals and toxins. And even a ton of those turned me crazy orange, streaky or just didn't wear off nicely (patchy).  But like I said, I have a very yellow/golden undertone to my skin so bronzers are amplified much stronger on my skin.  But even still, my skin was just starting for feel icky. So I when I went to order more of my tinted SPF I decided why not give their sunless tanner a try since all the ingredients are things I'd actually want to put on skin. And wow!!! In love!!! And not even kidding, I can get a full two weeks out of one application if I prep right and continue to moisturize! I've even revamped an old tan by adding a tiny bit of this tanning lotions to their regular lotion and used it as a gradual tanner or tanner extender! Not even exaggerating! Prep is key of course!!!! And I don't shave or use any detergents in my shower, so that may help. I wax once or twice a month with natural sugar wax and only use organic African black soap and cowash my hair- so no harsh detergents and perfumes running down my skin in the shower. I truly believe that helps with the condition of my tan. I use the scrubbing mitten the night before (so important not the day of!!!!) to exfoliate and don't get lazy with it- really scrub!!! I wax right after exfoliation if needed while my pores are still open (reduces ingrown hairs and hairs just snapping before the root). Then wait a full 24hrs to let the pores totally close and micro heal. The only prep the day of that is needed is just cleaning the skin with gentle/natural clarifying soap to make sure that there is no oils or residue on the skin. But absolutely no scrubbing the day off, always the night before! I use the application mitt and use the white lotion as a guide of sorts. It will disappear by time your on the other leg/arm- no need to rub it all in! Just use it like a guide. For ankles, knees, wrist, underarms, I flip over mitt to the clean side and gently blend from the adjoining body part down. I do NOT add any more lotion on joints. That will not turn out nearly as natural looking. I wait about 10 minutes then put on loose full coverage PJs and go to bed. The next morning I look amazing!! If I messed up anywhere or see a spot needing blending, showering and gently, gently, gently scrubbing the first morning is the best time. I've had so many compliments on this tan and people being so surprised when they see how pale I actually am without it. Lol",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Does not specify face for some reason. I believe it's safe for the entire body.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "New Holy Grail!!!! Must have for green beauty lovers!!!",
    "rating": "5.0 out of 5 stars",
    "content": "Yes it works at first it goes on invisible but have to wait and it does it job and was very impressed but dnt get on hands it stains lol but love ❤️ the product",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I just love this. So simple to use and doesn’t stink or transfer much. Drys very fast. When you’re applying it creates a white lotion so you can see exactly where it is going. Doesn’t streak and the color isn’t super drastic. Very pretty looking. Seems to last long and buildable.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Good self tanner at this price point",
    "rating": "5.0 out of 5 stars",
    "content": "The first thing is there is no harsh self tanner smell. The lotion is thick and provides easy coverage that lasts about five days. As it fades (or washes off) it stays fairly consistent and not splotchy like other self tanners. If you let it dry after application,  it doesn’t come off. On your clothes. Overall I'm very happy and will repurchase.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered this because the other self tanner I usually get is hard to find. This provides good color. It’s not orange and doesn’t smell bad. It goes on as a white somewhat thick lotion. . Be sure to massage it in really well into your skin, wiping in circular and straight motions until all the white is gone. No streaks if you do this.  Been using almost daily all summer. Color  Does wipe off onto towel after barhing. All self tanners I have used do this. Overall nice lasting color and easy to apply.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Works beautifully!!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I love this tanner!  The color is very nice...sort of a medium dark; never yellow or orange.  I use it a couple of times a week just to keep the tanned look.  And, it's an excellent moisturizer!  I highly recommend it!  I am a sun lover and have tanned all my life, but due to a recent successful melanoma removal, I decided my body had enough sun!  This is the next best thing!!!!",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It gives me a healthy tan without harmful exposure to the sun.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Highly recommend!",
    "rating": "5.0 out of 5 stars",
    "content": "Okay, first off, I almost never write reviews. Second, I have been an avid self-tanner user for the last 12+ years (both at home and professional spray tans) and have tried countless brands over the years. I heard about Beauty By Earth years ago and thought it was an overhyped affiliate-dominated too-good-to-be-true product, so I didn't try it. Over the years, it kept popping up as I searched for new products to try.",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In the last three years, I have switched almost all of my beauty products to clean products and regularly use the EWG's site to determine a product's efficacy. I knew that this product has almost no potentially hazardous ingredients and is rated a stellar 1 by EWG. Yet I couldn't believe that a product could be both CLEAN and EFFECTIVE. I am thrilled to say I've been proven wrong.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "I didn't believe the hype...",
    "rating": "4.0 out of 5 stars",
    "content": "I tried the first application on my legs only as my expectations could not have been lower. I was pleasantly surprised by the results, so the following day, I reapplied to my legs (for darker color) and to the rest of my body. I am beyond impressed with the results.",
    "post_time": "Reviewed in the United States on June 8, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I will say this lotion is thick—the thickest I have used. This makes it a bit challenging to apply. I use a mitt, and it is a bit of a workout to rub it all in. However, it has a pleasant coconut scent and dries fairly quickly, leaving the skin soft and hydrated. There was no color transfer and a very even application the next day. I'm shook.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Beautiful tan without the staining",
    "rating": "4.0 out of 5 stars",
    "content": "It should be noted that I am NOT an affiliate, but I thought it might help other skeptics to hear my feedback. For reference, I avoid the sun, so my skin is quite light with yellow undertones, but I do tan if I spend time in the sun despite my Northern European heritage. I used the medium-dark color and it looks natural on me and isn't too dark. If you want a super dark tan, apply another coat the next day (the areas I doubled up on look so good and have zero blotchiness). Happy tanning!!",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love this product. Free of dyes & is a beautiful tan color. Have had sooo many compliments on how natural and an color it is.",
    "post_time": "Reviewed in the United States on March 8, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "I like this okay.",
    "rating": "5.0 out of 5 stars",
    "content": "First, it does have a smell. (Some reviews say no smell at all?)  It smells a little rubbery out of the tube but not after it sits on your skin. It definitely smells like self-tanner but not quite as bad as others I’ve used. The cream is thick and I find it a little difficult to get even especially on my feet/toes. I usually use a foam (different brand) and I find it much easier to apply. I’ll keep trying this one and see how it works out. Right now, I like my old foam better. I do however, really like the face spray from this brand.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I'm ordering another bottle, color is great!",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Hydrating Tan",
    "rating": "5.0 out of 5 stars",
    "content": "Beauty by Earth Self Tanner - Made in the USA with all-natural & organic ingredients- A+!! This luscious Self Tanning Lotion is infused with Aloe Vera & Coconut for a radiant, sun-kissed look! I It is truly a streak-free tan, I get Medium to Dark!  Don't be fooled by its rich texture, it's all about that skin hydration!",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The first time I applied this tanning lotion, i was thrown off that it was white and felt just like regular lotion. But next morning i had a beautiful tan. I’ve used it several times since and love it. The smell is subtle, it dries quickly and it gives you a natural looking tan.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Beautiful tan",
    "rating": "5.0 out of 5 stars",
    "content": "Take your time when applying this tanning lotion as it’s sometimes hard to see if you have covered every area.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall I’m very happy with the price and result.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "It works!",
    "rating": "5.0 out of 5 stars",
    "content": "This is our 3rd tube of this in 2 years.  It works quite well especially after a bit of exfoliating!",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Used this the week prior to a wedding and omg it was so natural. Would buy again!",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "It works!",
    "rating": "5.0 out of 5 stars",
    "content": "This gives me a nice glow after one application. Easy to use",
    "post_time": "Reviewed in the United States on June 1, 2020",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This self-tanner is a game-changer if you're looking for a natural-looking glow without the sun. The formula is smooth and easy to apply, leaving no streaks or patchiness. It gives a warm, sun-kissed color that develops evenly over a few hours and lasts several days.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Amazing product",
    "rating": "5.0 out of 5 stars",
    "content": "So I'm major rookie when it comes to tanning in general. And I'm not going to lie I made quite a few rookie mistakes along the way, but even still I came out with a gorgeous tan! And it is husband approved, I can say that because if he thought it looked bad he would have told me, which I really appreciate.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So there has been some complaints about the smell, it smells good coming from the bottle and while applying. But after it sat on my skin I noticed what I thought was a funky smell but my husband didn't think it smelled and again he would have told me. But when I did the second layer the next day I couldn't smell it on me afterwards and I have a very sensitive nose so I know I would have smelled it again. This is just my opinion but I think how it smells is due to individual body make up/chemistry and taste. Because I can wear the same perfume as one of my sisters but it for some reason smells different on each one of us and I can love the smell but my sisters hate it and vise versa. So I think that goes with the smell of this tanner. It wasn't a bad smell even when I thought it smelled \"funky\". It was just a smell I wouldn't choose for myself to wear all day everyday. If that makes sense.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "My favorite yet!",
    "rating": "5.0 out of 5 stars",
    "content": "Not really streaky, which they claim to be streak free so I would agree with that. It smells like a fake tan after a few hours, but that doesn’t bother me it makes me feel like it’s working lol! Quick drying, love the color, I did the fair to medium. It goes on a little dry, and white, but the color does come out nicely.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great quality, pleasant smell. Easy to apply and nice finish! I used sent tropes befor, this one is waaaay better.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Best self-tanner",
    "rating": "4.0 out of 5 stars",
    "content": "I love that there is no awful smell , goes on really easy",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I found it to be a little difficult to rub in. When color developed it was a bit blotchy and darker in arm wrinkles. I chose the lightest color which resulted in a slightly yellow hue.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Self tanner",
    "rating": "5.0 out of 5 stars",
    "content": "I liked the low odor and the clean ingredients.",
    "post_time": "Reviewed in the United States on February 24, 2023",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is not something I would repurchase.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "It’s okay",
    "rating": "5.0 out of 5 stars",
    "content": "Experienced self tanner - have tried numerous brands and formulas and this one is up there on my list of favorites.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The lotion is thick and creamy. Don’t be discouraged when applying as this will leave a white residue on your skin seemingly no matter how much you try to rub it in. It will absorb and the white will disappear. I have found that once it drys/develops, it does not streak.",
    "post_time": "Reviewed in the United States on June 24, 2017",
    "pid": "B00L2PB3BW"
},
{
    "title": "Great color / Rough Fade / AMAZING customer service!",
    "rating": "4.0 out of 5 stars",
    "content": "I use latex gloves to apply to my entire body, then remove the gloves to apply to my hands and blend down into my wrist, followed by using a wet wipe on my palms.",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The scent is very mild, somewhat coconut.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Nice but not dark enough",
    "rating": "4.0 out of 5 stars",
    "content": "Overall this was a nice product however I tried it twice and felt t did make my skin as dark as I would have liked, and not worth it to keep due to the price.  Oh well, I liked the concept but I did return it.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was very skeptical of buying or using a self tanner and this one is great. Left me with just enough tan to make me look sun-kissed.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Great tanner",
    "rating": "4.0 out of 5 stars",
    "content": "works great, but did 4 stars for the smell after it settles",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love that the tan looks natural, I promise it won’t look too dark. Some things to keep in mind is: it goes on clear/ white so you have to pay attention to your tan lines. It also means it won’t transfer to you sheets! It lasts for about 5 days if you’re showering regularly. And if you exfoliate after those five days it comes off really well. Best way to put it on is with a mitt or gloves and make sure you rub all of it in! I love this products and the face drops.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "works",
    "rating": "5.0 out of 5 stars",
    "content": "Love this stuff ! No streaks, great color after a couple applications. Soooo moisturizing with the SHEA .",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought both the light/medium and the darker one.  With the lighter one, I couldn’t tell that much difference in my skin color.  With the darker one, I looked like I had a great tan after only putting it on once.  And the color lasted for quite a while.  In my opinion, the color looked like a natural tan.  And I’m blonde with fair skin….",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Works really well for beginners!",
    "rating": "4.0 out of 5 stars",
    "content": "I would be more careful how I put it on the next time though.  It goes on clear (the lotion is white).  I wasn’t careful enough on places like my feet and hands, so it was a little blotchy in those areas.  But overall, I was very satisfied with this product.  I would buy it again.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Of all the self tanners, this is probably my favorite.  It’s easy to put on, isn’t runny, color is good & it moisturizes.  The only downside is the scent.  But I haven’t used a self tanner yet that had a pleasing scent.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Moisturizing",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve been using this for years and I love it. A little goes a long way and it’s very emollient, which helps ensure smooth and even coverage.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve tried so many self tanning products and this is the only one that does not fade weird and has the most natural color. I’ve tried the moose version of this as well and while it works good too I noticed it can fade a bit faster than the lotion. There is a smell the hours it developed but it’s not a bad smell. So glad I found this company.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "The closest to a natural tan!",
    "rating": "5.0 out of 5 stars",
    "content": "Thanks to those who wrote great reviews on this product - I was convinced to try it and found my new favorite self-tanning product.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I apply it at night and wake up to a natural looking tan which looks even more natural after I shower the product off by morning.  Comparing the same (fair/medium) shade to my previous brand, Beauty by Earth gives a deeper light brown color, without a yellow tinge.",
    "post_time": "Reviewed in the United States on July 15, 2023",
    "pid": "B00L2PB3BW"
},
{
    "title": "Never going back to the tanning booths again",
    "rating": "5.0 out of 5 stars",
    "content": "Very very very happy I made this switch!!!",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Bonus points for the lovely coconut scent and my moisturized skin!",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Beautiful tan and no bad smell",
    "rating": "5.0 out of 5 stars",
    "content": "I fully woke up this morning expecting to put on another layer of Beauty by Earth Self Tanner Tanning Lotion but to my surprise, it wasn’t necessary! I have the quintessential Irish coloring, red hair, green eyes and lots and lots of freckles. I gave up years ago trying to get that classic golden tan that my all my sisters are blessed with and instead started on my self tanning lotion expedition. I’ve tried all sorts of self tanning products - including the “professional” spray-on in the spas that you pay a good chunk of change for - and have never been happy with the results (steaks, orange tone, blotching, stained clothes, etc) - until now…",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Yesterday, I carefully put on a light coat of this lotion (very little is necessary) right after my shower and waited a good 20 minutes before putting on my white shorts. I know, I know I was tempting fate (see Fadi Shaman’s review) but figured what-the-heck, in for a penny, in for a pound as my Mom would to say.  When I checked my shorts this morning, no stains at all… really, Nothing! I can’t remember anything not staining my clothes. As far as scent goes, I had to get the lotion and smell it again because I couldn’t remember what it smelled like. Very soft and none of that nasty chemical smell a lot of self tanners seem to have. It didn’t leave any kind of greasy feeling either but was more like just using a regular moisturizer.",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "One of my faves",
    "rating": "5.0 out of 5 stars",
    "content": "So in conclusion, if you don’t want a bunch of scars from skin cancer removals, I highly recommend; take vitamin B3/niacin (my dermatologist has me on it, new Australian studies - check it out!) wear SPF lotions daily, use lots of hats, avoid the sun as best you can and instead use this. It can not only save you wasted hours lying in the sun, it also saves your skin from prematurely wrinkling too. There is no downside from what I can see to this self-tanner. After seeing the results, this 7.5 Oz tube will probably last me six months or more and is absolutely worth every penny. I couldn’t be happier!",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This picture is a before and after 24 hours. I tried to use the same lighting so it was a good comparison.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Finally tanned",
    "rating": "5.0 out of 5 stars",
    "content": "I always loved the sun, but it didn’t love me back. My skin tone became uneven with white and dark spots. My dermatologist told me to stay out of the sun but said I could use a self tanner, but the tanners I tried in the past had a bad smell, so I couldn’t use them. I tried this tanner and there truly is no bad smell. It left my skin soft and with a beautiful golden glow. It also helped even out the dark and light spots and it’s organic . I use this once a week and I highly recommend it. It can save your skin and best of all you don’t have to give up your tan.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Not much of a smell! Works so well and lasts at least a week. I tend to only see results after 24hours.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B00L2PB3BW"
},
]