[
{
    "name": "        Beauty by Earth Self Tanner - USA Made with Natural & Organic Ingredients, Moisturizing Self Tanning Lotion with Aloe Vera & Coconut for a Natural Glow, Streak-Free Fake Tan, Medium to Dark       ",
    "stars": [
        "69%",
        "13%",
        "7%",
        "4%",
        "6%"
    ],
    "pid": "B00L2PB3BW",
    "ratings": "22,163 ratings",
    "other_info": {
        "Item Form": "Lotion",
        "Skin Type": "All, Combination, Sensitive, Dry, Normal",
        "Material Type Free": "Paraben Free",
        "Brand": "Beauty by Earth",
        "Product Benefits": "Hydrating"
    },
    "discount_price": "$ 35.99",
    "normal_price": "$4.80",
    "about_this_item": [
        " A NATURAL, SUN-KISSED GLOW: Goodbye to orange hues and hello to a natural-looking tan. Our bronzing tanning lotion comes in fair to medium & medium to dark shades for all skin types.  ",
        " CLEAN BEAUTY: Trust Beauty by Earth for a natural self tanner organic made with organic aloe vera, shea butter, and botanical extracts without any harmful additives or dyes.  ",
        " SUITABLE FOR FACE & BODY: Our organic tanning lotion can be used on both face and body for a seamless, all-over tan. For acne-prone skin, use our tanner lotion for glowing skin.  ",
        " OPTIONS FOR EVERYONE: We offer a variety of USA-made best self tanning lotions and formats, including mousse, spray tan, tanning drops, tanning mist, and more. Find your perfect match!  ",
        " EASY APPLICATION, NO STREAKS: Our best self tanner for body is easy to apply & goes on clear, without leaving any streaks or patches. You'll have a beautiful, even tan in no time. And no staining your sheets or clothes!  ",
        " LONG-LASTING RESULTS: Our natural tanning lotion self tanner delivers a beautiful tan that lasts for days. With proper care, maintain your gorgeous glow without any sun damage.  "
    ]
},
{
    "title": "Easy, simple, beautiful tan!",
    "rating": "5.0 out of 5 stars",
    "content": "This was my first time ever using self tanner, and I think it worked incredibly well!! I used one of those black scrubby exfoliating mits and really scrubbed my whole body in the shower the day before. Then right before I went to bed the next day, I used some lotion on my dry spots and then applied the tanning lotion using a mit all over. Rubbing it in super well. Then I wore just a loose cotton robe to bed and this is what I woke up to! No streaks, splotches, or orange areas. Just a simply beautiful tan. Will absolutely be repurchasing!!!",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Overall this was a nice product however I tried it twice and felt t did make my skin as dark as I would have liked, and not worth it to keep due to the price.  Oh well, I liked the concept but I did return it.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Nice but not dark enough",
    "rating": "4.0 out of 5 stars",
    "content": "works great, but did 4 stars for the smell after it settles",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love that the tan looks natural, I promise it won’t look too dark. Some things to keep in mind is: it goes on clear/ white so you have to pay attention to your tan lines. It also means it won’t transfer to you sheets! It lasts for about 5 days if you’re showering regularly. And if you exfoliate after those five days it comes off really well. Best way to put it on is with a mitt or gloves and make sure you rub all of it in! I love this products and the face drops.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "works",
    "rating": "5.0 out of 5 stars",
    "content": "Love this stuff ! No streaks, great color after a couple applications. Soooo moisturizing with the SHEA .",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought both the light/medium and the darker one.  With the lighter one, I couldn’t tell that much difference in my skin color.  With the darker one, I looked like I had a great tan after only putting it on once.  And the color lasted for quite a while.  In my opinion, the color looked like a natural tan.  And I’m blonde with fair skin….",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Works really well for beginners!",
    "rating": "4.0 out of 5 stars",
    "content": "I would be more careful how I put it on the next time though.  It goes on clear (the lotion is white).  I wasn’t careful enough on places like my feet and hands, so it was a little blotchy in those areas.  But overall, I was very satisfied with this product.  I would buy it again.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Of all the self tanners, this is probably my favorite.  It’s easy to put on, isn’t runny, color is good & it moisturizes.  The only downside is the scent.  But I haven’t used a self tanner yet that had a pleasing scent.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Moisturizing",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve been using this for years and I love it. A little goes a long way and it’s very emollient, which helps ensure smooth and even coverage.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really like that the product doesn’t stain clothing or rub off.  I find it easy to use and am pleased with the results I’m getting.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Never going back to the tanning booths again",
    "rating": "5.0 out of 5 stars",
    "content": "I fully woke up this morning expecting to put on another layer of Beauty by Earth Self Tanner Tanning Lotion but to my surprise, it wasn’t necessary! I have the quintessential Irish coloring, red hair, green eyes and lots and lots of freckles. I gave up years ago trying to get that classic golden tan that my all my sisters are blessed with and instead started on my self tanning lotion expedition. I’ve tried all sorts of self tanning products - including the “professional” spray-on in the spas that you pay a good chunk of change for - and have never been happy with the results (steaks, orange tone, blotching, stained clothes, etc) - until now…",
    "post_time": "Reviewed in the United States on July 15, 2023",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Yesterday, I carefully put on a light coat of this lotion (very little is necessary) right after my shower and waited a good 20 minutes before putting on my white shorts. I know, I know I was tempting fate (see Fadi Shaman’s review) but figured what-the-heck, in for a penny, in for a pound as my Mom would to say.  When I checked my shorts this morning, no stains at all… really, Nothing! I can’t remember anything not staining my clothes. As far as scent goes, I had to get the lotion and smell it again because I couldn’t remember what it smelled like. Very soft and none of that nasty chemical smell a lot of self tanners seem to have. It didn’t leave any kind of greasy feeling either but was more like just using a regular moisturizer.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Beautiful tan and no bad smell",
    "rating": "4.0 out of 5 stars",
    "content": "So in conclusion, if you don’t want a bunch of scars from skin cancer removals, I highly recommend; take vitamin B3/niacin (my dermatologist has me on it, new Australian studies - check it out!) wear SPF lotions daily, use lots of hats, avoid the sun as best you can and instead use this. It can not only save you wasted hours lying in the sun, it also saves your skin from prematurely wrinkling too. There is no downside from what I can see to this self-tanner. After seeing the results, this 7.5 Oz tube will probably last me six months or more and is absolutely worth every penny. I couldn’t be happier!",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This picture is a before and after 24 hours. I tried to use the same lighting so it was a good comparison.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Clean product",
    "rating": "5.0 out of 5 stars",
    "content": "I always loved the sun, but it didn’t love me back. My skin tone became uneven with white and dark spots. My dermatologist told me to stay out of the sun but said I could use a self tanner, but the tanners I tried in the past had a bad smell, so I couldn’t use them. I tried this tanner and there truly is no bad smell. It left my skin soft and with a beautiful golden glow. It also helped even out the dark and light spots and it’s organic . I use this once a week and I highly recommend it. It can save your skin and best of all you don’t have to give up your tan.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Self tanner with out harmfull ingredients",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "One of my faves",
    "rating": "5.0 out of 5 stars",
    "content": "Not much of a smell! Works so well and lasts at least a week. I tend to only see results after 24hours.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am so happy with this product it doesn’t stink, a really natural looking tan, doesn’t rub off . I get four days or so before I reapply so much better then most",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Finally tanned",
    "rating": "5.0 out of 5 stars",
    "content": "I recently tried Beauty by Earth Self Tanner, and I must say, I'm impressed! As someone who prefers natural and organic products, I was delighted to find that this self-tanning lotion is made with natural ingredients. The application was smooth and easy, and the results were fantastic. The color was natural-looking and not streaky at all, giving me a healthy sun-kissed glow. What I appreciate most is that it didn't have that typical self-tanner smell; instead, it had a pleasant scent that wasn't overpowering. Plus, it moisturized my skin, leaving it soft and hydrated. Overall, I highly recommend Beauty by Earth Self Tanner for anyone looking for a natural-looking tan without harmful chemicals.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B00L2PB3BW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "To apply it it is not greasy. It’s like a really nice cream. I did use it to tan my belly Since I usually use a one piece bathing suit on. To get the color I want you need to apply to her three times.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B00L2PB3BW"
},
]