[
{
    "name": " The Nightingale ",
    "stars": [
        "82%",
        "12%",
        "3%",
        "1%",
        "2%"
    ],
    "pid": "B00NY8OTR0",
    "ratings": "326,021 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "Trials and triumphs of families, wars inside and outside",
    "rating": "5.0 out of 5 stars",
    "content": "This was beautifully written easy to stay totally in.  The ending was totally heart wrenching. Never forget the lessons of history .",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wow…. This book had me all over. I was laughing, crying, scared, and finally brave. This book has taught me so much about the Nazis invasion that I started researching even more about the survivors. I will definitely read this novel again.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Women are so brave..",
    "rating": "5.0 out of 5 stars",
    "content": "One of my all time favorite books! Must read!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book is about 2 sisters who lived in France during WWII during the German occupation.  The story of one of the sisters loosely follows the true story of the young Belgian girl, Monique Hanotte, who risked her life to help escort 135 Allied airman out of German occupied France and Belgium.  It was difficult to put down the book; I kept wondering what would be the fate of the 2 sisters and their families.  I was unaware that the French were treated so badly by the Germans - the Germans imposed near starvation upon the French.  The actions of the Germans are a reminder of how easy it is for ordinary decent people to slip into depravity.  I didn't rate it 5 stars because, even though it is a compelling story, I did not think the writing had the artistic depth of say a John Steinbeck.  It is still well worth the read.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Love it!!!",
    "rating": "5.0 out of 5 stars",
    "content": "This book is so well written and researched.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Did not want it to end.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "A Haunting Tale",
    "rating": "5.0 out of 5 stars",
    "content": "An amazing story teller and so powerful.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Absorbed me from page 1. Truly one of the best and most beautiful written and poignant books I’ve ever read. A must read. Highly recommend.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Incredible story",
    "rating": "5.0 out of 5 stars",
    "content": "What a wonderful telling of a horrible time.  Kudos to you, Kristin Hannah. Thank you for this most wonderful book.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was such a great book! I would highly recommend it. I had such a hard time putting it down",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Amazing read",
    "rating": "5.0 out of 5 stars",
    "content": "Could not put this book down",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Another Hannah book that brings war to life.  The fear, joy and sacrifices that each person goes through during a world war.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Fabulous read",
    "rating": "4.0 out of 5 stars",
    "content": "I thought about putting this book down a couple times, but in the end glad I did not. This book gives you the POC of two sisters living in France during WWII and how their outlooks of the war and being taken over by the Germans effect their lives. No spoilers, but if you get it and think about putting it down DO NOT! The end of the book is hear wrenching and really has a great closer.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Found my eyes filling with tears at several points throughout this book. A stark reminder of how Socialism (which always eventually leads to Communism) is guaranteed to cause suffering, starvation, and death. There are a lot of parallels between the Nazis and today’s modern leftist Democrat party. What I did find a bit odd was the author’s choice with Isabelle. She was talking about a “Free France” and prosperity yet she joined up with Communists…There is no freedom or prosperity with Communism (quite the opposite). Socialism and Communism combined has killed well over 100 million people. Again, I found that to be a rather odd character choice. Otherwise I enjoyed this.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Great Book and storyline",
    "rating": "5.0 out of 5 stars",
    "content": "This book is very well written. I love historical fiction and this book did not disappoint.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a book that causes the ready to: 1. Better understand history  2.  Better understand just how capable women are, and  3. For the reader to question herself regarding what she would have done, and why.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "This Book Made Me Cry…And I Never Cry With Books",
    "rating": "5.0 out of 5 stars",
    "content": "Possibly one of the best books I’ve ever read. I am not a fan of historical stories but Kristin Hannah is an absolute artist that transports the reader into the moments as if she’d been there, herself. What a gift.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you love WWII novels, don't miss this one. Couldn't put it down. Deeply moving.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "A great read",
    "rating": "5.0 out of 5 stars",
    "content": "A friend recommended to read. Came as described and good price. I enjoyed reading it.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "good book would read a thousand times and was a really good price",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Badass page-turner",
    "rating": "5.0 out of 5 stars",
    "content": "Awesome. I continue to be impressed with the way Kristin Hannah weaves a tale. Spotlighting badass women in history through heart-breaking page-turners, what more can you ask for?",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just started reading this book and already having a hard time setting it down. She is a great author",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Jjb",
    "rating": "5.0 out of 5 stars",
    "content": "“If I had told him the truth long ago, or had danced and drunk and sung more, maybe he would have seen me instead of a dependable, ordinary mother. He loves a version of me that is incomplete. I always thought it was what I wanted: to be loved and admired. Now I think perhaps I’d like to be known.”",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Nightingale by Kristin Hannah follows two sisters, Vianne and Isabelle, in France during World War 2. Vianne, with her quiet strength, raises her daughter under the watchful eye of Nazi officers billeted at her home while her husband is away fighting. Isabelle, with her courage and bullheaded determination, works with a resistance group fighting the war in her own way.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Have tissues ready!",
    "rating": "5.0 out of 5 stars",
    "content": "This book ripped my heart out, y’all. I was ugly crying by the end of it. I should have expected it, as Kristin Hannah makes me cry every single time. I honestly didn’t expect it, though, because I have been burned out by books based in World War 2 era. It’s been years since I’ve picked on up…on purpose. Which explains why this book has been on my TBR since 2019 and only got read because it was a book club pick. I’m glad it was, as it was a 5 star read for me. Please be mindful of my trigger warnings, though, and take care of yourself, my friends.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I loved this book. Struggles during ww 2 in France. Those who did not \"fight\" during the war. Those who rebeled, loved and survived the most cruel circumstances.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "So beautiful and sad",
    "rating": "5.0 out of 5 stars",
    "content": "I love reading WWII books, but this one was one I'll not forget.  I felt such an overwhelming heaviness of sadness, it spilled out into my day.  I don't know how so many survived.  At times, I had to put the book down and take a break.  There is no break in the turmoil, torture, and starvation for the jews and for the people of France.  Broke my heart.  It was a lot, all at once and some of it made me think....how could anyone be that cruel?",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I know the author did a ton of research, it shows.  I kept hoping for one ounce of happiness or hope and there was none.  At first it made me put the book down, but then I thought . . . these people had no break either.  Would I read this book again?  No.  It was just too much for me but a story that many should read. If nothing else, so history does not repeat itself.",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Well researched, well written but be prepared a read that will change you.",
    "rating": "5.0 out of 5 stars",
    "content": "At first, this book didn’t grab me. But after three chapters, I was hooked! For this being my first Kristin Hannah, I’m far from disappointed.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved following the story of Vianne and how she navigated and coped with the challenges of the WW. The story gives one great insight into the very real struggles people were faced with and the atrocities that occurred. Its a story of love, tragedy, the will to fight for one’s family and what you believe in despite the consequences.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "another tale of strength about women's resilience during historical turmoil",
    "rating": "5.0 out of 5 stars",
    "content": "As I sit down to write this, there's this odd feeling of emptiness and dryness pervading my thoughts. I once stumbled upon this idea that a good review should capture how a book makes you feel, and let me tell you, this one has stirred up so many emotions in me that I hardly know where to start. If I had to sum it up in just one word, I'd probably go with \"beautiful\" – simple yet profound.",
    "post_time": "Reviewed in the United States on April 1, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My usual go-to genre is thrillers and mysteries, but there's something about historical novels that always gets me. Especially those set against the backdrop of Asian cultures or the turmoil of World Wars I and II. The way authors, especially women like Kate Quinn, Kristin Hannah, and Min Jin Lee, delicately yet powerfully depict the horrors of war and the human spirit within it – it's absolutely mesmerizing.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Loved the story",
    "rating": "5.0 out of 5 stars",
    "content": "War has always felt like a distant concept to me. I come from a country untouched by its scars, and none of my relatives have ever lived through it either. And honestly, I'm grateful for that. But maybe it's this distance that makes me so drawn to reading about it, even through fiction. These stories give me a glimpse into lives lived amidst unimaginable pain and suffering. And while I know nothing can truly capture the horrors of war, I can't help but relate to the everyday struggles faced by those who lived through it. It's both humbling and inspiring to see the strength and resilience of the women who navigated these turbulent times, not just for themselves but for those they loved.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In the words of Kristin Hannah herself, \"\"Men tell stories,\" I say. It is the truest, simplest answer to his question. “Women get on with it. For us, it was a shadow war. There were no parades for us when it was over, no medals or mentions in history books. We did what we had to during the war, and when it was over, we picked up the pieces and started our lives over.\"\"",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Amazing",
    "rating": "4.0 out of 5 stars",
    "content": "Well written",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book has me in a choke hold. Its so good",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Great storytelling can’t stop reading",
    "rating": "5.0 out of 5 stars",
    "content": "Wish I could read this for the first time again",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Leaving 4 stars because the book itself is a beautiful (and tragic) story. I don't love WWII books in general, but gave this one a try based on several recommendations.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "missing pages!!",
    "rating": "5.0 out of 5 stars",
    "content": "However this review is based on the publisher/printer. My copy is missing 33 pages right near the end. As you can see from this pic, it is from page 472-505, and this is an integral part of the story. Because I purchased the book a while ago and just recently got around to reading it, my return window is closed and I don't have the option for product support, so I am writing a review here in hopes of getting Amazon's attention to rectify this situation. So frustrating as this is a key part of the story!",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B00NY8OTR0"
},
]