[
{
    "name": " The Nightingale ",
    "stars": [
        "82%",
        "12%",
        "3%",
        "1%",
        "2%"
    ],
    "pid": "B00NY8OTR0",
    "ratings": "326,159 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "Epic and powerful story of survival and strength",
    "rating": "5.0 out of 5 stars",
    "content": "‘In love we find out who we want to be; in war we find out who we are.’",
    "post_time": "Reviewed in the United States on December 14, 2015",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wow… what a completely epic and powerful story this book was! This is a book that is subtle in its brilliance, it’s one of those books that gets even better the more you sit and think about it. I’m still kind of in awe as I sit here and reflect back on the sheer magnitude of everything that happened over the course of this book. This isn’t the type of book I typically read but I’ve heard so many people talking about it and with nearly 14,000 5-star reviews, how could I not check it out? I’m very glad I did because it was such a moving experience and it really makes you reflect on your own life and certainly will make you thankful for the freedoms we enjoy each day. It wasn’t over the top or gratuitous but it was a very real and honest portrait of life for women in France during WWII and the journey of two sisters as they set out on two very different paths towards survival and freedom in this horrific era.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "A Literary Masterpiece Transformed Into A Heartbreaking Yet Empowering Movie For The Mind’s Eye",
    "rating": "5.0 out of 5 stars",
    "content": "The story centers around two sisters, Vianne Mauriac and Isabelle Rossingol. Vianne, the older and more responsible of the two is living a peaceful and happy life with her husband and daughter in the French countryside. At the threat of impending war, her life is upended when her husband, Antoine, is sent off the fight for France. As Germany begins to occupy France, Vianne is forced to learn how to survive in these new times and protect her young daughter, Sophie. Meanwhile, Isabelle, the younger more rebellious sister has spent much of her childhood being bounced from one boarding school to the next. After the death of their mother when she was just 4, Isabelle has been largely abandoned by her sister and their father. Neither one knowing how to handle the rambunctious girl. As the war starts, Isabelle is not content to sit back and watch as her beloved city of Paris is overtaken by the enemy. Longing to make a difference in the war, Isabelle makes some shocking choices that will forever alter the trajectory of her life.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "“Tell my sister I asked about her. We parted badly.”",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "An Emotional and heartbreaking tale of survival!",
    "rating": "5.0 out of 5 stars",
    "content": "He smiled. “I am constantly arguing with my brother, even in war. In the end, we’re brothers.”",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Vianne and Isabelle’s war-time experience was vastly different, but I was fascinated and inspired by each. Their situations and choices, combined with their tumultuous history, was the source of much conflict between the two. But I loved that when push came to shove, they were still sisters and that’s a bond that is pretty hard to break. I loved seeing how their paths would intersect over the course of the book, even when it was heartbreaking. As I read, I found myself waiting for the time when they would cross paths again. Their relationship was so complicated and well written, I was 100% invested in each of their journeys as well as the evolution of their relationship with each other.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Easy and captivating read",
    "rating": "5.0 out of 5 stars",
    "content": "“Kiss me,” she whispered. “Make me forget.”",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "“It’s not forgetting we need, Vianne,” he said, leaning down to kiss her. “It’s remembering.”",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Phenomenal book, engaging story line",
    "rating": "5.0 out of 5 stars",
    "content": "I found myself relating with Vianne on many levels. I can’t imagine having to live what she lived through, but I could picture myself making some of the same decisions she did. She was cautious and was one to try to fly under the radar in order to not draw attention to herself or her daughter. She did what she had to in order to survive but she wasn’t one to take unnecessary risks. There were few exceptions to this rule as time goes on, however, and I was so proud of some of the things she was able to do. Of course my heart also broke time and again for the things she had to endure or do. She was certainly a hero in her own right for the part she played in the war, and I think she deserved just as much recognition as her sister. And both of them deserved as much recognition as the men on the front lines. I was fascinated by all of the complicated relationship dynamics at play with her and the various men in her life, from Antoine, to Beck to her father and Von Richter. It was all so well done, I know I’m not doing any of it justice here!",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "“I hope you never know how fragile you are, Isabelle.”",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "I really enjoyed this book!",
    "rating": "5.0 out of 5 stars",
    "content": "The Nightingale by Kristin Hannah: I really enjoyed this book. The story is based in Occupied France during World War 2. It had great Character development, watching both Isabelle and Vianne grow into courageous women. While the men are away at war, the women and children left behind become mentally strong and resilient. They learn how to survive and defy the Germans. I appreciated the theme of forgiveness throughout the book. The author did a fantastic job showing how the line of right and wrong needs to be blurred for the “greater good.” I do wish the ending had more end of war details as it felt a little rushed, however I still give the book a 10/10.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was alive and very young during World War II. I have read many books about World War II and the horrible stories and the beautiful stories. This story brought back memories, but also made everything more real and more touching of what the people that lived through this war especially in France, and all the Jewish people and what they went through. it is still hard to believe that humans can treat each other in such a horrible way. But then there is love that can rebuild and build a new life.  I would recommend this book to anyone.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "A breathtakingly, beautiful story of love and war",
    "rating": "5.0 out of 5 stars",
    "content": "As I read this well written book about the tragedy of war, it reminds me that women have gone through so much in our own lives. I loved this book of bravery of Isabelle and Viane and Sophie each learning what it took to survive and then having to survive cancer. I loved the history of wwII woven into the love stories and that gaeten survived and loved Isabelle his whole life. It didn’t say what happened to Antoine I would have",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Known how he died. Another beautiful book and I can’t wait to read your next book.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "a book to remember",
    "rating": "5.0 out of 5 stars",
    "content": "I read this in 2 days because I couldn't put it down. Then I read The Women (also by Kristin Hannah) and then The Great Alone! LOL",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is based on a French family during WWII and how each of them were impacted by the great war and the Holocaust itself. Fascinating read!",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Fantastic read!",
    "rating": "5.0 out of 5 stars",
    "content": "The Women is about nurses during Vietnam era and how they got through everything and the injustice to them once they returned home. Highly recommend that one, too!",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Great Alone is about a family who moves to AK and the difficulties they face while they live there. It has an incredible twist at the end which you will not see coming. Amazing story.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Breathtaking Saga.",
    "rating": "5.0 out of 5 stars",
    "content": "I have read The Nightingale twice and each time been overwhelmed by the powerful beauty of the story and it’s elegant writing.  There is nobody better than Kristin Hannah at novel writing, and, in particular, elevating women to heroic roles that convey strength and power.  This book is a triumph that I loved reading - twice.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book hit every emotion I have in a way no other book has. I must admit, It took me a while to actually open it and get started because I have never been into historical fiction but o was always drawn back to it. The nightingale is definitely my #1 read for 2024. It will live with me forever!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Truly a masterpiece",
    "rating": "5.0 out of 5 stars",
    "content": "I just finished this book and I wish I could read it for the first time all over again. This book crushed my soul & reminded me how precious life truly is. Truly the greatest book I have ever read. 5 stars is simply not enough",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed this book and look forward to reading another  one of Kristen Hannah's best sellers. I was glad to hear the events in this story were based on real female heroes from WWII.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Wow, what a great story!",
    "rating": "5.0 out of 5 stars",
    "content": "This will be a book I wish I could read again and again but for the first time. Such a heartbreaking, beautiful story. It’s hard to leave a rating that expresses everything this book encompasses.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this book and have recommended it to so many people. I went through so many emotions throughout the book. Just when I thought it couldn’t get any better, it did. I could not put this book down. Keep a box of Kleenex handy!",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "WOWOWOWOWOW",
    "rating": "5.0 out of 5 stars",
    "content": "I’d give it 10 stars if I could!!! One of the best books I’ve ever read. It hurt so good. Grab a box of tissues before you start it.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I can hardly put into words how stunning this book was. It was so visually deep and incredibly emotional. The heartache, the love, the pure unbridled depth to this story….",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "The best book I have read!",
    "rating": "5.0 out of 5 stars",
    "content": "I read it in exactly one week (and I’m a full time working Mom!) There was no way I could put it down.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Thank you, Kristin Hannah, for bringing me into this world, showcasing these amazing women! And taking me in such a deeply emotional journey through their lives.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Emotional Damage.",
    "rating": "5.0 out of 5 stars",
    "content": "Not the type of book I’d normally read but I figured I would give it a try…. Started off a little slow but I’m thinking again because it’s not my type of book.  Once I really got into it probably around chapter 10 or so I could not put it down!!!  Never have I ever read a book that brought me to tears!  This is a must read!!  I can not wait for the movie!",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Really loved the novel. It was a reading assignment for my son for school in the summer, but it got into it and read the whole thing myself. I really enjoyed it. Wonderful descriptions!",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Beauty among the Ashes",
    "rating": "5.0 out of 5 stars",
    "content": "Well written, a must read.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed all the details, the suspense, the agony, the headaches and the love.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "great read!",
    "rating": "5.0 out of 5 stars",
    "content": "It was a remarkable journey through the lens of the narrator.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Such a great story or love, loss and hatred all mixed together! Was hard to put down and hated for the book to end !",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Ohh...how much I cry!",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first book from Mrs. Hannah and the experience have been profound and satisfying. Look forward for the movie in 2025 and for more great reading from her.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I don’t give out five stars very often, but this was an easy five star read for me. It’s beautifully written, has some twists, has some romance, and rips your heart out at times. Definitely in my top five books of all time.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Best book of the year",
    "rating": "5.0 out of 5 stars",
    "content": "I loved everything about this book.  So well written and kept my attention.  Wonderful character development.  I was sad when it ended",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If this story is made into a movie, I only hope that they stay true to the book.  The book is great.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "remarkable",
    "rating": "5.0 out of 5 stars",
    "content": "Just beautiful…so beautiful… words can’t describe this book and how it makes one feel. In it is power beyond recognition.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book wrecked me...over and over. It was absolutely beautiful and devastating at the same time. I recommend to anyone.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "wow",
    "rating": "5.0 out of 5 stars",
    "content": "This was the most beautiful gut wrenching story I have read in a long time . I loved every moment of reading this book, lots of tears followed . I will always think about this book day in and out. I’ve never been a huge historical fiction fan, but this book definitely opened my eyes!  Such an amazing beautifully written story .",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm a slow reader and I read this in a few days. Amazing book. Inspiring story of 2 women. Cannot recommend enough.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Must read",
    "rating": "5.0 out of 5 stars",
    "content": "This was a terrific book, I could not stop reading it",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "She is such a gifted writer, This book and her new book the Women are 2 of the best stories I have read in a while.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Talented writer",
    "rating": "5.0 out of 5 stars",
    "content": "Love this book so much.  Characters stay with you long after book has ended.  Wondering what you would do in these dreadful situations…..The kind of novel you don’t want to end.  Recommend 💯!🩷🩷🩷 Author is wonderful, but this is my favorite of her books I’ve read so far (about 5 of them)",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A must read so we never forget the loss, bravery and sacrifice of those that lived, died and loved during WWII.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "BOUGHT FOR A FRIEND",
    "rating": "5.0 out of 5 stars",
    "content": "This was a beautiful novel of hope. A little slower of a read, but it told heroic stories. There were extreme events, but they rolled out fairly slow.  Although it was fiction, it was a solemn reminder that these unbelievable things took place during this unfortunate time. Just have your Kleenex ready, especially at the end! So many emotions",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love, Loss, more Loss with the heartbreak of history. Only to return to LOVE, Forgiveness and Life. I loved this book from the 1st page to the last.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Amazing!!!!",
    "rating": "4.0 out of 5 stars",
    "content": "Loved this book from the first page to the last page.  I will be reading more from this author.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Nightingale is a story of two sisters, Vianne and Isabelle and the way they both experience the horrors of an occupied France during WW2. It was a different perspective than most novels I’ve read from that era, so though familiar with the “story” due to the history, I enjoyed reading about it from a different angle, even though the details were always horrifying. Amazing adventure showcasing the heroism, big and small, of women.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Can't put the book down",
    "rating": "5.0 out of 5 stars",
    "content": "This is the first book I have read by this Author. Wow! The descriptions of events, rooms, places, surpasses many writers.  Her series of books I plan to get one by one, as this one was  fabulously described, and well written page after page!",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What a powerful story!  The heartbreaking stories never told of so many are represented in this book. Grab your tissue, it will change you!",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Powerful!",
    "rating": "5.0 out of 5 stars",
    "content": "For me personally, the book started off a little slow. By halfway through I couldn’t put it down. Fiction, but too much truth to not be heart wrenching. I hope we never forget the truths from this book.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was so good. Such a harsh but important reminder of the past. Through the heartache, hope, love, and tenacity prevailed. Usually have a hard time staying focused but this is the second from this author that I couldn’t put down.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Beautiful book",
    "rating": "5.0 out of 5 stars",
    "content": "Love this book! I wish I could give it more stars!!",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is such a captivating eye opening story. History that they don’t teach or talk about in school. It has such wonderful but sad twists and turns",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Empowering",
    "rating": "5.0 out of 5 stars",
    "content": "Now you need to read two books by John Boyne. Two great reads about the same period.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Boy in the Striped Pajamas",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Best book EVER!",
    "rating": "5.0 out of 5 stars",
    "content": "Followed by",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "All the Broken Pieces.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Trials and triumphs of families, wars inside and outside",
    "rating": "5.0 out of 5 stars",
    "content": "This was beautifully written easy to stay totally in.  The ending was totally heart wrenching. Never forget the lessons of history .",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wow…. This book had me all over. I was laughing, crying, scared, and finally brave. This book has taught me so much about the Nazis invasion that I started researching even more about the survivors. I will definitely read this novel again.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Women are so brave..",
    "rating": "5.0 out of 5 stars",
    "content": "One of my all time favorite books! Must read!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book is about 2 sisters who lived in France during WWII during the German occupation.  The story of one of the sisters loosely follows the true story of the young Belgian girl, Monique Hanotte, who risked her life to help escort 135 Allied airman out of German occupied France and Belgium.  It was difficult to put down the book; I kept wondering what would be the fate of the 2 sisters and their families.  I was unaware that the French were treated so badly by the Germans - the Germans imposed near starvation upon the French.  The actions of the Germans are a reminder of how easy it is for ordinary decent people to slip into depravity.  I didn't rate it 5 stars because, even though it is a compelling story, I did not think the writing had the artistic depth of say a John Steinbeck.  It is still well worth the read.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Love it!!!",
    "rating": "5.0 out of 5 stars",
    "content": "This book is so well written and researched.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Did not want it to end.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "A Haunting Tale",
    "rating": "5.0 out of 5 stars",
    "content": "An amazing story teller and so powerful.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Absorbed me from page 1. Truly one of the best and most beautiful written and poignant books I’ve ever read. A must read. Highly recommend.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Incredible story",
    "rating": "5.0 out of 5 stars",
    "content": "What a wonderful telling of a horrible time.  Kudos to you, Kristin Hannah. Thank you for this most wonderful book.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was such a great book! I would highly recommend it. I had such a hard time putting it down",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Amazing read",
    "rating": "5.0 out of 5 stars",
    "content": "Could not put this book down",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Another Hannah book that brings war to life.  The fear, joy and sacrifices that each person goes through during a world war.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Fabulous read",
    "rating": "4.0 out of 5 stars",
    "content": "I thought about putting this book down a couple times, but in the end glad I did not. This book gives you the POC of two sisters living in France during WWII and how their outlooks of the war and being taken over by the Germans effect their lives. No spoilers, but if you get it and think about putting it down DO NOT! The end of the book is hear wrenching and really has a great closer.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Found my eyes filling with tears at several points throughout this book. A stark reminder of how Socialism (which always eventually leads to Communism) is guaranteed to cause suffering, starvation, and death. There are a lot of parallels between the Nazis and today’s modern leftist Democrat party. What I did find a bit odd was the author’s choice with Isabelle. She was talking about a “Free France” and prosperity yet she joined up with Communists…There is no freedom or prosperity with Communism (quite the opposite). Socialism and Communism combined has killed well over 100 million people. Again, I found that to be a rather odd character choice. Otherwise I enjoyed this.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Great Book and storyline",
    "rating": "5.0 out of 5 stars",
    "content": "This book is very well written. I love historical fiction and this book did not disappoint.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a book that causes the ready to: 1. Better understand history  2.  Better understand just how capable women are, and  3. For the reader to question herself regarding what she would have done, and why.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "This Book Made Me Cry…And I Never Cry With Books",
    "rating": "5.0 out of 5 stars",
    "content": "If you love WWII novels, don't miss this one. Couldn't put it down. Deeply moving.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A friend recommended to read. Came as described and good price. I enjoyed reading it.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "A great read",
    "rating": "5.0 out of 5 stars",
    "content": "good book would read a thousand times and was a really good price",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As I sit down to write this, there's this odd feeling of emptiness and dryness pervading my thoughts. I once stumbled upon this idea that a good review should capture how a book makes you feel, and let me tell you, this one has stirred up so many emotions in me that I hardly know where to start. If I had to sum it up in just one word, I'd probably go with \"beautiful\" – simple yet profound.",
    "post_time": "Reviewed in the United States on April 1, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Loved the story",
    "rating": "5.0 out of 5 stars",
    "content": "Well written",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book has me in a choke hold. Its so good",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Amazing",
    "rating": "5.0 out of 5 stars",
    "content": "Wish I could read this for the first time again",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Great storytelling can’t stop reading",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent book, perfectly written. This is a must read for sure! It is so sad and so very tragic as you fall in love with the characters and have a devastatingly realistic look at how the war really affected innocent people and the strength that prevailed.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I could not put this book down. Stayed up late into the night two nights running as well as the majority of two days, to read this book. Nothing else in my life got done until this book was finished.  And I didn't just read it, I devoured it!",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "THE BEST!!",
    "rating": "5.0 out of 5 stars",
    "content": "  I came to love these women as my own soul sisters.  They are such strong, loving, brave, selfless and heroic women.  I wish I could meet them in real life and be able to call them my friends.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book had me sucked in the whole time. The way the story is told is intense, eye opening, wonderful, and heart breaking. I’m sad it’s over.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "I’m crying too hard to write!",
    "rating": "5.0 out of 5 stars",
    "content": "Definitely recommend!",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My heart. I absolutely adored this book! So many emotions. I couldn’t stop thinking about these characters and what they endured from the moment I started reading it.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Have tissues ready!",
    "rating": "5.0 out of 5 stars",
    "content": "“If I had told him the truth long ago, or had danced and drunk and sung more, maybe he would have seen me instead of a dependable, ordinary mother. He loves a version of me that is incomplete. I always thought it was what I wanted: to be loved and admired. Now I think perhaps I’d like to be known.”",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Nightingale by Kristin Hannah follows two sisters, Vianne and Isabelle, in France during World War 2. Vianne, with her quiet strength, raises her daughter under the watchful eye of Nazi officers billeted at her home while her husband is away fighting. Isabelle, with her courage and bullheaded determination, works with a resistance group fighting the war in her own way.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "So beautiful and sad",
    "rating": "5.0 out of 5 stars",
    "content": "This book ripped my heart out, y’all. I was ugly crying by the end of it. I should have expected it, as Kristin Hannah makes me cry every single time. I honestly didn’t expect it, though, because I have been burned out by books based in World War 2 era. It’s been years since I’ve picked on up…on purpose. Which explains why this book has been on my TBR since 2019 and only got read because it was a book club pick. I’m glad it was, as it was a 5 star read for me. Please be mindful of my trigger warnings, though, and take care of yourself, my friends.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I loved this book. Struggles during ww 2 in France. Those who did not \"fight\" during the war. Those who rebeled, loved and survived the most cruel circumstances.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Well researched, well written but be prepared a read that will change you.",
    "rating": "5.0 out of 5 stars",
    "content": "I love reading WWII books, but this one was one I'll not forget.  I felt such an overwhelming heaviness of sadness, it spilled out into my day.  I don't know how so many survived.  At times, I had to put the book down and take a break.  There is no break in the turmoil, torture, and starvation for the jews and for the people of France.  Broke my heart.  It was a lot, all at once and some of it made me think....how could anyone be that cruel?",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I know the author did a ton of research, it shows.  I kept hoping for one ounce of happiness or hope and there was none.  At first it made me put the book down, but then I thought . . . these people had no break either.  Would I read this book again?  No.  It was just too much for me but a story that many should read. If nothing else, so history does not repeat itself.",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "couldn’t put down",
    "rating": "5.0 out of 5 stars",
    "content": "At first, this book didn’t grab me. But after three chapters, I was hooked! For this being my first Kristin Hannah, I’m far from disappointed.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved following the story of Vianne and how she navigated and coped with the challenges of the WW. The story gives one great insight into the very real struggles people were faced with and the atrocities that occurred. Its a story of love, tragedy, the will to fight for one’s family and what you believe in despite the consequences.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "captivating read",
    "rating": "5.0 out of 5 stars",
    "content": "\"I always thought it was what I wanted: to be loved and admired. Now I think perhaps I’d like to be known.\"",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B00NY8OTR0"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had to take a bit of a break from this, was feeling very burnt out on WWII books and this was dragging a bit for me. Once I made to to around 50% it really picked up for me. The characters were so though to like at the beginning but I really warmed up to them. Kristin Hannah books always make me cry and this was no different. The themes of doing anything for your family really got me.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B00NY8OTR0"
},
]