[
{
    "name": "        Nutrichef Food Dehydrator Machine | Dehydrates Beef Jerky, Meat, Food, Fruit, Vegetables & Dog Treats | Great For At Home Use | High-Heat Circulation for Even Dehydration | 5 Easy to Clean Trays       ",
    "stars": [
        "68%",
        "16%",
        "8%",
        "3%",
        "5%"
    ],
    "pid": "B01DO0ZR7I",
    "ratings": "2,267 ratings",
    "other_info": {
        "Brand": "NutriChef",
        "Color": "White",
        "Wattage": "250 watts",
        "Product Dimensions": "11\"D x 11\"W x 10.2\"H",
        "Voltage": "120"
    },
    "discount_price": "$ 46.12",
    "normal_price": "$49.99",
    "about_this_item": [
        " EFFICIENT DEHYDRATION: A multi-tier electric food dehydrator can quickly and efficiently remove moisture from fruits, vegetables, meat, beef jerky and other foods, preserving their flavor, nutrients, and texture for longer storage times.  ",
        " EASY ACCESS AND OPERATION: Built with easy to use one operational button. Dehydrate with just a click. It has a temperature control system with a maximum of 180°F.  ",
        " HEALTHY SNACKS: Dehydrated foods are a healthy snack option, as they are free from additives, preservatives, and excess sugar and salt. They can also be a good source of vitamins, minerals, and fiber, making them a great addition to any diet.  ",
        " PRESERVE FOOD: Drying your own fruits, vegetables, and meats can be a cost-effective way to preserve food and reduce waste. retain nutrients and flavor, store for extended periods without refrigeration, and enjoy a cost-effective, educational activity with friends and family  ",
        " HEAT CIRCULATION: Through scientific testing, our food dehydrator has been shown to increase the shelf life of food by utilizing high heat circulation that travels evenly through each tray. This process effectively removes moisture content, resulting in shrunken but nutrient-dense food that retains 97% of its original vitamins and minerals.  "
    ]
},
]