[
{
    "name": "        Nutrichef Food Dehydrator Machine | Dehydrates Beef Jerky, Meat, Food, Fruit, Vegetables & Dog Treats | Great For At Home Use | High-Heat Circulation for Even Dehydration | 5 Easy to Clean Trays       ",
    "stars": [
        "68%",
        "16%",
        "8%",
        "3%",
        "5%"
    ],
    "pid": "B01DO0ZR7I",
    "ratings": "2,267 ratings",
    "other_info": {
        "Brand": "NutriChef",
        "Color": "White",
        "Wattage": "250 watts",
        "Product Dimensions": "11\"D x 11\"W x 10.2\"H",
        "Voltage": "120"
    },
    "discount_price": "$ 46.12",
    "normal_price": "$49.99",
    "about_this_item": [
        " EFFICIENT DEHYDRATION: A multi-tier electric food dehydrator can quickly and efficiently remove moisture from fruits, vegetables, meat, beef jerky and other foods, preserving their flavor, nutrients, and texture for longer storage times.  ",
        " EASY ACCESS AND OPERATION: Built with easy to use one operational button. Dehydrate with just a click. It has a temperature control system with a maximum of 180°F.  ",
        " HEALTHY SNACKS: Dehydrated foods are a healthy snack option, as they are free from additives, preservatives, and excess sugar and salt. They can also be a good source of vitamins, minerals, and fiber, making them a great addition to any diet.  ",
        " PRESERVE FOOD: Drying your own fruits, vegetables, and meats can be a cost-effective way to preserve food and reduce waste. retain nutrients and flavor, store for extended periods without refrigeration, and enjoy a cost-effective, educational activity with friends and family  ",
        " HEAT CIRCULATION: Through scientific testing, our food dehydrator has been shown to increase the shelf life of food by utilizing high heat circulation that travels evenly through each tray. This process effectively removes moisture content, resulting in shrunken but nutrient-dense food that retains 97% of its original vitamins and minerals.  "
    ]
},
{
    "title": "Works fine! Dry food and Herbs.",
    "rating": "5.0 out of 5 stars",
    "content": "I had a dehydrator which I used for desiccant and filament to support 3D printing. Then, wanting to dry out some freshly harvested herbs, I recalled the desiccants are carcinogenic, so I got a clean unit (this one) for food-safe work.",
    "post_time": "Reviewed in the United States on July 31, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The temperature is nice, and can go very low. This is important for some items. There's a ton of space, and I often use it to reconstitute stale potato chips and the like. There's no safety timer, so you can just run it how you want without having to work around when the device feels it is ok for you to use it.",
    "post_time": "Reviewed in the United States on June 14, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Clicks constantly, but is reliable and effective!",
    "rating": "4.0 out of 5 stars",
    "content": "Quiet, and the base is easy to clean, and you can put the drying racks on one of two ways for a close or tall spacing, as desired, for each level.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Recommended.",
    "post_time": "Reviewed in the United States on January 8, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Works very well",
    "rating": "5.0 out of 5 stars",
    "content": "This is a very simple to use machine, and it's very effective and requires little to no maintenance. It dries quickly and thoroughly, and is really affordable.",
    "post_time": "Reviewed in the United States on March 10, 2024",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The noise level is low. It emits a soft hum that's not at all distracting or too loud. Ours, however, makes a constant clicking sound every 10-15 seconds. Originally, we were concerned and thought we had a defective piece, and maybe we do, but it doesn't have any effect on its functionality. We noticed it was coming from the on/off area, and didn't stop or change when temperature was raised or lowered, or time extended. We spoke with the manufacturer and they stated that this should eventually go away, but it never has. Nonetheless, it doesn't seem to cause any issues, but we wanted to point it out that it does do this, when most others don't.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Very good introductory dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "We don't have any complaints, though. It does a good job at doing what it was built to do!",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use it to preserve food that is about to go bad. It works well.",
    "post_time": "Reviewed in the United States on September 3, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Very good",
    "rating": "4.0 out of 5 stars",
    "content": "Bought this thinking \"oh well it's $50 if it doesn't work...\". Turned out I am very happy with it. This works great especially for the price. My mother has a $300 pro dehydrator, and this is not that. This guy is small. You will get about 3 apples sliced thin in here, not using the bottom shelf (there's some debate on using the bottom shelf). That will shrink to fill a standard size sandwich ziplock bag. Some have complained about the noise. I am not bothered by it. It's low, and steady. If I was in a small apartment, or if placed close to a bedroom maybe it would be an issue for me. Easy to clean and setup. My 5 year old loves helping, and it's very easy for him to use as well. Also the instructions are very, very helpful. Not just about the machine, but techniques and tips for dehydrating.",
    "post_time": "Reviewed in the United States on December 16, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I got this for my hubby . He loves this. Very easy to use, not taking alot space on counter. Thank you",
    "post_time": "Reviewed in the United States on June 23, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Using for meat chips",
    "rating": "5.0 out of 5 stars",
    "content": "Using a Shabu Shabu frozen meat slicer to cut thin pieces of pork loin and beef.  Dehydrating in the Nutrichef for protein chips for my family.",
    "post_time": "Reviewed in the United States on March 23, 2024",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Works really well.",
    "post_time": "Reviewed in the United States on September 27, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Quiet",
    "rating": "5.0 out of 5 stars",
    "content": "Using it now for 1st time and other than having trouble lining up the trays I find it easy to use, clean and store. No noise from the fan",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this thing. I make alot of beef Jerry with it. Works great!",
    "post_time": "Reviewed in the United States on August 24, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "The best",
    "rating": "4.0 out of 5 stars",
    "content": "I am so happy I got this dehydrator.  I use it to make jerky treats for my Standard Poodle.  My poodle is a very picky eater and I have not been able to get the only treats she is crazy about for a while. She has been miserable!  Nothing I got was acceptable.  I have now made chicken jerky treats 3 different times and she loves them.  For anyone interested, I slice 3 lbs chicken breasts into thin narrow slices, add a pinch of salt.  I lay the pieces as flat at I can on the trays, close but not touching. Run the NutriChef for 7-8 hours on Max speed, switching the trays around after several hours.  I certainly recommend the NutriChef dehydrator for this purpose.",
    "post_time": "Reviewed in the United States on November 8, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have a small herb garden and also like to dry a few fresh fruits from time to time- apples and bananas usually.  This dehydrator is small and only has 5 trays but they hold a lot!  I was able to dry four medium sized, thinly sliced potatoes at one time.  Dried, they filled a quart jar.",
    "post_time": "Reviewed in the United States on November 10, 2019",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Great for making jerky",
    "rating": "4.0 out of 5 stars",
    "content": "The operation is very quiet - could barely hear it.  The only down side is knowing where the temp is. Low, medium, high is not accurate enough for me so its a guess on the temperature level so I have to use my digital thermometer to get it right.  If that's not an issue for you, this machine is excellent!",
    "post_time": "Reviewed in the United States on April 20, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "The plastic trays have little tabs that fit into the trays above and below to make the whole thing fit together. One tray had a missing tab when I unpacked the box. I emailed the company and they had me take a photo of it and email it to them, and then they promptly sent me another tray. Unbelievably, that tray too had a broken tab. They were so nice, didn't even need a picture this time, just sent me another tray. All of this took about a week. After I finally got working trays, I love this little machine. (To be honest, I used it with the other 4 trays while I was waiting for the one unbroken one.) It's not a giant dehydrator, but for my home garden, it's perfect. I dried tomatoes, pears, apples, peppers, onions, and beans for shelling. They all came out perfectly. I've got big plans for next year...And I'm grateful that the seller was so prompt with what could have been a less-than-satisfactory situation.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Just what I was needing for the small amount of dehydrating that I do",
    "rating": "4.0 out of 5 stars",
    "content": "I only gave this a 4 star for one reason: when I received the unit and removed it from the box and piece of hard plastic fell out of package.  In inspecting the unit the very bottom tray had a plastic part that is for the adjusting height of the tray.  I was going to ask Amazon if I could get just a replacement tray but it would only let me return the whole unit.  I did not want to do this because I was ready to make jerky.  I’m in hope that NutriChef May see this review and get in touch with me about a replacing the tray.  Other than this the unit is so far fantastic and easy to use and clean.  The clip had to be broken upon packing as it was on the very bottom tray.  Thank you for a great product all in all.",
    "post_time": "Reviewed in the United States on September 21, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "After scouring the internet for nearly an hour, I still have absolutely no idea what the temperature settings are degree wise, verses high, medium and low. “Dry your apples at 130°” they say! Ok nutrichef… you want to tell me what setting between high and medium 130° is at?",
    "post_time": "Reviewed in the United States on September 6, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Fantastic product without paying the \"mercedes benz\" price!!",
    "rating": "5.0 out of 5 stars",
    "content": "I didnt understand the instructions comoletely before I tried it. However, upon figuring some things out on my own, i have used the machine almost every day since it arrived. I wanted to try it out on a few things before I gave my review. I did strawberries, blueberries, pineapple, mixed veggies (frzn), Stringbeans(frzn), and apples. All came out woderfully. I am very impressed. I will say, if you purchase the silicone rack covers that dont have the hole already cut out, make sure you make the hole large enough. I was wondering why the food wouldnt dry, and the 1st. Batch took me 24hrs. But it wasn't the fault of the machine. I cut the holes bigger in the liners, and it works perfect. Also, it works even better for larger items like apple slices, without the liners. Im so glad I didnt psy twice or three times as much, to get the same tesults. I may purchase another. Thanks for a great, and yet inexpensive product. Love it!!!!",
    "post_time": "Reviewed in the United States on August 24, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this dehydrator so much that this is my 2nd purchase. Bought the first one about 3 years ago, still going strong. Just needed a second to keep up with all the fruits i dry. I'm gonna get a 3rd soon!",
    "post_time": "Reviewed in the United States on October 6, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Does the job quietly!",
    "rating": "3.0 out of 5 stars",
    "content": "This may be fine for fruit and veggies but after purchasing and notice the temps do not hit 176 as stated. Do not make anything with meat. Have this running for 6 hours and barely broke 120. FDA danger zone. Im tossing this batch.",
    "post_time": "Reviewed in the United States on September 28, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It takes longer than the smoker but it is way less mess!!",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Not for jerky",
    "rating": "5.0 out of 5 stars",
    "content": "Adjustable settings, adjustable racks, works great",
    "post_time": "Reviewed in the United States on February 17, 2024",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "All in all, a great product that after a few days of continuous use seems to work well. I've enjoyed dehydrating a variety of fruits and vegetables so far. Easy to use and great instruction booklet.",
    "post_time": "Reviewed in the United States on June 26, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Jerky anyone?",
    "rating": "5.0 out of 5 stars",
    "content": "Pro's, great price, easy to use, quick to get going, decent design.",
    "post_time": "Reviewed in the United States on October 31, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Con's one tab on a rack was snapped off, didn't interfere with use so I didn't return it. Racks don't always stack interlocking, requires a little jiggling sometimes.",
    "post_time": "Reviewed in the United States on March 9, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Good unit",
    "rating": "5.0 out of 5 stars",
    "content": "For those that give it a try, it's very important to be consistent with your cuts otherwise it's difficult to get things done at the same time. It's also a challenge to not overdry some things. Requires a watchful eye and a little experimentation.",
    "post_time": "Reviewed in the United States on December 18, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Made awesome jerky.. Make sure to cook for at least 4 hours. It’s just a pain in the ass to make jerky in the first place..",
    "post_time": "Reviewed in the United States on January 26, 2019",
    "pid": "B01DO0ZR7I"
},
{
    "title": "It is pretty much silent, but it also doesn’t work too well.",
    "rating": "3.0 out of 5 stars",
    "content": "I bought this specifically because it was a quiet machine, but it comes with a trade off.  I have a larger food dehydrator that I use primarily for venison but it is so loud we need to keep it in the basement while it is running (the loud part being the fan).",
    "post_time": "Reviewed in the United States on January 24, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The trade off is it doesn’t work as well as the bigger ones do. Yes it dehydrates food, but if you want your food to be crunchy like a cracker or potato chips, this one isn’t for you.",
    "post_time": "Reviewed in the United States on August 22, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Best method to minimize food storage!",
    "rating": "5.0 out of 5 stars",
    "content": "The first thing we tried making was banana chips but after 18 HOURS of dehydrating on the max setting the bananas were still chewy/gummy. This was the case for every other food we tried as well.",
    "post_time": "Reviewed in the United States on September 12, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I took another star off because the trays aren’t machine washable. It seems picky, but really? Every other brand is machine washable so why isn’t this one.",
    "post_time": "Reviewed in the United States on December 3, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Perfect size, and quiet.",
    "rating": "5.0 out of 5 stars",
    "content": "Additionally the trays are very fragile. Made of brittle plastic, polystyrene I believe. I had it for a week and two of the trays have small cracks.",
    "post_time": "Reviewed in the United States on February 12, 2017",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I received my dehydrator on August 15 & have had it in continual use. It's  quite efficient and quieter than I anticipated. I confess to speeding up the process  with a quick sauna in the oven, on 'juicy' vegetables like tomatoes, but I am quite satisfied with the product. The trays are ample and easy to clean. I have dehydrated ginger, tomatoes, peppers, grapes & cherries so far, and it was delivered on the 15th of August.",
    "post_time": "Reviewed in the United States on December 9, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Dehydrates quickly but trays are impossible to seat properly",
    "rating": "5.0 out of 5 stars",
    "content": "Just opened and getting ready to dehydrate. I had an old circular one that I got from a thrift shop before, and didn't bring it when I moved. I love that there's no hole in the center of the trays, and that they have alternating heights. A quick meat thermometer showed it getting to around 160F on high. Was very quiet, and I love that it's more compact. Can't wait to make home made beef jerky!",
    "post_time": "Reviewed in the United States on November 20, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a replacement for my 30 yr old dehydrator that finally gave up the ghost.  I love the fact that it dehydrates quickly ( a relative term as it dries herbs in a few hours and beef for jerkey in a day and a half - it works as well as any table top cheap dehydrator.  Seems to be sturdy, fan noise in minimal, doesn't use a ton of electricity, BUT it's beyond me how to get the drying trays to seat properly.  Oh well, it still works well and the cost is attractive.",
    "post_time": "Reviewed in the United States on November 16, 2018",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Fantastic and easy to use!",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this dehydrator after carefully reviewing the reviews of other consumers.  The product arrived one day late which was slightly problematic as I bought the meat I was going to dehydrate based on the given delivery date, so I suggest buying your meat after product arrives.  Too, the roast was on sale and the butcher sliced it thin at no charge.  The machine is so easy to use.  Season your jerky, lay strips on racks, cover and press on.  8 hours later I had perfect beef jerky at a tenth of the cost of buying it.  Too, we're on a paleo diet so I was able to make paleo jerky (no soy sauce or sugar added).  Paleo jerky is twice as costly as regular jerky so we saved even more.  If you're worried about the durability of your dehydrator, I suggest buying the 4 year protection plan just in case.  The plan is super cheap.",
    "post_time": "Reviewed in the United States on July 23, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This an awesome product!! I would recommend to anyone.",
    "post_time": "Reviewed in the United States on November 14, 2019",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Does it's job!",
    "rating": "5.0 out of 5 stars",
    "content": "Used to dry mangoes, kiwis and slices of chicken. All worked out well. For the fruits: cut them thin, that will cut the drying time significantly.",
    "post_time": "Reviewed in the United States on September 7, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I had three trays for orange slices and it didn’t dry them completely even after almost 24 hours.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Drying time is SO SLOW",
    "rating": "4.0 out of 5 stars",
    "content": "It’s a quiet machine but it doesn’t seem like it circulating warm air- it’s very cool air when I would feel the edges.",
    "post_time": "Reviewed in the United States on September 3, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "So far so good and it looks nice enough to sit on a shelf...the only thing is in our old dehydrator the motor was at the top but this one the motor is on the bottom so when we make jerky we had to worry about drippings, after some research I realized something had to lay on the bottom 1-2 racks, such as parchment paper but I ended up buying specific dehydrator paper. It's ok that I need it but it would have been nice to know when I bought the dehydrator.",
    "post_time": "Reviewed in the United States on December 28, 2019",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Nice product",
    "rating": "5.0 out of 5 stars",
    "content": "I am a novice and new dehydrator. So didn't want to spend the $ for a top of the line or large one. I've tried several food types and put those in jars with the little oxygen eating packet you can buy to seal it up tight. It's great that it is something you can let run all day long, if not dry enough yet, take the trays out, put those in the fridge and start up again the next day. You can let it run all night too if you want. It suits my needs.",
    "post_time": "Reviewed in the United States on November 28, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great product. Easy to use and amazing",
    "post_time": "Reviewed in the United States on May 16, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Pretty good!",
    "rating": "5.0 out of 5 stars",
    "content": "I needed a smaller unit as I have limited space in my kitchen. This is compact and it works great. I have a new puppy and wanted to make fruit and jerky meat. The fruit does great but I’ve not had success with the meat (chicken) but that’s just probably me. The recipe in the book states that you need to cook the meat before dehydrating it but that didn’t work and I didn’t like the way it came out but it looked the same as what you get in the pet stores. Overall I love this machine and use it at least once a week.",
    "post_time": "Reviewed in the United States on September 3, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first dehydrator. I grow spicy peppers and dehydrate them to make seasonings. At first it took a long time to get crispy and brittle but once I left setting on high it works great.  I also did bananas and they came out full of sweet flavor, dehydrated and delicious. Looking forward to trying new things",
    "post_time": "Reviewed in the United States on June 30, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "So this nutrichef dehydrator is an awesome dryer that does not take up much space but dries a lot of product. We are glad be bought it and look forward to many years of service.",
    "post_time": "Reviewed in the United States on November 21, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Doesn’t get as hot as the manual claims but still great to have a temp controller for a range of uses. Just use a meat thermometer in the openings of the lid to get accurate temperature. Very quiet also. I found that it has a bit of a hard time heating the trays when stacked to its full capacity. Smaller batches with less trays give a better consistency to the dehydration. Overall, perfect for my needs.",
    "post_time": "Reviewed in the United States on September 16, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "So far, so good.",
    "rating": "4.0 out of 5 stars",
    "content": "So far, so good. Arrived on time. Lots of things I'm looking forward to drying.",
    "post_time": "Reviewed in the United States on December 20, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This little guy fits perfect on my counter top and does the job I need it to do! I love the way the trays stack and it's easy clean up as well!",
    "post_time": "Reviewed in the United States on June 15, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "❤Perfect",
    "rating": "5.0 out of 5 stars",
    "content": "I don’t think I’ve stopped using this since I bought it! So easy to use, easy to clean. Make sure you have room to store it",
    "post_time": "Reviewed in the United States on July 19, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love the compact size. Can get quite a lot of product in the five trays. I love that they are square shaped. Very quiet.",
    "post_time": "Reviewed in the United States on July 24, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Super easy, love it!",
    "rating": "5.0 out of 5 stars",
    "content": "I was used to large dehydrators so when it arrived I was discouraged UNTIL I set it on my counter and realized how little space it took up.  It dehydrates and is rather pretty.  For the money, this works great for me (family of one).",
    "post_time": "Reviewed in the United States on September 26, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product because it's not complicated and the instruction booklet is easy to follow. I am making my own beef jerky tonight.",
    "post_time": "Reviewed in the United States on July 21, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Nice",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent product, set it and forget it. its very easy to use and I made chicken jerky yesterday, it came out perfect, thank you for this product.",
    "post_time": "Reviewed in the United States on December 18, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I have many allergies, intolerances and sensitivities and eat 100% organic but organic does not mean sulfites free (which is a preservative not a pesticide), so I need to dry my own fruits and veggies if I need to buy dried fruits.",
    "post_time": "Reviewed in the United States on July 5, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "I like it!",
    "rating": "3.0 out of 5 stars",
    "content": "I made the chicken jerky for my 13 yr yorkie and later some strawberries, banana and pineapple, turned out beautiful. This is a perfect size dehydrator. Yasmin Ladha",
    "post_time": "Reviewed in the United States on March 26, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this dehydrator to do just fruits and vegetables because I have a secondary one that I use for my meat. However I didn’t realize it until I got it here and we started using it that there’s no timer on it. My current dehydrator has a setting from anywhere from 1 to 20 hours that you set and then basically forget about it until it’s done because it shuts itself off wheN it’s done. You can’t do that with this one because it will just run and run until you shut it off so this one will not be used as much because it will need to have a separate timer on it either in the house or on my phone to remind me to shut it off.",
    "post_time": "Reviewed in the United States on November 11, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Excellent!",
    "rating": "5.0 out of 5 stars",
    "content": "I LOVE this dehydrator. I have owned probably 7 dehydrators and this is my favorite by far. It was supposed to be just my extra one for if I made a lot of jerky but it has ended up being my go to one. It’s even better than the expensive $70 one I bought that has all kinds of settings. This is quiet and it dries the jerky wonderfully. Would definitely buy again and recommend. I have not done anything other than jerky on it though.",
    "post_time": "Reviewed in the United States on December 11, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Got this product for my mother who is 80 years old and needed something simple that works! And behold I got this product and she is happy with it! No complaints from her and that means this is a good product! My mom makes jams and snuff so I consider her a pretty good cook as your oldest son. This product fit the ticket oh, I'm considering getting one for myself!",
    "post_time": "Reviewed in the United States on October 4, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Simple",
    "rating": "4.0 out of 5 stars",
    "content": "My NutriChef arrived today and  excited to try it asap",
    "post_time": "Reviewed in the United States on August 23, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Like many, I am sometimes leery about buying appliances like this online.  This unit is just right for me as a single man.  Extremely easy to clean, quiet, does a good job, and is fun for a first time jerky maker trying to just get in cheap to see if I'd like the product vs. the time expenditure.  I've found that five pounds of meat works great with the commercial jerky seasoning and fits in over two batches in this machine.  The instructions suggest freezing the meat for about 30 minutes to make slicing easier, but I've found I need to freeze it even a bit longer to get even thickness slices.",
    "post_time": "Reviewed in the United States on June 9, 2017",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Looking forward to using this!",
    "rating": "5.0 out of 5 stars",
    "content": "I loved it! It was just as described. Package came perfect and delivered fast as promised! 😊❤️",
    "post_time": "Reviewed in the United States on July 10, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very quite can't hear anything, Easy to clean. Has three settings high medium and low. Has five trays so many room to make plenty of dried food. I've made beef jerky perfect. I made dried fruit wasn't crispy after 10 hours my only complaint prolly doesn't get hot enough.",
    "post_time": "Reviewed in the United States on April 28, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Better than expected",
    "rating": "5.0 out of 5 stars",
    "content": "Small but mighty. This is a wonderful item to have to dehydrate your own foods and save a bundle of money.",
    "post_time": "Reviewed in the United States on May 26, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Really love this little machine. This dehydrator doesn't make any noise and it's very simply to work with. I did have pro oems with the shipping, but performance wise I can't complain. I would definitely recommend this to anyone.",
    "post_time": "Reviewed in the United States on September 2, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Just as described",
    "rating": "5.0 out of 5 stars",
    "content": "works great, smaller than most so works great in my little kitchen and will help me reach my healthy eating goals",
    "post_time": "Reviewed in the United States on April 3, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I have tried my best to like this product but it has not fulfill what I want to in dehydrating food. I have to give it 5 stars for noise control as it is very quiet. When it comes to dehydrating food I haven’t been able to achieve a batch of dehydrated food that is to the desire of crunchiness. All of my dehydrated food it is still bland. I’m sure a higher quality one will do the job. This one not so much.",
    "post_time": "Reviewed in the United States on September 26, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Jerky maker",
    "rating": "5.0 out of 5 stars",
    "content": "I have not yet used this product. In the fall it will be used constantly.",
    "post_time": "Reviewed in the United States on July 4, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Dehydrator arrived on time. While unpacking the trays, I found one with a broken spacer tab. Other than the damaged tray, I'm pleased with the purchase.",
    "post_time": "Reviewed in the United States on December 30, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Damaged tray",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great little food dehydrator!  I struggled with trying to select one within my price range and the size that I wanted that would meet all of my requirements, and this one did!  I have made jerky, and dried fruits and herbs, and I have been extremely pleased with the results!  I am very pleased with this product!",
    "post_time": "Reviewed in the United States on October 11, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Does a great job when food is sliced very thin and spaced apart on the racks. Also works best for the first two or three racks and less so for the upper two racks. So, I ended up starting the drying process in the oven with the door cracked and then transferring to the dehydrator. This allowed me to run two batches at the same time. So, for me the dehydrator was a supplement to the oven but not as a stand-alone dehydrator. Not bad, but if I get another one it’ll probably have a horizontal blowing fan instead of a vertical fan like this one.",
    "post_time": "Reviewed in the United States on July 23, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Excellent little dehydrator!",
    "rating": "5.0 out of 5 stars",
    "content": "love this. have used it 3 times since I  got it",
    "post_time": "Reviewed in the United States on March 24, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "...beef jerky does very well...so easy to use.",
    "post_time": "Reviewed in the United States on May 14, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Works best to finish what started out in the oven",
    "rating": "5.0 out of 5 stars",
    "content": "Great product. Expect for dehydrating fruit to take about 9 hours, depending on how thin it’s cut.",
    "post_time": "Reviewed in the United States on June 11, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I bought this and immediately left it on for a solid month and it acts fine.",
    "post_time": "Reviewed in the United States on March 19, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "easy to use",
    "rating": "4.0 out of 5 stars",
    "content": "I plan to use this product to dry food especially fruits.  I have many fruits trees and a lot of fruits from them every year.  However when I received this product and read the information in the booklet manual, I know I cannot use it. It is too weak, not enough force and need much time to dry that not to be mentionned/disclosed in the description in advance to avoid the return the product.",
    "post_time": "Reviewed in the United States on June 26, 2019",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I am unhappy if I have to pay fee for the return it at this covid19 time to go to the free return location.",
    "post_time": "Reviewed in the United States on August 27, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "How firm its backside is. Tougher then fresh raw hide",
    "rating": "4.0 out of 5 stars",
    "content": "Very solid and not made cheaply. Packaged properly with real high end cardboard. Nutrichef, you never seize to amaze me with the temperature control, easy cleaning, and noise level always being a main focus. Life couldnt be easier when it comes to drying my mushrooms. Huuuuddieee Hooooo!",
    "post_time": "Reviewed in the United States on January 7, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Made apple chips in this dehydrator for my first project and was super happy with the result. It dehydrates much faster than expected and I had apple chips in no time. The unit runs whisper quiet which was a plus. Love how you can rotate the trays to change how close or far apart they sit upon each other. The manual was also super helpful with lots of info and tips. Would definitely purchase again!",
    "post_time": "Reviewed in the United States on July 8, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Super quiet!",
    "rating": "5.0 out of 5 stars",
    "content": "I was totally blown away!!",
    "post_time": "Reviewed in the United States on March 9, 2017",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "- Easy to use, Easy to setup, quiet and does not take up much room on the countertop.",
    "post_time": "Reviewed in the United States on November 1, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "I was totally blown away!!",
    "rating": "5.0 out of 5 stars",
    "content": "- First try, I over loaded it with cilantro leaves. Way-to-Many!!",
    "post_time": "Reviewed in the United States on July 11, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "- To my surprise, it dried them all the first time in 2 hrs.",
    "post_time": "Reviewed in the United States on August 8, 2019",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Works great",
    "rating": "3.0 out of 5 stars",
    "content": "Since I am a GUY, it is Guy proof.  Can not wait to make Jerky!!",
    "post_time": "Reviewed in the United States on June 23, 2019",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I am SOLD!! I am SOLD!!",
    "post_time": "Reviewed in the United States on October 15, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "This will save me money",
    "rating": "5.0 out of 5 stars",
    "content": "Update!!! Update!!",
    "post_time": "Reviewed in the United States on August 12, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Made for the first time; 6lbs of Bayou Blend Homemade Beef Jerky, from a recipe!!",
    "post_time": "Reviewed in the United States on March 13, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Satisfied with this purchase for my girlfriend.",
    "rating": "4.0 out of 5 stars",
    "content": "GF loves beef jerky and she's made several batches so far without issues. Don't like to clean the trays so much but it is what it is. Price was good.",
    "post_time": "Reviewed in the United States on February 5, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator works very well and user friendly. I dehydrated apples to get things rolling and it could not have been easier. This unit is ight weight, good construction and quite. Very pleased.",
    "post_time": "Reviewed in the United States on March 14, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Great roduct",
    "rating": "2.0 out of 5 stars",
    "content": "The book says the top temp is just over 170 my temperature probe didn’t get close to that. Took triple the time it was supposed to. Pass this one by choose one with better temp control",
    "post_time": "Reviewed in the United States on October 2, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I am returning this. I would like to speak to someone as it says my window is closed but I put an asurion warranty on it.!!!! Y'all are totally taking advantage of This Covid 19",
    "post_time": "Reviewed in the United States on April 23, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Doesn’t get to temp",
    "rating": "5.0 out of 5 stars",
    "content": ". This think takes over 30 hrs to dehydrate banana chips 40 for blueberries.. And I want a return label and want this item to be picked up tomorrow and returned. So I can purchase one that works faster.",
    "post_time": "Reviewed in the United States on October 2, 2022",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "As a first time dehydrator user, this one is does the job well. Simple and clear instructions provided.",
    "post_time": "Reviewed in the United States on April 18, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "I put an asurion warranty on this. I have the proof and my windows closed?!",
    "rating": "5.0 out of 5 stars",
    "content": "I have only had this product for a few days but have made dog treats,  a fruit leather and am attempting to figure out pumpkin flour :) I'll find many more uses for it I am sure.",
    "post_time": "Reviewed in the United States on July 10, 2023",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I'm figuring it out as I go along",
    "post_time": "Reviewed in the United States on August 21, 2020",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Lots of space, works well",
    "rating": "3.0 out of 5 stars",
    "content": "Settings simple, quiet machine, easy to use",
    "post_time": "Reviewed in the United States on January 31, 2021",
    "pid": "B01DO0ZR7I"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It seams to be working well but just noticed that one of the little legs is missing ( broken off) on one of the dryer plates and don’t see how to order a replacement plate. In information would be helpful.",
    "post_time": "Reviewed in the United States on March 25, 2021",
    "pid": "B01DO0ZR7I"
},
]