[
{
    "name": "        Etekcity Bathroom Scale for Body Weight, Digital Weighing Machine for People, Accurate & Large LCD Backlight Display, 6mm Tempered Glass, 400 lbs       ",
    "stars": [
        "82%",
        "11%",
        "3%",
        "1%",
        "3%"
    ],
    "pid": "B01HI1W1V4",
    "ratings": "290,392 ratings",
    "other_info": {
        "Brand": "Etekcity",
        "Color": "Silver",
        "Recommended Uses For Product": "Humans",
        "Special Feature": " ",
        "Display Type": " "
    },
    "discount_price": "$ 19.",
    "normal_price": "$19.88",
    "about_this_item": [
        " First-Rate Quality: Don't settle for less. As the no.1 selling brand of body weight scales in the US, Etekcity is known for innovative and high-performing products. (Source: Stackline/Retail Intelligence, U.S. Amazon Data Market Share, February 2019-2021)  ",
        " Consistent Accuracy: Benefit from 10 years of professional experience. Trusted by over 5 million customers, we take pride in our high-precision sensors—the core technology that's responsible for the accuracy of body weight scales  ",
        " Easy to Use: The scale is equipped with an easy-to-read display with automatic on/off, low battery, and overload indications. Choose between 2 units of measurement (lb/kg) for your weighing convenience  ",
        " Minimal Design: Never Let a scale ruin your style. Place this scale in your bathroom, bedroom, or living room. It will complement the design of your living space  ",
        " A Durable Choice: The scale’s 6-mm tempered glass platform provides exceptional durability and comfort. Equipped with a supportive frame and anti-skid paddings to prevent slipping, you can rely on the sturdiness of our scale  ",
        " Large Platform: Step onto the scale comfortably with its large 11.9 x 11.9-inch platform  "
    ]
},
{
    "title": "Love this scale!",
    "rating": "5.0 out of 5 stars",
    "content": "Our bathroom scale broke so we had to replace it.  There are so many out there to choose from!  I looked at a variety of scales and this one kept appealing to me the most.  The reviews were good and I love the look.  Black with the clear base.  It sort of blends into our floor so it does not stand out.  It is very accurate and lights up for a few seconds when it's dark so that you can read it, AND the numbers are large enough to see easily.  I can weigh myself and get a certain number, then drink 4 oz (ish) of water.... then get back on the scale and it will reflect that small amount of weight gain.  Not all scales do that.  I am very happy with the purchase and highly recommend it.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There are 2 things I really like about this scale.  The numbers are big and clear to read and your weight stays on the little number window a few seconds after you step off the scale. It is also not heavy and easy to clean. Works great!",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Really Like This One",
    "rating": "5.0 out of 5 stars",
    "content": "I really love this. I just took it right out of the box stepped on it and it worked great. I didn't need to do anything. I've had mine for years. This was a present. Everyone loves it. It's just a simple scale that tells your weight, but that is good enough for me.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We like everything about this scale. We are senior citizens and have eyesight issues, but we can see these numbers very clearly.  Easy to use, just step on and off to start scale and then step back on for weight.  Love it.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Great Simple Scale",
    "rating": "5.0 out of 5 stars",
    "content": "I just received my new scale - used it a couple of times.  Not sure how to review because it hopefully won't have issues for a long time.  What I do know  - - it is lightweight - came ready to use (battery included), and seems accurate.  It looks just like the picture.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We had an old digital scale that died and was similar to this. It is reasonably attractive and doesn't take over the room. It seems to work well although I don't know how accurate it is. Since we just use it to compare day to day variations the absolute accuracy really doesn't matter. The backlight is nice, and although the step-on, step-off start is annoying it is no big deal.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Easy to read numbeers",
    "rating": "5.0 out of 5 stars",
    "content": "If I didn't know any better, I would have thought this scale was top of the line as far as quality and being precisely accurate and in-line with my doctors office scale. It also looks and feels high end. It's durable and study and takes up very little space. I like how the top surface is flat which makes it very easy to wipe it off with a spray of glass cleaner on a paper towel to keep it shiny and clean. There's no little groves or lines for dirt and debris to get down into.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This scale is very accurate. Within a couple ounces of my Doctor's scale. This is a great tool to loose weight, because of its accuracy, down to one tenth of a pound. Positive progress can be observed, making me try to see if I can loose more, over the next week. I highly recommend this scale",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Seems alright",
    "rating": "5.0 out of 5 stars",
    "content": "I am so happy that I purchased this new scale.  My old one was ancient... The new scale is easy to see the numbers, is sleek and I think the weight is correct...",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been pretty skeptical about electronic/digital scales after a bad past experience, but this one actually makes us pretty happy.  I was leery of the rechargeable aspect, but a charge lasts for a very long time.  I believe the scale is accurate, and it's appearance is pretty neutral.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Over 13 months and still going strong!",
    "rating": "5.0 out of 5 stars",
    "content": "I was curious when purchased how long the batteries would last in this scale.  The 2 AAA batteries that came with the scale are still going strong after over a year.  This is one of those purchases that just cannot be beat for the price.  We will see how long the generic batteries that came with the scale end up lasting, but I would image that name brand batteries would last twice as long, so 2 years would be pretty good!  I will update again when the generic batteries finally die.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Worked out of the box just as advertised and customer reviews. Simple setup, nice design, accurate as far as I can determine, looks and feed sturdy. Did have 2 batteries already installed and only had to remove the plastic batter insulator strip.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Better then advertised",
    "rating": "5.0 out of 5 stars",
    "content": "I am definitely satisfied with my selection and especially the price and speed of delivery. I can only say that I highly recommend scale.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It's crazy to say it but Garmin has been sleeping on devices for YEARS, eteckcity has a 1:1 for what Garmin has at a fraction on the cost + more. I was a Garmin user for YEARS and the unavailability to move my data around to interface with other app for insights (minus their partners like strava) while ALSO not offering similar products was the final straw. Eteckcity user now and replaced my watch scale and added the food scale for less then the cost of my refurbished Garmin fenix4 watch and new scale just crazy.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Etekcity > Garmin",
    "rating": "5.0 out of 5 stars",
    "content": "The scale worked great till the battery ran out & we recharged it, then after that is when everything went wrong.  The scale & my IOS don’t sync.  I synced it the other day, (took my iphone near the scale), this was 2 days ago.  Then today I had to sync it again.  I hope this fixes the issues but IDK.  Am I going to have to sync it all the time, now?  I’ll try to charge it up again, see if that helps it, but IDK…",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "So, the good: when it works it’s great.  And it syncs (when it syncs) with your Apple Health",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "I loved this scale till it started going haywire",
    "rating": "5.0 out of 5 stars",
    "content": "The bad: when it starts losing power is when it goes weird…so IDK….wiill update.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I own this one and their previous model of 10 years and this is one is more accurate.  I checked it with a 19.8lb weight and this one returned 19.8lb whereas the old one returned 19.4lbs.  I also really like the bluetooth weight sync.  Essentially, if your phone is nearby, and u step on the scale, it will log the weight on your phone, and you can easily export.  I used to do this with paper and pen every morning.  Great product.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Fantastic product! Better than the older model!",
    "rating": "5.0 out of 5 stars",
    "content": "Sleek looking scale simple to use gos on everytime you steep on it. #s light up, easy to read. I'm a 10-1/2 foot size my feet easily fit on comfortablly. You might find you get slightly different #s if you use it a few times. I weighted myself a few times then again with my 4 cats one by one to check there weight. I got some shift in weight at times different #s . So I'd say it may be on exact weight sometimes but it actually shifted a few pounds in one case so I don't know what to say. It seems close and you can get the same results multiple times then a 3lb shift. Which at my weight is a lot. I'm about 170lbs it's fine for general use maybe check it a few times to try to get a true #s . So far the build quality seems good. If I was a athlete competing or has serious medical issues that needed precise #s I'd spend more and get a more accurate model. For me it's not worth returning for this price point and it does look attractive yes. Hopefully this helps ppl",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a very stylish scale, bought the silver because I was not sure how dirty the black or blue one would look (dust, lint).  Batteries were included, all you have to do is pull the tab out of the battery compartment and its good to go.  It can be set for LBS or Kilograms.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "So far can't complain",
    "rating": "5.0 out of 5 stars",
    "content": "Ordered to track my weight loss journey,  nice look,  right price,  and when I go for my weight in's it aligns with the weight taken at dr office.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've had this scale for a couple years now, and it's excellent! Seems accurate, easy to read. I saw reports of the glass shattering in other reviews so have been careful, but it's inadvertently banged against walks in my bathroom and it's fine. Recommended.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Excellent product",
    "rating": "4.0 out of 5 stars",
    "content": "Having compared the scale's weight measurement with Kaiser's bariatric scale and another medical office scale on the same day, I can confirm that the Etekcity scale displays a body weight that's accurate within the normal range (+/-  0.66 lbs.). My only issue is that when I tap my foot on the scale to \"wake it up\", it often takes multiple attempts with varying pressure to make it turn on. Not a major inconvenience but unexpected for such a highly-rated product.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the fact this was ready to go right out of the box! It is accurate to the ounce and easy to use. It has balanced feet to ensure you are getting an accurate reading each and every time.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Accurate for a digital scale, but...",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful scale! Seems accurate, too. I love it so far. I've hit the edge a couple of times and haven't broken it (knock on wood), so seems durable, too.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is my 2nd time ordering this scale, we moved and I lost the 1st one we purchased. Once we got to the new place I ordered this one again. Works great! Love the clear glass design",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Accurate down to the ounce!",
    "rating": "5.0 out of 5 stars",
    "content": "This scale is very nice.  Light weight and it is easy to read.  The led numbers are so easy to read when I stand on it.  Seems to be true to weight as it is about the same as my doctor’s office.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I wanted one like my weight loss doctor has but I can't spend $1K for it, haha. I needed to see the areas of bone mass, BMI calculation, water etc. I love that it syncs with the app bc that way I can see my trends over time. There's a lot more on the app but I haven't explored it because I really just need a daily check of how I'm doing as I lose weight. The ONLY thing I don't like is that when I step on it seems to really depend on where my feet are and where my weight it balanced - sometimes I can get a higher weight reading if I am leaning a certain way....but it may be my floor which is a tad uneven. Other than that as long as I can stay still for 10 seconds, it gives all the readouts onto the app on my phone. Set up was super easy.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "So far, so good",
    "rating": "5.0 out of 5 stars",
    "content": "I appreciate how easy this scale is to read.  The light comes on when I step on the glass plate and the numbers are large enough for me to see without my cheaters. It's also much more consistent than my last scale - if I moved the old one an inch I'd gain (or lose) two pounds. I also like that it's mostly transparent so that it fades into the background.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like this scale bc I can slide it out when I need to use it but tuck it back under my towel rack when not in use",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Very stylish",
    "rating": "5.0 out of 5 stars",
    "content": "We needed an extra scale for the guest bathroom and this fit the bill. Checked it's accuracy against our other, more expensive scale and it was right on the money. Right down to the fraction of a pound!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We really love this scale.  It looks very nice and is accurate, as well as easy to use. We would highly recommend this to everyone.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Love this scale",
    "rating": "5.0 out of 5 stars",
    "content": "My husband has to weigh himself daily now so he likes the large",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "well lit numbers and reliability . Also appreciates the width which",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Very user friendly for older adults",
    "rating": "5.0 out of 5 stars",
    "content": "eliminates wobbling.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This scale is so nice and it was also very easy to use for the first time. It also looks very nice too. I love it",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Customer weightless",
    "rating": "5.0 out of 5 stars",
    "content": "I needed a new scale and just came across one of these on my home page. I got the black one. It comes with the four batteries in it and I just had to pull off the tab. The scale is a great size. The best part is how big and bright the numbers are. Most important it's accurate and I can rely on the results. The price is great too for what you're getting. Highly recommend!",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Everytime I step on the scale the same exact number of pouds appear.  My old scale would change the amount of pounts even if I stepped on the scale one minute and then two minutes later.  My new scale is perfect!!! And it has a light making it so much easier to read. Even though it is glass my foot prints do not show.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Absolutely fantastic!",
    "rating": "5.0 out of 5 stars",
    "content": "Battery lasts long and it does its job. I would recommend this product to family and friends.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The digital display is easy to read even without my glasses. You don’t have to do anything complicated to turn it on — just tap. I like that it is mostly transparent so you can see the bathroom tile through it — it practically disappears, which is great for my tiny bathroom.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Precise and consistent",
    "rating": "5.0 out of 5 stars",
    "content": "I wish calibrating it was a bit easier but it gives pretty consistent results if I weigh myself multiple times to confirm the weight",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What can you say about them?  They tell the truth every time.  Who else can you trust?  I use it to watch my water intake and waste.  If you are taking diuretics and you’re never sure about if you’re holding water or not, you need a scale.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Scales",
    "rating": "5.0 out of 5 stars",
    "content": "So far this scale has been good.  It's accurate and it looks good. I will probably get another one for my other bathroom.  It comes with warnings not to step on it when wet, as the glass will be slippery.  For children or elderly folks a different style might be safer.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This looks really nice in my bathroom.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "It works great. Gives accurate weight.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am very pleased with these scales. I would buy them again and I would definitely recommend it for a friend.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Nice!",
    "rating": "5.0 out of 5 stars",
    "content": "I got the scale a few days ago.  I did not see any reviews of how the app worked, so here it is.  You need to have the app open and the appropriate profile open in the app for the weight to be automatically recorded.  Once the weight is recorded, the information flows easily into the iPhone health app.  The app does have a nice graphing function and can track other body measurements.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The scale does not seem to \"self correct\" to a previously recorded weight.  Which I consider to be good.  It is measuring the actual weight.  When I step off and step on again either a few seconds or a few minutes later, I get the same reading.  I don't move the scale around to other surfaces.  It lives on a tile surface and works well.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Consistently accurate and app functionality",
    "rating": "5.0 out of 5 stars",
    "content": "I highly recommend.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I weigh myself every day for health reasons.  Easy to use . Press with one foot, release, it sets to 0, step on with both feet. Within seconds it finds your weight to the tenth of a pound. Lights up bright with LED.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Perfect",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect scale when all you wanna know is how much you weigh. People say you should not weigh yourself every day but I have to. I do it every morning at the same time wearing the same thing (nothing). This keeps me on track on my weight loss journey.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is easy to use. It's design is sleek and simple, which is what I like, since I don't need a scale to call attention to itself.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Sleek and Easy to Use",
    "rating": "5.0 out of 5 stars",
    "content": "Scale is nice, straightforward, and easy to use; seems to be accurate as I recently had a doctors appointment and my weight was within 1-2 pounds of my weight on this scale at home. Would recommend and buy again.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There is nothing to dislike. It is reliable. Just make sure that it is on a level surface, no carpet. After you find your spot you are good to go.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Nice scale",
    "rating": "5.0 out of 5 stars",
    "content": "Very precise scale and accurate. I have had this scale for 6 months and the battery has not even died yet. Its very easy to clean the glass surface and it still looks good as new. Highly recommend and have not had any problems with it.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wanted a simple to read, accurate scale that doesn't have any fancy bells and whistles, and this one is just right!",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Sturdy",
    "rating": "5.0 out of 5 stars",
    "content": "This is so much nicer than my old bathroom scale that I wish I had bought it sooner.  I love that it works right away when you step on it , rather than having to step on, then off, then on again.  The numbers are large and easy to read with the bright light.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Sturdy glass. Seems to have an accurate scale. Very bright & readable numbers.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Awesome affordable scale",
    "rating": "5.0 out of 5 stars",
    "content": "Very accurate and easy to use.  I weigh myself almost daily",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like the thin sleekness of this product. The scale is very accurate. It’s pretty looking as well",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Simple and effective",
    "rating": "5.0 out of 5 stars",
    "content": "I installed the batteries and immediately got my weight and was able to start tracking it for the next step in my health journey.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this the second time after I accidentally broke the one before.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Great product",
    "rating": "4.0 out of 5 stars",
    "content": "I've had this bathroom scale for almost two years. Still works just like it was new. Never had a battery change yet. It is accurate and it was not overly expensive. I would recommend it.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It looks good and does what it's supposed to. I think it's more accurate than my old scale I replaced.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Reasonably priced, seems sturdy",
    "rating": "5.0 out of 5 stars",
    "content": "I am more than pleased with this scale!  It is extremely easy to read, it is a simple but efficient design, easy to clean, & well worth the price!!  I highly recommend it!!",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nothing fancy, just tells the weight which is what I wanted. It shows the numbers quickly and it looks nice on the floor being transparent.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Good",
    "rating": "5.0 out of 5 stars",
    "content": "Works great and looks clean and classy in my bathroom 😊",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It should not take a brain surgeon certificate to be able to use a modern bathroom scale that is accurate and easily read. The price was a steal in the Labor Day sales. Great bathroom scale!",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Great Product",
    "rating": "5.0 out of 5 stars",
    "content": "Very nice",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Delivered quickly",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Lighter weight and precise",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this product at the start of my weight loss journey to ensure accurate weight. So far it’s been very precise and useful.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "When Qardio stopped support and I couldn't coax my Qardio Base to link to my new iPhone, I found Etekcity. My only regret is losing 7 years of data.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Great replacement for Qardio",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to use and seems very accurate.  Easy display to read.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "been using this for over a year now.  it works reliably, easy to use and looks good too.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Etekcity Bathroom Scale",
    "rating": "5.0 out of 5 stars",
    "content": "The product is very nice and easy to read .",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's a straight forward and easy to use/read digital scale.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "excellent.  works well, easy to use, easy to look at",
    "rating": "5.0 out of 5 stars",
    "content": "In the middle of my bulking era, out here slaying everyday as that number goes up.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This scale records weight as well as BMI onto the app and automatically syncs with my LoseIt app. The weight is automatically there all I need to record is my BMI which is easily displayed with my weight.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Great scales",
    "rating": "5.0 out of 5 stars",
    "content": "After repeated measurements over days and several within minutes I find the scale to be accurate and consistent.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B01HI1W1V4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I likethe ease of use. And it’s pretty accurate.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B01HI1W1V4"
},
]