[
{
    "name": "  Before We Were Yours: A Novel ",
    "stars": [
        "71%",
        "22%",
        "5%",
        "1%",
        "1%"
    ],
    "pid": "B01M14UN1J",
    "ratings": "148,979 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$19.69",
    "about_this_item": []
},
{
    "title": "Riviting",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent book",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed reading this book, characters really came alive, great story development and such a great ending. Would recommed",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Great Story",
    "rating": "5.0 out of 5 stars",
    "content": "At times, this book is so very sad and mysterious. I really enjoyed the read.  The ending made me happy.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m a Tennessee native and was saddened that there was truth in this fictional novel. How a woman could be so heartless to innocent children and for the poor parents who lost their children. Greed prevailed and yet some kids were saved from financial poverty and also were genuinely loved.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "I Recommend",
    "rating": "5.0 out of 5 stars",
    "content": "Nice paperback book for the money. Good read.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "great book, great read",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Very touching and informative about how children were purchased / adopted",
    "rating": "5.0 out of 5 stars",
    "content": "I love books centered around the past history of our country. This book is about orphans and things that happen when no one is watching. Before the internet, people with bad intentions got away with so much. This story is about love and loyalty and if the truth should come out to set things right.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Such a beautifully tragic story. I absolutely loved it. Such a good read. I knew nothing about this story. Just unimaginable what those babies went through.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Paperback book",
    "rating": "5.0 out of 5 stars",
    "content": "Heartbreaking story full of suspense. The telling of this tale in two different time periods is an impressive feat of writing skill. The characters are described and act as expected. Highly recommend.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Literally one of the best books I’ve read.  Not once did I want to stop reading.  Can’t wait to read more of her books",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Wow!!",
    "rating": "5.0 out of 5 stars",
    "content": "This story was so good!  I actually read it years ago and a friend was currently reading it and telling me how good it was.  I thought it sounded familiar so I read it again.  Loved it all over again!!",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is one of the best books I’ve read in a very long time, I didn’t want it to end! Spectacular, a must read!",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Wow!",
    "rating": "5.0 out of 5 stars",
    "content": "Reading a fictional book about true history where poor children and babies were stolen and sold to wealthy people was very painful.  Learning that this happened many times and was done in secret, yet wealthy and influential people received what they wanted with a son or daughter coming into their home.  These new parents had no idea of the physical and emotional history of these children.  It’s hard to imagine that any child leaving the Tennessee Orphanage could ever be emotionally stable enough to survive this treatment.",
    "post_time": "Reviewed in the United States on June 7, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Lisa Wingate writes about these fictional children in such a way that the reader wants to embrace and care for these children, showing them love and security.  This horrible adoption world happened!",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Heartbreaking News of Adoptions",
    "rating": "5.0 out of 5 stars",
    "content": "I give the rating of five stars because it taught me the true story of a horrific time in the State of Tennessee.  However, it is a painful, tear jerking book to read.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It jumped around and was hard to follow some times. But was a good read just took awhile",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "True story",
    "rating": "5.0 out of 5 stars",
    "content": "What a page turner!!  From one chapter to the next I loved the way this story unfolded.  It wasn’t a true story but one that could have happened.  Somehow we learn to survive.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Couldn't put this book down. Tore at my heart strings!",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Is it good to keep secrets?",
    "rating": "5.0 out of 5 stars",
    "content": "This is the 2nd book I've read by Lisa Wingate. (The first one was The Book of Lost Friends-excellent book.) It grabbed my attention and never let go.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a great story, sad to say that this was actually happening in this country during that time period.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Kept my interest",
    "rating": "5.0 out of 5 stars",
    "content": "Good book....kept my interest.  Found out what deplorable conditions some orphanages were.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There was nothing I didn't like about this book! It is one of the best I've ever read. I could not put it down, reading into the wee hours 2 nights to finish in less than 3 days. Love the way Wingate takes us seamlessly back and forth in time, with the characters coming alive more and more on each page. Sadly 5 stars are just not enough!",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Engrossing from start to finish",
    "rating": "5.0 out of 5 stars",
    "content": "I read this in just a few days. I usually only read about 30-45 minutes a day. But I couldn’t put this down. Such a tragic story. Based on real events. The world is so unjust.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Thought provoking.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Wonderful book",
    "rating": "5.0 out of 5 stars",
    "content": "Fascinating look at the lives of the children caught up in the scandalous Tennessee Children’s Home Society from the 1930s - 1950 and the effects on families from all stations in life.  Well researched and well written, the author brought the characters to life.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Before We Were Yours is a novel by Lisa Wingate.  The novel is based on the story of the Tennessee Children’s Home Society and Miss Georgia Tann who ran an orphan scam from the 1920’s to 1950.  In this period of time, thousands of children were stolen or legally taken from their biological homes and adopted by celebrities and wealthy people all around the country.  Some of the adoptive parents were hit up later for even more money for extended legal suits.  Most of the biological parents never say or heard of their children again.  Of the children themselves, many dies of unknown causes or of disease or mistreatment. Thousands were adopted and forgot about their true families.  Still others remembered their past and mourned the loss of their parents and siblings.  Using this story as a backdrop, Lisa Wingate composed a story of one family whose children were taken illegally.  What happens to these helpless children is the basis of this story.  It is well-written and creates a haunting view of live at that time in the homes.",
    "post_time": "Reviewed in the United States on March 23, 2018",
    "pid": "B01M14UN1J"
},
{
    "title": "Content",
    "rating": "5.0 out of 5 stars",
    "content": "The five children of Briny and Queenie Foss were brought up on a riverboat.  They loved the life and could not envision anything else.  Then Queenie began having problems as she tried giving birth to a set of twins.  Briny took her to the hospital in Memphis leaving Rill in charge of her siblings, Camellia, Lark, Fern, and Gabby. The next morning, when they expected to see Briny, a group of men came and took the five children off the boat to be taken into the care of Miss Tann and the Tennessee Children’s Society.  They were looked upon as a great treat as they, except for Camellia, they all had blond hair and blue eyes.  This was the preferred option for adoptive parents.  Lisa takes us through the sordid life in the Home and the despair Rilla feels when she can neither protect nor keep her siblings together.  Rilla would spend her life trying to find her siblings and make sure they were all right.  She lived for the say she would return to the houseboat and Briny and Queenie would meet her with open arms and minds.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Lisa takes us to the depth of despair in the basement of the home where the siblings are housed until there is room for them upstairs.  We feel Camellia’s pain and displeasure for being her and her need to fight against it.  How will her rebellion turn out?  We feel Rilla’s guilt as not keeping her family together and not being able to protect them from harm.  Will Rilla be able to reunite her family?",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "INJUSTICE",
    "rating": "4.0 out of 5 stars",
    "content": "The book is very well-written and the topic is outstanding.  Although this is about a fictional family, Lisa brings the situation that really existed to the forefront of our mind and does not let us neglect it.  This ranks right up there with the top five books I have read this year which I think are the best I have read.",
    "post_time": "Reviewed in the United States on April 19, 2023",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There is nothing so fine as reading a finely crafted story by a talented writer.  I am grateful for this write.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B01M14UN1J"
},
]