[
{
    "name": "        BEAUTURAL Steamer for Clothes, Portable Handheld Garment Fabric Wrinkles Remover, 30-Second Fast Heat-up, Auto-Off, Large Detachable Water Tank       ",
    "stars": [
        "67%",
        "16%",
        "6%",
        "3%",
        "8%"
    ],
    "pid": "B01N1QE5ME",
    "ratings": "67,434 ratings",
    "other_info": {
        "Brand": "BEAUTURAL",
        "Color": "Aqua",
        "Product Dimensions": "6\"L x 4.3\"W x 10.7\"H",
        "Item Weight": "2 Pounds",
        "Style": "Steamer"
    },
    "discount_price": "$ 39.",
    "normal_price": "",
    "about_this_item": [
        " Detachable 8.79-ounce water tank for 15 minutes of continuous steaming to remove wrinkles perfectly  ",
        " No leaking, no spilling with leak-proof design enables to steam whether vertically or horizontally  ",
        " 1200 watts with 30-second fast heat-up and powerful steam output dewrinkles your clothes in no time  ",
        " Safe to use on all fabrics and suitable for clothes, curtains, furniture, toys and so much more  ",
        " The lint brush and soft brush attachments are included to provide a variety of steaming options  "
    ]
},
{
    "title": "Easy to use. Does a lot of fabric on one fill up",
    "rating": "5.0 out of 5 stars",
    "content": "This steamer is good quality very portable and is not heavy even with a full water tank. Gets out stubborn wrinkles. Did a long dress on one tank. I've bought more expensive steamers and I'll have to say this one works way better so for the price it is a great value. You fill the tank from the bottom but the fill line is when tank it upright. So that's the only thing I would improve. I drew my own fill line for when I'm filling it, lol. Highly recommend",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm so happy I tried this. I hate ironing and haven't ironed in years. This is so much easier, just hang your clothes on a hanger and steam. Wrinkles come out FAST. Also it is perfect to get the wrinkles out of new curtains, etc. The price is great too.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "love this product!",
    "rating": "5.0 out of 5 stars",
    "content": "This product is bit larger than the regular which I really like, it’s just right in size fr me. You can lay whatever you’re iron flat on bed and steam iron without any spillage 👍🏾. Steaming quality very great as it takes almost if not all wrinkles out. Very easy to use as well. Be careful when using as steam is very 🔥.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great to have when you need a quick press.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Very handy",
    "rating": "5.0 out of 5 stars",
    "content": "I love that it works on thick fabrics!",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Pictures are before and after. Being that I am always looking for the smarter way to get something done, this streamer for the situation. No ironing board, just steam it and be done. Highly recommend. I know, not perfect. But it's very quick.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Works on jeans!",
    "rating": "5.0 out of 5 stars",
    "content": "Wrinkles don't stand a chance against this magic wand! Takes about 20 seconds to heat up and less than that to get half a shirt done. It works exactly as described. I would buy this again in a hummingbird heartbeat! In fact, I'm buying one for my mom. She needs this. Oh and I have little lady hands and can hold it comfortably. 💖",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This design is so much better than others - you can use at any angle and it does not leak.  Heats up quicky.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Really good for easy wrinkle removal",
    "rating": "5.0 out of 5 stars",
    "content": "It's incredibly user-friendly and efficiently steams my clothes in no time.!",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Does the job, random little water drips on clothes can be annoying but not a big deal, dries fast.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "This is my second time purchasing this product. I loaned my first steamer to a friend and they loved it so much that they kept it.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This product is compact for travel but does it job as well as the upright steamer.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Great little steamer",
    "rating": "4.0 out of 5 stars",
    "content": "We used this to steam my daughter’s bridal party dresses/gowns and everyone was pleased! Easy to use and did a great job!",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "*Updated review*",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Replacement sent. Updated review",
    "rating": "4.0 out of 5 stars",
    "content": "The company sent me a replacement unit and I have been using the new one for about a week now without any problems. My favorite part is how quickly it heats up.  I also appreciate that the steamer has a separate water tank that can be removed and refilled as needed. This doesn’t happen often because I can steam multiple items with just one tank.  Does a good job and I am happy with my purchase.  I changed my rating to 4 stars. It was a rough start with the first steamer only working once but the company readily corrected the issue and I am happy with the results.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Old review:",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "It's does the job as described",
    "rating": "5.0 out of 5 stars",
    "content": "I read the other review saying this product was disposable due to it only working a few times. I was hoping for the best since I really wanted an inexpensive steamer with a detachable water container. No luck!  I used it once and it never worked again!  I have requested a replacement steamer and will see how it works. Maybe I will get lucky and get a functional unit the second time around.",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I will update when the replacement unit comes to see if it works properly.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Trabaja bien",
    "rating": "4.0 out of 5 stars",
    "content": "I was pleased to find the steamer works as described & is easy to use! I tried it on a cotton dress shirt & a nylon/rayon blend men's Hawaiian style shirt.  It took the wrinkles out of both equally.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The only negative for me, as a senior citizen,  is that it was a little heavier than I expected.  But I took a break after each shirt & rested my arm.  If I were younger, I'm sure this would not be an issue.  But thought I'd mention it for seniors or those with mobility issues.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Love this",
    "rating": "5.0 out of 5 stars",
    "content": "Made ironing a thing of the past.",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Got it for myself but my mom found it more useful😅😅",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "lol my mom loves it",
    "rating": "5.0 out of 5 stars",
    "content": "A friend recommended this to me over a traditional iron and I am so glad she did! I was honestly amazed at how quickly and effortlessly wrinkles came out of my clothes. And it takes up less space than an iron and an ironing board! Very happy with this purchase!",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Es fácil de usar y se calienta rápido y bien pero hay que estar rellenándola con frecuencia porque el agua se va rápido",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Works great!",
    "rating": "4.0 out of 5 stars",
    "content": "If you want a crisp unwrinkled shirt everytime unfortunately this won't be for you. Get an actual iron or maybe higher quality steamer. For the price, it's got great bang for buck and you can definitely tell the difference when steaming shirts or pants with this. I've also completely forgot about the attachments that come with it and have never used so maybe those make this product better. This a great and easy to use product that you fill up with water, plug in, and steam clothes from a hanger",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Compact and easy to use, heats up really quickly.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Hay que llenarla con frecuencia",
    "rating": "5.0 out of 5 stars",
    "content": "I have some pants that tend to get wrinkled after washing them. Seeing this caused wrinkles on my forehead from the stress of trying to get these wrinkles off my pants. Sometimes I would dream about having something that would remove said wrinkles. I had an old iron that my grandma bought when she was younger, but it was completely outdated. Then the dream for steam came and hit me after searching on amazon for a solution to the wrinkles of my pants. I found this steamer and after reading a couple of reviews, I ordered it. I am proud to say that my pants are now wrinkle free and they’re looking extra crispy.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This steamer works great. It doesn't leak when flat iron steaming.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "good results from the price",
    "rating": "3.0 out of 5 stars",
    "content": "First comment is that this is a bit large and heavy for holding upright for very long (at least for anyone with any sort of grip or arthritis issue).  Additionally, as I gripped it and moved it from hand to hand, I kept accidentally hitting the steamer lock button, so had to continually relock it.",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Once I got this, I immediately pulled out a blouse that has been sitting in my closet for a year or so, in desperate need of ironing.  It is a 2-layer top, with the layers bound at top and bottom, so you cannot just iron one layer. The inner layer is tank-top like, made of a semi-thick stretchy material, and this same material is what is used for the waist band of the top. The outer layer is a very thin see-through layer that also stretches a bit. Even after being ironed, washed, ironed again and washed again, it still has some of the original shipment creases. So I decided to try this steamer on it. First thing I noticed is that trying to pull any stretchy material taunt enough for the steamer to really work well is almost impossible, making the steaming more difficult. There were a few areas of the sleeves that I was able to iron against the door that the top was hanging on, and those areas did come out mostly wrinkle-free. The thicker stretchy waist band was even more difficult to get the wrinkles out of. After using the steamer for approx. 15 minutes, and thus it was about empty, the top still has some creases here and there. Ultimately, I'm going to have to iron the top again. What this tells me though, is that it is likely only going to work well on stiffer material, whereas most of my wrinkle problems are similar to the top already described - some sort of thin flowy stretchy material. While it is possible that using this in a flat method might make it work a bit better on these stretchy materials, I already have a regular iron with steam ability, so I don't need that function. What I need is something that I can use quickly to steam out wrinkles. Debating on whether or not to return this one and try something else.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Otra opcion",
    "rating": "5.0 out of 5 stars",
    "content": "Funciona bien",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It does what my wife wanted it to. No complaints from her.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Works good",
    "rating": "5.0 out of 5 stars",
    "content": "This steamer is way better than the one I got previously. I can tilt this one down and the water will not pour out of the steamer like my other one. I got this one to block some of my crochet pieces and of course just to steam my regular clothes. Excellent! Would highly recommend for both reasons .",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We have purchased two of these! My husband can't live without this for his dress shirts. Super easy to use, doesn't burn clothes, and warms up quickly. Also compact enough to pack for long trips.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Way better",
    "rating": "4.0 out of 5 stars",
    "content": "Bought so new drapes that were heavily creased. I ordered a small hilife steamer and that was a total bust, so I ordered this one and it’s wonderful. Heats up quickly but the device isn’t hot to the touch. Easy to use, love the locking system. It’s a little heavy because of the size but it’s still comfortable to handle and works well. I don’t think it’s small enough to take in a small suitcase, it would eat up a lot of space, but you do you. I attached some before and afters.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I purchased the steamer to remove wrinkle from a large formal dress and a thinner, more delicate dress. I expected it to take time on the ball gown, which was primarily tulle. I hung it up and steamed layer by layer, letting it dry some between the layers before moving to the next. The more delicate dress was also hung in preparation for steaming. It took longer than expected to remove wrinkles, and not all came out. I followed the manufactures instructions and let the steamer heat up well. It seemed too much work, for me personally, probably due to my age. It was not convenient nor easy to hold the steamer in one hand going vertically. I can go horizontally on the table with my steam iron, more easily. I truly believe I would have gotten better results. It seems to be made for small items; and will perhaps work well. Both my standard steam iron and the handheld steamer have nearly the same size box, so both should travel well. I did return the handheld steamer, as I personally had a difficult time managing with it. I took off a star due to the product not being a multi-generational product.",
    "post_time": "Reviewed in the United States on February 8, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Won't live without it!",
    "rating": "5.0 out of 5 stars",
    "content": "The cording is sufficient, the reservoir holds a good amount of water. It was great that the steamer came with a pouring cup, so water could be added neatly.  The power display light is bright, so you know when the steamer is on and when the water has heated sufficiently.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have loved using this to get the wrinkles out of my clothes.  I keep this in my bathroom.  I can easily hang my garment and then steam it quickly without the hassle of getting out my iron and ironing board.  This has saved my so much time!",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Love it!",
    "rating": "5.0 out of 5 stars",
    "content": "This steamers works really well.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It works great and fast.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "It works good",
    "rating": "4.0 out of 5 stars",
    "content": "I love the steamer but doesn't work if majorly wrinkled just slightly wrinkled. Works better in my opinion on shirts, tshirts things like that",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve bought this steamer 2x. I love it, heats up quickly, very effective. The first time I bought it, it lasted 2 years and when it died I was like “ok, nothing lasts forever, it’s only $30, I’ll replace it with the exact same model because it works so well.” But this time it has only lasted 1 year. Now when I try to use it, it leaks water spots all over the garment, half the time it doesn’t actually work. Before the 1 year mark, it worked so well, but I don’t like the idea of having to replace it so often. This time I will probably opt for a higher end model in the hopes it lasts longer.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Great but not long lasting",
    "rating": "5.0 out of 5 stars",
    "content": "The size is perfect to hold in hands and works great for cotton clothes because it has a good steam.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Heats us fast.  Great water tank.  Multidirectional.  Use it for my longarm while quilting.  Great item!",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Works great for fancy clothes",
    "rating": "4.0 out of 5 stars",
    "content": "UPDATE #2: The company reached out to me after seeing that my item was defective, and offered to replace it, even though I'd already returned the original through Amazon. I received the replacement a few days ago, but have not had a chance to test it out yet. I am upgrading my review based on the positive customer support, and will update again after I have had a chance to test the replacement.",
    "post_time": "Reviewed in the United States on September 16, 2018",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "UPDATE: After my original glowing review, I am sadly disappointed. After my first use, it was about two weeks before I used this again (had gone on vacation).  I plugged it in and... nothing. Absolutely nothing. It would not heat up or power on in any way whatsoever. I was shocked, so I tried in another outlet,  and still nothing. Will be returning!",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Great steamer for quilters!",
    "rating": "5.0 out of 5 stars",
    "content": "Original Review:",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This is one of those products that, after using for the first time, I couldn't believe I had waited so long to get. I absolutely detest ironing. It's such a pain to drag out a clunky ironing board, and I'm not very good at it, so all that effort and my clothes still don't look great. So I avoid it, trying my best to grab clothes straight out of the dryer and hang them before they wrinkle. This little handheld steamer is perfect for when I leave laundry in the basket for too long, or just need to touch up a garment. I've just started using it, so I can't speak to durability, but it certainly feels well-made. Here are my pros and (minimal) cons:",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Quit working; company sent replacement",
    "rating": "4.0 out of 5 stars",
    "content": "Pros:",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "*Super easy to operate--pop out the water tank, fill it up, pop it back in, plug it in, then click the power button. Once it heats up, you can press and release the trigger for a burst of steam, hold the trigger down, or lock the trigger for continuous steam (easiest option!)",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Fast to heat!",
    "rating": "5.0 out of 5 stars",
    "content": "This is a very fast to heat and steam product. I feel like it doesn't drip compared to other models. Good build and easy to use.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I used the steamer 4-5 times in a month and then one day, saw some smoke coming outside. Stopped using it since then! 4 start just coz I may have gotten a faulty product.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "It’s a good one!",
    "rating": "4.0 out of 5 stars",
    "content": "First off, I have really loved this steamer. I have used it at least once a day since buying it. That being said it just stopped working. Its been a year, so maybe that is a good life for a steamer like this. Just know it will probably last about a year going into it. Also, I have ONLY used distilled water in this steamer, so that isn't a problem.",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Favorite steamer, takes seconds to turn on and works great on my work shirts and pants, completely stopped ironing due to this",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Its been great for about a year.",
    "rating": "5.0 out of 5 stars",
    "content": "My first time using it but I’m absolutely loving it and the water doesn’t spill out",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought a new shower curtain. It had lots of fold lines on it. I used this steamer on it and it worked perfectly. No more fold lines. It is light weight and non leaking. I will try it on clothing soon",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Everyone needs this",
    "rating": "5.0 out of 5 stars",
    "content": "This is my second purchase , I thought the new one had a defect manufactured and I try too put the water inside the small hole...then I saw in the new model the water's hole is under ( photo)  all is in the manuel ( I didn't read 🤣) I hope it this help you...read  bad review about the same case ( small hole).",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Remember the water's hole is under.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Portable",
    "rating": "4.0 out of 5 stars",
    "content": "This handheld steamer is lightweight, easy to use and performs beautifully!  I liked it so much I bought 2 more - one for my daughter-in- law (and son) and for my granddaughter starting college!",
    "post_time": "Reviewed in the United States on September 10, 2022",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this to replace a Shark brand steamer that is no longer in production so I couldn't get another.  The Shark lasted about 8 years and I really liked it so I wanted something that could live up to it's performance.  I was a little leery of this model because it is significantly smaller than my old Shark and I wasn't sure that the build quality and performance could be matched in such a small package.  A perk of being smaller is that it's boiling chamber is a lot smaller so it heats up a lot faster.  From plugging it in and turning it on, it's ready for steam in less than 60 seconds.  There are a few things I don't like as much and a some that I prefer in this model.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "leaks",
    "rating": "3.0 out of 5 stars",
    "content": "After owning this for 2 years (I use it about once a month on one or two items) so not heavy use, it started to leak.  The steamer part works fine (for the record none of the attachments ever did anything for me, they are a waste of money).  I noticed the water container now leaks.  Since the steamer part still works, I kept it.  I now store with NO water and have to steam quickly so it doesn't leak while I'm steaming.  Hope this helps you.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wow this is my first time using a steamer and may I say this works wonders! I so happy I purchase this! If you're having doubts whether you should buy it or not these pictures should convince you to get one!!",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Holy grail!",
    "rating": "5.0 out of 5 stars",
    "content": "This portable steamer is so convenient. I use it for curtains and clothes. It’s comfortable in your hand, and provides a powerful steam for removing deep wrinkles. Like any other appliance, you must be aware that you will get burned if you’re not careful. It’s small enough for travel and performs well on most any material.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love This Little Machine. No more ironing board for me. Easy to Use. Wrinkles Are Gone. Highly recommended.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Awesome",
    "rating": "4.0 out of 5 stars",
    "content": "First time used there was water coming out from the steam spouts. Which I didn’t find out until a shirt was wet after one stroke.",
    "post_time": "Reviewed in the United States on October 11, 2023",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Next time worked better now that I made sure there was no water on the steam head.",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Works Perfectly Easy To Use",
    "rating": "5.0 out of 5 stars",
    "content": "Third time was not the charm. Stopped working. Ran through the troubleshoots still nothing. Even gave it another week to “rest” nada. Don’t know what happen. As I write this review I’m still trying to give it a go but nothing.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The water does not seem to be going down either.",
    "post_time": "Reviewed in the United States on November 15, 2023",
    "pid": "B01N1QE5ME"
},
{
    "title": "Stopped working (fixed)",
    "rating": "5.0 out of 5 stars",
    "content": "EDIT: I really didn’t want to give up on this product so I decided to try to make up my own troubleshooting. And I managed to get it",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So here’s what I did. I turned on the steamer and removed the water tank. I then pressed down the trigger and locked it in place. While tilting it back and forth until water started to spit from the little spout. I kept at it until steamer started to come out from the grill. I kept going until there was hardly any water coming out of the spout and what sounded like a propeller inside got a bit louder. Connected the water tank back and finally STEAM!",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "SOLVED: Stopped making steam after 8 months",
    "rating": "4.0 out of 5 stars",
    "content": "UPDATE: The steamer works again! I used a canned air (duster) to unclog the hose inside the steamer. There are a bunch of videos on YouTube how to do this, took me 30 seconds",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The steamer broke after 8 months of use (motor is running, but no steam coming). I used it in total maybe 20 times.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Practice",
    "rating": "5.0 out of 5 stars",
    "content": "It is very easy and comfortable; also powerful. I love it. I recommend it 100%",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this steamer because my other cheaper one broke and I am SO glad that I did! This handheld steamer is lightweight, ACTUALLY removes wrinkles with minimal effort, produces lots of steam, is easy to use, and it's a great price for how well it works. I find new reasons to use this thing all the time, and I haven't used my ironing board in ages because I prefer to use this. The water reservoir is pretty big, so you don't have to refill it often if you have a big project.",
    "post_time": "Reviewed in the United States on September 27, 2023",
    "pid": "B01N1QE5ME"
},
{
    "title": "EXCELLENT steamer!! Highly recommend everyone owning one of these!",
    "rating": "5.0 out of 5 stars",
    "content": "Full disclaimer, I had to get a replacement because the first one that I got didn't produce any steam whatsoever. I almost left a cranky review, but after reading other reviews it sounded like I just got a dud. The replacement that I got was absolutely perfect! SO if you do buy this and aren't satisfied with the result, exchange it for a new one because I can't see how anyone could leave a negative review with how great this thing works. I was worried that, since I got a broken one, the replacement steamer would break easily. However, I have been using my replacement for almost a year now without any issues and it still works flawlessly! I highly recommend this steamer.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Hope this helps!",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Great for delicate fabrics!",
    "rating": "4.0 out of 5 stars",
    "content": "I have their older model of this one, and got this one for my mom but I ended up using it first, hahaha.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is better than the one I have because the water is easier to add and remove! Larger opening.",
    "post_time": "Reviewed in the United States on October 25, 2023",
    "pid": "B01N1QE5ME"
},
{
    "title": "Excelente",
    "rating": "4.0 out of 5 stars",
    "content": "But both of these are identical in every other way. Works great on SUITS AND TIES!",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great for pressing suit pant sand other pants that require a crease, especially between cleanings.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Practico",
    "rating": "4.0 out of 5 stars",
    "content": "es practico pero si se puede regar el agua",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It is making a loud weird sound and it is not working at all. I literally unboxed it today to use and it was useless 🙄",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Not steaming",
    "rating": "4.0 out of 5 stars",
    "content": "After I posted the above review the seller reached out to me offer some solutions which I had already tried and once I told them that the product was in fact defective it was a deemed faulty and they shipped a new one which have already arrived. It works great and I am grateful for the attentive and professional customer support. Thank you!",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It worked the first time I used it. It actually worked very well and I was happy with the purchase. However, when I used it again (for only the 2nd time) it didn’t work— only made humming noises. So, it was a waste of money for me and I can’t recommend it. Maybe I got a defective one. A refund would be nice.",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "It worked, and then it stopped after the 2nd use",
    "rating": "4.0 out of 5 stars",
    "content": "UPDATE:  The seller contacted me to resolve the problem. They offered troubleshooting solutions. The issue was resolved; therefore, I'm changing my rating to 4 stars. They have excellent customer service. I recommend this product.",
    "post_time": "Reviewed in the United States on November 21, 2019",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have never used a steamer before but thought I would try this one after reading such good reviews and also being recommended by several influencers on youtube.  I got tired of the ironing board and iron!  I really like the steamer.  It works as advertised.  Caution:  the steam gets hot!!!  The only reason I gave it a 4 star rating is because of the large size overall and the small size of the water container.  I have to refill the container several times if I am steaming a few things at once.  I disagree with those who said it would be good for travel.  In my opinion, it will take up a good bit of suitcase space and if you pack heavy and are going to fly it could tip you over the maximum weight before having to pay extra.  Overall, I do recommend it.",
    "post_time": "Reviewed in the United States on October 25, 2023",
    "pid": "B01N1QE5ME"
},
{
    "title": "Great Product But Not For Travel",
    "rating": "4.0 out of 5 stars",
    "content": "A couple months ago, I bought some curtains that were quite wrinkly from being in their packages for who-knows-how-long. i went at them with my steam iron to little avail. The curtains have two layers, a thicker darkout layer and a top mesh layer. While the iron improved the blackout layer, it took forever and wasn't quite up to snuff. I was afraid to use the iron on the mesh in case it might melt it. I eventually bought this steamer, which had a coupon available at the time.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This steamer cam quickly; although, it just ships in the labeled box without any additional packaging. This wasn't an issue for me, fortunately. I plugged it in to try almost immediately.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Easier Than Ironing",
    "rating": "5.0 out of 5 stars",
    "content": "This was my first steamer, and it was quite easy to use. Remove the container, filled it, replace and plug it in. It takes less than a minute to heat up, and you'll know when the power light is steady.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I started in on the mesh layer of my curtains, and while it took a while because curtains are a lot of fabric, I noticed definite improvement. So far, I've only done the one layer of the top curtain, and there's a world of difference between that and the mesh layer of the other curtain. You'll want to stretch the fabric to get wrinkles out, which was easy enough with the mesh. I think I'll need a couple extr a hands for the thicker layer, however.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B01N1QE5ME"
},
]