[
{
    "name": "        Hoki Found -Waterproof Pet Feeding Mats with High Lips - Multiple Size and Colors for Dogs, Cats & Others-G       ",
    "stars": [
        "76%",
        "14%",
        "6%",
        "2%",
        "2%"
    ],
    "pid": "B01N8TH7JY",
    "ratings": "26,752 ratings",
    "other_info": {
        "Material": "Silicone",
        "Color": "Gray",
        "Target Audience": "Small Animals, Bird, Cat, Dog, Insect",
        "Brand": "Hoki Found",
        "Product Care Instructions": "Machine Washable"
    },
    "discount_price": "$ .",
    "normal_price": "$12.99",
    "about_this_item": [
        " Made from High-quality & Non-Toxic Silicone. 100% PVC & BPA-free.  ",
        " Clean up easily by rinsing or under the sink, or simply wipe down the mat with a wet cloth. Dries up quickly and is dishwasher safe.  ",
        " SIZE: 19“ x 12”. Extra High Raised Edge. A thicker brand than similar ones.  ",
        " Extra High raised outer lip prevents food, water and treats from spilling onto your clean floors! Please refer to measurements for size.No more messy spills on floor again.  ",
        " Anti-slip, Non skid, Waterproof, Durable, Flexible,Soft and easily taken anywhere for travel.  "
    ]
},
{
    "title": "Very nice, but could be sturdier",
    "rating": "4.0 out of 5 stars",
    "content": "This mat is great for keeping food and water bowls from sliding around and spilling on the floor. It's easy to clean and stays in place on wood and laminate surfaces.",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My only piece of criticism is that the raised edges are very soft and do not prevent things like brooms and vacuums from deforming the mat. If you have a robot vacuum, it'll get caught on this mat and try to suck up the corners. If spills occur, be very careful picking up the mat or it will fold up on you.  Otherwise, its easy to use and provides extra grip for food and water bowls that wouldwise slide around.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Nice tray but packaging needs improvement",
    "rating": "5.0 out of 5 stars",
    "content": "It's a nice tray to protect the floor with plenty of room for food and water dishes.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The mat comes rolled and zip tied. Cutting the zip tie risks damaging the mat. A twist tie would be better.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Protects the floor",
    "rating": "4.0 out of 5 stars",
    "content": "Protects the floor from water damage from my sloppy pets.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use this for my dogs water bowl. They have water all over the floor and it’s making my tile have hard water issues , so I figured I should try something. This is perfect! It would be good for food bowls also.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Great mat",
    "rating": "5.0 out of 5 stars",
    "content": "Came expediently; good quality. Good product.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect for the old Harley...",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "As Advertised",
    "rating": "4.0 out of 5 stars",
    "content": "Does precisely what I need. Keeps the water on the mat, everything from moving around. Very durable, great looking.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Easy to clean",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Easy to clean",
    "rating": "5.0 out of 5 stars",
    "content": "The gray color fades into the background without drawing much attention, and it's very easy to clean.  The little paw shape at the corner is a cute little touch.  No more pet food pieces staining my stone patio floor.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We bought a larger TV for the kitchen and the previous tray was too small. This one fit perfectly and because of its material, will be easier to keep clean.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Served Our Purpose",
    "rating": "5.0 out of 5 stars",
    "content": "I am using this silicone tray as a nail care tray/desk protector. I cannot comment on how I think it functions as a pet food/water bowl tray. That said, I LOVE it for how I am using it! I wanted something to protect the surface of my desk when I wanted to do my nails. After looking at hard, cafeteria-style trays, I realized silicone would be much easier for storage/cleaning/etc. I found some mats without edges/ridges, but I really wanted a tray with a lip or edge to catch any spills. This silicone tray rolls up and lays flat very easily. It is closer to a silicone baking sheet in stiffness than what one might expect from silicone in this shape/size.",
    "post_time": "Reviewed in the United States on November 13, 2023",
    "pid": "B01N8TH7JY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "For my needs, this thin quality is perfect as I can roll the mat up and use a fabric hair tie to hold it closed (like an old-timey map or scroll!) I have no need to pick up the tray when it is full of objects/tools, and it would not be possible given its floppy (not flimsy) nature. However, once cleared of the larger objects, picking up the tray with dirty brushes and tools that need to be cleaned and any spilled polishes/powders/etc is very easy, like taking a placemat to the sink to dispose of the crumbs - easy peasy. After cleaning the tray I lay a little clean towel over it to air dry the cleaned implements and tools on. Then, it gets rolled up and stored away with all my other nail supplies - fits right into my polish tote bag.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Perfect for my usage!",
    "rating": "5.0 out of 5 stars",
    "content": "So far it has protected my desk/kitchen table/deck and patio and other surfaces from the throes and inaccuracies of my nail art passion. Sharp tools and nail scissors have fallen onto it without damage, it has taken various nail polishes, stains, powders, adhesives, and countless acetone spills. I'm sure it won't last forever and will take damage, and ultimately fail and be disposed of, one day. But, that is why I purchased it - sometimes you just need a paper plate instead of a ceramic one. (That was a metaphor, don't complain about sustainability and eco-responsibility - let the analogy land.)",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have 4 of these. they are great for keeping the water on the mat. plus, also the dry food .",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "works great",
    "rating": "5.0 out of 5 stars",
    "content": "We love this mat for our cat. Doesn’t slide, easy to clean, plenty of room for feeding dishes.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The brown color matches my wood floor pretty closely and my boy’s bowls don’t slide around while he’s eating anymore. Also keeps spills off the floors.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Very practical, convenient cat feeding mat",
    "rating": "5.0 out of 5 stars",
    "content": "Works well and looks nice.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B01N8TH7JY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great addition to feeding my dog.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B01N8TH7JY"
},
]