[
{
    "name": "        BEAUTURAL Steamer for Clothes, Portable Handheld Garment Fabric Wrinkles Remover, 30-Second Fast Heat-up, Auto-Off, Large Detachable Water Tank       ",
    "stars": [
        "67%",
        "16%",
        "6%",
        "3%",
        "8%"
    ],
    "pid": "B01N1QE5ME",
    "ratings": "67,415 ratings",
    "other_info": {
        "Brand": "BEAUTURAL",
        "Color": "Aqua",
        "Product Dimensions": "6\"L x 4.3\"W x 10.7\"H",
        "Item Weight": "2 Pounds",
        "Style": "Steamer"
    },
    "discount_price": "$ .",
    "normal_price": "$59.99",
    "about_this_item": [
        " Detachable 8.79-ounce water tank for 15 minutes of continuous steaming to remove wrinkles perfectly  ",
        " No leaking, no spilling with leak-proof design enables to steam whether vertically or horizontally  ",
        " 1200 watts with 30-second fast heat-up and powerful steam output dewrinkles your clothes in no time  ",
        " Safe to use on all fabrics and suitable for clothes, curtains, furniture, toys and so much more  ",
        " The lint brush and soft brush attachments are included to provide a variety of steaming options  "
    ]
},
{
    "title": "Awesome",
    "rating": "5.0 out of 5 stars",
    "content": "This portable steamer is so convenient. I use it for curtains and clothes. It’s comfortable in your hand, and provides a powerful steam for removing deep wrinkles. Like any other appliance, you must be aware that you will get burned if you’re not careful. It’s small enough for travel and performs well on most any material.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love This Little Machine. No more ironing board for me. Easy to Use. Wrinkles Are Gone. Highly recommended.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Works Perfectly Easy To Use",
    "rating": "4.0 out of 5 stars",
    "content": "First time used there was water coming out from the steam spouts. Which I didn’t find out until a shirt was wet after one stroke.",
    "post_time": "Reviewed in the United States on October 11, 2023",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Next time worked better now that I made sure there was no water on the steam head.",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Stopped working (fixed)",
    "rating": "5.0 out of 5 stars",
    "content": "Third time was not the charm. Stopped working. Ran through the troubleshoots still nothing. Even gave it another week to “rest” nada. Don’t know what happen. As I write this review I’m still trying to give it a go but nothing.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The water does not seem to be going down either.",
    "post_time": "Reviewed in the United States on November 15, 2023",
    "pid": "B01N1QE5ME"
},
{
    "title": "Great for the price",
    "rating": "5.0 out of 5 stars",
    "content": "EDIT: I really didn’t want to give up on this product so I decided to try to make up my own troubleshooting. And I managed to get it",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So here’s what I did. I turned on the steamer and removed the water tank. I then pressed down the trigger and locked it in place. While tilting it back and forth until water started to spit from the little spout. I kept at it until steamer started to come out from the grill. I kept going until there was hardly any water coming out of the spout and what sounded like a propeller inside got a bit louder. Connected the water tank back and finally STEAM!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Clothing Steamer",
    "rating": "5.0 out of 5 stars",
    "content": "So I have worked with steamers before from high end professional steamers to low end apartment steamers and the steamer is a great hybrid of both. Steam quality is very high You get a lot of steam out of the reservoir the steams quality is full and hot, The only drawback is if you angle the steamer at a lower angle it does cause sputtering or spitting of hot water on the clothing and for certain materials this can definitely cause warping or sinks in certain materials. The court is long enough to work in a lot of areas, The accessories that come with it work well.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Definitely keep out of reach of kids as if it's hot they may burn themselves.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "SOLVED: Stopped making steam after 8 months",
    "rating": "4.0 out of 5 stars",
    "content": "UPDATE: The steamer works again! I used a canned air (duster) to unclog the hose inside the steamer. There are a bunch of videos on YouTube how to do this, took me 30 seconds",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The steamer broke after 8 months of use (motor is running, but no steam coming). I used it in total maybe 20 times.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Practice",
    "rating": "5.0 out of 5 stars",
    "content": "It is very easy and comfortable; also powerful. I love it. I recommend it 100%",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this steamer because my other cheaper one broke and I am SO glad that I did! This handheld steamer is lightweight, ACTUALLY removes wrinkles with minimal effort, produces lots of steam, is easy to use, and it's a great price for how well it works. I find new reasons to use this thing all the time, and I haven't used my ironing board in ages because I prefer to use this. The water reservoir is pretty big, so you don't have to refill it often if you have a big project.",
    "post_time": "Reviewed in the United States on September 27, 2023",
    "pid": "B01N1QE5ME"
},
{
    "title": "EXCELLENT steamer!! Highly recommend everyone owning one of these!",
    "rating": "5.0 out of 5 stars",
    "content": "Full disclaimer, I had to get a replacement because the first one that I got didn't produce any steam whatsoever. I almost left a cranky review, but after reading other reviews it sounded like I just got a dud. The replacement that I got was absolutely perfect! SO if you do buy this and aren't satisfied with the result, exchange it for a new one because I can't see how anyone could leave a negative review with how great this thing works. I was worried that, since I got a broken one, the replacement steamer would break easily. However, I have been using my replacement for almost a year now without any issues and it still works flawlessly! I highly recommend this steamer.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Hope this helps!",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Great for delicate fabrics!",
    "rating": "4.0 out of 5 stars",
    "content": "I have their older model of this one, and got this one for my mom but I ended up using it first, hahaha.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is better than the one I have because the water is easier to add and remove! Larger opening.",
    "post_time": "Reviewed in the United States on October 25, 2023",
    "pid": "B01N1QE5ME"
},
{
    "title": "My favorite Steamer ever!!!",
    "rating": "4.0 out of 5 stars",
    "content": "But both of these are identical in every other way. Works great on SUITS AND TIES!",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great for pressing suit pant sand other pants that require a crease, especially between cleanings.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Practico",
    "rating": "4.0 out of 5 stars",
    "content": "es practico pero si se puede regar el agua",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It is making a loud weird sound and it is not working at all. I literally unboxed it today to use and it was useless 🙄",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Not steaming",
    "rating": "4.0 out of 5 stars",
    "content": "After I posted the above review the seller reached out to me offer some solutions which I had already tried and once I told them that the product was in fact defective it was a deemed faulty and they shipped a new one which have already arrived. It works great and I am grateful for the attentive and professional customer support. Thank you!",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It worked the first time I used it. It actually worked very well and I was happy with the purchase. However, when I used it again (for only the 2nd time) it didn’t work— only made humming noises. So, it was a waste of money for me and I can’t recommend it. Maybe I got a defective one. A refund would be nice.",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "It worked, and then it stopped after the 2nd use",
    "rating": "4.0 out of 5 stars",
    "content": "UPDATE:  The seller contacted me to resolve the problem. They offered troubleshooting solutions. The issue was resolved; therefore, I'm changing my rating to 4 stars. They have excellent customer service. I recommend this product.",
    "post_time": "Reviewed in the United States on November 21, 2019",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have never used a steamer before but thought I would try this one after reading such good reviews and also being recommended by several influencers on youtube.  I got tired of the ironing board and iron!  I really like the steamer.  It works as advertised.  Caution:  the steam gets hot!!!  The only reason I gave it a 4 star rating is because of the large size overall and the small size of the water container.  I have to refill the container several times if I am steaming a few things at once.  I disagree with those who said it would be good for travel.  In my opinion, it will take up a good bit of suitcase space and if you pack heavy and are going to fly it could tip you over the maximum weight before having to pay extra.  Overall, I do recommend it.",
    "post_time": "Reviewed in the United States on October 25, 2023",
    "pid": "B01N1QE5ME"
},
{
    "title": "Great Product But Not For Travel",
    "rating": "5.0 out of 5 stars",
    "content": "A couple months ago, I bought some curtains that were quite wrinkly from being in their packages for who-knows-how-long. i went at them with my steam iron to little avail. The curtains have two layers, a thicker darkout layer and a top mesh layer. While the iron improved the blackout layer, it took forever and wasn't quite up to snuff. I was afraid to use the iron on the mesh in case it might melt it. I eventually bought this steamer, which had a coupon available at the time.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This steamer cam quickly; although, it just ships in the labeled box without any additional packaging. This wasn't an issue for me, fortunately. I plugged it in to try almost immediately.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Easier Than Ironing",
    "rating": "5.0 out of 5 stars",
    "content": "This was my first steamer, and it was quite easy to use. Remove the container, filled it, replace and plug it in. It takes less than a minute to heat up, and you'll know when the power light is steady.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B01N1QE5ME"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I started in on the mesh layer of my curtains, and while it took a while because curtains are a lot of fabric, I noticed definite improvement. So far, I've only done the one layer of the top curtain, and there's a world of difference between that and the mesh layer of the other curtain. You'll want to stretch the fabric to get wrinkles out, which was easy enough with the mesh. I think I'll need a couple extr a hands for the thicker layer, however.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B01N1QE5ME"
},
]