[
{
    "name": "        PCA SKIN Hyaluronic Acid Boosting Face Serum, Hyaluronic Acid Serum for Face Made with Niacinamide and Ceramides, Helps Reduce Fine Lines and Wrinkles and Delivers 24-Hour Moisturization, 1 oz Pump       ",
    "stars": [
        "87%",
        "5%",
        "3%",
        "2%",
        "3%"
    ],
    "pid": "B06XSDH36N",
    "ratings": "831 ratings",
    "other_info": {
        "Skin Type": "Normal",
        "Product Benefits": " ",
        "Use for": " ",
        "Scent": " ",
        "Special Ingredients": " "
    },
    "discount_price": "$ 125.",
    "normal_price": "$125.00",
    "about_this_item": []
},
{
    "title": "Hyaloronic cream",
    "rating": "3.0 out of 5 stars",
    "content": "It arrived squished, and not in brand new condition?",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve been using this serum for over a year. It works well for dry skin. However, the price is pretty high, you need to reorder it every 2 months if you use it twice a day.",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "B06XSDH36N"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "I like this product. I’m 69 everyone thinks I’m 59",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am a huge fan of PCA products. I get compliments all the time in my skin.",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "B06XSDH36N"
},
{
    "title": "Works",
    "rating": "5.0 out of 5 stars",
    "content": "This is my 2nd purchase of this product. I'm very happy with it.",
    "post_time": "Reviewed in the United States on April 29, 2024",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product.  Used it a long time.  It up lifts your face.  It is wonderful",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B06XSDH36N"
},
{
    "title": "Huge fan",
    "rating": "5.0 out of 5 stars",
    "content": "I have been sucked in to buying so many expensive products from my esthetician and none have them worked. This is the FIRST serum that I actually notice a difference in my skin. I’ve always had dry skin and this keeps my face glowing all day. I’ve gotten so many compliments since I’ve started using this twice daily morning and night. AWESOME PRODUCT!",
    "post_time": "Reviewed in the United States on September 11, 2023",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "You can wear makeup over it, or go without (I don’t wear any makeup) It’s very nice and light on your skin. Minor moisturizing boost, doesn’t help much with my fine lines and wrinkles. Better than a lot of HA boosters (smell texture feel) price is a little higher for being slightly less effective on the fine lines. However noticeable difference on mens skin. You can’t tell they’re wearing anything but smooths out majority of fine lines!",
    "post_time": "Reviewed in the United States on November 17, 2023",
    "pid": "B06XSDH36N"
},
{
    "title": "Love this",
    "rating": "5.0 out of 5 stars",
    "content": "I rarely write reviews.  Only when a product stinks, or is extraordinary.  In this case, extra extraordinary.  I had rough patches on my cheeks for almost two years, and I was using PCA products, but obviously the wrong ones.  I'm 62.  This could have been due to stresses or hormone imbalances, so I finally I saw a friend of mine who is an esthetician, and all she did was rub the same products I was using into my face and wipe them off - for an HOUR.  So I started researching PCA products, and tried this one.  Why?  Because she told me Niacinimide was essential to healthy skin.  Within two days of use, my skin was noticeably better and after two weeks, I love my face again.  I use it with Hydrator Plus Broad Spectrum SPF 30, which was recommended, and the cost is so worth it!  You only use a tiny one-pump to cover your entire face, so it does last long.  Cost?  Your face is the first thing people see.  Wouldn't you want to have glowing skin again?",
    "post_time": "Reviewed in the United States on July 23, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Was nice feeling on my skin, had a nice peppermint smell to it ans when I put it on it felt like I went to the spa lol",
    "post_time": "Reviewed in the United States on November 13, 2023",
    "pid": "B06XSDH36N"
},
{
    "title": "A favorite…",
    "rating": "5.0 out of 5 stars",
    "content": "Arrived on time & in good condition. Product is a favorite & never disappoints.",
    "post_time": "Reviewed in the United States on January 4, 2024",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been using PCA products for a couple of years now.  This is one of my favorites, the hydration face serum. Pricey, but a little goes a long way.  No scent to it and it definitely helps with hydrating my face and lasts all day.",
    "post_time": "Reviewed in the United States on May 2, 2023",
    "pid": "B06XSDH36N"
},
{
    "title": "Love this Face Serum",
    "rating": "5.0 out of 5 stars",
    "content": "I have sensitive skin and it works for me",
    "post_time": "Reviewed in the United States on October 22, 2023",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My injector raves about this stuff so I finally purchased it. I instantly felt the difference! It’s not something that just coats your skin and makes you think that it’s working. This HA really doesn’t penetrate your skin and makes your skin feel so good. I woke up the next morning after using this and was even more impressed. Worth the price.",
    "post_time": "Reviewed in the United States on July 19, 2022",
    "pid": "B06XSDH36N"
},
{
    "title": "Hydrate",
    "rating": "5.0 out of 5 stars",
    "content": "PCA skin never fails! Iv been using PCA skincare for years. The trick to their skincare line is consistency, in order for the product to worm you must use the whole skincare line, 2-3 times daily. My skin is always smooth, clear and hydrating because I take of my skin like religion. It’s pricey but that’s because the formula contains hyralonic acid which is basically liquid collagen and the key to clear, smooth and radiant skin. Highly recommend this product and you must use the whole line for optimal results!",
    "post_time": "Reviewed in the United States on April 29, 2021",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Disappointed.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B06XSDH36N"
},
{
    "title": "Instantly felt the difference",
    "rating": "5.0 out of 5 stars",
    "content": "I use this serum daily and have for years.  My dermatologist recommended this brand and said it was a high quality product.  My skin looks great and feels great!",
    "post_time": "Reviewed in the United States on February 25, 2023",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It makes my skin feel hydrated and helps with slowing the aging process",
    "post_time": "Reviewed in the United States on June 16, 2023",
    "pid": "B06XSDH36N"
},
{
    "title": "Worth every penny!",
    "rating": "5.0 out of 5 stars",
    "content": "This product is seriously addicting. I use several products from the PCA SKIN line, but this product is a must. I believe it is suitable for all skin types, considering I use it and so does my mother-in-law. I have oily skin with occasional flaking, and this product has solved my issue with flakiness. My skin always looks and feels smooth and supple now. I started out using it twice daily but have backed off to once daily use, and I feel like I am still getting the same results. Also keep in mind, a little bit goes a long way! Not even a full pump is needed to cover your entire face.",
    "post_time": "Reviewed in the United States on March 28, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "keep my familys skin hydrated all day",
    "post_time": "Reviewed in the United States on July 7, 2023",
    "pid": "B06XSDH36N"
},
{
    "title": "Love il!",
    "rating": "5.0 out of 5 stars",
    "content": "Makes my face looking healthy!",
    "post_time": "Reviewed in the United States on July 4, 2023",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great",
    "post_time": "Reviewed in the United States on July 29, 2023",
    "pid": "B06XSDH36N"
},
{
    "title": "Great",
    "rating": "5.0 out of 5 stars",
    "content": "This product is awesome to the skin and moisturizes like no other......I have purchased many products and I have already purchased this one again. Only thing is I wish I could see how much is in the bottle to not run out. I like it so well and it is costly, I only use once daily to every other day and use an alternative in it's place....due to the cost.",
    "post_time": "Reviewed in the United States on November 8, 2020",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Obsessed! I’ve never purchased an expensive face lotion. I received a sample of it after a chemical peel and was hooked! There really is a difference between lotion sitting on top of your skin and seeping into your pores. My fave feels and looks amazing and I’ve gotten so many compliments lately that my skin looks so good! 2nd time purchasing it and it will be a regular purchase! PS- I use it morning and night and it lasted about 2.5 months.",
    "post_time": "Reviewed in the United States on August 15, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Awesome",
    "rating": "5.0 out of 5 stars",
    "content": "No smell , very hydrating. Gentle on sensitive/ eczema prone flare ups skin.",
    "post_time": "Reviewed in the United States on December 29, 2022",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This helps brighten up your skin.  Gives it a replenished look, like a big drink of water for your face.  I use it daily in the AM.",
    "post_time": "Reviewed in the United States on January 16, 2022",
    "pid": "B06XSDH36N"
},
{
    "title": "BUY NOW!",
    "rating": "5.0 out of 5 stars",
    "content": "Lovely scent, excellent botanical, excellent ingredients. Big fan of PCA",
    "post_time": "Reviewed in the United States on October 22, 2022",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried too many to count hyaluronic serums to count!  My doctor recommended PCA Skin Hyaluronic Acid Boosting Serum several times to me. Finally I tried it. What a difference it makes for your skin. Can’t be without it now!",
    "post_time": "Reviewed in the United States on January 2, 2020",
    "pid": "B06XSDH36N"
},
{
    "title": "Hydrating!!",
    "rating": "5.0 out of 5 stars",
    "content": "I live in CO and we have virtually no humidity so my skin is always dry. I think this combined with the collagen moisturizer are well worth the money. My skin is dewey and glows. My nurse even commented on how hydrated I look. I will definitely continue to use.",
    "post_time": "Reviewed in the United States on January 26, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I have purchased this many times.  Love the product, but this purchase has a different odor that smells like urine or urea.  Usually it is pretty scentless, fresh smelling.  I will assume that I was sent a spoiled product. Box was kind of bashed in.",
    "post_time": "Reviewed in the United States on November 5, 2022",
    "pid": "B06XSDH36N"
},
{
    "title": "Great Product",
    "rating": "3.0 out of 5 stars",
    "content": "Packaging is very misleading because it is heavy in the bottle is only half full when you receive it. My first review was actually taken down so I am attempting to tell the truth for a second time.",
    "post_time": "Reviewed in the United States on December 11, 2020",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This really works. I swear by PCA products. Been using PCA products for 1 year and I see a big difference in my face. Take before and after pics",
    "post_time": "Reviewed in the United States on March 1, 2020",
    "pid": "B06XSDH36N"
},
{
    "title": "Awesome product",
    "rating": "3.0 out of 5 stars",
    "content": "The product itself is wonderful, however, the packaging is so heavy that you have no idea when you are running low. One day it’s just gone. 😕",
    "post_time": "Reviewed in the United States on April 20, 2021",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love most PCA products - this one in particular is great.  Have seen a really positive change in the texture and smoothness of my skin.  Have tried several other hyaluronic acids - they do not compare.  PCA is simply the best.",
    "post_time": "Reviewed in the United States on March 23, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "Packaging weight misleading",
    "rating": "5.0 out of 5 stars",
    "content": "Makes your skin feel like silk and hydrated all day long.",
    "post_time": "Reviewed in the United States on August 30, 2021",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love pca in general and this product is one of my favorites I am 40 and I needed it very much.",
    "post_time": "Reviewed in the United States on June 22, 2020",
    "pid": "B06XSDH36N"
},
{
    "title": "EXCELLENT PRODUCT",
    "rating": "1.0 out of 5 stars",
    "content": "Made my face sticky and breakout. Might work for someone without sensitive skin. Not worth the price me.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product. It has really helped and does wonders . Would definitely recommend.",
    "post_time": "Reviewed in the United States on September 27, 2020",
    "pid": "B06XSDH36N"
},
{
    "title": "This serum is simply amazing and your skin is continuously hydrated.  Love it",
    "rating": "4.0 out of 5 stars",
    "content": "Love this product but so expensive for 1 oz",
    "post_time": "Reviewed in the United States on March 18, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love this serum but the amount is too small for the money.",
    "post_time": "Reviewed in the United States on June 17, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "Bottle arrived empty",
    "rating": "1.0 out of 5 stars",
    "content": "I have been buying this for years and it usually lasts me 80-90 days before I run out.  This one was ordered on August 28th...and by Sept 12th it was empty (two weeks later) .  Either I was sent a \"pre-used\" bottle or they have changed the design to hold less.",
    "post_time": "Reviewed in the United States on September 13, 2023",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great",
    "post_time": "Reviewed in the United States on December 4, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Good",
    "rating": "5.0 out of 5 stars",
    "content": "I love this serum! It hydrates my face (without overhydratont) and soaks into my skin nicely. I usually put this on at night and when I wake up, my face feels so soft.",
    "post_time": "Reviewed in the United States on February 7, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like this product and will order more.",
    "post_time": "Reviewed in the United States on November 11, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Great hydrating serum",
    "rating": "4.0 out of 5 stars",
    "content": "I use it in conjunction with other products.",
    "post_time": "Reviewed in the United States on August 23, 2017",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Really like this stuff - you only need a tiny bit to cover your whole face.",
    "post_time": "Reviewed in the United States on November 30, 2021",
    "pid": "B06XSDH36N"
},
{
    "title": "Worth trying !",
    "rating": "2.0 out of 5 stars",
    "content": "The product arrived unsealed and used. I could tell it was used as it was much lighter than the same product that I’ve bought from PCA Skin in the past. Otherwise, the product itself (when not arriving used) is very effective.",
    "post_time": "Reviewed in the United States on October 7, 2020",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So the product inside the heavy container was nice, however it didn't last long. Much to my disappointment! The container is heavy, making it appear like you are getting a lot of product; VERY MISLEADING.. you get VERY little product.",
    "post_time": "Reviewed in the United States on July 27, 2020",
    "pid": "B06XSDH36N"
},
{
    "title": "Four Stars",
    "rating": "3.0 out of 5 stars",
    "content": "You can't open the container either.. I wont buy again.",
    "post_time": "Reviewed in the United States on March 15, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this product. Leaves my skin feeling great",
    "post_time": "Reviewed in the United States on March 28, 2021",
    "pid": "B06XSDH36N"
},
{
    "title": "Expensive but worth it",
    "rating": "5.0 out of 5 stars",
    "content": "Great product. Expensive but worth it. I’m 67; it cured my dry skin.",
    "post_time": "Reviewed in the United States on May 20, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "really like the product but my bottle lasted only about 2 weeks. It was a rip off from what looks like a nice size bottle. Irritated",
    "post_time": "Reviewed in the United States on September 6, 2017",
    "pid": "B06XSDH36N"
},
{
    "title": "really like the product but my bottle lasted only about 2 ...",
    "rating": "5.0 out of 5 stars",
    "content": "I LOVE this product!  It is worth every cent! My skin felt instantly hydrated! This one is a keeper!!",
    "post_time": "Reviewed in the United States on April 18, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The product is amazing!! Literally only lasted me one month of morning and night usage. That could get expensive!!",
    "post_time": "Reviewed in the United States on February 27, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "Five Stars",
    "rating": "1.0 out of 5 stars",
    "content": "While the product itself is just awesome and a little goes a long way, the box came already opened at one end and the pump had already been primed. The box looked like it might have been handled or returned before. Bar code on bottom taped over. Too expensive to get without being sure of a full bottle.  Back it goes.",
    "post_time": "Reviewed in the United States on December 19, 2021",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Exactly what I was looking for.  Would recommend to friends and family.",
    "post_time": "Reviewed in the United States on December 16, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "Five Stars",
    "rating": "5.0 out of 5 stars",
    "content": "It made my skin feel fresh and younger",
    "post_time": "Reviewed in the United States on June 24, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I agree with the other reviews.  I really like the product, but my first bottle lasted for 4-5 months and this one lasted about 6 weeks, using the same amount daily.  Too expensive to risk that again.  Can't inspect how much is in the bottle.",
    "post_time": "Reviewed in the United States on October 22, 2017",
    "pid": "B06XSDH36N"
},
{
    "title": "Product previous use",
    "rating": "5.0 out of 5 stars",
    "content": "Amazing Serum!!!Recommend to everybody!!!",
    "post_time": "Reviewed in the United States on January 10, 2020",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I used it as an aftershave moisturizer.",
    "post_time": "Reviewed in the United States on April 23, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Great",
    "rating": "5.0 out of 5 stars",
    "content": "Will continue to buy this product",
    "post_time": "Reviewed in the United States on July 6, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this product. Skin is so silky after I use it.",
    "post_time": "Reviewed in the United States on June 17, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "Great",
    "rating": "3.0 out of 5 stars",
    "content": "Nice product but stopped pumping. Had to pull inner pouch from bottle.",
    "post_time": "Reviewed in the United States on March 14, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "i've only used it once on my face because of the smell.  i'm using it on my elbows and feet as a moisturizer because of the powerful smell of toilet bowl cleaner. it actually makes me gag. y'all really have to tweek the scent formula to not be so tidy-bowl. it's very powerful. so very powerful.",
    "post_time": "Reviewed in the United States on May 13, 2020",
    "pid": "B06XSDH36N"
},
{
    "title": "Three Stars",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent moisture",
    "post_time": "Reviewed in the United States on June 29, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I purchased this product June 2nd was out July 1st was a good face hydrated product but not enough for the money. For that reason I would not recommend hyaluronic acid boosting serum purchase I have many of their products I am not happy with this at all!!I have a picture to show this enclosure inside the bottle!",
    "post_time": "Reviewed in the United States on July 13, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "it smells like toilet bowl cleaner",
    "rating": "5.0 out of 5 stars",
    "content": "Smooth",
    "post_time": "Reviewed in the United States on January 18, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Amazing!!!",
    "post_time": "Reviewed in the United States on January 2, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "So hydrating on my dry skin",
    "rating": "1.0 out of 5 stars",
    "content": "The cylinder is empty there is no product in it whatsoever!",
    "post_time": "Reviewed in the United States on February 21, 2023",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "been using it for years. great product",
    "post_time": "Reviewed in the United States on October 3, 2017",
    "pid": "B06XSDH36N"
},
{
    "title": "The consistency of the face product was inconsistent. It was sticky.",
    "rating": "1.0 out of 5 stars",
    "content": "The consistency of the product was not like the other times I have ordered.",
    "post_time": "Reviewed in the United States on January 13, 2023",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Damaged . Leaked everywhere in package . Had to throw out and had no cap even in the package",
    "post_time": "Reviewed in the United States on August 4, 2022",
    "pid": "B06XSDH36N"
},
{
    "title": "Damaged",
    "rating": "5.0 out of 5 stars",
    "content": "WORKS WELL",
    "post_time": "Reviewed in the United States on February 13, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "This has not happened to me before, however, this product looked like it had been opened before. Could not even get one application.",
    "post_time": "Reviewed in the United States on December 20, 2021",
    "pid": "B06XSDH36N"
},
{
    "title": "Five Stars",
    "rating": "5.0 out of 5 stars",
    "content": "Great product",
    "post_time": "Reviewed in the United States on January 15, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Used at directed.",
    "post_time": "Reviewed in the United States on December 23, 2022",
    "pid": "B06XSDH36N"
},
{
    "title": "Disappointed",
    "rating": "1.0 out of 5 stars",
    "content": "Product lasted 3 weeks.",
    "post_time": "Reviewed in the United States on June 29, 2020",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "$120?",
    "post_time": "Reviewed in the United States on May 29, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "Five Stars",
    "rating": "1.0 out of 5 stars",
    "content": "The pump stopped working after 2 months and there is plenty of the product left. This product was expensive and I’m very upset it stopped working: (",
    "post_time": "Reviewed in the United States on July 25, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "It broke my face out. Sorry wasn't for me.",
    "post_time": "Reviewed in the United States on February 9, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Think I was ripped off",
    "rating": "1.0 out of 5 stars",
    "content": "Not feb 18 and it’s already empty",
    "post_time": "Reviewed in the United States on March 27, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Think they ripped me off",
    "post_time": "Reviewed in the United States on March 13, 2024",
    "pid": "B06XSDH36N"
},
{
    "title": "Extremely expensive for 1 ounce",
    "rating": "1.0 out of 5 stars",
    "content": "Will be buying from my dermatologist from now on",
    "post_time": "Reviewed in the United States on March 1, 2019",
    "pid": "B06XSDH36N"
},
{
    "title": "Not the best",
    "rating": "4.0 out of 5 stars",
    "content": "There has to be something wrong with that price label there’s no way in the world you’re telling me it’s 150 for one product that’s 1 ounce that seems highly excessive and not a affordable for most American people. I’m extremely confused I understand a kit being that price, it comes with multiple products but just for one item ,I don’t understand .",
    "post_time": "Reviewed in the United States on November 28, 2017",
    "pid": "B06XSDH36N"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very expensive, with no results after 30 days.",
    "post_time": "Reviewed in the United States on October 27, 2017",
    "pid": "B06XSDH36N"
},
{
    "title": "A pump problem ?",
    "rating": "5.0 out of 5 stars",
    "content": "This may sound odd but I too experienced the product running out too soon. I decided to investigate. I screwed off the top which came loose but would not come off. I pulled on it and it started to give way. The top was attached to a bag of product. I really had to work to pull the whole bag out. The bag wasn't empty but the pump wasn't pulling the product out. I was able to finally use every bit by squeezing the bag and pumping at the same time -- a little tricky but doable. I'm presuming there is a delivery problem with some of the pumps.",
    "post_time": "Reviewed in the United States on November 13, 2017",
    "pid": "B06XSDH36N"
},
{
    "title": "Best Hydration Ever!",
    "rating": "3.0 out of 5 stars",
    "content": "Excellent product however.",
    "post_time": "Reviewed in the United States on April 2, 2020",
    "pid": "B06XSDH36N"
},
{
    "title": "Absolutely love this serum",
    "rating": "3.0 out of 5 stars",
    "content": "Love this product. My dermatologist mentioned this would be great after having IPL laser treatment. I have been using this since April and noticed a big difference in my skin's hydration level. Loved the product and also love the other PCA products. Just started using the pore refining treatment and detox mask.  Thanks PCA!",
    "post_time": "Reviewed in the United States on April 29, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "pimples",
    "rating": "2.0 out of 5 stars",
    "content": "Absolutely love this serum!  I use it 3x a day and it's changed my skin!  I love the glow it gives you!",
    "post_time": "Reviewed in the United States on July 27, 2018",
    "pid": "B06XSDH36N"
},
{
    "title": "Lasts only 1 month using 2 pumps twice daily!",
    "rating": "3.0 out of 5 stars",
    "content": "broke out.  very odd break outs.",
    "post_time": "Reviewed in the United States on May 1, 2021",
    "pid": "B06XSDH36N"
},
]