[
{
    "name": "        SeoulCeuticals Korean Skin Care 20% Vitamin C Hyaluronic Acid Serum + CE Ferulic Acid - Potent Anti Aging, Anti Wrinkle Korean Beauty 1oz       ",
    "stars": [
        "65%",
        "16%",
        "9%",
        "4%",
        "6%"
    ],
    "pid": "B072K1LNNY",
    "ratings": "24,157 ratings",
    "other_info": {
        "Skin Type": "Oily, Combination, Dry, Normal",
        "Product Benefits": " ",
        "Use for": " ",
        "Scent": " ",
        "Special Ingredients": " "
    },
    "discount_price": "$ 19.",
    "normal_price": "$19.98",
    "about_this_item": [
        " THIS KOREAN SKIN CARE VITAMIN C serum contains the same potent, active ingredients as more expensive CE Ferulic Serums  ",
        " EXTREMELY EFFECTIVE - WE PROMISE you'll begin to see results with this K beauty product within 3 weeks when used daily  ",
        " POTENT ANTI AGING, ANTI WRINKLE serum is proven to help reduce the appearance of wrinkles, fine lines & crows feet  ",
        " THIS TOPICAL VITAMIN C ALSO helps to fade sun spots and is guaranteed to provide you with a brighter more youthful complexion  ",
        " THIS FACIAL SERUM HELPS TO shrink pores, clear up acne, prevent breakouts, and minimize the appearance of acne scars & perfect under korean makeup  "
    ]
},
{
    "title": "Wow great stuff.",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this serum in a whim and for the price I figured I'd give it a try. This serum works amazing ...All the redness around my mouth my nose under my eye corners all gone My skin looks so smooth and even toned. Try it it works great! Buy the two pack you won't regret it I only bought the one now I'm going to buy the two pack. I use it every night I probably use more than most people so it's not lasting that long",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Ever since applying this product I've noticed a more even, lighter, brighter skin tone. Less lines and wrinkles. I also love the smell! It's very pleasant. I feel I look more youthful and I've had multiple people comment on my skin. A little goes a long ways. Will purchase again.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "I'm a man and I'm getting compliments on my skin!",
    "rating": "4.0 out of 5 stars",
    "content": "Skincare aficionados know what product this is duping.  And while I have been inspired by rave reviews to try the famous version of a Vitamic C Ferulic Acid serum, I just couldn't handle the price. So I tried this.  I put this on every morning under my sunscreen.  It has a nice, Vitamin C-ish smell, the consistency is good, the packaging protects the contents and I didn't see any ingredients I had a problem with.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recently sampled a well know retinol cream, and unfortunately the strength was too much for me, leaving me with a big rough, discolored spot on my face. I believed that this Vitamin C serum might help. In addition,  I went back to a much milder version of retinol every other night, alternating with a barrier repair serum, and it seems to me that the three serums in combination are making the spot go away, fading my facial age spots a bit, besides diminishing fine lines on my face and neck and other sun damage on my hands (I always put whatever I am using on my face on my chest and back of hands). Overall, my skin is smoother and more even.  I have experienced no bad effects from this serum.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Seems to be working in healing skin product damage",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product and use it daily - I've repurchased this several times now! It has a great feeling on my skin, and leaves it noticeably hydrated and glowing. I personally love the orange scent, but it may be too much fragrance for some people.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I'm hard to convince with beauty products, but I have to give a big thumbs up to this serum. It works. My skin is so much improved in all sorts of ways. The thing about finding a beauty item at a good price is that it allows you to use a lot of it without worry. I put a good amount on my face and also on my neck, chest, as well as arms and hands. Vitamin C will not block UV rays but it will counter damage. I just started doing this and I see real results as those areas do not have that slightly leathery look.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Love this!",
    "rating": "5.0 out of 5 stars",
    "content": "I was trying to find a cheaper alternative to the Peter Thomas Roth vitamin C serum, which works great , but is quite pricey ($105), so decided to buy this product. I’d give this product 3 stars as has a nice fragrance and specifications of a high level of vitamin C, however it leaves my skin feeling very dry after I apply it. I stopped using it and purchased the product I used before….",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I trust and admire Korean cosmetics  and this small bottle of serum with freulic acid has changed my aging (74 year-old) complexion in just a short time! Fewer dark spots and smoother, fresher- looking skin overall. I use it every night. It’s lightweight and so easy to apply, like applying water. Let it dry for about five short minutes, and then use a well-known moisturizer ( Cetaphil Moisurizing Cream) atop it. I cannot believe the difference in the mirror in the am. I used to look horrid! My face is fresh and bright now.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "This is a great product at a great price",
    "rating": "4.0 out of 5 stars",
    "content": "This is nice and makes my skin feel soft, but I don't think it has made any visible changes to my skin. It is light feeling when you put it on and has a good smell. It's in-between thick and thin without any stickiness.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I didnt think of expecting so much from this serum  due to the price and I am not one that buys face products especially if it was not previously  recommended by somebody else but I have to say that I will def keep buying products from this brand. The serum tightens up my skin and leaves it ready for my sunscreen and morning cream.  I also got the face mask (the snail mucin) and the multifunction all in one face cream and they all leave my skin feeling very soft and fresh. I feel like my face skin looks clearer and tighter. I will continue purchaing this brand and I am actually going to buy more of their products.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Love",
    "rating": "4.0 out of 5 stars",
    "content": "I see canges in my skin",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was having redness it works great!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Great face serum!",
    "rating": "4.0 out of 5 stars",
    "content": "Skin is calmer less red.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So, far I like it but I have been using a short time. About 2 weeks",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Good product faulty receptacle",
    "rating": "5.0 out of 5 stars",
    "content": "I like the serum but lid does not screw on or seal properly, therefore can’t travel with product. I also wonder if lack of seal will degrade product over time.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is great stuff. My face feels and looks better when I use it. Great substitute for other CE Ferulic serums.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Love this stuff",
    "rating": "5.0 out of 5 stars",
    "content": "Unlike other vitamin C serums I’ve used, this doesn’t remain tacky on my skin.  It actually dries and you can apply other things on top fairly quickly.  It’s lightweight, has a very even consistency and the dropper is great for application.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love the value and That the ingredients are pretty safe. according to EWG too.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Love the feel on my skin",
    "rating": "5.0 out of 5 stars",
    "content": "I love that this serum doesn’t feel sticky on my face like some serums do, smooths my fine lines well! Not a bad price for a serum!",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just started using it and it feel smooth non greasy",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Fantastic Results with SeoulCeuticals Korean Skin Care Vitamin C Serum!",
    "rating": "5.0 out of 5 stars",
    "content": "I  recently added the SeoulCeuticals Korean Skin Care 20% Vitamin C Hyaluronic Acid Serum with CE Ferulic Acid to my skincare routine, and I am thrilled with the results! This serum has truly exceeded my expectations in every way.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First off, the texture is lightweight and absorbs quickly, leaving my skin feeling hydrated and smooth without any sticky residue. After just a few weeks of consistent use, I noticed a significant improvement in the overall brightness and evenness of my skin tone. The combination of 20% Vitamin C, Hyaluronic Acid, and Ferulic Acid is a powerhouse trio that has helped reduce the appearance of fine lines and dark spots, giving my skin a more youthful and radiant glow.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "SeoulCeuticals Korean Skin Care 20% Vitamin C Hyaluronic Acid Serum",
    "rating": "5.0 out of 5 stars",
    "content": "What I love most about this serum is how gentle it is, despite being so potent. I have sensitive skin, and many Vitamin C serums can be irritating, but this one has been a game-changer. It’s perfect for daily use, and I’ve had no issues with redness or dryness.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The packaging is also worth mentioning—it's sturdy and comes with a dropper that allows for easy, mess-free application. Plus, a little goes a long way, so I know this bottle will last me a while.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Best Vitamin C I’ve found!",
    "rating": "4.0 out of 5 stars",
    "content": "Overall, I highly recommend the SeoulCeuticals Vitamin C Serum to anyone looking to enhance their skincare routine. It delivers visible results, is affordable, and is a fantastic addition to any skincare regimen!",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have always liked Korean Products and the one that let me down was JULEP because I think it was financial or a buyout. I can't get the products I really liked.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Great results in short time span!",
    "rating": "5.0 out of 5 stars",
    "content": "  I saw the Ad for this Korean product and decided to purchase. I will report back because I've only used it a few days,  HOWEVER, I can honestly say I love the feel and the look it gives. As far as the consistency it is to a heavy, watery side, and is not thick and viscous. I am making a statement;  it  is not a product fault. I like it. Basically it is fragrant-less and for me that is a big plus. Packaging is very nice and it arrived on time. Know this is not a moisturizer. I have very good skin for my age but I like the finish it gives me. While wearing it recently I have received several compliments.  I will definitely re-order.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It isn’t too oily and doesn’t smell like bacon! It has a nice absorption and smells like orange. It’s only been a few days, but I’m already seeing some fading in some sun spots on my face. Very pleased so far!",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Works",
    "rating": "4.0 out of 5 stars",
    "content": "After my pregnancy, I was freaking out as I developed some wrinkles on my forehead. I purchased this product as a bundle with a mist and the serum and saw results in a couple of weeks! I was so impressed that my kids accidentally spilled my first serum and i re-purchased it!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Lightening my dark facial spots",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Good Feeling",
    "rating": "4.0 out of 5 stars",
    "content": "I notices a little difference so I think its good but for this price Id say its the better one you can buy",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Tengo una semana usando y no eh tenido ninguna reacción  pero el producto esta muy liquido se absorbe rapido pero mi botella llego con  el gotero quebrado (es vidrio) como se muestr en el video.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Demasiado liquido",
    "rating": "5.0 out of 5 stars",
    "content": "\"Same day delivery - I like this serum. It's light and not greasy.\"",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "a re-purchase item for me!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Great",
    "rating": "5.0 out of 5 stars",
    "content": "I just really really love Korean skin care. I think it is unmatched to what we have in America and has helped my skin so much for all the stuff I have bought and this helps too! I love the moisture it has brought back to my face and the quality of it is amazing!",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like the produce because it goes on so easy and my face looks younger.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Amazing product",
    "rating": "5.0 out of 5 stars",
    "content": "I just got the product it fits good with my makeup and it smells really good I’ll try it for some months for more results but I’m so happy it combines with my makeup",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like the texture of the Vitamin C and how it blends into my skin. I still have not noticed that it has had much effect on my dark spots. I would like to wait for a couple of months before I can comment on it. I’m using it daily and will evaluate its effectiveness after a few months.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Love!",
    "rating": "5.0 out of 5 stars",
    "content": "Esencial para la piel por su firmeza y elasticidad",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First time trying this C serum and I have seen positive results so far. C is great for skin brightening and reducing spots. When combined with CE Ferulic Acid, it stabilizes the Vitamin C and increases the effectiveness. I've noticed brightening and evening out of my skin tone from using this on my face each morning.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Skin glow may be brighter than my future",
    "rating": "5.0 out of 5 stars",
    "content": "This Vitamin C Hyaluronic Acid Serum is like a magic potion for my face! At 35+, I don't have wrinkles yet, but this serum makes my skin glow brighter than my future. It’s like my skin found the fountain of youth. A must-have for anyone looking to dazzle! Thank you Tik Tok for the introduction!",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This product feels great going on and can be easily mixed with my other serums.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Day Glow Serum",
    "rating": "5.0 out of 5 stars",
    "content": "If you want to pay $145 for “The” prestige brand, ok, but this is as good if not better. I consider it a crucial step in my morning skin care routine - this my 2nd bottle of SeoulCeuticals (still using my 1st bottle but didn’t want to chance running out). It is my 4th step…cleanse, tone, essence, Vit C, polypeptide, sunscreen, moisturizer if needed. (Of those I could skip the polypeptide. Maybe. But why shoot a winning horse.)",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This comes in a dark blue bottle to protect it from light exposure. There are directions in English - something my polypeptide does not provide :(  Buy  it, USE IT, everyday before your sunscreen.  You will never regret it.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Cheers to good skin!",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve been using this for about a month every morning and my face feels so clear and glossy. Love it",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It is good",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Glowing",
    "rating": "5.0 out of 5 stars",
    "content": "I don't like this item, because my skin is not accepted, please do not send it again thank you and have a good day",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Really helped my skin look radiant and glowy. Love it!!!",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Good items",
    "rating": "5.0 out of 5 stars",
    "content": "So far only used a couple times. A bit sticky but very thin and goes on easily. Do far so good. Cant really see any difference yet. But skin does feel soft.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Gives skin a soft texture and feel. Adds a vibrant glow. Great for older skin.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "good product",
    "rating": "5.0 out of 5 stars",
    "content": "works well",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My first order is different from my second one! My second order it looks milky ! I’m not sure what’s going on.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "I’m not sure about my second order",
    "rating": "5.0 out of 5 stars",
    "content": "My daughter gave me some of this and I have been using it quite a while. It feels like it tones my skin and makes it feel less saggy.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Misleads you into thinking this product is made in Korea. It's made in US. It's modeled after Korean formulas, whatever that means. There are no % of individual ingredients listed on the label, so I'm thinking it has small amounts of different things. Perhaps because of that, it doesn't sting, has hardly any smell, and didn't cause an allergic reaction. Feels like putting water on your skin. The dark bottle prevents light oxidation. The dropper lets you use a tiny amount. I wash my face with Cerave salicylic acid wash 2%. After showering, I put 1 drop if Vit C on my cheeks, then use Cerave serum around my eyes, and Cerave pump moisturizer all over my face. I don't look younger after 3 months of daily use, but my skin has stayed clear. I stopped wearing makeup after COVID, so my skin was able to fully recover and looks great. I look much younger without foundation.  Makeup and/or brushes/sponges make my face break out with bumps. No longer.",
    "post_time": "Reviewed in the United States on January 24, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Feels good on my skin",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve tried several different formulas on Amazon, but this is the one that has brought the most compliments.  I couldn’t really tell myself, but others have said my skin appeared brighter. It’s a tad expensive for the fluid ounces you receive.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What was said in the description is",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Misleading -- NOT made in Korea",
    "rating": "5.0 out of 5 stars",
    "content": "What the product delivers",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this product after I decided to start taking better care of my skin again after having another baby. The reviews on the product looked good and I decided to give it a shot. I hadn't used vitamin C before in my routine, but I'm so glad that I included it. This product makes my skin feel so good every morning. It is hydrating, and has a pleasant smell that isn't overwhelming. My skin didn't have any negative reactions to it as well, and my skin is looking better now than it has in years. I'm on my 2nd bottle of this and will continue to purchase it.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "Feels nice on face",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works very good on my sensitive and rosacea skin.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Great",
    "rating": "5.0 out of 5 stars",
    "content": "I’m now into Korean skin care products lol",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am 67 years old male. Since I started using fine lines started disappearing.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Fine lines",
    "rating": "4.0 out of 5 stars",
    "content": "Good for sensitive skin, provides hydration and keeps it soft for long time",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved how this product made my skin look and feel after one use. It is much thinner than most serums that I am used to but still provides all of the same benefits. Skin had a noticeable glow and softness after continued use.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Gentle on skin",
    "rating": "5.0 out of 5 stars",
    "content": "The feel is great. It brightens and smells fantastic!",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I do give  this as gifts.  Their snail \"eye\" cream is the thing to buy and use lightly  over your face and  neck. This serum is OK but no miracle worker. Try it. You m ay like it. I prefer  Estee Lauder serum.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Thinner than most serums",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this at the recommendation of my daughter’s dermatologist’s PA. So far so good.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Very lightweight and soaks into the skin easily. I have noticed a difference in any of my dark spots but it does help give the skin a natural glow. If you’re going to be in the sun I do not suggest using this product, your skin will BURN. Even if you put sunscreen on top.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Nice!",
    "rating": "5.0 out of 5 stars",
    "content": "Been using for one week. Love it!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like the price and the product itself.  I use it daily before applying lotion and eye cream.  It is light and not sticky/tacky",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Great",
    "rating": "5.0 out of 5 stars",
    "content": "On of the best vit C I used . I will stay with this one because it is great and the price is good too",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I've been using it for about 2 weeks straight now and I can see a visible difference in my skin. The only downside is that smell is a little heavy when you first apply it. I haven't had any visible outbreaks from using it but everyone's skin is different so what works for me may not work for you.",
    "post_time": "Reviewed in the United States on March 25, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Vit C Serum",
    "rating": "5.0 out of 5 stars",
    "content": "I mean I try new products all the time and oh my gosh within a day as in I slept my face is so much brighter already can’t imagine using it a whole month, definitely recommend",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "No result so far. Instructions are not accurate",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Wow oh wow",
    "rating": "4.0 out of 5 stars",
    "content": "I have not used the product for very long but I like it so far. I use it with a moisturizer so I cannot judge that aspect of the serum. The purity of the product is wonderful with nothing extra added.",
    "post_time": "Reviewed in the United States on March 13, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Leaves my skin so bright and smooth.  It has also helped my sons break outs.  He uses the spray, serum, and lotion everyday.  It has been a great product for him.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "No result so far. Instructions are not accurate",
    "rating": "5.0 out of 5 stars",
    "content": "So I’ve been testing this for a while now and I whole heartedly recommend! I didn’t get any irritation or reaction to this product - I use this every morning after cleansing then I apply my sunscreen on top it gives me glow and  it’s very light weight as well I’m happy I came across this product and it’s my dupe for the skinceuticals c e ferulic serum and plus it’s more affordable too!",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I Saw tik tok reviews - and this was a great percentage and the right firm of Vitamin C.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "I have sensitive skin but this product has not aggravated my skin.",
    "rating": "3.0 out of 5 stars",
    "content": "Hand down will absolutely our has again. Very brightening when used first thing in the morning prior to toner, etc",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've never had a vitamin C that is thin as water like this one. I will continue to use and hope it works",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Si 👍 es genia",
    "rating": "3.0 out of 5 stars",
    "content": "Me gustó mucho y lo uso pero su efecto genial no dura mucho como uno quisiera ,  se que no es permanente pero pensé que al menos me duraría de 6 a 8 horas ! Pero me gusta ! 👍",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was looking for something like this in an expensive name brand. Saw this one on Tik tok. Got good reviews. So it has been about a month for me now since using the product and I love it.  I notice a difference. Plus others are starting to notice the effects. I use on my face neck chest and hands. My fine lines and wrinkles have faded and are not as prominent. On my non makeup days I use this serum with lotion and I have radiant glowing skin. Highly recommend",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Legit serum",
    "rating": "5.0 out of 5 stars",
    "content": "I am always trying new vitamin C serums, and when I was recommended this brand I now see why!",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The product is amazing and at this price, it’s awesome!!",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Great product & wonderful seller!",
    "rating": "4.0 out of 5 stars",
    "content": "The sellers were alerted to a possible delivery issue, and they reached out right away to confirm that my package wasn’t impacted. They offered to replace it right away, free of charge. That is a great seller if you ask me!",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "pros: easy to layer, glossy skin effect, absorbs easily, non irritant",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "first time trying a vitamin c serum",
    "rating": "5.0 out of 5 stars",
    "content": "cons: not sure if this really did anything for my skin, i used a whole bottle  but i guess vitamin c takes longer to see results",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "will i buy again? maybe, but for now ill try something else",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Great serum for face!",
    "rating": "5.0 out of 5 stars",
    "content": "Serum is watery but it works well.  When using it my face, it seems to lighten the redness.  Put 1-2 drops around my face each morning goes a long way.  It's not as light as other Korean serums that I have purchased from a Korean company but I definitely would recommend this.  I already purchased another bottle.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's a great booster for my skin - (combo skin type). I strongly stand behind the concept that skincare is not just for the immediate result (that's what Botox is for) but the routine of skincare. Treat your skin right, with the right products and it will take care of you... do your skin a favor and dose it with a great vitamin C blend. I have tried more than I even want to admit. So far this is my official go-to.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Serum",
    "rating": "5.0 out of 5 stars",
    "content": "Love it ♥️",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was my first time trying a vitamin c serum so I don't have anything to compare this to, but I really noticed the difference after the first use. My face look refreshed and healthy, quite glowy.",
    "post_time": "Reviewed in the United States on June 8, 2018",
    "pid": "B072K1LNNY"
},
{
    "title": "Instant results - great skin food!",
    "rating": "5.0 out of 5 stars",
    "content": "I think the best method is to put the dropper on your face, although I often will drop the serum in my hand and apply to my face that way, but some of the product gets wasted that way in my opinion and I end up using more drops than needed because it all drips between my fingers. It took me a bit of research to figure out where in the Korean routine this is incorporated. As I understand it, you apply it after your essence. I usually wait about a minute for the essence to get absorbed, then I apply this serum and usually wait about 15 minutes for my skin to absorb the serum completely. During that 15 minutes I just finish off drying my body from my shower, body lotion and getting dressed. By the time you've finished all that it's time to apply the emulsion, the next step of your routine. This works well if you have limited time in the morning, just continue getting ready while the vitamin c is getting absorbed, so you don't lose any time.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It has a really nice citrus scent that's not too overpowering, and although it's a serum it does not leave a greasy mess on your face, your skin will absorb it well, and as someone else said drink it up.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Very impressed!",
    "rating": "5.0 out of 5 stars",
    "content": "This is a product I'll continue using because I see the results in such a short period of time, and I know the results will just keep getting better. Definitely recommend trying this. Oh, and for those who have said they have had breakouts from using this.... I can't stress enough that your skin needs to be thoroughly clean prior to using any type of serum, because otherwise dirt and dead skin cells just get trapped and you end up with acne. This is why I do the Korean skin care routine, because you initially do a double cleanse and your face is clean throughout the rest of the steps, and when you apply this serum you're applying it to a very clean face. Before doing the Korean routine I thought my face was getting a proper clean, but I was so wrong. I hardly ever get a pimple now! It's possible some might just be having a reaction to the serum (though it's not greasy and absorbs well), but just wanted to caution that you ensure your face is clean first before applying this.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "TOP TIP: With the exception of my cleanser I always gently press products into my skin rather than smearing them all over my face. I've noticed a big difference by doing this. Your skin absorbs them so much better. The products work as they're supposed to, skin is noticeably hydrated and stays hydrated for longer. It's like blotting a carpet stain with a cloth - you press the cloth into the carpet and it absorbs the liquid, and your skin does the same thing with products. Pressing is more effective than smearing the surface.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Loved it until I received a rancid bottle",
    "rating": "3.0 out of 5 stars",
    "content": "I was a little skeptical at first but decided to give it a go.  So glad that I did.  After two weeks of usage I am seeing a definite change in my brown spots on my face.  They have faded so much!  Give this a whirl.  It will not disappoint!!",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this twice previously, but the last bottle I purchased had a rancid smell to it. I opened it a few days after the return window, so I’ll have to toss it.  I’m not sure I want to risk it again if their quality control is inconsistent.  Before this experience, though, I found it to be very effective in brightening and smoothing my skin.  The smell (of the two previous bottles) had a light citrusy scent.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Serum de vitamina C",
    "rating": "3.0 out of 5 stars",
    "content": "Me ha ayudado a  aclarar y desvanecer",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B072K1LNNY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "las  manchas oscuras de la piel, tiene una consistencia espesa lo que ayuda a no tener que usar mucho y así te rinda más el",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B072K1LNNY"
},
]