[
{
    "name": "        2pcs Hand-held Groove Gap Cleaning Tools Door Window Track Kitchen Cleaning Brushes(Green)       ",
    "stars": [
        "65%",
        "20%",
        "10%",
        "3%",
        "3%"
    ],
    "pid": "B072M2FBZG",
    "ratings": "5,977 ratings",
    "other_info": {
        "Brand": "Rienar",
        "Color": "-Green",
        "Handle Material": "Plastic",
        "Specific Uses For Product": "Bathroom, Window",
        "Product Dimensions": "8\"L x 3.5\"W x 0.55\"H"
    },
    "discount_price": "$ 4.99",
    "normal_price": "$2.50",
    "about_this_item": [
        " Narrow tufted brush on one end to sweep away loose dirt. Scraper on the opposite end to dislodge debris trapped in corners.  ",
        " This cleaning brush tool was designed to clean windows track, sliding doors and shower door tracks easily and quickly.  ",
        " The elevated Curved Handle, Has Built-In Finger Grips For a comfortable Hold.  ",
        " This gap cleaning brush has hanging hole can hang up and occupy less space.  ",
        " This magic window cleaning brush was 7.75 inches long; Color: Green; Qty: 2 Pack.  "
    ]
},
{
    "title": "Easy to clean small spaces",
    "rating": "5.0 out of 5 stars",
    "content": "Great tools for cleaning tight spaces and very reasonable in price.",
    "post_time": "Reviewed in the United States on April 26, 2023",
    "pid": "B072M2FBZG"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Super convenient product, really good for scrubbing tight corners and crevices such as windowsills, but I have noticed the bristles aren't very sturdy. Only used one of the brushes about ~5x total so far, cleaned the brush after each use and stored well yet the bristles are already starting to warp and weaken. Cheaply made product but a handy cleaning tool nonetheless.",
    "post_time": "Reviewed in the United States on May 12, 2021",
    "pid": "B072M2FBZG"
},
{
    "title": "Cheaply made but handy!",
    "rating": "5.0 out of 5 stars",
    "content": "Helps dislodge dried dirt in my slider door!",
    "post_time": "Reviewed in the United States on June 17, 2023",
    "pid": "B072M2FBZG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It does it’s job, it just doesn’t last long. I had a very dirty window track, with lots of stuff in the track for quite some time. After cleaning the whole thing the brush was done for. But it’s did what it’s suppose to do so no complaints. U get what u paid for!",
    "post_time": "Reviewed in the United States on September 2, 2021",
    "pid": "B072M2FBZG"
},
{
    "title": "Nice tool!",
    "rating": "5.0 out of 5 stars",
    "content": "Handy little brush from cleaning the runs of sliding doors. I work in a deli where our cold cases (containing the deli meats and cheeses) have sliding doors. Before buying, we really only used rags to wipe out the little bits of food that collected in the bottoms but using the brushes makes it 10x easier.",
    "post_time": "Reviewed in the United States on November 11, 2020",
    "pid": "B072M2FBZG"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This would be perfect if the handle were longer or elevated a bit.  I need to have room for my hand.",
    "post_time": "Reviewed in the United States on December 31, 2022",
    "pid": "B072M2FBZG"
},
{
    "title": "Good for quick clean up",
    "rating": "5.0 out of 5 stars",
    "content": "Ok",
    "post_time": "Reviewed in the United States on July 5, 2023",
    "pid": "B072M2FBZG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "They are softer bristles then I expected... I assumed that they were for cleaning the tracks not dusting. All in all they are good dusting brushes, I even use them on my keyboard works great.",
    "post_time": "Reviewed in the United States on May 24, 2020",
    "pid": "B072M2FBZG"
},
{
    "title": "Handy little brushes",
    "rating": "5.0 out of 5 stars",
    "content": "Lo compre  por que me ayudara a hacer mejor mi trabajo ,no lo he calado pero creo que funcionará",
    "post_time": "Reviewed in the United States on August 18, 2022",
    "pid": "B072M2FBZG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I didn't have any high expectations for these brushes, but I have kind of come to love them.  I keep one in the bathroom and one in the kitchen.  They are surprisingly sturdy and comfortable to hold.  The flat edge is perfect for cleaning in the window tracks and the brush is tough enough to allow for major scrubbing if necessary.",
    "post_time": "Reviewed in the United States on January 25, 2020",
    "pid": "B072M2FBZG"
},
]