[
{
    "name": "        Face Tanner – Self Tan Serum w/Hyaluronic Acid and Organic Oils, Self Tanners Best Sellers, Facial Sunless Tanner for Natural Sunkissed Glow, Fake Tan Moisturizer, 2.0 fl (Light to Medium)       ",
    "stars": [
        "62%",
        "15%",
        "10%",
        "5%",
        "8%"
    ],
    "pid": "B0731W4BMS",
    "ratings": "4,297 ratings",
    "other_info": {
        "Item Form": "Serum",
        "Skin Type": "Oily, Combination, Dry, Normal",
        "Material Type Free": "Chemical Free",
        "Brand": "GOLDEN STAR BEAUTY",
        "Product Benefits": "Hydrating,Revitalizing,Pores,Moisturizing,Nourishing,Rejuvenates,Anti-aging"
    },
    "discount_price": "$ 28.99",
    "normal_price": "$14.50",
    "about_this_item": [
        " Our self tanner for face will provide you with a luxurious golden bronze tan. It works as an unbeatable self-tanning moisturizer, leaving your face perfectly tanned, with absolutely no fake tan smell and no streaks. Unlike many other self tanners, it does not turn your skin orange. It has no oily feel and has perfect fade, giving you a striking appearance that will grab everyones attention.  ",
        " From now on, getting an even, enchanting face tan will be easy for you. By following the instructions from our brochure How To Tan Your Face you will be on your way to achieving the perfect natural golden tan. As simple as that.  ",
        " Elevate Care Of Your Facial Complexion: Apart from giving your skin an impressive natural sun-kissed tan, this sunless tanner deeply moisturizes, nourishes, and rejuvenates your complexion. The groundbreaking face tanner features anti-ageing, deeply hydrating, and revitalizing properties. It helps you slow down skin ageing, and improve your skin's tone and elasticity. It is non-comedogenic, so it doesn't clog pores and cause acne.  ",
        " Get ready for the greatest tan you have ever had. Our sunless self tanner always Works Like A Charm. If at any point over the next year you don't love our self tanning lotion, then contact us and we'll be happy to help you.  ",
        " Compromise For Nothing Else Than The Best: Made in the USA under strict quality controls and featuring organic, USDA certified oil and extracts, vitamin B5, aloe vera, hyaluronic acid, and intense moisturizers. Our facial sunless tanning serum is paraben free, cruelty free, gluten free, vegan friendly and dyes free.  "
    ]
},
{
    "title": "My favorite face tanner so far",
    "rating": "4.0 out of 5 stars",
    "content": "I have tried a new other products like this and this is my favorite. No issues with my sensitive skin. Not a hydrating product. Much like others, be sure to rinse your hands throughly if apply with your hands. I use one pump on my face and one on my neck. Two cons are strong scent of vanilla and packaging. The scent is better than most tanners but strong. The packaging is wasteful. I accidentally dropped the bottom and it broke. Then, I realized how big it is for little product. Wish it was smaller for the amount of product in it.",
    "post_time": "Reviewed in the United States on January 1, 2021",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was looking for a self tanner that would match my face to my self tanned body, not make me look patchy..clog my pores,..or leave me greasy and this is amazing!! I've been using this every other day since I got it and I haven't worn any makeup! The color is gorgeous and its so natural! Perfect for giving you a sun kissed glow.  You can put this on at the end of the day or in the morning before you leave and it develops beautifully. I wash my face and exfoliate pretty frequently so I understand it is going to wear off but it has very good lasting power. The best part is that there is little to no smell, and this does not leave any residue on your face whatsoever. Definitely worth it!",
    "post_time": "Reviewed in the United States on December 11, 2019",
    "pid": "B0731W4BMS"
},
{
    "title": "I really really really like this",
    "rating": "4.0 out of 5 stars",
    "content": "Used this once so far and it's nice. The color is subtle, but that is perfect in my opinion for the face. Huge color changes never work well on the face so I think it's perfect.  It spreads evenly (although I don't like that you can't see as you are putting it on, it does go on completely clear), and smells great. The pump bottle is perfect for a face product like this.  Definitely feels moisturizing, and I didn't have any issues with breakouts.  I will for sure continues using this product. .",
    "post_time": "Reviewed in the United States on March 5, 2021",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was a little worried that this would look way to orange on my pale face, but it worked great! After exfoliating, I applied the recommended amount of product onto the mini Golden Star mitt and applied it to my face before bed. The next morning my face looked tan, but not dramatically tan which I prefer. I am sure if I applied more I could achieve a darker tan. I really felt like I didn't need as much makeup with the tan which is nice!",
    "post_time": "Reviewed in the United States on November 16, 2018",
    "pid": "B0731W4BMS"
},
{
    "title": "Nice subtle golden tan- perfect for the face",
    "rating": "5.0 out of 5 stars",
    "content": "The smell is wonderful and there is no self tanner smell at all. I haven't been using the product long enough to notice any anti aging benefits, but I did notice that my face felt softer the next morning. I can't wait to see the next product they come out with for the face! I love all of these ingredients!",
    "post_time": "Reviewed in the United States on September 8, 2019",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Again, I can't judge on sensitive skin because I don't have it. Not sure why they insist on asking. Bottom line, it works really well but is still somewhat drying so you may need to wear moisturizer under it. It doesn't make it less effective, I've tried it both ways. It smells like Warm Vanilla Sugar from B&BW. I was a bit skeptical because the last time I ordered something that had a million great reviews, it ended up awful and magically disappeared because they had fabricated reviews. This is actually a really good product, and you get a lot of it, too. I've used it at least 4 times a week since I got it and it still hasn't dipped below the label line. I'm a fan.",
    "post_time": "Reviewed in the United States on December 2, 2020",
    "pid": "B0731W4BMS"
},
{
    "title": "Works on Fair Skin!",
    "rating": "5.0 out of 5 stars",
    "content": "I love this face serum! I'm usually conflicted when it comes to tanning my face because I don't like using the self-tanner that's intended for the rest of my body and using the same mitt to apply it to my face. This face serum comes out like a liquid and you only need a couple of drops! I apply it before bed and wake up with a beautifully tanned face. It is so easy to evenly apply and it's perfect for the winter when you're mostly worried about having a tan face! I haven't had any breakouts either and the serum is really gentle, perfect for sensitive facial skin.",
    "post_time": "Reviewed in the United States on February 17, 2021",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this self tanner!! I bought both self tanner for face and self tanner + mitt duo for body. The self tanner for face is more like a serum, which is lightweight and non-sticky. The self tanner for the body was more like a lotion, which I absolutely loved! Both glided on very easily and spread evenly. The mitt was perfect for spreading the product around and ensuring no missed spots or streaks. I did not use the mitt on my face, just body. The serum didn’t have much of a scent but the body tanner smelled like cocoa butter! Overall great product, especially since they are vegan & cruelty-free :)",
    "post_time": "Reviewed in the United States on June 12, 2019",
    "pid": "B0731W4BMS"
},
{
    "title": "I'm a real person and it actually is as good as the reviews imply",
    "rating": "5.0 out of 5 stars",
    "content": "The thing I’m most obsessed with about this face tanner is that I can put it on right before bed, then I wake up with a beautiful tan and I don’t have a mess at all on my sheets! I feel like a lot of tanners are hard to use on my face because I’m so fair that every imperfection shows, but with this face tanner I can spraky it into my hand and massage it into my face to make sure the coverage is even. This product doesn’t provide a super dark tan, which is perfect for me. It’s a goldy bronze color and I love that so far, it’s been really good on my skin. I have sensitive skin but haven’t had any issues with oil buildup or dryness. I absolutely plan to purchase again when I run out!",
    "post_time": "Reviewed in the United States on October 29, 2020",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This product is great.  It  even works great with my Retinol moisturizer, even though I have to reapply daily.  Trough the summer I used it over my entire face, it had very natural color, and my skin felt great!  I apply after I get out of the shower, and after toner.  I then do my morning routine not putting anything on my face for 15 or 20 minutes.  Currently, as I am not wearing makeup due to masks, and so (because I don't want my face darker than my arms, I use it on my cheeks in place of blush and hit the high spots on my forehead and chin!  I love it!  A staple on my makeup table!",
    "post_time": "Reviewed in the United States on April 14, 2018",
    "pid": "B0731W4BMS"
},
{
    "title": "I have tried a lot and this is the best brand",
    "rating": "5.0 out of 5 stars",
    "content": "I have history of skin cancer so I was on the search for the perfect self tanner. I purchased the face tanner from golden star beauty. I put it on the first night I got it just used in place of my pm face lotion, slept in it and woke up to a decent color. This is buildable, I used three straight days and looks like I went on a sun exposed vacation. Since then I have also purchased the body oil, I have only used that one night but it’s basicly the same I applied at night before bed and woke up to a nice color. There is no fake tan smell, does not leave skin feeling sticky like other brands, and no transfer of color to clothes or sheets. Best tanner ever and I hope they continue to make this for years to come. Customer for life here!",
    "post_time": "Reviewed in the United States on July 23, 2018",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely loved this face tanner! For all products by Golden Star Beauty - the smell is incomparable. Truly the best I have ever smelt for a self-tanner. It is a very lovely, sweet smell. The product is clear, so you do have to make sure you do not miss any spots. I have sensitive skin and I haven't had any issues with it at all! Every time I use it, I wake up with a wonderful glow! It isn't overbearing either. It is just the right amount to give you that \"golden\" tan! 10/10 recommend!",
    "post_time": "Reviewed in the United States on December 3, 2021",
    "pid": "B0731W4BMS"
},
{
    "title": "The Best Face Tanner",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great product for your face it doesn't go on really dark I put it on at night before I go to bed to give it time to get its color and it's not a very strong color at all it's just enough to make it look like you've got a little tan on your face I'm very pale it's very soft on your face and moisturizing this is my second or third bottle already. It doesn't turn orange. And actually I like to use it on my legs because it's not that strong and it works really well especially for us freckled women that we don't want her freckles to stand out if you just put one layer this on your legs it's perfect",
    "post_time": "Reviewed in the United States on October 8, 2020",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Iv been using self tanners for years. I recently purchased the face serum from Golden Star Beauty and I was amazed by how amazing the color developed! No orange tone at all. NO FUNKY SMELL. I’m a licensed Esthetician specializing in skin care so I was impressed to see that the serum contained hylaronic acid in it. This is an amazing ingredient to use on its own so finding it in my new self tanner was a huge plus. You have my word, you’ll love this product! I’ll be continuing to purchase this for as long as I can. They have many more products to choose from so I’m excited to try them all!",
    "post_time": "Reviewed in the United States on May 28, 2020",
    "pid": "B0731W4BMS"
},
{
    "title": "3rd bottle luv",
    "rating": "5.0 out of 5 stars",
    "content": "I LOVE the smell! And that's same a lot oh, I am very sensitive to smells and prone to migraines but the scent of this product is very light and non-offensive. I do use gloves to apply, but even still it gets a little bit on my wrist and you have to be really careful around your creases that's for sure. No matter what, it always seems to seeping to my fingernails, and it's really gross looking when the tips of your fingernails are orange. But it works really well and you can definitely build a tan just make sure you exfoliate first! The price seems a little steep at first, but the product does go a long way and you do get a lot of color out of even just one application, so it's worth it.",
    "post_time": "Reviewed in the United States on June 22, 2019",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like the amount of color that you get with one application. It goes on smooth and so far, no streaks or problems with the hairline. I am a blond with fair/medium skin. I do have a yellow undertone to my skin.  This product matches my tanned skin perfectly. My makeup looks better. I can go without makeup for casual days. I have been putting it on every 3 days to maintain.  I previously used the lotion brand that is supposed to build color over time. I never felt like I got any color with that product and it always smelled so bad that my husband would complain. NOT this!! almost 0 smell. Good color with one application. So happy I tried this one. I think I need the body product next.",
    "post_time": "Reviewed in the United States on October 7, 2019",
    "pid": "B0731W4BMS"
},
{
    "title": "AMAZING INGREDIENTS",
    "rating": "5.0 out of 5 stars",
    "content": "Highly recommend this face self-tanner:",
    "post_time": "Reviewed in the United States on February 5, 2019",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "-incredible smell, reminded me of coconut tanning lotion. I put it on before bed and the smell was so relaxing, like I was at the beach! No hints of the usual self-tanner smell.",
    "post_time": "Reviewed in the United States on March 11, 2021",
    "pid": "B0731W4BMS"
},
{
    "title": "Great product!",
    "rating": "5.0 out of 5 stars",
    "content": "-color was natural and no streaks. My complexion is on the more fair side so I prefer a more subtle color for every day, but you can easily build it to a more dramatic tan by using every night before bed.",
    "post_time": "Reviewed in the United States on June 22, 2019",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "-made my skin feel soooo smooth & soft, even better than some of my moisturizers (probably because of the hyaluronic acid, vitamin B5, organic oils, etc)",
    "post_time": "Reviewed in the United States on September 4, 2019",
    "pid": "B0731W4BMS"
},
{
    "title": "Luxury face tanner",
    "rating": "5.0 out of 5 stars",
    "content": "A nice organic facial self tanner. Contains great ingredients like hyaluronic acid, rosehip oil and vitamin b5,it is paraben free and vegan. It gives a nice light tan color with no orange undertones,it absorbs fast. Very nice packaging, the bottle is 2 oz,will last a long time. It has a slight scent ,but not overpowering.",
    "post_time": "Reviewed in the United States on December 6, 2022",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I only applied one coat and allowed the product to sit for about 20 hours with no water, and the color was slightly on the copper/bronze side but absolutely natural and sun-kissed. I am very pale, but I tan naturally and have a yellow/olive undertone so it works wonderfully on me. I sweat and exercise 1-2 times a day, and it disappears after 2 days or so, but it’s easy and quick to apply and pretty hydrating. It comes out as a Louis gel type formula, and I squirt it on my hands and rub evenly across my face, then wash hands. I haven’t quite figured out how to use my nighttime face masks and under eye serums, but I still use the same sunscreen, nightmmoisturizer, and gentle cleanser as I did before. Great product!!",
    "post_time": "Reviewed in the United States on January 30, 2018",
    "pid": "B0731W4BMS"
},
{
    "title": "Natural, effective, and no smell!",
    "rating": "5.0 out of 5 stars",
    "content": "I really liked this face tanner and will be using it again! The smell wasn’t strong or overwhelming and most importantly it didn’t break me out! I have pretty sensitive skin and didn’t notice a huge change in my skin which is nice! The color was perfect and not too dark!",
    "post_time": "Reviewed in the United States on January 31, 2023",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I just started self-tanning again after years, so their little booklet on how to self-tan was really helpful. For me, I felt like I only needed a few drops for my face and it feels very pleasant on my skin. I usually apply it overnight and it's really effective! I have very light skin so for me one time aleady gives me a sunkissed glow.",
    "post_time": "Reviewed in the United States on March 31, 2019",
    "pid": "B0731W4BMS"
},
{
    "title": "Really liked this face tanner!",
    "rating": "5.0 out of 5 stars",
    "content": "Honestly, I live in Florida and the sun is almost always available to me. But with my light skin, I get burned so fast. Also, my freckles come out like crazy and I get a really easily burned nose. So I think I'll stick to self-tanning, because it doesn't hurt my skin and gives me that tanned look.",
    "post_time": "Reviewed in the United States on March 23, 2021",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Facial Serum has a lot of great ingredients and my face felt hydrated and looked great right after application. The natural bronzed glow this gave me as it built up was beautiful. This was a bit complex to work with because you need to wipe away the product from certain areas of your face - lips, hairline, etc. - and you have to be careful not to take that too far or \"draw outside the lines\" when removing it. The Facial Serum tan lasted about 4 days on my skin. I do use facial cleansers and other products that may have caused this to fade faster than the Dry Oil product I used on my body.",
    "post_time": "Reviewed in the United States on May 19, 2020",
    "pid": "B0731W4BMS"
},
{
    "title": "Pleasant to use and goes a long way!",
    "rating": "4.0 out of 5 stars",
    "content": "Honestly if I could give this 100 stars I would. Absolutely fantastic product!! Made in USA, Organic, Cruelty Free and Vegan?! What more can you ask for! I’m very skeptical about self tanners but this one took all my worries away! Used it for the first time yesterday; I have a combination of oily and dry skin. It has such a light weight moisturizer feel which I love. But the actual results of my skin blew me away! Not only did I have a quick natural tan, but how healthy my skin looked and felt was mind blowing. Not to mention the smell was not that overbearing nasty self tanner smell. It had a light pleasant vanilla scent that didn’t last too long. I highly recommend!!",
    "post_time": "Reviewed in the United States on April 26, 2018",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am a repeat customer and bought again because I found the price more affordable compared to other brands. Organic is important to me. It also gets you dark fast, which is what I wanted. I wish it could literally be sprayed on your face like a fine mist but you spray in your hands and then run on your face. Also wish it wasn't quite so sticky afterwards (although it seems less this way than last time I purchased). Feeling skip the afterwards is important to me since I like to apply makeup right after. Overall very good.",
    "post_time": "Reviewed in the United States on June 27, 2019",
    "pid": "B0731W4BMS"
},
{
    "title": "Feels and looks great on the skin!",
    "rating": "5.0 out of 5 stars",
    "content": "First of all, let me say if you're someone who is often bothered by the fragrance that self-tanners have PLEASE try this tanner, the scent isn't overpowering but has a lovely fragrance. As for the application of the product, this was the first facial tanner I have ever used so although I don't have anything to compare it to however I was very impressed by the process. It has a gorgeous natural colour to it, and I personally love mixing it with my favourite moisturizer in the evening before bed because I wake up with a gorgeous natural glow, and it always for a very easy, smooth application!",
    "post_time": "Reviewed in the United States on February 20, 2020",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I will definitely be recommending this to any friends in the future!",
    "post_time": "Reviewed in the United States on December 1, 2021",
    "pid": "B0731W4BMS"
},
{
    "title": "4/5 stars",
    "rating": "4.0 out of 5 stars",
    "content": "4 stars! The self tanner is great! I love the glow / tan it gives me. It doesn’t have the artificial look that most self tanners leave. It goes on smooth and isn’t sticky feeling, dries quickly!",
    "post_time": "Reviewed in the United States on March 24, 2020",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve had the tanner for a while but only used it 1 or 2 times. The product is great + does the trick, but I couldn’t give it a full 5 stars because through my experience with the company I feel like if you had an issue with the product it would be a hassle to communicate with them.",
    "post_time": "Reviewed in the United States on April 15, 2020",
    "pid": "B0731W4BMS"
},
{
    "title": "A MUST HAVE! Where has this been my entire life?!!!!",
    "rating": "5.0 out of 5 stars",
    "content": "This facial serum is literally a dream come true! I had a natural looking tan that looked great even shortly after I put it on at night, and when I woke up in the morning, it was even more perfect. It smells like a natural vanilla scent, and you only need two pumps, so this bottle will last me last me a seriously long time! I’m on day 3 of just using that one application, and I still have a very natural looking bronze tan that is fading all at once and is not splotchy at all! I seriously could not be more impressed with this product, I’ve already purchased a second bottle as a gift!",
    "post_time": "Reviewed in the United States on March 2, 2020",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Such a great product! I was looking for a self tanning product that I could use during the winter months for my face and neck and would maybe be a little beneficial to my skin as well. The color is just right; one application was enough to give a little color without looking too drastic. I use a mit to apply which I'd recommend, and the consistency makes it very easy to rub in evenly. The best part by far is the scent. While it does have a smell, it does NOT have that fake tanner scent that everyone recognizes. I feel like that's so unheard of with self tanners. The scent isn't a chemical scent either. It's hard to describe but I would consider it fairly pleasant.",
    "post_time": "Reviewed in the United States on February 22, 2021",
    "pid": "B0731W4BMS"
},
{
    "title": "Great scent",
    "rating": "5.0 out of 5 stars",
    "content": "Using this product along with the mitt and body self tanner made my whole look come together. It was easy to apply and has lasted through a bunch of hot yoga and pilates sessions.",
    "post_time": "Reviewed in the United States on March 31, 2020",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love that there were 2 different products as we all know our face is way more sensitive to things than our body. I didn't break out or have major tanning liquid stuck in your pores.",
    "post_time": "Reviewed in the United States on June 26, 2018",
    "pid": "B0731W4BMS"
},
{
    "title": "Game changer for sure!",
    "rating": "5.0 out of 5 stars",
    "content": "The smell it didn't smell like the typical self tanners at all. This does not give you that at all, it almost smells like a coconut and vanilla lotion.",
    "post_time": "Reviewed in the United States on May 24, 2020",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's very easy to apply and does not turn your skin orange by any means so a major win win!!",
    "post_time": "Reviewed in the United States on May 18, 2019",
    "pid": "B0731W4BMS"
},
{
    "title": "Perfect Face Tanner!",
    "rating": "4.0 out of 5 stars",
    "content": "I was skeptical about tanning my face because I didn't want to break out nor did I want to look orange. I loved that it was a serum rather than a lotion because it felt lighter on my face and that it wouldn't clog my pores that much. The scent isn't overbearing at all - in fact the scent is hardly even there which is always great. If you follow the instructions, the application is seamless. It tells you to add it to the places that tan first naturally so your cheeks, forehead, and bridge of the nose. After you apply it, make sure to wipe it from your eyelids, acne scars, acne, eyebrows, and mouth since those will appear darker. I definitely see myself repurchasing this when I run out!",
    "post_time": "Reviewed in the United States on September 12, 2020",
    "pid": "B0731W4BMS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been looking for a tanning serum for several months, and this one seems to be what I was looking for. I was using another popular brand, but it was so oily the product would rub off on my clothes and did not stay on very long. I have only used it a few times, but it stays on, does not tub off, and builds up over time. My only concern is the directions state you should not wear any makeup over or under the product. I can see not wearing any before applying, but after it dries, one should be able to apply other products like any other serum.",
    "post_time": "Reviewed in the United States on June 27, 2019",
    "pid": "B0731W4BMS"
},
]