[
{
    "name": "        HATHASPACE Smart Air Purifiers - True HEPA Air Purifier, Cleaner & Filter for Allergies, Smoke, Pets - Eliminator of 99.9% of Dust, Pet Hair, Odors - HSP001-700 Sq. Ft.       ",
    "stars": [
        "77%",
        "14%",
        "5%",
        "2%",
        "3%"
    ],
    "pid": "B075ZZND8B",
    "ratings": "14,946 ratings",
    "other_info": {
        "Color": "White",
        "Brand": "HATHASPACE",
        "Product Dimensions": "8.9\"D x 8.9\"W x 22.2\"H",
        "Noise Level": "43 dB",
        "Particle Retention Size": "0.30"
    },
    "discount_price": "$ 149.99",
    "normal_price": "$282.99",
    "about_this_item": [
        " SMART FILTER FOR BEDROOM: Our 4-in-1 filter system targets pollen, dust, pet dander, VOC’s, smoke, and odors - the H11 HEPA filter captures 99.9% of particles down to 0.3 microns. Our lightweight device is portable, allowing you to improve air quality wherever you need it. Our smart air quality sensor & touch-screen display makes the purifier easy to use & adjust your settings, & also shows air quality information.  ",
        " EXCEPTIONALLY SILENT: Designed for quiet operation, making it perfect for use in bedrooms and living rooms. The purifier's efficiency in capturing dust and particles - see just how much our air purifiers for home can assist and support the body’s natural response  ",
        " EASY TO USE & INSTALLATION: Built to easily identify, access, and change your filters - our purifier comes with multiple fan speed options, enabling you to set the pace of air filtration to suit your needs. Included is a remote to easily adjust the speed to your preference and turn the light on & off when needed - with the auto mode as well to facilitate real-time adjustments based on your room's air quality, & ITS QUIET!  ",
        " REMOVE ODORS, SMOKE, & VOC'S: Both an air cleaner & odor eliminator, our air purifier features a unique honeycomb activated-carbon filter that absorbs odors, smoke, and VOC’s. With a state-of-the-art fan and motor, enjoy clean air delivered quietly and efficiently in your home, bedroom, office, kitchen, basement, dorm, apartment, or living room.  ",
        " FEATURE: Before using the Ionizer/Anion feature, be sure to clear the room of humans and animals and wait 30 minutes after completing before reentry. This feature should be used in unoccupied spaces only. Using the ionizer in an occupied space can cause irritation and injury.  ",
        " FIND RELIEF: Our purifiers come with a 2-year warranty, award-winning customer support 7 days a week, and the peace of mind with a brand you can trust. You can also find our replacement filters to ensure you have fresh air all year around!  "
    ]
},
]