[
{
    "name": "        Fullstar Vegetable Chopper - Food Chopper - Onion Chopper - Vegetable Slicer & Spiralizer - Veggie Chopper with Container - Kitchen Gadgets - Home Essentials - Kitchen Accessories (4 in 1, White)       ",
    "stars": [
        "73%",
        "15%",
        "6%",
        "2%",
        "4%"
    ],
    "pid": "B0764HS4SL",
    "ratings": "110,961 ratings",
    "other_info": {
        "Brand": "fullstar",
        "Product Dimensions": "8\"L x 2.99\"W x 4.48\"H",
        "Material": "Stainless Steel",
        "Color": "White",
        "Special Feature": "Multipurpose",
        "Recommended Uses For Product": "Vegetable",
        "Product Care Instructions": "Dishwasher Safe",
        "Blade Material": "Stainless Steel",
        "Item Weight": "2 Pounds",
        "Blade Length": "4 Inches"
    },
    "discount_price": "$ 29.97",
    "normal_price": "$49.99",
    "about_this_item": [
        " The Original Pro Chopper - Our superstar veggie slicer has been creating waves on TikTok! Simple to use, set up, and clean, save time and energy during meal prep with our OG vegetable chopper. Chop, slice, and dice your ingredients like a seasoned chef!  ",
        " Easy Meal Prep with Rust-Resistant Blades - Our vegetable chopper is perfect for anyone who wants to eat healthier but doesn't have a lot of time to spare. Dice potatoes, tomatoes, cucumbers, carrots, and more with the heavy-duty, rust-resistant blades. The 420 stainless steel blades retain razor sharpness for crisp, smooth dicing.  ",
        " 5-Star Design - With a soft grip handle made of long-lasting TPU, you'll enjoy more control over your chopping motions. The non-skid rubberized bottom of this BPA-free veggie chopper will keep it firmly in place on any surface, wet or dry.  ",
        " No mess and slips - our catch tray makes cooking so much more convenient, no mess and no messing around! It makes cleaning effortless and our non-slip base also makes your chopping that much easier. Plus the entire chopper is dishwasher-safe (top rack) .  ",
        " A Kitchen Essential - Whether you're a novice cook or a seasoned pro, the Fullstar Food Chopper is a must-have in any kitchen. It's versatile and easy to use. Please read the instruction manual provided with the Fullstar food chopper closely before use.  "
    ]
},
{
    "title": "Game Changer",
    "rating": "5.0 out of 5 stars",
    "content": "This little chopper has made food prep so much easier. It's ability to dice onions alone makes it worth it. But it also works on bell peppers, celery, cabbage, apples, and zucchini. It works on carrots too but only a couple of small pieces at a time and it takes a little more oomph. It works on the bulb of green onions but not the soft green tops. It does not work on green beans, and I didn't try it on broccoli because I think it would be a pain to clean. All of the other vegetables are easy to clean out of it. It comes with a brush to scrape the blades and a fork thing to clean the top. The top was a pain to scrape, but I really only need to do it once when I'm all finished. The chopper was smaller than I expected, but that actually works in my tiny kitchen. I just need to cut veggies into smaller pieces, but I still think it cut down veggie prep time by half. It's also just fun to use. I was almost sad the first time I used it because I ran out of veggies to chop. Time will tell if it holds up and worth the full price, but so far it's worth the sale price I was lucky enough to pay.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this bc we were having a party and I didn't want to cut onions for hours. I set aside like 3 hours for prepping veggies and was done in like 20-30 mins. I've used it on onions, cucumber, tomato, zucchini, squash, lettuce. Pretty much all the common salad veggies and it's been great. My husband hates prep work but now he's like raring to go to use this thing it's so easy. The little box is decent sized and will hold a decent amount. I got one with two dicer blades and both work great. They are very sharp tho! Only pick up by the plastic lip. I learned that the hard way. It seems like it will last. We've been using it a few times a week for about a month now. I wash it top rack in the dishwasher no problem. It did come with little cleaning brush thing and a device to get any veggies out that get stuck in the blade but I haven't needed them.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "My husband loves this",
    "rating": "4.0 out of 5 stars",
    "content": "This food chopper does an excellent job at cutting vegetables.  It's sturdy, made of quality materials, and comes with a assortment of tools.  I have been using this chopper to cut a variety of vegetables and have not been disappointed so far.  It's best to chop firm vegetables, e.g., onions, zucchini, etc.  Soft vegetables like ripe tomatoes, may not cut very well.  Another drawback is that the blades are difficult to clean -- food can get stuck between the blades.  I've attached 2 photos showing what remains after rinsing the blades when an onion and tomato were cut.  Also, if you're not careful, you may cut your fingers trying to clean the crevices.  The chopper in fact, cautions users to \"never touch blades with your fingers.\"  Getting the blades completely clean for example, when you want to store the cutter for a long time, may be painstakingly slow.  Finally, much downward pressure may be needed to cut firm vegetables -- this may be an issue for those with arthritis, pain in their limbs, or who are physically weak.  Overall, it's a great chopper and highly recommended to all.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love chopped salads but lack the patience to cut everything up with a knife.  This makes it faster, easier and fun.  I just throw slices in there and take out my anger and its gets chopped very easily into the container below.  I throw salad dressing over everything in the container and eat as is.  Easy to clean especially with the included tools.  Just make sure you clean after every use or at least rinse off all the food.  Otherwise might be pretty annoying to clean.  I didn't find the extra tools useful at all.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Excellent quality food chopper.  Generally works well and cuts well.  Difficult to clean.",
    "rating": "5.0 out of 5 stars",
    "content": "I love this chopper! I make chopped fruit and veggies for 4 parrots in the morning and it goes much faster than using a knife or smaller choppers. The holding container is a good size as well. The tools that are included make clean up a snap. A word of warning, when washing by hand, the blades are super sharp.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is super easy to chop off things with that machine. It is going to save you a lot of time and effort. But don't forget to cut onions or big vegetables into at least two pieces before using it with fine blade as it might require a lot of pressure from you. Cleaning is a bit of hustle but overall very satisfactory product.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Well Constructed and Great for Chopped Salads",
    "rating": "5.0 out of 5 stars",
    "content": "This has a been a game changer in the kitchen. I use it almost every time I cook. After an accident cutting onions, I needed something safer and this does the trick! You can cut everything super quick, uniform and easily. It is dishwasher safe and easy to store.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "When using my chopper was surprised at how hard it was to get my vegetables to go through. Even with sharp blades, it was a struggle. I even cut my vegetables down, still had a hard time and I was only doing onions that were sliced in half. I cut the onions even thinner, still has a hard time. I was using the one with smaller blades. When cleaning with the brushes, I could still see onions stuck to the blades. Ended up using the tip of a knife to get stuck onion off blades. I’ll let it soak in hot water next time. I didn’t want to dull the blades by letting it soak in water for to long. Another thing that was disappointing was the loud sound it makes once the vegetables cut through. BAM, so loud, I was scared I broke the thing. I saw a video of one purchaser put a whole onion through it, no loud sound once the whole onion went through. What I’m I doing wrong ? Things I like about the chopper is that it cuts the very in perfect little cube size, all the same size. I like it has a container that the vegetables fall into. I wanted so bad to give a five star review, but I can’t because of the encounters I experienced. Hopefully over time in using it, it will get better and I’ll get the hand of it",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Great chopper!",
    "rating": "4.0 out of 5 stars",
    "content": "I just prepped 3/4 lb baby carrots and a large red onion in under 4 minutes, and that includes peeling the onion and rough chopping into quarters. Took me less than 2 minutes to clean. Only other thing I used was a knife to cut the onion. Simple to use (although for harder things like carrots you'll need to hit it or have enough muscle to squeeze it down, but I was doing 4 baby carrots at a time). Changing blades couldn't be easier. Clean up is a breeze with the tools provided. No muss, no fuss, no cutting board or 20 minutes of cutting. And I can store the veggies in the container until needed. Fullstar also has covers for the catch bowl and I think I'll purchase them in the future. The only reason I gave a 4 out of 5 is one, I can't give 4.5 stars. Second, it's a shame that it doesn't come with a slicing blade, like if you want to slice celery or thin strips of apple or sweet potato for drying or potato for au gratan potatos. The egg slicer will only reliably slice soft things like an egg or a ripe avocado. Had it come with that slicing blade, the review would have been 5.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought the Fullstar 8 in 1 vegetable chopper:  I have now used the product a total of one time only, just once so far, but that was enough to realize that it's really a big time saver.  Sure, I could have done all of my potato dicing by hand, but this really made things a whole lot faster and easier, and that faster includes the little bit of clean-up time to hand wash the few pieces I used.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Very, very sharp!",
    "rating": "4.0 out of 5 stars",
    "content": "Use CAUTION.  I cut my finger on the blades when I tried to remove an onion that was stuck so please be very careful.  I now have a deep cut on the end of my finger that will take time to heal as I will probably keep bumping it by accident.  This is not the fault of the manufacturer.  They include a warning that the blades are sharp.  I found that the chopper required small pieces of onion and apple.  It was too difficult for me to force the top down otherwise.  So I still had a lot of cutting to do.  In addition it takes time to clean and repack all the parts, so I am not sure how much I will use it.  It does make very uniform pieces, which is good for apple fritters.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have never been willing to chop tiny vegetable pieces with a knife.  I saw a video with a recipe using this same chopper…. Cottage cheese, bell pepper, banana peppers, onion and feta….. and had to buy it when I saw the tiny pieces of peppers and onion, none of which do I want to eat a piece of, but combined in tiny pieces the taste is great!  This is a game changer for me.  We have 3 homes we travel to and I bought one for each house.  FUN to use!!!  Be sure to pound down hard with a “slam” on the lid to chop.  For goodness sakes, never touch those sharp blades.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Great price, works fantastic!",
    "rating": "4.0 out of 5 stars",
    "content": "I was reluctant to purchase yet another PLASTIC slice and dice as everyone of the past were more of a pain in the rear then just getting out the pairing knife, but i got to say this little gadget DOES work and fast you can go thru your veggies in a fraction of the time it takes to prepare by knife , all the little doo dads that come with it help with many other prep jobs as well, if i had to complain about anything is i wish they would figure a way to lock the top to the holding bin as it has a tendency to come off in a violent episode of slice and dice  HUMOR ,  i gave a four mostly cause of that and its a bit harder to clean esp mushrooms off the plastic block its got several grooves and catches them easily  they include a brush to use on it  but found a toothpick was faster  good luck  happy chopping",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wow!!! I liked this product so much, I bought each daughter one...and they like it too. My hands have gone arthritic over the years, but we're never too old to try something new.  It was a habit I found extremely hard to break....chopping, slicing, dicing anything by hand!  This chopper has saved my hands so much pain, it's kind of hard to say to what degree, how much. I do appreciate some of the new fangled products, though, such as this one. For the senior chefs out there....give this chopper a shot, it can't hurt (no pun intended).",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "FINALLY  something that REALLY WORKS",
    "rating": "4.0 out of 5 stars",
    "content": "Great for dicing veggies and more for large meals, but also can make myself a chopped salad with less dishes and utensils all in one container, and then just eat the salad out of the container! (Thank you @nutritionbykylie)",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These blades are SHARP, do not underestimate them. I’ve seen them cut through veggies, chicken, some nuts, and more. I’ve also seen them cut little tiny cuts in my fingers if I wasn’t EXTRA careful while cleaning. Don’t touch the blades directly for any reason, hold on to the plastic border.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Fullstar Vegetable Chopper, Slicer, Spiralizer",
    "rating": "5.0 out of 5 stars",
    "content": "My only complaint is that sometimes it can be hard to clean all the little crevices completely. The tools provided help a lot there, and save quite a bit of time, but there’s often some little bits of lettuce that I find left between the blades once dry. It gets clean in the dishwasher once I get the stubborn stuff off though.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Got this to replace an older model chopper by another manufacturer, I had several that broke. This is very solid and well made, multiple chopping and cutting options, easy to clean.  A real time saver in the kitchen. Blades are extremely sharp, which makes chopping a breeze, but you do need to be careful, you can cut a finger just by touching the blades. There is a clear warning right on the chopper.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Single serving chopped salad 😋",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this as a gift for a friend. They already had a similar chopper from Amazon (not sure which brand), but said that this one takes the cake! The variety of attachments makes the chopper especially versatile. If you're looking to save time in the kitchen or if you're a busy parent needing to feed a child, look no further. The two dicing attachments are great for cutting veggies for stirfry, the egg slicer is convenient for a salad, & the spiralizer is useful to make the viral cucumber salad. You won't regret this purchase!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My friend commented that they weren't particularly impressed how the attachments are stored. Also, some items are difficult to clean from the cutting tools (e.g., mushrooms). I'd stick to using this gadget for harder fruits & veggies.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Dices in record time!!",
    "rating": "5.0 out of 5 stars",
    "content": "I used this last night to chop a yellow onion, yellow and red bell peppers and celery. What would usually take me anywhere from 45 minutes to an hour took only 10 minutes! My prep time was a fraction of what it normally would have taken. It’s easy to clean with the tools that are included and you can store everything together in the basin. The blades are super sharp so use caution. The videos give lots of great ideas how to chop things like cilantro among other cumbersome vegetables. I may but an additional one as a gift for my best friend!",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love this thing, I could do without all the extra attachments to be honest, they are just something to have to dump out on the counter then put back in every time you use it. I do not use anything but the two dicing grids which work very well. I mainly use it for onions because I HATE dicing onions , no tears with this thing and very perfectly done every time, also is not too large so it doesnt take up a bunch of space. If you are a pro veggie chopper this is probably unessisary but for the average Joe this is pretty nice and saves time.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "works excellent for chipping onions or anything you need diced",
    "rating": "4.0 out of 5 stars",
    "content": "Love this chopper! I thought I was going to blow this off as some very dull little blade that I would be fighting with and spend more time cleaning it than it would take me to actually chop it myself, but I was wrong. Blades are very sharp and work very well to make short work of any dicing. As a colorguard school graduate, I always find gadgets like these is a waste of money, but I was proven very wrong. I was able to chop enough hashbrowns for our entire family of six in a matter of minutes. You can’t put the items in hole, there is some prep you need to do ahead of time, but even with that it makes it go much faster being able to just lay large slices inside and whack the top. That is the big key, you can’t just press you have to actually hit it! The variety of other items on the other hand feel like they’re a waste of plastic. Maybe other people will find a use for them, but I have barely even looked at them outside of the package. The extra cleaning brush is very useful for getting in between the little grooves to get bits of food out when washing and along the top tongues of the  Compression flap. The storage capacity is great, but if you are doing a high volume, we will need to empty it occasionally into a larger bowl, which isn’t a big deal. I do wish there was a size in between the very large chopper size and the small diced one.  They may offer a separate one, but I have not looked yet. Hopefully they come out with maybe a micro plane option as well so you can shave things like cabbage, brussels sprouts etc..",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought one of these off Temu (yes, not smart) and it wouldn’t even chop an onion and was so flimsy. This thing works great! The blades are sharp so be careful but it does what I wanted my Temu one to do. Alleviates time for me cause chopping and dicing for me takes the longest when cooking. Has good storage too!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Love the chopper! But do t get all the accessories",
    "rating": "5.0 out of 5 stars",
    "content": "I have been using this chopper for a year and if it broke tomorrow, I would buy another one in a heartbeat. For $30, it has saved me countless hours chopping and dicing. I am not at all sure that I can add much more info than others have stated about sharpness, consistency of size and ease, but it's all true. It does get things \"stuck\" occasionally but that's what the little cleaning brush is for. Love this gadget!",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I  just used my chopper for the first time and am quite impressed. I went thru 3 three big onions, three jars of pickles and 10 pounds of potatoes in about 30 minutes. I would like to pass on two items….when they indicate the blades are sharp, you need to believe it. I barely touched the blade on the small size grate and got a cut. Second, if you wish to dice, slice the item close to the same size as the grate and chop after…this make the dices very uniform in size in all dimensions. Very durable and simple. I will gift some to my cooking buddies.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Works great",
    "rating": "4.0 out of 5 stars",
    "content": "This is such a main to clean i almost prefer to just hand chop. But like the other night when we had stew, it helped make such quick work of chopping all the vegetables! I really do like it. Like I said just a bit of a pain to clean",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The chopper is easy to use,  holds quite a bit, has different attachments making it very versatile and is easy to clean with the brush included.  Definitely easier and safer than the big mandolin I have, which means I am using this chopper alot more.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "What a Great Tool!",
    "rating": "4.0 out of 5 stars",
    "content": "After looking at sooooo many different products and reading reviews, it seemed there weren’t really any good choppers out there.  One cooking article I read even said there aren’t any good ones, just a not terrible one.  Can’t remember if this was the not terrible one from the article, but for me it works.  It does require quite a bit of strength with some items (required my full arm on the top and applying as much weight as I could).  Could be it’s not supposed to cut green pepper, but I got it done.  I learned with the onion just to cut it up into smaller chunks and then I didn’t have any problems.  Yeah you’re still cutting the onion, but not as much as it takes to dice it all up.  Easy to clean in the dishwasher. The little brushes are handy getting skins and such off the cutting grids.  Haven’t tried the spiraling attachment yet so no feedback there.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Ordered this after watching a dietitian video. We all know we need to eat more vegetables but it is not always easy or time efficient to dice them up. She was showing the easy of chopping and dicing so I thought it would be worth a try.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "it really works",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product, we all see products that promise to be easy and work good but they don't.  This one does.  I've used it many times and it's so easy, no batteries, no plug, just sharp blades that will cut you if you touch them, which the directions say to be careful, it comes with little bottle brush tools to clean the blades.  I've cut tomatoes, onions, peppers and cucumbers , i would definitely recommend this product.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was skeptical that this would really be a good dicer.  I've tried many dicers in the past with none working very well.  I'm happy to say that this  is a great product.  It dices in a matter of minutes and it gets the entire onion.  You do have to cut the onion in quarters and dice.  I consider that a small price to pay to get the dicing done quickly and efficiently.  I'm so happy I took the chance and tried this product.  It's excellent",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Goodbye to crying when chopping onions",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve been looking forward to getting this chopper for while! It works perfectly! So much so that I wasn’t careful picking it up and accidentally gave myself a razor thin cut on the top of my finger. Those blades are legit!",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had avoided buying one of these as it seemed lazy but I have fallen in love with being able to quickly dice things up and having the handy container.  Still have to take out the cutting board to trim and cut things down small enough though.  Wish it had other cutting options.  Maybe other more expensive ones do.  May look into that someday.  For now this works.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Great Product! Cuts with Precision!",
    "rating": "5.0 out of 5 stars",
    "content": "This product does it all and does it well.  Very happy with it and will probably gift 1 or 2 this Christmas. Little bulky, but all the pieces fit in the holder neatly and has all kinds of uses!",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a game changer!! If you don’t have one you literally need one, it saves so much time while cooking. Super easy to use! I’ve had this item for 2+ years and it’s still holding up!",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Fits the bill perfectly",
    "rating": "5.0 out of 5 stars",
    "content": "I have wanted one forever and finally splurged and got all the attachments. The quality is great and I love that it came with different blades. It’s super lightweight but doesn’t slide around because of the grips on the bottom. I feel it’s a very safe product even when cleaning there is minimal chance for injury. Definitely recommend this product!",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "***updated review***",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "Company contacted me and offered full replacement, I just asked for a new blade and they sent me one. It has worked perfectly with the new blade. I’ve had no issues with it since. Company stands by its product and has great customer service, must have just been a faulty part. I upgraded my rating. ***",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought based on all the reviews, but the materials are cheap and parts of it not secure. The metal blades on the small dicer bent after a few uses. This wasn’t anything big, it was a chopped down onion of appropriate size for the dicer. Two of the blades bent, causing it to be completely useless. Things also can get stuck in the blades, so it can be tedious to clean sometimes. Basically wasted my money unfortunately.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "I have been putting off buying this and found one cheaper at Aldi. The one from Aldi broke after 3 uses. But this one has better features and chops so much easier without having to use as much force. It’s perfect for dicing veggies! And easy to clean",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It does chop veggies ok, but my husband had to do the pushing because it’s hard for me.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Chopper",
    "rating": "5.0 out of 5 stars",
    "content": "I have the only use this to chop thus far, but I’m telling you this thing has every option. You can imagine so far. I love it.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love my veggie chopper, it actually has made me eat more vegetables because I don’t have to deal with standing there and cutting them up individually and spending so much time in the kitchen. This makes it so simple that you just wanna throw it together real quick and you’re done. I use mine for a lot of things not just vegetables but fruit too. You can’t go wrong by this.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "So many options!!",
    "rating": "5.0 out of 5 stars",
    "content": "I started canning this year and didn’t make this purchase until the end of my growing season. Huge mistake. I was able to dice so quickly it turned my prep time in half. I was able to make salsa in record time!!!",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Seems very durable, the blades come out for easy cleaning also which is awesome, and honestly just a fantastic purchase all around.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Veggie chopper",
    "rating": "5.0 out of 5 stars",
    "content": "LOVE this chopper. Saves me so much time, especially on French fries. Has a harder time cutting carrots and sweet potatoes, so I just put those veggies in the clear plastic base and microwave them for about 45 seconds, just enough to make them a little softer. Then they chop like a dream.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve had other brands of this similar product but this one is better quality and cuts my kitchen prep time to minutes instead of hours!!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Game changer",
    "rating": "4.0 out of 5 stars",
    "content": "The Fullstar vegetable chopper makes chopping, dicing, and other vegetable operations much easier. You can easily swap out the blades and there are many options. I can dice, chop, etc. without this item and it takes me more time. I highly recommend this item.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Update:",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "This thing is a time saver",
    "rating": "5.0 out of 5 stars",
    "content": "I love this gadget way more than I thought I would. Thank you to the influencer that caught my attention with their video of meal prep with this bad boy. No complaints....just know that it's very sharp and if you touch the blades...even lightly...you are going to get cut. Be careful of it slipping out of your hand during washing and you trying to catch it....'cause this little guy is as sharp as a samurai sword. Very worth the investment. If you like to cook, and you are frequently chopping stuff....this is what you want to ask Santa for this year.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Works great, but VERY sharp. Sliced my finger open when trying to clean with a very slight swipe across the blades. That is not the reason for the star removal though. Used primarily for onions and bell peppers the chopper produces uniform pieces quickly. Also used for potato's to great affect.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Fabulous Chopper",
    "rating": "4.0 out of 5 stars",
    "content": "Made of high quality plastic casing, but after 2 months it has started to crack. The chopper needs to be slammed down to slice through produce and creates high stress on the plastic case and handle. Chopping into smaller pieces before using the chopper sort of defeats the purpose of having a chopper.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, good product but should be made with stronger materials.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Chopped summer squash, onions, bell peppers, fennel bulb",
    "rating": "5.0 out of 5 stars",
    "content": "I decided to treat myself to a vegetable chopper as I am working on adding more vegetables to my diet.  Prime Days had the 4 blade Fullstar Vegetable Chopper at a price almost half off the usual price.  So I splurged.  Chopping all the vegetables I eat takes a lot of time but not with the chopper. As soon as the chopper arrived I brought out my vegetables to try it out.  I used the larger holes for all the above.  Summer squash and bell peppers were so easy, onions needed to be sliced a little thinner before cutting, the fennel bulb was tough but actually not too bad.  Cleanup was a breeze with the provided tools. My only caveat is that 4 blade unit does not include a way to slice.  I haven't used the included spiralizer, it's not something I probably will use and would rather have the mandolin slicer instead.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This unit will certainly turn out to be a real time saver.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Y'all...Just get it. Do it.",
    "rating": "4.0 out of 5 stars",
    "content": "This is a stapleeeeee in my kitchen!! It has cut down prep time like you wouldn't believe. Whether it's meal prepping or just cooking or whatever your chopping needs are, this is the solution. I've used this for years and the blades are still sharp and she works like a charm. I make a lot of dips and salsas so to be able to cube up a bunch of veggies so quick and throw everything together is a life saver.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very good quality product, easy to use and all the different blades comes in handy, very reasonable for the quality of the product",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Very good and handy kitchen gadget",
    "rating": "5.0 out of 5 stars",
    "content": "This thing is the greatest product I wish I would have bought one long ago. Chops, bell pepper and onion great and I love that you have two different size options.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This thing is far more durable and sharp than my previous salad shopper. I love it. I would give it five stars, but there are larger cut options that I had with my previous salad cutter that I do not have with this one. Some of the other amenities are nice, but I don’t necessarily need my salad cutter to also be a juicer and would’ve preferred two more trays with larger holes so I could do things like veggie straws or bigger cuts of cucumber.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Better Than I Expected",
    "rating": "5.0 out of 5 stars",
    "content": "I have only used the chopper function of this wonderful item but even if that's all it does, it was more than worth the purchase price.  It chops so quickly and completely and the cleanup is surprisingly fast!",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Worked well. Required some force to chop hard vegetables.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Worked well but broke after 2 years",
    "rating": "5.0 out of 5 stars",
    "content": "Base broke after two years. Company would not replace the broken part.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Absolutely love this chopper! It has made such a huge difference in time when making salads and such. I have used tomatoes, avocados, pickles, peppers, & jalapeños so far.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "What a time saver!",
    "rating": "5.0 out of 5 stars",
    "content": "I used it to make salads. Next time I’m making potatoes for breakfast. Ease to use and simple to clean.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love that all my cuts are uniform.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Perfect making salad so fast",
    "rating": "4.0 out of 5 stars",
    "content": "No tears with onions. Perfect cuts for potato",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "salad and much more!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Cuts are great",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this to see if it would help minimize prep time for meals.  I Love IT!  I am thinking they would make a cool gift!",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Came partially preassembled but I'm kinda afraid to use it cause it doesn't seem very sturdy. Looks nice though.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "BEST chopper I have ever used!",
    "rating": "5.0 out of 5 stars",
    "content": "I do a lot of canning and chopping peppers & onions for salsa.  I've used other choppers without much success, but this one is great!  It chops easily through peppers, onions, potatoes & apples.  I also ordered extra chopping inserts for future use when the first ones get worn.  Great product!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We use everyday for dinner. Super sharp and easy to use. Be careful when washing so u don't touch sharp surfaces. It will cut skin easily.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Use it everyday",
    "rating": "4.0 out of 5 stars",
    "content": "I really like using this because it makes chopping up my veggies so much easier and faster. I only use one of the blade attachments, but that one I've been using works great. It's actually kind of difficult to clean though. I wash it by hand and the food often gets trapped in the edges of the blade and the top part of the chopper so I always go in with a knife or something flat to get the food out and then wash with soap. I've never tried putting it in a dishwasher, so I don't know if that would work better.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Not sure how long this chopper has been available but I wish I'd bought it on the day it came out. It makes dicing and chopping a breeze, so efficient and easy to use.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Good!",
    "rating": "5.0 out of 5 stars",
    "content": "I read reviews about using cilantro and green onions and how horrible it was to clean ! Of course , what did you expect !",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is made for veggies and fruits not herbs ! Just use your brain and will work great , and yes it does need a bit of force but I am not that strong of person to begin with . So if I can do it anyone can !",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "This chopper is amazing",
    "rating": "5.0 out of 5 stars",
    "content": "It is the best chopper we have ever had.  We use it at least twice weekly for a variety of chopping, dicing and slicing.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works great. Some things do have to be sliced thinner before putting it into the chopper.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Does the job",
    "rating": "5.0 out of 5 stars",
    "content": "This chopper makes food prep so much easier.  I have used it for just about every vegetable and several fruits as well.  The only thing I had difficulty with was when I did not slice sweet potatoes thin enough.  Once they were cut to under a 1/2\", the chopper easily cubed them.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have used these tools before and I really like this one. It has the Hand slider so you are not able to cut your finger on the slicer. I do a lot of canning and the ability to be able to chop veggies quickly is what it is all about. I highly recommend this tool for any one.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Mega Chopper",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and saves a lot of time for those with less-than-professional knife skills.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great chopper - time saver and everything chops evenly. Unfortunately I had to give it to my daughter as I have a bad shoulder and this requires some strength.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Handy Dandy",
    "rating": "5.0 out of 5 stars",
    "content": "Indispensable when making soups or stews. But, watch your fingers… Those blades are super sharp!",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My husband lives this gadget. Had obe forever and the blades wore down. Great find",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "This thing is the bomb!",
    "rating": "5.0 out of 5 stars",
    "content": "I recently purchased this chopper, and it has been such a time saver!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love to have small bits of onion and this chopper works great!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Second Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Have bought several of these for gifts and for myself fast and easy.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this product saves a lot of time with chopping vegetables",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Love It!!!",
    "rating": "5.0 out of 5 stars",
    "content": "El mejor que he tenido tiene para varias funciones lo recomiendo",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I used it to chop up salsa vegetables, it worked great",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Great in the kitchen",
    "rating": "5.0 out of 5 stars",
    "content": "Does what it says. SUPER sharp. Be careful cleaning it.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This food chopper is really helpful in the kitchen.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Really helpful in the kitchen",
    "rating": "5.0 out of 5 stars",
    "content": "This chopper is Awesome. I would buy it again",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This veggie chopper is perfect! I 100% recommend.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Fullstar Vegetable Chopper - Food Chopper -",
    "rating": "5.0 out of 5 stars",
    "content": "I l love the way it works real fast",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have a garden and grow enough bell peppers to freeze for a year.  This sturdy device cuts them in perfect size for adding to recipes. Blades are very sharp so don’t touch them when cleaning.  Comes with many different blades for different foods like potatoes, boiled eggs and carrots.  Device has a rubber bottom to keep it in place making it sturdy when chopping.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Great for making salads!",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve been using this a while, and there’s nothing better to chop onions with than this. Saves your eyes by making it a much quicker job.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Life changing, buy it now.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Chops good",
    "rating": "4.0 out of 5 stars",
    "content": "This product exceeded my expectations, being a professional chef I work with commercial grade equipment all day long so, I wasn't expecting this chopper to do more than dicing soft vegetables like tomato, bell pepper etc. BUT...this product can do much more than that, hard rrots like beets, yam etc. The blades are razor sharp and the plastic is strong, not flimsy. So I can tell that this chopper can take a beating. Cleaning is easy too.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0764HS4SL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A wonder in the kitchen",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0764HS4SL"
},
]