[
{
    "name": "        Himalayan Salt Scrub Face Foot & Body Exfoliator Infused with Collagen and Stem Cell Natural Exfoliating Salt Body Scrub for Toning Cellulite Skin Care by M3 Naturals       ",
    "stars": [
        "66%",
        "14%",
        "9%",
        "4%",
        "7%"
    ],
    "pid": "B076DSRB6B",
    "ratings": "47,253 ratings",
    "other_info": {
        "Brand": "M3 Naturals",
        "Item Form": "Powder",
        "Skin Type": "All, Combination, Sensitive, Dry, Normal",
        "Product Benefits": "Exfoliating",
        "Active Ingredients": "Collagen,Stem Cell,Himalayan Salts,Aloe"
    },
    "discount_price": "$ 25.81",
    "normal_price": "$2.15",
    "about_this_item": [
        " M3 Naturals Himalayan Body Scrub! Enjoy the best exfoliating experience not only as a body scrub but also a facial scrub, hand scrub, or foot scrub. Moisturizing and rich in antioxidants, our Himalayan salt with Jojoba oil will help restore your natural skin while scrubbing away unwanted toxins and dead skin cells! *  ",
        " Exfoliating & Moisturizing! Infused with Collagen and Stem Cell our Himalayan salt will take your skin regimen to the next level providing a boost in natural collagen production and increasing skin cell longevity. M3 offers a powerful line of scrubs women including that delivers unmatched anti-aging skin results. *  ",
        " A Must-Have Scrub for All Ages! Whether you choose to use our natural Himalayan pink salt as a body scrub or face scrub, our unique blend of ingredients will help reduce the appearance of acne, cellulite, blackheads, wrinkles, fine lines, dark spots, shaving bumps, spider veins, blemishes and more! This skincare product is the perfect bonus to your pedicure kit for an at-home foot spa to enjoy yourself or as a relaxing gift. *  ",
        " Spa Quality Results! Detox and polish your skin by gently removing unwanted toxins from your pores, adding moisture, and balancing systemic pH. A top-quality pore minimizer that revitalizes healthy skin and works to maintain glowing results! Replace your unwanted skin scrubbers with your new favorite body exfoliating scrub. *  ",
        " Made in the USA! M3 Naturals is proud to provide men's and women's beauty products with the highest quality natural ingredients that are not only cruelty-free but made right here in the United States of America. *  "
    ]
},
{
    "title": "Nice product",
    "rating": "5.0 out of 5 stars",
    "content": "I have very sensitive skin and the product burned a bit. The first time I used it, but I added more water and it was much better. I actually like it a lot and it is a great exfoliation. Good value for the money. Just make sure you add enough water to the mixture if you have sensitive skin.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My skin feels so much smother after I use this,  the smell is pleasing, and I just can't say enough good things about it.. the only negative is I use to much, so it won't last long.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "This stuff is amazing",
    "rating": "4.0 out of 5 stars",
    "content": "I picked up the Turmeric scrub after using the Superfood scrub for over a year and, for the first time in my life (I am 39) experiencing a clear face with absolutely no acne or blemishes. A week without the Superfood and the blemishes started to return. Unfortunately, Superfood did not pop back up as an available option here, so in desperation I read the ingredients on all other scrubs by M3 and picked the Turmeric. It burns my face, and because of the ingredients and smaller coarse/exfoliating particles, it does not easily move across the face to effectively exfoliate the way the Superfood did. I will say that it moisturizes better, but I have a fragrance-free light facial lotion for that and believe that, overall, this product just won't replace what I came to enjoy in the Superfood blend. Such a bummer, now I am on the hunt once again to find a product that will help with breakouts.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s hard to believe that a black, gritty product would leave skin so soft and smooth, but it does.  Indulge yourself and reap the benefits.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Missing the Superfood Scrub",
    "rating": "5.0 out of 5 stars",
    "content": "Leaves my face, & body feeling great. Don’t let it get In your mouth while washing your face though, it tastes awful",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This might not be a product made for me as a 28 y/o man but it seems to work.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Goes on tough, leaves skin soft",
    "rating": "5.0 out of 5 stars",
    "content": "Not a fan of the smell. Maybe I got a bad batch or it \"expired\" (bought mid April) but I don't find the smell very pleasant. It's hard to describe. It's not a terrible smell but I find myself holding my breath when using it, however it could just be me. The scrub seems to be quite abrasive when I use it and cleans my face really well. Along with a change in diet and regular exercise, I've noticed less acne and breakouts.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "For the men, I'd highly recommend you do not use this scrub right after shaving your face. I've made that mistake and it REALLY BURNS. Way more so than other exfoliation scrubs and face washes.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Leaves your skin feeling great",
    "rating": "4.0 out of 5 stars",
    "content": "Overall it's a decent product that seems to work well. This just might not be made for me is all due to the cons I've described.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It's a little rough for your face but I love to use it on my body, feet, and lips.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Seems okay",
    "rating": "4.0 out of 5 stars",
    "content": "This scrub has got good grit. Easy to apply and use and rinses very clean. A little seems to go a long way. I only knocked off a star because I don't care for the smell. It's not a strong scent but it was enough to make me wrinkle my nose at it.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Personal use for gentle exfoliation",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Nice product",
    "rating": "5.0 out of 5 stars",
    "content": "Smells so good. Makes my skin feel softer",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Feels so good on your legs.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Very nice on my skin",
    "rating": "4.0 out of 5 stars",
    "content": "Helps a lot with ingrown hairs on your legs and such.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Do it before you shave to clean your leg.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Dont eat it lol jk",
    "rating": "4.0 out of 5 stars",
    "content": "I bought it primarily for my face. I will use it for all over on occasion because using it all over daily would have you going through a jar quickly and it is too expensive for that. With that said, one would ask if it is actually worth the money. I would say, so far, so good. My face and all areas on which I have used it are quite smooth. Some areas are smoother than before, which is why there is a great possibility of me making this a regular purchase.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I like but wished it had more turmeric.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Leaves you smooth",
    "rating": "5.0 out of 5 stars",
    "content": "I use this scrub for a month. And it really clean my face and body . It got it soft and feeling smooth.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love how my skin feels after my shower. Takes a bit to rinse off so it’s not too oily, but worth it. I don’t use it on my face, I prefer product made specifically for face care. Highly recommend for a body exfoliating treatment at least once a week and don’t forget the feet!",
    "post_time": "Reviewed in the United States on February 28, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Works but not a fan of the smell",
    "rating": "4.0 out of 5 stars",
    "content": "The scrub is actually white in color. It doesn't have any added fragrance so the scent is not the most pleasant. Smells like oil basically. It scrubs well and rinses easily.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Is sure to get your skin nice and smooth.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Nice and gritty",
    "rating": "4.0 out of 5 stars",
    "content": "Leaves a slippery surface due to the oil.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I personally don’t like to use hand lotion and be all slippery. For example.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "It works well",
    "rating": "5.0 out of 5 stars",
    "content": "For my body or face it’s okay.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It smells good and made my skin softer after using it just once. Only thing I dislike is that I think there could be more in the jar.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "works well, smells awful...",
    "rating": "4.0 out of 5 stars",
    "content": "I like the way it works, but it smells so so bad. I don’t know if I got an old jar or something, but I have to hold my breath when I use it.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve really enjoyed using the Arabica coffee scrub! It is very hydrating, gently exfoliating leaving my skin with a polished glow. Love the coffee smell as well. Must have for my self care routine. You will not be disappointed!",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Hydrating Scrub",
    "rating": "5.0 out of 5 stars",
    "content": "Upon reading many of the reviews I have noticed everyone complaining about the amount in the container. The product is 340g by volume, and after putting it on my scale the weight is 407g. I say all of that to say that the amount is accurate as it is packaged by volume not amount, the photo is only for promo. How appealing would it have looked half empty?",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "On another note I look forward to trying this product, the texture feels nice and sandy which is perfect for getting deep into those roots.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Scrub",
    "rating": "5.0 out of 5 stars",
    "content": "This is wonderful!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Does a great job cleaning my feet...especially removing dead skin for replenishment",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Super clean",
    "rating": "5.0 out of 5 stars",
    "content": "doesnt dryout fast, keeps me moisturized. smell isnt overpowering, smells like citrus",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love everything about this scrub. I love the grapefruit smell and it leaves my skin beyond smooth. As someone who does have moderately sensitive skin it also was gentle! I will continue to purchase when I run out!!!!",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "moisturizing",
    "rating": "4.0 out of 5 stars",
    "content": "I haven’t used this consistently but each time I do, it clears my face and makes it smooth.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Really great scrub and leaves your skin feeling very soft",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Soft skin",
    "rating": "4.0 out of 5 stars",
    "content": "Me ha gustado mucho este producto, lo conocía de antes y me encanta lo suave que deja la piel, se reflejan cambios desde la primera semana y el el vendedor tiene buen trato con el consumidor",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was ok.I may need to use longer.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Worth it",
    "rating": "5.0 out of 5 stars",
    "content": "The exfoliating properties of this scrub are outstanding. The natural exfoliating salt works wonders in removing dead skin cells, leaving my skin feeling incredibly smooth and rejuvenated. I’ve noticed a significant improvement in the texture of my skin on my face, feet, and body. It effectively unclogs pores and helps to clear away any rough patches.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The scent of the scrub is refreshing without being overpowering. It has a pleasant, clean fragrance that makes the exfoliation process even more enjoyable. The texture is just right—not too abrasive but gritty enough to provide a thorough exfoliation. It rinses off easily, leaving no residue behind.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Love this stuff",
    "rating": "5.0 out of 5 stars",
    "content": "It does a great job of deep-cleaning your pores. I am a fan!",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Sadly this arrived slightly broken, meaning there was no liquid left in the jar. I thought I’d have to add some olive oil or just use it as a dry scrub, but leaving it for a couple of weeks, with the lid tightly fastened, helped. It leaves your skin feeling lovely and smooth. If it hadn’t arrived damaged, I would have given it five stars. I’ll buy again. Hopefully next time it’ll arrive intact.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Lovely scrub",
    "rating": "5.0 out of 5 stars",
    "content": "Very since I brought this product I’ve seen a huge difference with my skin . It’s soo much smoother & glowing I use it on my face as well. Definitely will be buying another one .",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I didn't like that the jar leaked the almond oil while in transit. Somehow the lid wasn't tight enough. Otherwise, the product would have five stars.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Good to use",
    "rating": "5.0 out of 5 stars",
    "content": "It really works.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Leaves skin very smooth",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "My Jar Was Ajar When I received it",
    "rating": "3.0 out of 5 stars",
    "content": "Container came and was very greasy so it must have been leaking. The container was still greasy after I cleaned it but opened it anyway and of course it slipped from my hands as I pulled the inner cover off it and I lost a bunch of it to the floor of my bathroom but that's on me I should have returned it for leaking.  The product overall was okay; didn't notice any difference after using it.  Didn't seem any better than any other similar product I have used (for less $)",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Also, just read something about stem cells on the Amazon description (that I didn't notice when I purchased) and it's not listed on the label of product.  Not sure what that is !",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "It leaves your face really smooth and clean.",
    "rating": "5.0 out of 5 stars",
    "content": "Love the bath salt but needs to be packaged so the oil doesn’t leak out. It has happened both times I have ordered it",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I used to purchase a salt scrub @ World Market until it was no longer available.  I was genuinely happy to try out this salt scrub. It leaves rhe skin soft & silky! My skin feel nicely hydrated  during these hot summer months.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Weird smell",
    "rating": "3.0 out of 5 stars",
    "content": "First time trying this brand coffee scrub purchased after readying reviews. There is no coffee smell at all. I looked forward to that most. After one use skin feels ok will use until gone. But will be looking for another brand to try.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Was really dried out had to add water",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "So So",
    "rating": "5.0 out of 5 stars",
    "content": "Makes my skin fresh and brand new",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This awesome scrub, absolutely stands second to none, to the multitude of scrubs I've previously used throughout my life. I have no idea what the \"secret ingredients\" are, but whatever is in this round container makes my skin do the happy dance each and every time I treat it to the aggressive exfoliation regime of the devil. And the results are nothing short of remarkable. My skin feels like it's spent an entire day at the world's finest spa, and I haven't even left my bathroom. If they sold this scrub in 55 gallon containers I'd buy 2, so I would never have to contemplate what if, someday, for whatever reason, it disappeared? Oh H.LL NO!",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "New skin",
    "rating": "5.0 out of 5 stars",
    "content": "At first I was not impressed. It looked liked someone just open a bag of brown sugar and put it in a jar.. There was no oil there was nothing it was extremely dry. But I use it on my skin and after washing it off my skin was moisturized and smooth so it actually redeemed itself.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "So I was a bit skeptical about this stuff at first. Overall I really like it and the only con may not apply to others, but it still bears mentioning and knocks a star off for me.",
    "post_time": "Reviewed in the United States on December 20, 2019",
    "pid": "B076DSRB6B"
},
{
    "title": "WOW! Color me impressed!",
    "rating": "3.0 out of 5 stars",
    "content": "Cons",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "-Maybe it's my skin type or something, but whenever this stuff gets on the back of either hands (and if you use it while showering like I do, it will get all over your hands) it causes an irritating/stinging sensation. Kind of like a light rash. It's bearable now, but when I first used it, I got a bit worried it wouldn't go away (It goes away in a couple a minutes after you wash it off thankfully). This happens sporadically now, but during the first couple of weeks it happened every time. I'm guessing it's the salt in it (it has dead sea salt) as some parts of my skin hates salt water with a passion.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "????",
    "rating": "3.0 out of 5 stars",
    "content": "The back of my hands get dry easily, so again that may have something to do with it (shrugs). Luckily, it doesn't do it to my face (what I use it for exclusively) but your mileage may vary.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Pros",
    "post_time": "Reviewed in the United States on January 27, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Jar comes 2/3 full",
    "rating": "3.0 out of 5 stars",
    "content": "I received my body scrub this morning and have not yet opened it. For $25 you do not get a lot. The jar is about 2/3 full and hits across the M3 Naturals logo. The product is heavy and is sold by weight. If using on your body and not just your face it will not last long. I’m looking forward to trying it and hope it is effective for the price paid.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Moisturizes well, exfoliates well (from what I can tell), smells like those old sugared orange candy slices. Overall not too bad. Will repurchase until I find a better alternative",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Very nice, smells like orange candies from grandma",
    "rating": "4.0 out of 5 stars",
    "content": "Yay! It wasn't cracked although the delivery person placed it in the rain",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This stuff is amazing - until recently I didn't know you're supposed to exfoliate before shaving but after one use of this I noticed an immediate difference.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Aroma is nice",
    "rating": "4.0 out of 5 stars",
    "content": "I don't have all the cherry spots/chicken skin legs like I did, my leg hair takes a bit longer to come in, my body is SUPER smooth for days, and the scrub itself is gently abrasive - it doesn't hurt to rub it in and i feel absolutely relaxed afterwards.",
    "post_time": "Reviewed in the United States on August 23, 2020",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have minor-to-moderate sensitive skin and even with using shaving creme I'd have razor burn but this product has given me no issues whatsoever.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "I am sooooo soft",
    "rating": "3.0 out of 5 stars",
    "content": "I use it once a week during my \"Everything\" showers and after three uses it's going to have a permanent spot in my bathroom.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "So, ad others have pointed out, the product definitely does not arrive looking as moist ad it does in the pictures. I compared it to the scrub I have from a nationally recognized body product retailer and immediately started adding coconut oil. But, after a out a tablespoon or so, I stopped myself. I questioned if maybe there was a reason it was made that way. I decided to try it out and compare the results of the two. I started scrubbing with the M3, after a workout, and almost immediately noticed a lemongrass scent fill the shower. But it was not heavy and did not linger. I don't mind lemongrass but some people might find that upsetting. The scrub goes on just like any other. As a matter of fact, since it was drier, I think I noticed the crystals/grains more. After drying off, I noticed my skin felt VERY nicely moisturized. It's hard to describe but it was not an oily feeling as some scrubs give, just a pleasent sense that the moisturize was there and working on my skin, so a lotion would not be necessary. Also, I didn't notice any fragrance of lemongrass clinging to me. I like the lack of a scent because it allows me to perfume  my skin the way I would like afterwards. Also my bathtub didn't seem oily afterwards; a big plus for cleaning up. Overall, I felt very good, kind of rejuvenated, after using it.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Give it a try before judging it due to lack of oil",
    "rating": "3.0 out of 5 stars",
    "content": "In comparison, next time I worked out, I used my other brand of scrub. It has a nice Lavender and Sandalwood sent that lingers. It has lots of oil and you definitely notice it as you scrub your body. I got out of my bath gently surrounded buy it's relaxing scent. After drying of I noticed my skin felt highly moisturized. But also that if I rubbed my fingers against it, I felt the oil was getting on my hands too. Only very slightly mind you, I didn't feel greasy or anything. Just that maybe there was a thin layer of oil lingering on top of my skin. Also my bathtub definitely looked like it was covered in oil. I wouldn't use this on my face, but my body felt lovely. I didn't feel the need to put anything on my skin for a long time afterwards. Overall, this scrub felt delicious and relaxing.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In short, I honestly prefer the M3 a little more. But it also matter what you're looking to get out of the scrub. The M3 came with a sticker offering the next one free and I plan to partake. Next time I won't add any extra oil, to see how it acts then. It was long, but I hope some find this review helpful.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Not much product",
    "rating": "3.0 out of 5 stars",
    "content": "Before opening the jar I noticed that there was not much product in the jar. When i opened it, The inside looked like it melted on its way to my house...",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "But overall the tumeric scrub is good. My face feels really smooth. But for the price of 25-26 bucks I want the entire jar filled with what I paid for.",
    "post_time": "Reviewed in the United States on April 10, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Great product however shipped dry!",
    "rating": "5.0 out of 5 stars",
    "content": "The product was dry once I opened it. However I added a little bit of water for moisture and it brought the product back to life! My skin smoother and noticeably hydrated!",
    "post_time": "Reviewed in the United States on February 10, 2021",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Once again, I will preface this review with my typical introduction. I don't write reviews often. I don't do this because of a few reasons, but mainly because of the vast amount of reviews readily available, I don't feel the need to add to the maelstrom of opinions out there. However, here and there I will encounter a product that is either so great it would be a crime not to praise it. On the other end of that spectrum, I may also encounter a product so horrifying it would be immoral not to warn others.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Possibly best charcoal scrub for your skin",
    "rating": "5.0 out of 5 stars",
    "content": "M3's charcoal scrub belongs in the praise section. It works well and the customer support behind it is top-notch as well. I always had problems with breakouts around my face near and around my nose and mouth area. This never subsided even into adulthood. The only effective treatment was antibiotics but that's not sustainable so I'm always on the lookout for new products. It doesn't hurt, right? Well about a year or two ago, I saw this product and bought it. It was costly but I didn't worry too much about finances at the time so no harm no foul. Tried it and immediately saw positive results within the week. I only used the products maybe a couple of times a month and that was enough to keep my skin clear of whiteheads and other blemishes.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "recently, my living situation has gotten more crowded and a very inconsiderate person would like to use my products without care. This person took a liking to the M3 charcoal scrub, no surprise there, and depleted my supply. My financial situation isn't as stable as it was before but I was still going to buy it again, just to make sure I search for the correct product I saved the container. It wasn't until I was looking at the container again that I notice the promotional ad offering a free container. I didn't think they would still honor the ad but they did! So luckily for me, I got a replacement and this time I\"m going to keep it in my room. M3 had me as a repeat customer before but now I'm a bonafide fanboy!",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Best body polish on Amazon",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great get on Amazon! It’s so moisturizing after you rinse it. It really helps me use less moisturizer outside of the shower. It’s easily become my favorite scrub.",
    "post_time": "Reviewed in the United States on July 10, 2020",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "My only thing was that it came and leaked all over my package. Amazon was so helpful and replaced it, though the second package leaked as well (not as much), I just accepted it.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Rejuvenating and refreshing product!",
    "rating": "3.0 out of 5 stars",
    "content": "I enjoyed using this body scrub today! It felt much more rejuvenating and refreshing than any body scrub that I’ve ever used!",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just used this for the first time. I hate shoes so I’m usually barefoot or in sandals. My heals are usually so rough. After using this scrub, they are so smooth and soft. Highly recommend",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "good",
    "rating": "4.0 out of 5 stars",
    "content": "i like the feeling after. does smell a little weird but in a good way",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Producto se siente de excelente calidad, tal y como se presenta en la imagen, empaque y tiempo de entrega es excelente",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Exfoliante Corporal Exfoliante",
    "rating": "5.0 out of 5 stars",
    "content": "Great product face felt real clean and looked real clean. It kind of lightened up a couple of scars that people thought that they were gone, but it took the redness out of some of my scars I had in my skin, felt real smooth.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I am giving this 2 stars. I usually get tree hut brand but decided I’d give this a try. I’m giving it 2 stars because once you try to put it on all the exfoliation scrub slides off into the bottom of the shower and you’re left with this black slime that you’re just kind of moving around. Also, upon opening the jar, it was literally half full or less (tree hut brand is so full its stuck to the bottom of the lid when you open it) and they are both the same price.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Charcoal scrub",
    "rating": "5.0 out of 5 stars",
    "content": "I tried for the first time today & the product is literally + figuratively spot-on. How you ask? Well, it is exfoliating on my skin and I’m able to mentally relax.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The jar wasn’t full. It was only about 2/3 full.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Not very abrasive. Can half full",
    "rating": "3.0 out of 5 stars",
    "content": "Too expensive to not get a full jar.",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love a salt scrub, but extra oil makes the skin less irritated and leaves it more nourished.  Luckily I had a bottle of pure almond oil and added it a little at a time until the salt completely absorbed it.",
    "post_time": "Reviewed in the United States on March 8, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Exceeds Expectations",
    "rating": "5.0 out of 5 stars",
    "content": "Also, it was definitely under filled, which made it easier to add the oil, but the oil didn't add volume, so I think they could add more salt, too.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Like most items, if you've never used it before and your skeptical try a minimal amount on something small. Fotunately for me, that's all I was using it for. Small parts. Enjoy❣️",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Kinda oily...",
    "rating": "3.0 out of 5 stars",
    "content": "Love the coral color of this Himalayan Scrub crystals, and the scent is nice, kind of like the smell of citrus. Oranges maybe. The jar was not full when it arrived, but I think that's just the way it comes. The crystals are soft, and you'll need quite a bit to do an entire body. What I did not like about these crystals was the oily feeling on my body after rubbing them on with my hands. My arms and shoulders felt heavily oiled--not soft and smooth, but oily, and not in a good way, almost as if I'd rubbed on a thin layer of Vaseline. I needed to use a bar of soap to get the feel of oil off my hands. Might not bother some people, but that wasn't what I was hoping for. I have a friend who likes the product, so rather than return it, I'm giving it to her.",
    "post_time": "Reviewed in the United States on January 16, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Does as expected.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Works well",
    "rating": "3.0 out of 5 stars",
    "content": "So when i originally ordered the product I reviewed an empty package. Did the proper steps via Amazon and got it mailed again and finally received it. I don’t hate it but don’t love it either. It’s a dry scrub but seems to have a lot of oil in it! It feels good when exfoliating but when rising it off my whole body and shower felt oily! It took like two more body washes to get the oily feeling off.",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "(UPDATED REVIEW)",
    "post_time": "Reviewed in the United States on April 20, 2021",
    "pid": "B076DSRB6B"
},
{
    "title": "Ok product",
    "rating": "5.0 out of 5 stars",
    "content": "After experiencing symptoms of redness, dryness, and irritation for 5 days (on the 3rd day is when I created the first review) today my skin is finally coming back to its normal state. It was painful for a few days to apply my facial products and it left my skin itchy, peeling and mostly INFLAMED. It wasn't a good experience, but something very interesting occurred once the symptoms of redness and irritation slowly faded away. The acne scars on my cheeks were healed and less noticeable today when I woke up this morning, and the appearance of my skin looks SO MUCH BETTER. I cannot give full credit to this product because my serums and moisturizers contain acne-scarring healing ingredients(and I was using aloe vera a few times this week too for the dryness, irritation, and flakiness), but I believe the dryness caused by this product caused by skin and pores to tighten immensely, and therefore my skin was able to heal faster as a result. This is all speculation, but I haven't seen my skin heal so quickly in a matter of a few days. I'm not sure if I will ever use this product again, but I may keep it just in case for spot treatment for scars specifically, but not for my entire face.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "(PREVIOUS REVIEW)",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "DO NOT BUY THIS PRODUCT IF YOU HAVE SENSITIVE SKIN ***UPDATED REVIEW***",
    "rating": "5.0 out of 5 stars",
    "content": "In the beginning, it seemed appealing to me to buy this product for 3 reasons: The amount of positive reviews (8,000+), charcoal scrubs have helped clear up my sensitive-combination skin in the past, and it contain stem cells, which I thought could've assisted with healing my scars. The first time using, I didn't like how it easily dissolves in water and how much of a mess it makes on my white sink top. The scrub was very dry and needed water to be able to apply to skin, or else it's VERY abrasive and irritating. I didn't like it so I put it on my shelf for a couple weeks, until finally I decided to give it another go. Before application, I made sure to fill it up with water and mix it, because then it would be easier to apply. I rubbed it on my skin and it was much better, but still very messy. I kept it on for 10-20 minutes MAX and finally washed it off and moisturized my skin. Everything was okay for awhile, but as I was working later on that night, I slowly started noticing how itchy my neck and cheeks were becoming. By the time I went home and took off my mask after work, the whole bottom of my face, cheeks, jaw, chin, and neck, were RED ASF all over, and my skin erupted in a rash. It is officially 2 and half days after that incident, and my skin is still red, bumpy, and irritated. I WILL NEVER USE THIS PRODUCT AGAIN. ON GOD. This is one of the worst facial masks I've ever used... and I've used at least more than 30 types of face masks in my entire lifespan. Please do not buy this if you have sensitive skin. SAVE YOURSELF!",
    "post_time": "Reviewed in the United States on April 24, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You will love this product!  It takes off dry skin and makes you feel soft!!!  It absolutely works.  I’m so excited about it.  Love this product!!!",
    "post_time": "Reviewed in the United States on September 26, 2022",
    "pid": "B076DSRB6B"
},
{
    "title": "This scrub is amazing!",
    "rating": "3.0 out of 5 stars",
    "content": "I love the size of the jar. I wasn't pleased with the fact of the stemcells..",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B076DSRB6B"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Love this product! Highly recommend! I have sensitive skin and have no problems. The way it made my face feel was unbelievably soft. I started getting comments on how great my skin looked. Definitely noticed smaller pores as well.  I use just a dab once or twice a week. I could probably use it even less often, but I love the product.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B076DSRB6B"
},
]