[
{
    "name": "        HOBOT-298 Window Cleaning Automatic Robot with Ultrasonic Water Spray, Intelligent Cleaning, AI Smart Route Plan, Replaceable Water Tank, and Control via Smartphone or Remote       ",
    "stars": [
        "37%",
        "15%",
        "13%",
        "11%",
        "25%"
    ],
    "pid": "B07LF4HZ6C",
    "ratings": "167 ratings",
    "other_info": {
        "Brand": "HOBOT",
        "Model Name": "HOBOT-298",
        "Special Feature": "Replaceable water tank, Edge cleaning",
        "Color": "White",
        "Included Components": "Set of clothes (3pcs/pack), Extension cord, AC Adapter, Safety rope, HOBOT Window Detergent"
    },
    "discount_price": "$ 299.",
    "normal_price": "",
    "about_this_item": [
        " Effortless and efficient cleaning: Innovative ultrasonic water spray nebulizes water into dense mist to dissolve dust and polish windows without leaving watermarks. A powerful vacuum safely attaches the robot to the surface while extracting dust and removing all impurities.  ",
        " Safety and reliability design: An auto-adjustable pneumatic pad automatically controls the driving force and keeps the force between the caterpillar treads and cleaning cloth in balance. Auto-edge detection with AI-smart route planning navigates the robot in zigzag pattern in horizontal and vertical directions suitable for frameless windows. A long (15 ft) safety rope and embedded UPS (Un-interrupted Power System) prevents the robot from falling in case of a power outage.  ",
        " Large cleaning area and position memory: Large size (9.5 X 9.5 inches) cleaning cloth, long power and included extension cords provide a wide range of cleaning coverage ideal for not only residential use but also small-scale businesses such as restaurants, cafes, offices, etc. The robot automatically returns to its starting point once the window is cleaned, ensuring easy access and removal in hard-to-reach areas.  ",
        " Replaceable water tank and control via smartphone APP or remote: In case the ultrasonic spraying nozzle is clogged, simply replace the entire water tank or spraying nozzle with a standard screw driver. Receive notifications and alerts on your smartphone, such as when a task is completed, by installing HOBOT APP.  ",
        " Please read the included manual before use. You can also use the link to video tutorial on the box. The robot works with power cord ONLY. Do NOT use on frames with non-rectangular (rounded) edges. Minimum surface cleaning area is 13х13 inches for any glass thickness of 3 mm or more. FAQ are found on our Amazon store page.  "
    ]
},
{
    "title": "Large, medium and small Hobot does them all.",
    "rating": "5.0 out of 5 stars",
    "content": "From small, medium to large windows Hobot does them all.  We've struggled for ten years with our windows and were never satisfied with our hand cleaning results.  We have a lot of different size windows and Hobot is excellent on all of them, but is outstanding on our larger ones where it seems to do the best because of more mobility movement.  Our windows are now the best they have ever looked and we could not be more pleased.  The price point has always been the sticking point for us, but it sure beats a broken bone or worse from a ladder fall or the cost of a professional cleaner. 3/4 of our windows are two and three stories high.  We haven't started on those yet, but on the lower level where we can reach with two feet on the ground it did excellent and we are now proud of our windows.  We are so proud we are going to name our Hobot \"Sparkle.\"  If Sparkle has longevity and holds up well without costly repairs or replacement then it will be money well spent.  Highly recommend anyone that is hesitant to go ahead and bite the price bullet as we don't think you will ever be sorry.  If you do decide to get one make sure you do as Hobot says by either dusting your windows first with the Hobot and blue pads (optional, not included) or with a swifter if this is the first time using the Hobot.  We followed the Hobot protocol and could not be happier!  We love the included liquid cleaner and will always be using that instead of plain water.  My only suggestion to Hobot is to make a duel pair where they will synchronize with each other and do the inside and outside windows at the same time as this would be a perfect set up for us!  Think about doing this Hobot and and then send us royalties.  Ha!  Sparkle needs a roomie named Shine.",
    "post_time": "Reviewed in the United States on May 2, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "UPDATE!!  After several months, the manufacturer contacted me and offered me a $20 gift card to remove my original review below.  Hmmm...",
    "post_time": "Reviewed in the United States on April 27, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "You don't know how bad I wished...",
    "rating": "4.0 out of 5 stars",
    "content": "You don't know how bad I wanted this product to work.  Two large homes, both 3-stories, 130 panes of glass each.  I've been spending $780 for each home twice a year for a pro to clean the windows.",
    "post_time": "Reviewed in the United States on February 12, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I had high hopes for this nifty product, but it just doesn't work.  The technology is cool, it's simple to turn on, it stays stuck to the window and the robotics magically detect the window size and shape and direct the machine over every inch of the window.  But it doesn't clean.  If the window has anything other than a very light coat of dust, it just doesn't clean it, even after two passes.  I used it as directed, used their cleaner product, and it's a non-starter.",
    "post_time": "Reviewed in the United States on April 15, 2022",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Easy to use, Works very good",
    "rating": "5.0 out of 5 stars",
    "content": "This cool gadget sprays a very fine micro mist ahead of its path, then sweeps the area with what is basically a micro-fiber pad.  No heavy mist, no scrubbing back and forth to get the crud off.  The vacuum feature suctions the machine on to your window, but doesn't \"vacuum\" off the dirt.  If you had a foot square micro-fiber cloth mounted on a flat piece of cardboard and gently slid it over your window after an extremely light mist of Windex, you would simulate the cleaning action of this product.  Try it.  It just doesn't work on the inside or outside.  Won't remove a light finger print on the inside or even light waterspots on the outside.  Dang, I wished this worked!  In ten years, we'll all be washing our house windows with a robotic product, but the technology isn't there yet.",
    "post_time": "Reviewed in the United States on April 11, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Gotta love Amazon's return policy.",
    "post_time": "Reviewed in the United States on September 15, 2023",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Not ready for prime time. Won't be putting any window washing humans out of business.",
    "rating": "1.0 out of 5 stars",
    "content": "The Hobot -298 works extremely well. The micro cloth really does a fine job and the unit seems well built. Its auto dispenser emits a fine spray as it works its way over the window surface. It works best on large windows. Small windows seem to confuse the sensors. Our small non opening windows are recessed into the wall significantly as that is the design the builder went with. It looks great but it seems to cramp the Hobots style a bit. On the large picture windows and on tall vertical windows such as storm doors, it works excellently. Also, for oversized bathroom mirrors it does a fine job too.",
    "post_time": "Reviewed in the United States on April 24, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have heard the argument that a person can do a window cleaning faster than the robot, and this is true. But with the robot doing the window, you can ca doing other things at the same time. It increases productivity.",
    "post_time": "Reviewed in the United States on May 14, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Cleans those hard to reach places- Windows Mirrors and Shower glass",
    "rating": "3.0 out of 5 stars",
    "content": "Example; While the robot was cleaning the very large living room window, I was doing laundry and watching dinner on the stove. A beep alerts you to when the Robot is done or needs attention.",
    "post_time": "Reviewed in the United States on August 27, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It has not fallen off a window yet. It has battery backup should power be lost. A safety tether is included  but using it is not convenient because what are you going to hook it onto?  Unless you have a curtain rod above the window, there is nowhere to fasten the rope to. I took it off.",
    "post_time": "Reviewed in the United States on January 24, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Not ready for prime time.",
    "rating": "3.0 out of 5 stars",
    "content": "If you are looking for something to polish your already-clean windows, this is for you. While it touts it's use of fluid, it is essentially a dry operation. After numerous uses it's used about an ounce of fluid. When it finishes the window and you take it off, the cleaning pad feels completely dry. All that would be okay if a perfectly cleaned window was left behind, but it only gets the most superficial dirt. It gets a small fraction of the dirt I get by doing the window by hand. Hand cleaning a just-robot cleaned window produces a paper towel with significant dirt on it. On the other hand, if you hand clean your windows and can't get the streaks off, this machine does that pretty well. I'm quite disappointed with the performance based on the price of this machine. I'm keeping it, but just to clean up the streaks. In all fairness, if you did your windows with this every week, it would probably work well. It just doesn't work well unless the window is pretty clean already.",
    "post_time": "Reviewed in the United States on April 20, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Really wanted to like this. The first one arrived and the fan wouldn't work. Contacted Hobot and they said there was a batch of inventory they sent to Amazon that had broken fans. They shipped me a replacement and it arrived today. I charged it for hours and turned it on.....same issue. The fan doesn't run so it won't suction to the window. I'm so disappointed. I was really excited to try this out...and never got to. I'm not sure if I want to try for another replacement...or just get a refund at this point. If it's this glitchy...wouldn't it glitch out again in the future?",
    "post_time": "Reviewed in the United States on February 26, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Took a while to get one that works....but now it's great!",
    "rating": "3.0 out of 5 stars",
    "content": "Update: I finally got one that works and it is amazing. It does what it says and is actually pretty resilient. It doesn't do too well on windows that don't have a high edge. However you can still control where it goes and it gets the job done.",
    "post_time": "Reviewed in the United States on March 9, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I've tried a number of the window cleaning robots on the market over the last month. This one produces the cleanest windows and is also the fastest. It is the only one with a reservoir for the cleaner; it spritzes the window as it goes. But I am returning it because of two negatives: I hate managing the long power cord and the long tether, which get  tangled up, and it hits the edges of the window too aggressively and runs right over them. If your window has frames that are 90 degrees and square, you may like this. If like me you have window frames that are barely raised and beveled or curved, this will not work for you. When it runs over the edge it either gets stuck or loses suction and falls off.",
    "post_time": "Reviewed in the United States on July 28, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Best window robot on the market EXCEPT...",
    "rating": "4.0 out of 5 stars",
    "content": "I have 6 large sliding doors on my lanai with a permanent screen and rail behind them, so it’s impossible to reach all of the surfaces.  The HOBOT was able to clean all of the outside surfaces with a minor exception where 1 door was too close to the rail, not hobot’s fault. As for the quality of the cleaning, not as good as a good human washer would do.  It can’t clean all the way into the corners. Some spots on the glass had to be addressed manually, not a big surprise for the first time. I don’t anticipate there will be many spot issues for future cleanings.  Overall I’m highly satisfied.  Instruction manual lacked detail so it took some time to figure out the controls, especially how to control the mister. I use provided remote and the Bluetooth app on my Apple phone.  Both worked well with little difference in capability.",
    "post_time": "Reviewed in the United States on July 20, 2022",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I purchased 5/22 and was super excited to use.  Easy to set up, Suction power is fantastic. Works well on inside windows.  Outside windows require a deep clean before you start using this on a regular basis.  Heavy dirt gets smeared.  Use as weekly cleaning to prevent extreme dirt buildup and works great.  1 big issue; if it is windy while machine working, the cleaning fluid blows away due to the fine mist it uses and will leave streaks.  Would I buy again...Probably",
    "post_time": "Reviewed in the United States on October 6, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Not as good as a human window washer. But does the job where a human can’t go.d both the",
    "rating": "1.0 out of 5 stars",
    "content": "Don’t know why sprayer is so inadequate but it seems gimmicky. I found if I sprayed a little cleaner in front of it’s path on occasion it did very well indeed. I don’t understand why they didn’t make the sprayer more functional. I prefer to use Pledge multi surface spray cleaner for glass, much better than Windex. Windex streaks Pledge does not. I’ve only just gotten a chance to use it but with the above caveats and will update in the future. If there is another that performs as well but doesn’t have the sprayer and is therefore cheaper I would recommend the cheaper version. I paid $400 and it seems expensive even at that reduced price, otherwise recommended.",
    "post_time": "Reviewed in the United States on March 11, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Received yesterday.  Out of the box.  Noticed plastic is a bit \"cheaper\" than I expected, but giving it a chance.  Read instructions twice.  Plugged it in to charge the battery (back up battery must be charged despite unit working on plugged in power).",
    "post_time": "Reviewed in the United States on August 29, 2022",
    "pid": "B07LF4HZ6C"
},
{
    "title": "On the fence",
    "rating": "5.0 out of 5 stars",
    "content": "Tonight, fully charged.  All excited to use.  Turn on . . . getting beeping orange / blue light.  Manual says that the \"battery needs charging\".  WHAT??",
    "post_time": "Reviewed in the United States on June 26, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Plugged it back in (an hour ago).  Light is orange again (which means it's charging).  So . . . had a green light.  Ready to use.  Turned on.  Get a orange/blue flashing light indicating battery needs charging.  With the time I've spent messing with this unit, I could have cleaned the window inside and outside already.",
    "post_time": "Reviewed in the United States on December 5, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Cleans The Dirtiest Of Windows!",
    "rating": "5.0 out of 5 stars",
    "content": "Hobot is AMAZING! We live in a 6th story condo with a LOT of windows that get hit by road and sea air. They were absolutely filthy and window cleaners wanted $1200 to come out and clean. Hobot got the job done! As I am sure everyone is, I was super skeptical- and my husband laughed at the thought of me buying this. He said no way it will work.",
    "post_time": "Reviewed in the United States on July 30, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It was super easy to figure out. I was so worried it would fall to its death but suction wasn’t a problem at all. See my video, our windows were filthy! We used Hobot to go over them with a dry pad first and then turned on the spray cleaner function. I cannot get over this thing!!",
    "post_time": "Reviewed in the United States on April 22, 2023",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Hobart the Robot",
    "rating": "2.0 out of 5 stars",
    "content": "I live by the ocean in a hi-rise, so we get a lot of salt on my windows from the high winds. I rinse my windows with the hose and put Hobart to work. He does a great job & is safer and more cost effective than hiring insured & licensed window washers! 🧼🪟✅",
    "post_time": "Reviewed in the United States on January 4, 2022",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Suction is good - doesn't fall off the tile even where there are small gaps. But the cleaning is so delicate - it is positively unable to deal with soil level of showers. The only thing it can deal with in the bathroom are mirrors. And even those are a bit problematic: my little kids sometime get tiny dots of toothpaste on the mirrors and hobot can't deal withbthem - just smears them over the surface leaving funny trails. Anyway, I bought it for bathroom needs - and it's pure wast of money ( though kids love playing with the bot using remote 😆",
    "post_time": "Reviewed in the United States on November 22, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Not suitable for bathroom tiles and glass shower doors",
    "rating": "5.0 out of 5 stars",
    "content": "This device actually did a great job.  Be sure to look at your windows to see if the frame around the glass has a beveled or rounded edge.  If the edges are not at a 90 degree angle, the device will run up on it and lose suction.",
    "post_time": "Reviewed in the United States on May 5, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very easy to use.  I purchased a separate 24-volt portable power station and can easily clean all the windows everywhere in my home, without tangled cords or tethers.  Easy push of a button to start and stop, or use the remote control.  Can also use a mobile phone app, but really is unnecessary.  Nice (and safer) not to having to climb up tall ladders to clean high, large windows.  A bit expensive, but worth the price!  Customer support is also FANTASTIC!  Quick response and answer to my questions.  RECOMMENDED!",
    "post_time": "Reviewed in the United States on February 21, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Check the edge of the inside frame around the glass.",
    "rating": "2.0 out of 5 stars",
    "content": "After understanding the idiosyncrasies of the Hobot, it appears to do a decent job of cleaning.  One negative is that it only sprays out one side so it cannot effectively clean an area underneath the unit when it stops at an edge.",
    "post_time": "Reviewed in the United States on November 26, 2022",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This seems cool until you realize you still have to clean your windows afterwards. The machine leaves track marks from the wheels! This is a beta product they should never have released. In tests they must have shown this happened!",
    "post_time": "Reviewed in the United States on December 19, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Easy to use, fun to watch, does a good job cleaning windows.  Be the envy of your neighborhood!",
    "rating": "5.0 out of 5 stars",
    "content": "basically i like this robot. it is easy to use, except it does not work on dirty windows.",
    "post_time": "Reviewed in the United States on April 8, 2023",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "very difficult to achieve sparkling panes without removing dust first .",
    "post_time": "Reviewed in the United States on October 11, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Doesn’t work as it is advertised.",
    "rating": "3.0 out of 5 stars",
    "content": "Our robot floor cleaner became great help/life saver for every day cleaning that we thought this would be the same for window cleaning. Turned out the other way. It doesn’t clean as it is advertised.",
    "post_time": "Reviewed in the United States on December 25, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Hobot 298 is easy to use but it is does a mediocre cleaning job.  It leaves streaks no matter how dirty or slightly dirty the window.  You can clean the wheels and change and clean the pads all you want but the streaks will be there.  If you are hoping to avoid cleaning windows yourself or hiring someone to do it, this product is not for you (or me).",
    "post_time": "Reviewed in the United States on October 31, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Disappointing window bot",
    "rating": "4.0 out of 5 stars",
    "content": "The Hobot 298 cleaned over all very well, but didn’t get the corners.  The remount didn’t work that well, will try using my phone next time.  I really liked the way it shined the windows, just wished it did the corners better",
    "post_time": "Reviewed in the United States on July 30, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Does a so so job on my windows...",
    "post_time": "Reviewed in the United States on December 23, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Over all did a very good job.",
    "rating": "5.0 out of 5 stars",
    "content": "  Perfect for my solar panels. This is the main reason why I wanted to try this product",
    "post_time": "Reviewed in the United States on August 18, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for my wife's birthday and she is thrilled with it.  \"Winston\" that's what we named it does everything they said it would.  We have neighbors who are asking where did you get that?  I want one.  He is especially good on mirrors and Mirrored wardrobe doors.  It may sound pricey but will pay for itself  in less than six months versus hiring a window washer.",
    "post_time": "Reviewed in the United States on July 28, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Makes solar panel cleaning easier",
    "rating": "3.0 out of 5 stars",
    "content": "Love it!",
    "post_time": "Reviewed in the United States on September 18, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I can't believe how it checks all the boxes. Works on balcony in and outer,  super fast, smart, easy to use...buy it!! I used to struggle to clean the outer balcony glass 33rd floor..now I just hold the unit to the glass, turn it on, and press start..Done...I'm especially impressed how it senses the individual frameless glass panels...unbelievable product,  if you live in a modern building like here in Miami...Brickell...Buy Buy Buy..",
    "post_time": "Reviewed in the United States on August 27, 2022",
    "pid": "B07LF4HZ6C"
},
{
    "title": "It really works well!",
    "rating": "1.0 out of 5 stars",
    "content": "Too complicated!!  And it takes too long to clean a window",
    "post_time": "Reviewed in the United States on December 8, 2023",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "This product is a great disappointment. I used it only 4 times through out 6 months and now it just stopped working. When I used it,  had to supervise this device at all times. It’s either get stuck at the corners,  or needs more space to turn around or just finishes the job half way. Couple times I had to catch it when it’s falling down, too unreliable.",
    "post_time": "Reviewed in the United States on January 20, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Finally a product that works",
    "rating": "5.0 out of 5 stars",
    "content": "Finally, we are able to get clean windows and clean showers. We have been waiting for such a long time for a product like this.  We are so happy.",
    "post_time": "Reviewed in the United States on July 13, 2022",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The product works as described. But, the User manual could be much more clear. The use of the remote does seem to follow the suggestions in the manual. After using the device a few times, it is easier to figure out. I would not have any problem recommending the unit. It is built quite well.",
    "post_time": "Reviewed in the United States on June 29, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Product works as described",
    "rating": "5.0 out of 5 stars",
    "content": "I love this unit.  I have 14 sliding glass doors and just as many windows.  I can now sip a cup of tea while watching this amazing unit clean my windows.  Easy to assemble and directions for use understandable.  Do not hesitate to purchase this item!!",
    "post_time": "Reviewed in the United States on November 11, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is one of the most awesome products I have ever purchased for cleaning! I have all different size windows and I love it. I even purchased another one for a Christmas gift!",
    "post_time": "Reviewed in the United States on November 3, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Loads of windows? You need this item!",
    "rating": "1.0 out of 5 stars",
    "content": "El aparato se carga de prende cuando está listo y no tiene se enciende el poder de succión lo que hace que no se agarre a nada. El aparato se vuelve inútil, lo compre y me fui a otro país y lamentablemente no podré devolverlo. Más de 500$ perdidos.",
    "post_time": "Reviewed in the United States on November 17, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My central window is about 4 feet wide and doesn’t open. Very hard to clean from inside without high acrobatics. Hobot got the job done safely and quickly. I wish I’d bought it sooner- huge difference when a window is clean! ✨☀️",
    "post_time": "Reviewed in the United States on June 27, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "It works!!!",
    "rating": "1.0 out of 5 stars",
    "content": "it does not clean Glass, it help of maintaining the Cleaned Glass to stay clean, meaning if there is only light dust, it can help, but it does n to clean dirty glass",
    "post_time": "Reviewed in the United States on January 21, 2023",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This product is awesome ! My windows need constant cleaning to keep the dust away. I don’t even need to spray windows with cleaner unless there’s fingerprints & even then it’s not always needed. It does all the work...Extremely simple!",
    "post_time": "Reviewed in the United States on May 28, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "NO SUCCIONA. NO WORK",
    "rating": "1.0 out of 5 stars",
    "content": "En lo personal no me agrado, no limpia suciedad importante, además en el primer día de uso el dispersador de agua o líquido dejo de funcionar. Y dice q no tiene garantía, para eso uno compra el HOBOT versión anterior y uno se encarga de el líquido... con una diferencia importante de precio",
    "post_time": "Reviewed in the United States on November 1, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Left streaks. Did not perform as expected",
    "post_time": "Reviewed in the United States on April 24, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Does the hard work for you",
    "rating": "5.0 out of 5 stars",
    "content": "Love our Hobot.  Works great on our large Lanai windows.  No streaking, and leaves you with nice clean windows.",
    "post_time": "Reviewed in the United States on May 29, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Pésimo producto, no se como algunas compañías lanzan al mercado un producto inservible, no limpia los cristales de las ventanas cuando están sucias, solo funciona cuando están limpias, las ruedas de tracción que sirve para movilizarse por el cristal patinan cuando esta sucia y da por terminada la limpieza, por lo que no limpia nada.",
    "post_time": "Reviewed in the United States on June 22, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "No compren, no sirve para limpiar cristales.",
    "rating": "1.0 out of 5 stars",
    "content": "Unfortunately this unit did not work as planned. I live in a coastal area and the Hobot could not clean up salt residue on my window. With or without a cleaning solution all it did was smear the glass.  Already sent the unit back....",
    "post_time": "Reviewed in the United States on April 2, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The first to apologize is the bravest. The first to forgive is the strongest, and the first to forget is the happiest  ;~PB",
    "post_time": "Reviewed in the United States on January 17, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Not the Unit I was hoping For",
    "rating": "5.0 out of 5 stars",
    "content": "I am impressed by this machine! It takes little effort to operate and it cleans my windows very well. Thanks for a bottle of cleaning detergent in the box!",
    "post_time": "Reviewed in the United States on May 21, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Lo devolví, no limpia bien. Después de un día de uso empezó a tener un sonido raro y no se deslizaba fácilmente por el vidrio. Mala inversión",
    "post_time": "Reviewed in the United States on November 10, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Fantastic,  works well  ;~PB",
    "rating": "5.0 out of 5 stars",
    "content": "This gadget is awesome!!! No more streaky windows!!! This helped get even the hard to reach corners on the high windows!  Easy to use as well!",
    "post_time": "Reviewed in the United States on June 18, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "This machine is not working properly.  I did not like the product quality.  I definitely didn't get the cleaning I wanted.  The company should help me.  Please answer.",
    "post_time": "Reviewed in the United States on April 15, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "I love the work it does !!!",
    "rating": "1.0 out of 5 stars",
    "content": "Producto nuevo llegó incompleto, sin control remoto, sin manual, sin líquido de limpieza, con difusor de ultrasonido malo, extrañamente venía uno de repuesto, siendo que a un producto nuevo no le corresponde que lo traiga, muy mala experiencia.",
    "post_time": "Reviewed in the United States on August 14, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "No limpia absolutamente nada y deja las marcas de donde pasa el equipo en el vidrio. Arrastra la suciedad….",
    "post_time": "Reviewed in the United States on June 1, 2022",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Awesome",
    "rating": "5.0 out of 5 stars",
    "content": "One of the best product I ever had, act at Spider-Man and make my windows so shin",
    "post_time": "Reviewed in the United States on July 22, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I will use it to clean the windows of the outdoor terrace.",
    "post_time": "Reviewed in the United States on May 9, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "HOBOT-298 Window Cleaning",
    "rating": "5.0 out of 5 stars",
    "content": "Todo",
    "post_time": "Reviewed in the United States on June 9, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Succión malo, se ha caído por cuarta vez.. Y se atora fácilmente....",
    "post_time": "Reviewed in the United States on September 10, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Excelente producto",
    "rating": "5.0 out of 5 stars",
    "content": "great tool for a smart home!",
    "post_time": "Reviewed in the United States on May 28, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It works!  Cleaned all windows in two days!",
    "post_time": "Reviewed in the United States on July 7, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Estoy muy decepcionada, mi robot se ha caído por cuarta vez....",
    "rating": "1.0 out of 5 stars",
    "content": "The robot wheel slips over the window and the robot doesn’t move in spite of cleaning the wheel as per the troubleshooting instructions.",
    "post_time": "Reviewed in the United States on May 19, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to use!!!",
    "post_time": "Reviewed in the United States on January 10, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "work smarter",
    "rating": "1.0 out of 5 stars",
    "content": "Does not get the job done. Just takes off the dust. The water spray just makes the job worst.",
    "post_time": "Reviewed in the United States on August 17, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love it.",
    "post_time": "Reviewed in the United States on November 22, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Useless Waste of money!",
    "rating": "1.0 out of 5 stars",
    "content": "Useless waste of money!",
    "post_time": "Reviewed in the United States on October 5, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was at 2019 International CES event and that's when I saw Hobot 298 from Home Robot USA. They also have many other great robotic products.",
    "post_time": "Reviewed in the United States on September 29, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "CES 2019 Chosen and Best Window Cleaning Robot!",
    "rating": "5.0 out of 5 stars",
    "content": "I have purchased my window cleaning HOBOT 298 from the manufacturers website as it was better option for the moment.",
    "post_time": "Reviewed in the United States on August 26, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Robot excelente",
    "rating": "5.0 out of 5 stars",
    "content": "So far it has been a great experience and I have used it today all day pretty much.",
    "post_time": "Reviewed in the United States on February 22, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "A must-have!",
    "rating": "5.0 out of 5 stars",
    "content": "Here are some facts and my findings to share, thought it would give you better idea and insight about this product:",
    "post_time": "Reviewed in the United States on April 26, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "I like it!",
    "rating": "1.0 out of 5 stars",
    "content": "Pros:",
    "post_time": "Reviewed in the United States on October 5, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Great expectations ... but really disappointed",
    "rating": "5.0 out of 5 stars",
    "content": "- It has battery which mainly for power backup, in a situation where cord or connection disconnects or comes off, even if you loose power the backup battery will keep it going and will keep it hold on the surface. That way it won't fall off and get damaged.",
    "post_time": "Reviewed in the United States on January 28, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "- Great safety features like battery backup, long power cord and safety cord/rope.",
    "post_time": "Reviewed in the United States on May 16, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Helps to save time!",
    "rating": "5.0 out of 5 stars",
    "content": "- Very powerful motor.",
    "post_time": "Reviewed in the United States on March 1, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "- Great suction.",
    "post_time": "Reviewed in the United States on December 16, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Amazing product ! Highly recommend",
    "rating": "5.0 out of 5 stars",
    "content": "I love it ! My best investment ...",
    "post_time": "Reviewed in the United States on July 21, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Game changer! I use a little cleaner sprayed on the glass after dry mopping. Looks professional!",
    "post_time": "Reviewed in the United States on October 3, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Amazing cleaning bot",
    "rating": "1.0 out of 5 stars",
    "content": "I was previously happy with the product until after less than 3 years the product just start to malfunction. I suspect it's because of issue with sensor mal-detection. It's basically useless now as the machine just stopped at random place in the middle of the window.",
    "post_time": "Reviewed in the United States on August 8, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love everything about it!  I have \"MS\" and an incapable of doing my own windows.....this BOT actually does it for me!",
    "post_time": "Reviewed in the United States on June 3, 2022",
    "pid": "B07LF4HZ6C"
},
]