[
{
    "name": "        HOBOT-298 Window Cleaning Automatic Robot with Ultrasonic Water Spray, Intelligent Cleaning, AI Smart Route Plan, Replaceable Water Tank, and Control via Smartphone or Remote       ",
    "stars": [
        "37%",
        "15%",
        "13%",
        "11%",
        "25%"
    ],
    "pid": "B07LF4HZ6C",
    "ratings": "167 ratings",
    "other_info": {
        "Brand": "HOBOT",
        "Model Name": "HOBOT-298",
        "Special Feature": "Replaceable water tank, Edge cleaning",
        "Color": "White",
        "Included Components": "Set of clothes (3pcs/pack), Extension cord, AC Adapter, Safety rope, HOBOT Window Detergent"
    },
    "discount_price": "$ 299.",
    "normal_price": "",
    "about_this_item": [
        " Effortless and efficient cleaning: Innovative ultrasonic water spray nebulizes water into dense mist to dissolve dust and polish windows without leaving watermarks. A powerful vacuum safely attaches the robot to the surface while extracting dust and removing all impurities.  ",
        " Safety and reliability design: An auto-adjustable pneumatic pad automatically controls the driving force and keeps the force between the caterpillar treads and cleaning cloth in balance. Auto-edge detection with AI-smart route planning navigates the robot in zigzag pattern in horizontal and vertical directions suitable for frameless windows. A long (15 ft) safety rope and embedded UPS (Un-interrupted Power System) prevents the robot from falling in case of a power outage.  ",
        " Large cleaning area and position memory: Large size (9.5 X 9.5 inches) cleaning cloth, long power and included extension cords provide a wide range of cleaning coverage ideal for not only residential use but also small-scale businesses such as restaurants, cafes, offices, etc. The robot automatically returns to its starting point once the window is cleaned, ensuring easy access and removal in hard-to-reach areas.  ",
        " Replaceable water tank and control via smartphone APP or remote: In case the ultrasonic spraying nozzle is clogged, simply replace the entire water tank or spraying nozzle with a standard screw driver. Receive notifications and alerts on your smartphone, such as when a task is completed, by installing HOBOT APP.  ",
        " Please read the included manual before use. You can also use the link to video tutorial on the box. The robot works with power cord ONLY. Do NOT use on frames with non-rectangular (rounded) edges. Minimum surface cleaning area is 13х13 inches for any glass thickness of 3 mm or more. FAQ are found on our Amazon store page.  "
    ]
},
{
    "title": "Awesome",
    "rating": "5.0 out of 5 stars",
    "content": "One of the best product I ever had, act at Spider-Man and make my windows so shin",
    "post_time": "Reviewed in the United States on July 22, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I will use it to clean the windows of the outdoor terrace.",
    "post_time": "Reviewed in the United States on May 9, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "HOBOT-298 Window Cleaning",
    "rating": "5.0 out of 5 stars",
    "content": "Todo",
    "post_time": "Reviewed in the United States on June 9, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Succión malo, se ha caído por cuarta vez.. Y se atora fácilmente....",
    "post_time": "Reviewed in the United States on September 10, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Excelente producto",
    "rating": "5.0 out of 5 stars",
    "content": "great tool for a smart home!",
    "post_time": "Reviewed in the United States on May 28, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It works!  Cleaned all windows in two days!",
    "post_time": "Reviewed in the United States on July 7, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Estoy muy decepcionada, mi robot se ha caído por cuarta vez....",
    "rating": "1.0 out of 5 stars",
    "content": "The robot wheel slips over the window and the robot doesn’t move in spite of cleaning the wheel as per the troubleshooting instructions.",
    "post_time": "Reviewed in the United States on May 19, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to use!!!",
    "post_time": "Reviewed in the United States on January 10, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "work smarter",
    "rating": "1.0 out of 5 stars",
    "content": "Does not get the job done. Just takes off the dust. The water spray just makes the job worst.",
    "post_time": "Reviewed in the United States on August 17, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love it.",
    "post_time": "Reviewed in the United States on November 22, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Does the hard work for you",
    "rating": "5.0 out of 5 stars",
    "content": "Love our Hobot.  Works great on our large Lanai windows.  No streaking, and leaves you with nice clean windows.",
    "post_time": "Reviewed in the United States on May 29, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Pésimo producto, no se como algunas compañías lanzan al mercado un producto inservible, no limpia los cristales de las ventanas cuando están sucias, solo funciona cuando están limpias, las ruedas de tracción que sirve para movilizarse por el cristal patinan cuando esta sucia y da por terminada la limpieza, por lo que no limpia nada.",
    "post_time": "Reviewed in the United States on June 22, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "No compren, no sirve para limpiar cristales.",
    "rating": "1.0 out of 5 stars",
    "content": "Unfortunately this unit did not work as planned. I live in a coastal area and the Hobot could not clean up salt residue on my window. With or without a cleaning solution all it did was smear the glass.  Already sent the unit back....",
    "post_time": "Reviewed in the United States on April 2, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The first to apologize is the bravest. The first to forgive is the strongest, and the first to forget is the happiest  ;~PB",
    "post_time": "Reviewed in the United States on January 17, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Not the Unit I was hoping For",
    "rating": "5.0 out of 5 stars",
    "content": "I am impressed by this machine! It takes little effort to operate and it cleans my windows very well. Thanks for a bottle of cleaning detergent in the box!",
    "post_time": "Reviewed in the United States on May 21, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Lo devolví, no limpia bien. Después de un día de uso empezó a tener un sonido raro y no se deslizaba fácilmente por el vidrio. Mala inversión",
    "post_time": "Reviewed in the United States on November 10, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Fantastic,  works well  ;~PB",
    "rating": "5.0 out of 5 stars",
    "content": "This gadget is awesome!!! No more streaky windows!!! This helped get even the hard to reach corners on the high windows!  Easy to use as well!",
    "post_time": "Reviewed in the United States on June 18, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "This machine is not working properly.  I did not like the product quality.  I definitely didn't get the cleaning I wanted.  The company should help me.  Please answer.",
    "post_time": "Reviewed in the United States on April 15, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "I love the work it does !!!",
    "rating": "1.0 out of 5 stars",
    "content": "Producto nuevo llegó incompleto, sin control remoto, sin manual, sin líquido de limpieza, con difusor de ultrasonido malo, extrañamente venía uno de repuesto, siendo que a un producto nuevo no le corresponde que lo traiga, muy mala experiencia.",
    "post_time": "Reviewed in the United States on August 14, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "No limpia absolutamente nada y deja las marcas de donde pasa el equipo en el vidrio. Arrastra la suciedad….",
    "post_time": "Reviewed in the United States on June 1, 2022",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Useless Waste of money!",
    "rating": "1.0 out of 5 stars",
    "content": "Useless waste of money!",
    "post_time": "Reviewed in the United States on October 5, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was at 2019 International CES event and that's when I saw Hobot 298 from Home Robot USA. They also have many other great robotic products.",
    "post_time": "Reviewed in the United States on September 29, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "CES 2019 Chosen and Best Window Cleaning Robot!",
    "rating": "5.0 out of 5 stars",
    "content": "I have purchased my window cleaning HOBOT 298 from the manufacturers website as it was better option for the moment.",
    "post_time": "Reviewed in the United States on August 26, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Robot excelente",
    "rating": "5.0 out of 5 stars",
    "content": "So far it has been a great experience and I have used it today all day pretty much.",
    "post_time": "Reviewed in the United States on February 22, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "A must-have!",
    "rating": "5.0 out of 5 stars",
    "content": "Here are some facts and my findings to share, thought it would give you better idea and insight about this product:",
    "post_time": "Reviewed in the United States on April 26, 2019",
    "pid": "B07LF4HZ6C"
},
{
    "title": "I like it!",
    "rating": "1.0 out of 5 stars",
    "content": "Pros:",
    "post_time": "Reviewed in the United States on October 5, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Great expectations ... but really disappointed",
    "rating": "5.0 out of 5 stars",
    "content": "- It has battery which mainly for power backup, in a situation where cord or connection disconnects or comes off, even if you loose power the backup battery will keep it going and will keep it hold on the surface. That way it won't fall off and get damaged.",
    "post_time": "Reviewed in the United States on January 28, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "- Great safety features like battery backup, long power cord and safety cord/rope.",
    "post_time": "Reviewed in the United States on May 16, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Helps to save time!",
    "rating": "5.0 out of 5 stars",
    "content": "- Very powerful motor.",
    "post_time": "Reviewed in the United States on March 1, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "- Great suction.",
    "post_time": "Reviewed in the United States on December 16, 2020",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Amazing product ! Highly recommend",
    "rating": "5.0 out of 5 stars",
    "content": "I love it ! My best investment ...",
    "post_time": "Reviewed in the United States on July 21, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Game changer! I use a little cleaner sprayed on the glass after dry mopping. Looks professional!",
    "post_time": "Reviewed in the United States on October 3, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Amazing cleaning bot",
    "rating": "1.0 out of 5 stars",
    "content": "I was previously happy with the product until after less than 3 years the product just start to malfunction. I suspect it's because of issue with sensor mal-detection. It's basically useless now as the machine just stopped at random place in the middle of the window.",
    "post_time": "Reviewed in the United States on August 8, 2021",
    "pid": "B07LF4HZ6C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love everything about it!  I have \"MS\" and an incapable of doing my own windows.....this BOT actually does it for me!",
    "post_time": "Reviewed in the United States on June 3, 2022",
    "pid": "B07LF4HZ6C"
},
]