[
{
    "name": "        Keonjinn LED Bathroom Mirror 28 x 36 Inch Bathroom Mirror with Lights Front Lighted Makeup Mirror Anti-Fog Dimmable UL Listed LED Driver Tempered Glass Wall Mounted Vanity Mirror (Vertical/Horizontal)       ",
    "stars": [
        "70%",
        "15%",
        "5%",
        "2%",
        "7%"
    ],
    "pid": "B07MNDTY9C",
    "ratings": "1,631 ratings",
    "other_info": {
        "Brand": "Keonjinn",
        "Room Type": "Bathroom, Living Room, Powder Room",
        "Shape": "Rectangular",
        "Product Dimensions": "36\"L x 28\"W",
        "Frame Material": "Glass"
    },
    "discount_price": "$ 169.99",
    "normal_price": "$209.99",
    "about_this_item": [
        " 【Dimmable & Memory】 The brightness of this modern led mirror is dimmable, short press to turn the mirror light on/off while long press on the button can adjust the brightness of the mirror (10%-100%). With the UL listed LED power driver, this wonderful bathroom mirror are available for an excellent lighting experience. When the LED mirror is restarted after a power failure, it will return to the last use, no need to adjust again.  ",
        " 【Safe Defogging】 The frontlit mirror's light and anti-fog are controlled separately. To avoid overheating of the mirror due to long time use of defogging, the anti fog function will automatically turn off after one hour of continuous use, then you need to click the defogging button to turn on the defogging function again.  ",
        " 【Easy Flexible Installation】Super easy to install with French cleat brackets. Our bathroom mirror support normal wall switch control and can be connected using plugs or hardwired. Can be installed in bathroom, bedroom and the room you want to install. Only plays an auxiliary role in the brightness of the room, and is not recommended as a separate lighting.  ",
        " 【Tempered Glass & Packaging】 Strong and safe tempered glass are resistant to breakage, ensuring your daily use for safety. Newly improved packing greatly reduces damage during transportation. Keonjinn led mirrors have passed all tests including dropping test, impact test, heavy pressure test etc.  ",
        " 【Brand Keonjinn】 As the leading brand in the mirror category, we have been committed to providing consumers with affordable quality mirrors and have received over 7,800 reviews on Amazon for 6 years. We are constantly improving the craftsmanship and packaging of our mirrors to ensure that our mirrors reach our customers intact. Please don't hesitate to get in touch if there's anything we can help with you.  "
    ]
},
{
    "title": "Connection cord Interfere with mounting on Mirror.",
    "rating": "3.0 out of 5 stars",
    "content": "Measurements are wrong 36/28 as advertised.actual dimensions are 36x27 1/4",
    "post_time": "Reviewed in the United States on June 23, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Makes a difference  if you are tryin to hide any imperfections of previous glass on wall.",
    "post_time": "Reviewed in the United States on February 27, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Love this mirror!!!!",
    "rating": "3.0 out of 5 stars",
    "content": "The mirror was well packaged, no damage.  I was a little nervous with it coming USPS.  It was easy to hang and wire into our existing vanity light that we removed.  I would recommend you have more than one light source in your bathroom if it's large.  I can't wait to show it off!!",
    "post_time": "Reviewed in the United States on June 2, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Dope mirror.. but came with a chip in the corner.. would be dope to get refund instead of shipping this thing back. Would have given it it 5 but for the chip",
    "post_time": "Reviewed in the United States on June 28, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Mirror came with a chip in the corner",
    "rating": "3.0 out of 5 stars",
    "content": "The mirror is beautiful and well lit.  My wife and girls now refuse to use any other mirror in the house, especially for applying makeup.  Anti-fog function is a big added plus.  I rarely write product reviews; however, the Keonjinn customer service team truly warrants recognition.  They even went as far as to replace the mirror after I had damaged it.  Top notch quality and customer support.  Highly recommend!",
    "post_time": "Reviewed in the United States on April 4, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've installed tons of mirrors, lights, fans, outlets, etc. and this mirror is very difficult to install. The instructions are confusing and we had to install it differently than laid out in the diagram. This mirror would benefit from preinstalled hardware to attach it to the wall.  That being said, it was easy to hardwire to my existing outlet and the mirror is extremely bright and the defog function works as expected.",
    "post_time": "Reviewed in the United States on December 28, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Incredible customer service.  Great mirror!!  Great company!!",
    "rating": "4.0 out of 5 stars",
    "content": "Did some shopping around for different lighted mirrors during our bathroom remodel.",
    "post_time": "Reviewed in the United States on July 27, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Found this one and liked the simplistic look. Figured I'd give it a shot.",
    "post_time": "Reviewed in the United States on June 27, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Horrible to install, but when it's installed it works great",
    "rating": "4.0 out of 5 stars",
    "content": "It was easy to install, even for a \"savvy homeowner\" and fit the space perfectly.",
    "post_time": "Reviewed in the United States on November 15, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I thought the anti-fog feature would be a gimmick and not work but I can safely say its not and works great! Adjustable brightness is cool, but wish I would get just a alittle brighter.",
    "post_time": "Reviewed in the United States on May 4, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "My Splurge",
    "rating": "5.0 out of 5 stars",
    "content": "Doing my bathroom renovation on a budget but so happy I splurged on this mirror. It is amazing and worth it!",
    "post_time": "Reviewed in the United States on April 4, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "For the money it looks pretty decent on the wall, the lighting is not even all the way around the frame and in some spots it shows darker than the rest of the framed area. Still looks pretty nice when it’s up and definitely different than a plain old mirror. If it lasts for quite a few years I’m saying it will have been a good buy.....",
    "post_time": "Reviewed in the United States on March 2, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Not superb, but not terrible either....",
    "rating": "5.0 out of 5 stars",
    "content": "Also you need to watch the other types of lighting you have in the room, because if the light color is different than one or the other of the lights seems to look out of place...",
    "post_time": "Reviewed in the United States on March 16, 2019",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The lighting is great. And I love the touch on/off switch. It was screwed too tight in the back and made some of the back plastic crack around the screws. That was the only issue. My boyfriend had to strip an old lamp wire so I would be able to plug it in to an outlet, a different alternative if you rent like we do and can't do any real wiring. Bought it new, and I think it is worth the money.",
    "post_time": "Reviewed in the United States on October 5, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Very satisfied",
    "rating": "4.0 out of 5 stars",
    "content": "The mirror met all my expectations. It was easy to install and works like a charm. Before getting into the shower, touch the defrost mode, and when out of the shower, the mirror is clear. The adjustable light brightness is a nice touch. Would recommend this product if that is what you need.",
    "post_time": "Reviewed in the United States on November 29, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Exactly what she was wanting. These lights are not for bathroom lighting but for mirror lighting only. Look awesome and worked as expected. Installation can be a pain, wish it had a bracket instead of just screw holes, but it works.",
    "post_time": "Reviewed in the United States on April 19, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Good lighted bathroom mirror.",
    "rating": "5.0 out of 5 stars",
    "content": "The product is designed extremely bad. The back of the mirror is solid flat rather than having a void that can accommodate wire or outlet (even a recessed outlet), a wire projects out of flat surface at the back, it would not allow the mirror to be installed flushed on the wall. The screw holes at the back of the mirror to hang on the wall right at the edge of the mirror back frame (less than 0.5\"), and they are fixed. You have to get the screws on both side exactly at a precise distance to mount the mirror, no room for adjustment. This is even a bigger problem if you have to change the location of the screes on the wall (because of wires, studs or other obstacles), and now you will have at least one of the holes outside the area covered by mirror. That is a huge problem on a tiled wall as you cannot fill a hole in a tile and make it good.  Overall, very poor design, low quality material. Had to return and buy from another brand. Waste of time.",
    "post_time": "Reviewed in the United States on February 29, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "We bought this mirror 10 months ago, and everyone loves it!  It is bright and beautiful.  Anyone who sees it (I make sure to turn the light on when we have company, to show it off!) always compliments us on it!  My son installed it, and he said it wasn't difficult, but, he is an electrician so I don't know if it's an issue for an untrained person.  It is one of the best purchases we made in our remodel!",
    "post_time": "Reviewed in the United States on January 9, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "She Loves Em",
    "rating": "4.0 out of 5 stars",
    "content": "I received both of these mirrors and opened them and was impressed. They will look great in new bathroom space; however, the biggest problem is both mirrors have scratches on the front of the mirror. They are not able to be buffed out as are into the glass surface. Having to get them replaced and hoping I just got unlucky that 2 have scratches and I won’t have to return them again. Will update review when replacements arrive.",
    "post_time": "Reviewed in the United States on March 7, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It is a beautiful mirror and so far, has fit most of my expectations.  My only draw back is the brightness.  I really anticipated more, but it is  just not a super bright vanity.  Love the look in my newly remodeled bath.",
    "post_time": "Reviewed in the United States on January 4, 2022",
    "pid": "B07MNDTY9C"
},
]