[
{
    "name": " Talking to Strangers: What We Should Know About the People We Don't Know ",
    "stars": [
        "63%",
        "22%",
        "10%",
        "2%",
        "2%"
    ],
    "pid": "B07NJCG1XS",
    "ratings": "23,609 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "The Strange New World of Living Around Strangers",
    "rating": "5.0 out of 5 stars",
    "content": "Malcolm Gladwell has at this point created a distinctive style of non-fiction. Social science research is combined with various narratives and then woven into a meta-narrative about something of widespread interest.",
    "post_time": "Reviewed in the United States on September 11, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "That “formula” is more or less followed in Talking with Strangers. However, with more success and experience Gladwell is less focused on simply saying something interesting and more focused on effecting reform in society. And, as with any person with a message for change in America, he takes positions that are bound to be uncomfortable and controversial.",
    "post_time": "Reviewed in the United States on November 14, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "An engaging and thought provoking read.",
    "rating": "5.0 out of 5 stars",
    "content": "The phenomenon at the center of Talking with Strangers is that, uniquely in modernity, we no longer live in a village or tribe where we know most of the people we interact with. Based on solid psychology, Gladwell explains that most humans have a default reaction to trust strangers.  When we don’t we rely on what Gladwell refers to as transparency—the idea that one’s inner self is revealed by facial gestures or body movements.",
    "post_time": "Reviewed in the United States on September 8, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Compellingly, Gladwell describes that people who don’t trust strangers are not necessarily the model we want to follow.  The same man who acted as a whistleblower against Bernie Madoff also holed up in his house fearing a government assassination.  If we don’t default to trust we end up in a society few would desire.",
    "post_time": "Reviewed in the United States on January 26, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "You Can't Give Strangers the Benefit of the Doubt",
    "rating": "5.0 out of 5 stars",
    "content": "Along the way Gladwell builds his case for sensible ways to navigate the stranger filled world by citing cases as diverse as Amanda Knox and Jerry Sandusky.  Some of the stances on controversial cases are going to offend some readers, but there’s really no way to discuss topics like child abuse and date rape without offending someone.",
    "post_time": "Reviewed in the United States on February 18, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "By no means does the reader have to agree with all that Gladwell says. However, his ability to build evidence leading towards a persuasive conclusion on how we should act towards with one another is a good example of how popular science should be conducted.  You can disagree that aggressive policing is being applied incorrectly or that alcohol consumption is a key factor in the rise of date rapes. But then you have to criticize Gladwell’s ideas and evidence.  While he’s not writing a peer-reviewed paper, the ideas in this book are amenable to scientific criticism.",
    "post_time": "Reviewed in the United States on January 20, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "New York, Central Park, Malcolm Gladwell and his lastest bestseller",
    "rating": "4.0 out of 5 stars",
    "content": "I actually liked this book the most of anything Gladwell has written.  Too many of his earlier books seemed written to pique one’s interest while having little real impact. Even if you find him offensive, self-righteous or just plain wrong you can’t deny he has something important to convey. Hopefully, Gladwell will continue to turn from focusing on the merely piquant to the central issues of the day.",
    "post_time": "Reviewed in the United States on November 6, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The author uses well-know case studies to make his points, starting and ending with the arrest of Sandra Bland and running through Cold War CI failures, Chamberlain's engagement with Hitler, Madoff, Sandusky, date rape, post-9/11 interrogation, Sylvia Plath, and LE crime analysis.",
    "post_time": "Reviewed in the United States on December 13, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Fantastic read!",
    "rating": "3.0 out of 5 stars",
    "content": "The one substantial fault I find is that in his arguing for the concept of default to truth.  Although I do find some validity in it, the examples he provides are all colored by authority bias - which by itself can have a significant impact on receptive belief.  In a bit of irony, in a book that argues for understanding context in interactions with strangers, in this bit on \"default to truth\" he avoids context which would weaken his presentation of that concept.  And in his discussion of both the intelligence and the law enforcement examples, I perceive he is too dismissive of the role of experience and professional competence, or the lack thereof, with his discussion a bit too focused on support for the concept the book is pushing.  Understandable to a degree, but I feel that by avoiding that piece of the discussion it weakens rather than strengthens his argument.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "On the other hand, his discussion of transparency / coupling / mismatching is very good, and put in an easily understood casual way of explanation that could serve as a useful reference in HUMINT training.  The same goes for the discussion of the counterproductive nature of coercive interrogation still struggling against the myth of its efficacy.  Finally, the section discussing hot spot policing is touches a chord, as it practical effectiveness has long been understood and there is a tremendous amount of information and training available focused on the methods of processes, but in far too many jurisdictions it is either ignored, misused, or simply incompetently managed in application.",
    "post_time": "Reviewed in the United States on September 17, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "Genuine Roller Coaster",
    "rating": "4.0 out of 5 stars",
    "content": "What this book provokes is all kind of emotions, from disgusting to stisfaction in understanding deeper most of people... I say most because sometime not even one can understand him or her self... just imagine strangers.",
    "post_time": "Reviewed in the United States on February 23, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Its a roller coaster because there were moments in the ones I felt a little bored and unnecessary dialogs or explicit description of sexual judgement; I think that if there is something a little technic in between about certin serious themes in a book, that kind of core language is not necessary.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B07NJCG1XS"
},
{
    "title": "The idea of default to truth",
    "rating": "2.0 out of 5 stars",
    "content": "Realy, there were moments in the ones I felt the book will never finish.  Finally it did through many passages, dialogs and understanding... sometimes story telling is not that detailed while it can make you bored,  however the book is really exciting...!",
    "post_time": "Reviewed in the United States on September 4, 2022",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Mr Gladwell thinks everyone one of us have same function in society,and when we fail,the default to truth justifies the wrong outcome.To me,is ridiculous to think that a CIA officer is ok defaulting to truth,apparently not been suspicious of double agents.Mr Gladwell live in utopia.",
    "post_time": "Reviewed in the United States on September 25, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "The Emporer has no clothes on.",
    "rating": "4.0 out of 5 stars",
    "content": "I ordered this book in great anticipation after watching multiple speeches by Malcolm Gladwell - a great speaker he is. Many aspects of this book are intriguing and interesting with great insight on a few of the many topics he addresses - like whether a person' exterior reaction to stress is an indicator of guilt or innocence - yet the overall premise of the book falls short, as Malcolm depends on many non-sequitur arguments to sustain an invalid premise between a black woman and a white cop.",
    "post_time": "Reviewed in the United States on October 17, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The primary topic of the book is the events that lead to the death (suicide) of a young black woman a few days AFTER an encounter with a police officer. Malcolm presumes to combine her death with other deaths that have occurred between black people and police officers, yet her death was a suicide - something he fails to explore in more depth - but a topic he mysteriously avoids in order to characterize her death as being at the hands of the police officer; which her death wasn't.",
    "post_time": "Reviewed in the United States on June 16, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "So how do we talk to strangers?",
    "rating": "5.0 out of 5 stars",
    "content": "  There are a many ways to improve these interactions between police and the public, but Malcolm uses a very weak argument to suggest that her death is a direct result of the woman's encounter with the officer, which was the onus for her being in jail. Malcolm's evidence is anemic, and he suspiciously avoids the responsibilities of the private citizens when also \"talking to strangers,\" in this case a police officer. Her response to the traffic stop was disproportionate to the circumstances, and while understandably frustrating to her, it did not warrant her over-the-top response which resulted in her arrest. Malcolm makes no effort to engage that subject, but instead avoids it all together in order to not put any blame on the woman for her own outcomes, even in the presences of an jerk-cop.",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A book that starts out with an intriguing topic, decays into another politically motivated, agenda-driven subject matter, and left this reader feeling like he had been bait-and-switched into thinking he was reading a thoughtful book with great insight into the human condition, only to realize the book's topic was politically motivated. Maybe another book.",
    "post_time": "Reviewed in the United States on November 3, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "It’s a Good read",
    "rating": "5.0 out of 5 stars",
    "content": "I listen to the RH podcast, and this season was all about this book. If you're heard RH recently, you'd be familiar with about 80% of the book.",
    "post_time": "Reviewed in the United States on September 9, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I get Gladwell's argument that how we talk to strangers is guided by the tendency to default to truth, the transparency fallacy, and failure to account for context (coupling), and the argument is persuasive, but I didn't get a concrete sense of what I should do with that knowledge other than \"being careful\" because talking to strangers can be fraught with misunderstanding, false assumptions, and cluelessness. I'm not sure he knows either.",
    "post_time": "Reviewed in the United States on July 25, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Should be a required read in school and among police officers!",
    "rating": "5.0 out of 5 stars",
    "content": "Gladwell draws from real life examples of how our misunderstanding of the communication of strangers, verbal and non-verbal, can lead to horrible situations. He draws the connection to policy making and especially policing, which ignores or misinterprets scientific evidence in these cases.",
    "post_time": "Reviewed in the United States on January 21, 2024",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I said at the beginning of this book that I was not willing to put the death of Sandra Bland aside. I have now watched the videotape of her encounter with Brian Encinia more times than I can count—and each time I do, I become angrier and angrier over the way the case was “resolved.” It was turned into something much smaller than it really was: a bad police officer and an aggrieved young black woman. That’s not what it was. What went wrong that day on FM 1098 in Prairie View, Texas, was a collective failure. Someone wrote a training manual that foolishly encouraged Brian Encinia to suspect everyone, and he took it to heart. Somebody else higher up in the chain of command at the Texas Highway Patrol misread the evidence and thought it was a good idea to have him and his colleagues conduct Kansas City stops in a low-crime neighborhood. Everyone in his world acted on the presumption that the motorists driving up and down the streets of their corner of Texas could be identified and categorized on the basis of the tone of their voice, fidgety movements, and fast-food wrappers. And behind every one of those ideas are assumptions that too many of us share—and too few of us have ever bothered to reconsider.",
    "post_time": "Reviewed in the United States on December 13, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "Common Sense",
    "rating": "5.0 out of 5 stars",
    "content": "I particularly liked the anecdotes or accounts of very recent history. This book got me to listen to the rest on Audible.",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have unequivocally loved every other Malcolm Gladwell book I’ve read except this one.  I think the policing analysis of the Sandra Bland case and other cases is right on.  As usual Mr. Gladwell’s analysis is spot on and very informative.",
    "post_time": "Reviewed in the United States on September 18, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "Good book",
    "rating": "5.0 out of 5 stars",
    "content": "I disagree wholeheartedly with the analysis that Graham Spanier was duped by Jerry Sandusky. The investigation of  the matter by former FBI Director Louis Freeh concluded that Paterno, Spanier, Curley and Shultz had know about the allegations of sexual abuse by Sandusky since 1998 and did nothing about it.  The case against Spanier was overturned on a technicality.  Spanier, like the leaders in the Catholic Church child sexual abuse scandal, was protecting the institution.  He is most certainly not the kind of person I want heading an institution teaching our young people.",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Regarding the Fraternity Party chapter, I’m left shaking my head.  All I know at the end of that chapter is alcohol mixed with young people is a recipe for disaster.  I neither agree or disagree with the outcomes of the cases cite in the chapter.",
    "post_time": "Reviewed in the United States on January 29, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Interesting but I’m not convinced the conclusions and analysis in Sandusky case are valid",
    "rating": "5.0 out of 5 stars",
    "content": "Item arrived on time and as described! Thanks!",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My first book of 2020. I am a neurotic introvert, so this book title gave me a quick sting of anxiety. Luckily, it wasn’t what I was expecting; it wasn’t a self-help book about how to practice your way into extroversion. Having read Tipping Point and Blink, I hoped this new effort from Gladwell would provide a similar pop-science look at a fascinating aspect of our culture that is often overlooked. It didn’t do that, either. Instead it starts with a story of a tragic encounter between a policeman and an unarmed person of color. How did their communication break down so completely that this woman ended up dead as a result of a traffic stop?",
    "post_time": "Reviewed in the United States on September 15, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "Good Experience!",
    "rating": "4.0 out of 5 stars",
    "content": "Gladwell uses this story as a backdrop for further conversation on the difficulty of communicating with strangers and the common assumptions and pitfalls into which we all stumble. The discussion doesn’t seem to break much new ground, but Gladwell is articulate and his argument is clear. I finished this book with a shrug and a quick scramble to find my next book. I wasn’t left with any deep or troubling truths to reflect upon and I didn’t feel the guttural  pull of the injustice described in the book. Perhaps Gladwell’s natural style--relaxed but informed, provocative but safe, relevant but untimely--works against him in this book. Instead of offering answers to problems, Gladwell presents a series of “what if” hypotheticals that do not seem to directly address the real communication problems described. Communication is tricky. That’s the whole of this book. Gladwell shares some fun anecdotes and some tragic stories but the book feels rushed to production and amorphous in message.",
    "post_time": "Reviewed in the United States on March 17, 2021",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "C",
    "post_time": "Reviewed in the United States on May 9, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "a good read",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoy reading Malcolm Gladwell‘s books as they are very informative and insightful. They are also entertaining and take on issues that are important in today’s world.",
    "post_time": "Reviewed in the United States on July 8, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoy reading Gladwell.  Most of the time I read nonfiction to see what ideas the author has and how they might compare with my own thinking.  That is easy to do with this book because he goes into great detail about the people and situations. There is a pretty scathing review in the Atlantic Monthly today which suggests that Malcom's peddling of social science has reached its own tipping point (not much left to offer).  It is probably true that Malcolm is too trusting of social science research which is often nothing more than commonly understood ideas dressed up with fancy language, or simply shoddy thinking and research that was good enough for an academic journal (though there are exceptions). Social science is a mess, but the behavior is still interesting to think about, and when reading Gladwell you can disagree or come up with your own ideas about what's actually going on.  No harm in that.",
    "post_time": "Reviewed in the United States on September 14, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "Questions are more interesting than answers",
    "rating": "3.0 out of 5 stars",
    "content": "I didn't find this book nearly as interesting as Gladwell's other writings.",
    "post_time": "Reviewed in the United States on February 25, 2024",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I found this book deeply engaging and challenging to digest in a positive way. In other words, the strong premise of how we talk to strangers has serious complications and impact in many situations that we are poorly equipped to deal with.",
    "post_time": "Reviewed in the United States on May 18, 2021",
    "pid": "B07NJCG1XS"
},
{
    "title": "Empty reading",
    "rating": "5.0 out of 5 stars",
    "content": "Also, I am working on being anti-racist and informally studying aspects of criminal justice reform. This book unpacks some issues that explain part of our systemic issues. I am grateful that the author did the hard work and explained it well. This book will change me. Lots to think about.",
    "post_time": "Reviewed in the United States on January 19, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is not a pleasant read. If you are looking for a romantic comedy, you got off track somewhere. This takes a hard look at human nature, motives, and misunderstanding, and that can get uncomfortable, at least for me. The concept of coupling was so interesting. When a book challenges my understanding, I grow and that made this book beneficial.",
    "post_time": "Reviewed in the United States on June 2, 2022",
    "pid": "B07NJCG1XS"
},
{
    "title": "Timely and Important",
    "rating": "5.0 out of 5 stars",
    "content": "Malcolm Gladwell makes a simple point that a lot of rape cases are in the context of excessive drug and alcohol abuse. An altered state of mind, by definition, will make you unable to show physical discomfort or resistance because you're literally not conscious, even though your eyes are open and you're talking. He then uses a series of experiments and anecdotes to show how a lack of resistance can be misinterpreted by the other partner as consent.",
    "post_time": "Reviewed in the United States on October 2, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Ultimately, his point is not that revolutionary--be careful with getting drunk and high and then being around strangers in a highly charged, semi-anonymous and sexualized environment.",
    "post_time": "Reviewed in the United States on September 12, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "This is the book we need right now, though unfortunately not the one we want.",
    "rating": "5.0 out of 5 stars",
    "content": "For making this point he has been skewered, accused of defending rape culture and of trying to excuse the behavior of rapists.",
    "post_time": "Reviewed in the United States on February 1, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "No, this is not what he's doing. Rather, as is typical for Gladwell, he's simply pointing out that \"consent\" is not binary -- there are many shades of grey. History will be kinder to this text than the criticism of this temporary hysteria.",
    "post_time": "Reviewed in the United States on February 15, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Good read",
    "rating": "5.0 out of 5 stars",
    "content": "The ideas in this book are disturbing and serious. If the theory is true, talking with strangers is difficult, and we often get things wrong for multilple reasons, I believe this book's message needs more discussion as a nation and as communities.",
    "post_time": "Reviewed in the United States on September 3, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "As Malcom Gladwell states, \"This book is a conundrum.\"  Studies. actual events, etc. all lead to the conclusion that we miss identify cues from strangers that often ends with bad results.  Although tone and word choice play a big part,  policing is a treacherous job. This book offers insight into why so many arrests go bad.",
    "post_time": "Reviewed in the United States on August 27, 2022",
    "pid": "B07NJCG1XS"
},
{
    "title": "Police Brutality or Training?",
    "rating": "5.0 out of 5 stars",
    "content": "In a time of extreme paranoia and division, Gladwell provides insights into why we think like we do and act like we do. His analysis of police work is right on.",
    "post_time": "Reviewed in the United States on October 27, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Malcolm tends to be a binary taste: if you enjoy his work this will be a thought-provoking read. If not, you're likely to flag it as an overly-squishy apology for bad behavior.",
    "post_time": "Reviewed in the United States on July 31, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Timely message",
    "rating": "4.0 out of 5 stars",
    "content": "And there, really, is the book's core theme spelled out: we are far too diverse in thought, opinion, behavior, and motivation to carry around the simple rules of evaluation which we assert are universal.",
    "post_time": "Reviewed in the United States on July 1, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In the analysis of a seemingly-simple case of police abuse Malcolm touches on the nature of lies and spies, of suicide and binge-drinking, to call us all to carpet for the way we think of each other, the way we behave to each other, and the way we deal with the \"abnormal.\"",
    "post_time": "Reviewed in the United States on August 15, 2022",
    "pid": "B07NJCG1XS"
},
{
    "title": "People are so peoply",
    "rating": "5.0 out of 5 stars",
    "content": "When taken with a proper measure of reserve, as all Malcolm's work calls for, Talking to Strangers provides an elegant master-class on human relations with a rich notes section to dive deeper on any parameter he dissects on.",
    "post_time": "Reviewed in the United States on December 6, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I thought Malcolm Gladwell's story was a compelling and engaging page turner. It's hard to not give a superior rating but the fact is the story almost tends to be skewed by the perceived authoritative position he takes. He did well to casually mention sources for references without over stating them. I do feel it was best to go short here as too much citing of sources can become boring. I loved the fact that he brings in the many biases inherent in visual interpretation of human behavior and that he's made some very valuable points about institutional disparagement that exists as you read these words. If you find yourself interested in understanding behavior and situational forces you will enjoy reading this story.",
    "post_time": "Reviewed in the United States on February 1, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Decent reference on current cultural issues in US",
    "rating": "4.0 out of 5 stars",
    "content": "Gladwell manages to piece together seemingly unrelated horrific, tragic, questionable, and confusing events to find a common thread among them. While I don’t disagree with a common thread, I am still pondering the last chapter and what it all really means. What do we take away? What do I take away? It’s a similar feeling at the end of all Gladwell books. I’m glad to have known and pondered these different events in our recent history, and to have gained some skills for the critical thinking needed to get through future events.",
    "post_time": "Reviewed in the United States on December 16, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My adult son recommended this book and it is a good read.  Would recommend.",
    "post_time": "Reviewed in the United States on March 19, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Interesting Analysis",
    "rating": "5.0 out of 5 stars",
    "content": "Malcolm Gladwell takes the reader through an interesting assortment of well known events to demonstrate how people reach the wrong conclusion about another person’s behavior during an event and often because of training that is not well founded. He provides information about well-known events that were not well known at the time of the event, resulting in a re-evaluation of your own conclusions about the event. Although this is an easy read, Gladwell guides the reader to some interesting theories. It’s worth the read.",
    "post_time": "Reviewed in the United States on August 3, 2022",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is so wonderfully thought provoking. It came into my life at a profound time, and brought some peace and clarity. In these trying times in the world, it is so refreshing to have a writer like Gladwell. This book is an example of non-threatening discussion about what we can all feel is wrong. The vast majority of us believe in the good in people, yet that isn't reflected in the state of our relationships across the board. This books shines a glaring light on why, with wonderful sources.",
    "post_time": "Reviewed in the United States on March 15, 2021",
    "pid": "B07NJCG1XS"
},
{
    "title": "Thank you",
    "rating": "5.0 out of 5 stars",
    "content": "Thank you, thank you, thank you, for synthesizing all of that information and presenting it in a way that is easily digestible. Now, if only I can find a way to share this with all the strangers in my life, so we can start to heal.",
    "post_time": "Reviewed in the United States on August 26, 2022",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I haven’t had much of an attention span for reading in quite a while but I loved this and kept stopping to tell my husband what I had just read. I really like Malcolm Gladwell and really appreciate his open mind and keen curiosity about people and our behaviors. I think this book should be required education in schools. It dispels the common untrue beliefs we have about other people and their intentions. It’s a great book for understanding more about peacemaking.",
    "post_time": "Reviewed in the United States on May 9, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "This book will blow your mind!",
    "rating": "5.0 out of 5 stars",
    "content": "Having a hard time getting into this book, but the beginning really makes me think.",
    "post_time": "Reviewed in the United States on November 18, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Thanks -- quick delivery. Book was as advertised. I would purchase from them again.",
    "post_time": "Reviewed in the United States on February 28, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Time to read",
    "rating": "5.0 out of 5 stars",
    "content": "The key irony, while i enjoyed this book and learned many things. I would sum this up as you cannot judge a book by its cover. No pun intended.",
    "post_time": "Reviewed in the United States on August 14, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "This is a great read, very comforting and easy to digest. I enjoyed the passage of time as it relates to the way that we communicate and or/need to communicate with others. Enjoyed!",
    "post_time": "Reviewed in the United States on December 2, 2022",
    "pid": "B07NJCG1XS"
},
{
    "title": "on time and as advertised",
    "rating": "5.0 out of 5 stars",
    "content": "This book was highly recommended by a colleague. The topic is somewhat interesting and like so much of  Galdwell’s work it’s emotionally compelling but ultimately light on rigour. It’s easy to see why Gladwell is as successful as he is, he’s glib and breezy, he focusses on tiny sample sets and interesting anecdotes. He generally echos whatever the current thinking on the matter is, but from an actual",
    "post_time": "Reviewed in the United States on September 9, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Ideas perspective, there’s not much there is there.  Having just watched his abysmal, self righteous, sneering performance in the Munk debates this week I realize why.  It’s not just Gladwells work that lacks substance, it seems Gladwell himself lacks substance.  He was utterly demolished by the brilliant Douglas Murray, and Matt Taibi (on the question of the trustworthiness of the corporate press).  This humiliation on the substance of the debate was so complete that the only way Gladwell filled time and space on stage was through the use of schoolyard bullying tactics, e.g. intentional use of diminutives mispronunciations of people’s names and of course, the ever present ad hominem attack.  Gladwell showed himself to be a sycophant, a cheerleader for the most superficial, popular, social talking points ultimately he’s no more than a well-heeled pseudo intellectual. If that sounds good to you buy this book, if not, I’d find better ways to waste your time and rapidly depreciating money.",
    "post_time": "Reviewed in the United States on October 1, 2022",
    "pid": "B07NJCG1XS"
},
{
    "title": "Good Research, boring topic",
    "rating": "4.0 out of 5 stars",
    "content": "I don't know why I bought this book. I guess I thought Malcolm Gladwell could never do wrong. It's a well-researched thesis, but the way he just adds filler upon filler upon filler for mundane topics is really annoying. Usually I can't put the book down, but this time I was getting bored and asking, \"when will he get to the point?\"",
    "post_time": "Reviewed in the United States on December 17, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It's more a niche topic and if you're into that social behavior stuff and could geek out over it, this is the book for you. If you're just a causal reader and want some entertainment with for your leisure time, I'd skip this book, it's too academic.",
    "post_time": "Reviewed in the United States on April 23, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Interesting Concept",
    "rating": "2.0 out of 5 stars",
    "content": "I read this during the shelter in place during the Covid-19 for my book club.  I don’t think that it was the best book to read during this time of self isolation.  Would have been good to read something a bit more uplifting.  That aside, this is a well-written and well-researched book.  It is very interesting to think about our own and history’s interaction with strangers.  Some chapters I enjoyed better that others.  I do think that some of this book will stay with me - after all we are always coming in contact with strangers!",
    "post_time": "Reviewed in the United States on March 27, 2024",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was our most recent book club and we all felt the same.  the title is misleading and the stories, whilst interesting , have little to do with the central idea. It's my first Malcolm Gladwell and have to assume that the others are are way better.",
    "post_time": "Reviewed in the United States on May 25, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "A huge disappointment",
    "rating": "5.0 out of 5 stars",
    "content": "Incredibly well researched argument on topics that I would typically only “make sense of” in a blur of confusion and emotions. That is to say, I don’t. Malcolm Gladwell is inspiring. His essay style writing on controversial topics is bold yet convincing. I was left thinking about the topics he mentioned for hours on end, which inevitably meant reading this book at a much slower pace. Would definitely recommend this read to anyone who is struggling to find their perspective and voice on a number of issues the way I am. First, how can I convince myself on a perspective. Then second, how can I convey my thoughts convincingly. I think both matters require a great amount of time and thought, both of which Malcolm has clearly mastered in this art piece.",
    "post_time": "Reviewed in the United States on September 27, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book will show police how to better behave when they pull people over and hopefully show those who get pulled over how to better behave.  Discusses  why  most crime is confined to such small geographical areas and how to stop it.  Why people jump off the Golden Gate Bridge and some ways to lower suicide rates. How spies, financial fraudsters and sex offenders get away with it for so long and the nature of the people that uncover their activity.  All of these seemingly far flung subjects are put together in an amazingly cohesive book.  Gladwell once again sheds light on the reasons behind why things are the way they are and the reasons are usually surprising.",
    "post_time": "Reviewed in the United States on October 21, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Review for Talking to Strangers",
    "rating": "4.0 out of 5 stars",
    "content": "Read this title as part of a book club, otherwise it's not typically my genre. I learned a lot more than I knew previously, from the UK's former PM, Chamberlain, to the Penn State case, to Sandra Bland's story. From Madoff to suicides and the unbelievable concept of coupling, though the book was on the longer side and some stories were troubling, I feel better equipped to understand others and I realized I'm not as good as I thought at detecting liars. And clearly neither are our judges or other trained professionals.",
    "post_time": "Reviewed in the United States on December 17, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Who hasn't had an encounter with a stranger that was so memorable that you can think back on it as a turning point in life, or cannot imagine it never happening. Setting aside the author's focus on interaction with police, I thought more often about my habit of talking to strangers in public, sometimes asking about their child, or making a comment about the weather, or just saying \"excuse me, you need to pick up you dog's poop.\" I might keep doing that , but it will take on another significance after reading this book. Purchased it after seeing author's interview on MSNBC.",
    "post_time": "Reviewed in the United States on October 9, 2022",
    "pid": "B07NJCG1XS"
},
{
    "title": "Another fascinating book by Gladwell",
    "rating": "5.0 out of 5 stars",
    "content": "First impressions are vital, they say,",
    "post_time": "Reviewed in the United States on July 21, 2022",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "But our biases get in the way.",
    "post_time": "Reviewed in the United States on December 28, 2021",
    "pid": "B07NJCG1XS"
},
{
    "title": "Eye Opening Details",
    "rating": "5.0 out of 5 stars",
    "content": "I would recommend this book to those who care about relationships and our society. An important read for young and old, indeed.",
    "post_time": "Reviewed in the United States on September 7, 2023",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is not so dissimilar from Gladwell’s past work, but it seems somewhat more tentative in its conclusions.  In some ways, I like this approach better than that of previous books where he had a tendency to make pronouncements.  Interestingly enough, the footnotes of the book are in some ways more interesting and engaging than the information in the chapters. I am not sad that I bought this book, but some readers may be disappointed that Gladwell’s change in tone and method here.",
    "post_time": "Reviewed in the United States on October 27, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "A change of method for Gladwell",
    "rating": "4.0 out of 5 stars",
    "content": "Didn't know what to expect but I love the way he writes. Although 300+ pages, it's an easy read for my second 300+ page book. Lots of stories. I am gonna order outliers next probably.",
    "post_time": "Reviewed in the United States on July 27, 2022",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I expected the pseudo-scientific hypotheses supported by little more than anecdotes, but I did not expect things to go so backward, like when Gladwell tacitly suggests Jerry Sandusky was falsely accused, absolves the Penn State administrators of their failings, and kind of blames the parents for being deceived by Larry Nassar because we \"default to truth.\"",
    "post_time": "Reviewed in the United States on September 29, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "First time reading Gladwell",
    "rating": "5.0 out of 5 stars",
    "content": "It's obvious to the point of common sense that people tend to believe others. It seems to me that his \"default to truth\" maxim oversimplifies these terribly complex situations. Gladwell, however, jettisons the nuance and frames the anecdotes in the book as clear examples where our \"default to truth\" is the culprit—just take his word for it. I'm not so sure he has met the burden of proof.",
    "post_time": "Reviewed in the United States on February 13, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Edit: Also, Gladwell never establishes a clear position on whether \"default to truth\" is good or bad. Early in the book, he uses the above examples (and others) to show that \"default to truth\" can be problematic. But he ties the introduction about Sandra Bland's fate to an example where police officers' training to AVOID defaulting to truth has led to the poor relations between police and the public. In this case, it seems to have precipitated Sandra Bland's suicide. If the point is simply that our \"default to truth\" is neither good nor bad, then I struggle to understand the point of this book.",
    "post_time": "Reviewed in the United States on July 24, 2022",
    "pid": "B07NJCG1XS"
},
{
    "title": "An Easy Book to Dislike",
    "rating": "5.0 out of 5 stars",
    "content": "I was a little bit worried reading through the reviews of this before purchasing... I loved many other Malcolm Gladwell books like Blink and Outliers and there are a fair number of disappointment readers. I personally enjoyed this book as much as his others. It is a really interesting book that tackles complicated issues and examines some fascinating examples in his typical writing style. I see people writing that he doesn't give clear solutions to the issues we have of detecting deception or communicating with strangers better, but that really isn't the point of the book, and with awareness of the difficulties we have people can draw their own conclusions about if/how they want to change how they interact with others.",
    "post_time": "Reviewed in the United States on December 20, 2019",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Very thought provoking and should be required reading by college students, especially those prone to heavy drinking, policy makers and the various branches of law enforcement.  We need to rethink our assumptions.",
    "post_time": "Reviewed in the United States on December 28, 2020",
    "pid": "B07NJCG1XS"
},
{
    "title": "Solid Gladwell Book",
    "rating": "4.0 out of 5 stars",
    "content": "There are so many ways to misunderstand people -- and that is when you are speaking their language.  This book explores the deep cultural roots that impact how we see the world, and explains how local customs, professional training, responses to stress can all conspire to create grave misunderstandings.  This is a great book to read when meeting people from strange lands or strange neighborhoods.  Gladwell does a fantastic job using famous matings between different cultures, and the many, overconfidences that can cause even professionals at the CIA from correctly spotting liars.  This book would be helpful to anyone who is in customer service, aviation, diplomacy, legal fields and many more, where you have to understand, work with and straighten out people.",
    "post_time": "Reviewed in the United States on August 17, 2022",
    "pid": "B07NJCG1XS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Gladwell's book makes some very salient points regarding are lack of ability in reading people who display signals that are contrary to our expectations.  He makes this point using various and diverse examples ranging from professionals and so-called experts to our every-day encounters. I gave it three stars for content but I felt it lacked any substantive remedy for the malady the he so carefully illustrated.  In the end, you are left hanging with the notion that his is who we are and there's not much we can do about it.  It appears from the reading, in fact, that an impersonal AI with some basic data would do a better job of reading people than we would and we could, be handicapping ourselves by using the visual stimulus heralded as the 80 plus percent of non-verbal communication.  An interesting yet incomplete work.",
    "post_time": "Reviewed in the United States on December 25, 2021",
    "pid": "B07NJCG1XS"
},
]