[
{
    "name": "        Umite Chef Mixing Bowls with Airtight Lids, 6 Piece Stainless Steel Metal Bowls, Measurement Marks & Colorful Non-Slip Bottoms Size 7, 3.5, 2.5, 2.0,1.5, 1QT, Great for Mixing & Serving       ",
    "stars": [
        "80%",
        "11%",
        "5%",
        "2%",
        "3%"
    ],
    "pid": "B07Q2BJBJ6",
    "ratings": "27,888 ratings",
    "other_info": {
        "Bowl Material": "Stainless Steel",
        "Number of Pieces": "6",
        "Brand": "Umite Chef",
        "Color": "Multicolor",
        "Style": "Modern"
    },
    "discount_price": "$ 32.26",
    "normal_price": "$40.99",
    "about_this_item": [
        " PREMIUM MATERIAL: Each bowl is made of high-quality heavy gauge stainless steel, which is resistant and rustproof. Umite Chef mixing bowls feature a mirror finish interior and fingerprint-proofexterior. High-quality food grade stainless steel, you and your family can ues it with peace of mind  ",
        " LARGER BOWL SIZES: Our stainless bowls deeeper than standard bowl sets, allow for larger servings . This set contains sizes1.5, 2.0, 2.5, 3.5, 7 quarts, that gives you much more flexibility, and less mess, satisfy your demands for mixing large batters, tossing salads, washing vegetable, marinating and storing, etc  ",
        " EASY TO CLEAN:The silver bowls feature a shiny interior and fingerprint-proof satin exterior, Which are simple to clean by hand  ",
        " NON SLIP SILICONE BOTTOMS: Flat silicone bases prevent the metal bowls slippage when mixing, you need not to worry about the bowls will wobble when mixing, beating and whipping.  ",
        " TIGHT-COLORFUL LIDS: Flexible BPA free plastic lids closely fit the bowls, keep your food fresh, tight fitting lids are great for food storage, great choice for storing food for longer.  "
    ]
},
{
    "title": "Easy to store!",
    "rating": "5.0 out of 5 stars",
    "content": "Compact, neutral, and holds a lot! The durability is fantastic and I love how they all stack inside of one another, calls for easy storage!",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the bowls. They were lighter in weight than I thought. The lids may be slightly bent, but they fit perfectly into the bowls. The colors are cute and very practical. I recommend them and would buy them again.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Love the bowls",
    "rating": "5.0 out of 5 stars",
    "content": "I love that they nest nicely and are color coded with bottoms that match their tops. Great for use with cooking and baking.  Also love to store leftovers in them.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I grew up in a household that only ever used glass mixing bowls, so this is my first experience with metal ones so I don’t know if they’re supposed to be this soft and scratch this easy or not but I was quite shocked. The very first time i used them I used my hand mixer to whip up some quick buttercream and I was shocked at how awfully scratched it was afterwards. Like I said, I don’t know if that’s normal but I feel like even if it is, these bowls seem softer to me. Just wanted to mention this for future buyers to be aware of.",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Love the bowls and tops",
    "rating": "4.0 out of 5 stars",
    "content": "The lids fit well but do not make them leak-proof. The colour of the lids is nice too and they look exactly like the image.",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I think these bowls are great value for money though, particularly if you’re like me and desperately needed new mixing bowls, but aren’t too picky.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Love it but they scratch easy",
    "rating": "5.0 out of 5 stars",
    "content": "The kids bent a little after washing them on the top rack, but they still close. The bowls are great, and I would definitely recommend them. Just... hand wash the lids if you care about them.",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Bought for my mother to replace very large tupperware bowl she had purchased from our milkman (yes milk delivery man) 50 years ago that finally cracked!  She loves them.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Lids not fully dishwasher safe",
    "rating": "4.0 out of 5 stars",
    "content": "I love the colors of the lids and the bottoms of these bowls.  The grip of the bottom of the bowls on the counter makes for an easier time mixing ingredients.  I would recommend hand washing the lids.  Left one of these at a relative’s home and they washed it in the dishwasher, bowl was fine but the lid won’t seal well any longer.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "If the lids would stay on... they would be a five star for me.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Great bowls, lids have issues",
    "rating": "4.0 out of 5 stars",
    "content": "I love these stainless steel stacking bowls.  I'm not a fan of the lids.  The lids do work wonderfully, as long as you don't refrigerate them.  I opened my fridge and found the lid curled off the bowl.  I can use the lids and have them work properly as long as they remain room temperature.",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I was looking for some metal mixing bowls to use when I use my mixer. These bowls have been wonderful! Very stable, doesn’t slip. I even tried the highest speed of my mixer and didn’t put a hand on the bowl- stayed stable! Very large bowls and great quality for the price. The only downside is the lids. The lids do not stay secure. I don’t store things in mixing bowls often, so this isn’t a deal breaker for myself, but may be for some looking.",
    "post_time": "Reviewed in the United States on February 5, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Great, nonslip bowls! Lid doesn’t stay on though.",
    "rating": "3.0 out of 5 stars",
    "content": "These bowls are very nice. The lids however are a different story. As soon as you put the sealed bowl and lid in the fridge and they get cold, they will no longer seal. It wouldn’t be a huge deal but it’s hard for my husband to bring a salad to work in his lunch box (construction) when the lids won’t stay on and that was the main reason for this purchase.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So many bowls, each with lids and the nonstick bottoms make these bowls, outstanding!",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Lids won’t suction when cold.",
    "rating": "4.0 out of 5 stars",
    "content": "Great set of bowls with several different sizes for all your cooking and storage needs. Sturdy and well designed. The silicone bottoms are nice on noise reduction on your countertop. Easy to clean and store since they nest inside eachother.  The only down side is that the lids are not \"airtight\". The lids fit nicely, but are not snug enough. The plastic is rigid and doesn't always fit the bowl tightly. Otherwise I would have given them a 5 star rating.",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought these after my plastic bowls were just too scratched to keep. I love these. They are lightweight, yet sturdy. They stay put on the counter. I use them a lot and they have held up well.",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Great value!",
    "rating": "4.0 out of 5 stars",
    "content": "I needed a good set of stainless bowls and I liked they came with lids.  You just put the lid and press down and it pressurizes for a good seal on most of the set.  Unfortunately a couple of the bowls lids don’t work as well but overall I’m good with them.",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm 70 years young and these are the Best bowls I have ever had!!  I cleaned out my kitchen, new appliances, gave the church things I don't use, the inside of my cabinets rearranged, and shined the cabinets.  While I was doing this I was watching a tv show and they presented bowls.  I stopped what I was doing and checked it out then as always I checked out Amazon and found these.  The rating were like night and day!  These are Beautiful and they do stay put when mixing!!  I love Amazon!!",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Mixing bowl set",
    "rating": "3.0 out of 5 stars",
    "content": "I washed these and started using them. They are pretty and sturdy and easy to use. However, the first lid I used would NOT STAY ON. I purchased these because the hard plastic bowls I currently use have lids that do not stay on. What good is a lid if it doesn't seal?",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I know it’s on the high-end in terms of price for bowls, however, the quality, I think it’s worth it the stackability, the textured bottom of each bowl, the airtight lids they wash well I just hand wash mine. I think if you want to elevate your kitchen. This is one option for you. I do really really like them though. You can make a salad. You can put the lid on it. Keep it in the fridge you can they’re nice enough you can use them to display your fruit. If you need to prep to make a cake or some thing, I think that they’re a good product very well-made and they’re not just your traditional  Bowl not that there’s anything wrong with that but I’m saying if you wanna elevate the look of your kitchen without doing like a major revamp, you can always change your bowls and your hot pads and towels and give your kitchen space and entirely different look. There a nice white bowl , it’s not your cheap flimsy tin. Feeling kind of bowl. These bowls are very good quality. I highly recommend.",
    "post_time": "Reviewed in the United States on September 8, 2023",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Love these",
    "rating": "5.0 out of 5 stars",
    "content": "I use them everyday.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Lid on green bowl after 1 wash isn't fitting snug anymore, sits on top loosely and all warped out of shape. Pretty much useless for storing food.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Lid fitment",
    "rating": "5.0 out of 5 stars",
    "content": "I wanted stainlesss steel bowls with color and lids but also wanted bowls that were a good size and not just small mixing bowls. These bowls are great quality and check all those boxes. They have great lids and are even dishwasher safe. Really glad I bought them.",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love these bowls, the largest one is HUGE and will be great for baking and cooking, good quality, no dents and comes with lids. Bonus!",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Best Stainless Steel Bowls I have found",
    "rating": "5.0 out of 5 stars",
    "content": "These are exactly what I wanted... bowls with lids that would stay sealed.  These work great!",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "These are a really nice set of bowls with one exception- the 7 quart bowl lid, mine is purple, doesn’t fit snug onto the bowl so you can’t really use it, especially to take it anywhere or store in the refrigerator. Would have given 5 stars if not for that one lid issue",
    "post_time": "Reviewed in the United States on February 6, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Great Bowls",
    "rating": "5.0 out of 5 stars",
    "content": "Nicely constructed and attractive; pleased with this product",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "These are nice bowls.  A little on the light weight side, but working out well so far.  The rubberized bases keep noise level down and they don't go sliding around.  Have washed in dishwasher a few times and holding up well.  I like em'...",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "The lids are a very nice, tight fit",
    "rating": "3.0 out of 5 stars",
    "content": "08/05/24 Update: The lids are useless... They do not fit correctly and do NOT seal.  Very dissappointed.  I have to use aluminum foil or saran wrap to cover.  The lids are now in the trash.  Hence, have reduced to three stars as my initial review of the the bowls stands... so far...",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought these bowls hoping the seal was going to last for the bowls. Nope after a year of using them. The seal is gone. Very disappointed.",
    "post_time": "Reviewed in the United States on June 7, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Very nice",
    "rating": "5.0 out of 5 stars",
    "content": "I have read the reviews above that the lids are loose I so I went through mine and all of them fit nicely but one and I believe it’s because I stuck the lid in the bottom basket of the dishwasher. Other than that they are very good I love how they all stack neatly",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Change to my earlier review..",
    "post_time": "Reviewed in the United States on April 13, 2022",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "I do like these bowls; BUT...",
    "rating": "4.0 out of 5 stars",
    "content": "I had some dried, sticky sweet orange sauce that was in the small bowl and I used some baking soda & vinegar to clean it off. After just a couple minutes of scrubbing, and cleaning off the sauce, there was a small hole in the bowl! So, while these are lightweight, they are NOT solid stainless steel. Also, I looked for warranty information and found nothing here on Amazon to contact the manufacturer, Umite Chef. I googled and all I could find was that the trademark had expired in 2020 due to:",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Abandoned-Failure To Respond Or Late Response",
    "post_time": "Reviewed in the United States on January 7, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Warped Lids",
    "rating": "5.0 out of 5 stars",
    "content": "So my friends, I would have to assume these are all back stock that is being sold off and there will be no warranty or additional assistance, after the sale, should anyone need it.",
    "post_time": "Reviewed in the United States on August 20, 2022",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Sturdy enough to actually USE; but light enough for older hands & wrists to manipulate. I love the coated bottom for counter stabilization. I don't know if that will affect using them over hot water for tempering chocolate or eggs & butter; but if so, I have one that's non-coated. However, it is something to consider. The lids fit well; but not water-tight in all cases. The size range gives me prep bowls & dough rising bowls to a big bowl for party salads. I absolutely recommend these!",
    "post_time": "Reviewed in the United States on April 2, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Functional and Feng Shui approved!",
    "rating": "5.0 out of 5 stars",
    "content": "Exactly as pictured but may not be dishwasher safe because the lids warped during the drying cycle. Still love them no the less, just something to note",
    "post_time": "Reviewed in the United States on March 1, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Decided our kitchen needed a facelift this year and decided to go with these for our new mixing bowls. Love the lids and also love that they all fit inside the big one. Definitely great for our cabinet Space. And kind of a fun random thing, when water hits them when you’re washing them,  it sounds like a sound bowl at a sound bath. Lol.",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Absolute YES",
    "rating": "5.0 out of 5 stars",
    "content": "For sure get these if you need functionality or zen feng-shui-ality 😉",
    "post_time": "Reviewed in the United States on June 8, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Edit: have had these a few months now and the lids are starting to warp some, they still work if something is stacked on top of it, but if you need these for airtight, I’d try another brand!",
    "post_time": "Reviewed in the United States on December 17, 2023",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Works ok",
    "rating": "4.0 out of 5 stars",
    "content": "Nice and light but sturdy. Don’t dent. They are scratched to heck but I guess I expected that with baking. Sizes are good. Covers are not airtight by any stretch of the imagination.",
    "post_time": "Reviewed in the United States on January 12, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I wanted these for the non slip bottom and am very happy with these bowls. Having lids for them is an added bonus.",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Mixing bowls with silicon base",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve been needing some mixing bowls and these fit perfectly with what I was looking for! I love the variety of sizes! I wish the lids went on a little different, but I still love them!",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very rarely write reviews but was so impressed that I'm making an exception.",
    "post_time": "Reviewed in the United States on March 28, 2022",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Great",
    "rating": "4.0 out of 5 stars",
    "content": "Bought one set for my mom then became jealous so bought another for myself.",
    "post_time": "Reviewed in the United States on November 23, 2023",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Best feature: nesting bowls AND nesting lids. Storing is easy and organized and makes finding the correct lid for the bowls effortless. (How many times have you searched for the right lid for any storage container?)",
    "post_time": "Reviewed in the United States on November 25, 2023",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Bought 2 sets!",
    "rating": "4.0 out of 5 stars",
    "content": "- Being able to stack the sealed bowls on top of each other is a big plus.",
    "post_time": "Reviewed in the United States on January 24, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "- The seals are air tight.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Would Buy Again",
    "rating": "3.0 out of 5 stars",
    "content": "The biggest surprise: I know it is not wise to put something hot in metal bowls if you want to avoid getting burned. I also know that the silicone base is probably not oven proof.  But I accidentally left one drying inside the oven and didn't discover it until the oven had preheated to 425º !!! It was smoking a bit but did not melt or deform in any way. I can't even tell which bowl it was anymore.",
    "post_time": "Reviewed in the United States on September 18, 2022",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One star off:  It's impossible not to scratch the inside of the bowl if using a whisk or stirring with a metal object.",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Needs a 5 qt size",
    "rating": "4.0 out of 5 stars",
    "content": "I just received this and have not yet used it. It looks like a nice set. I like the nonslip flat bottom. Unlike some other reviewers mentioned the cover seem to fit well.  I can’t give it five stars because there isn’t obvious gap between the largest and second largest size in the side where a 5 quart bowl would go. 5 quarts would be a perfect sized mixing bowl and its absence is felt.",
    "post_time": "Reviewed in the United States on September 18, 2023",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought these bowls mainly to use the larger ones as water bowls for our dogs that we put in different places in the house.  They have a great product on the bottom (maybe silicone) to keep the bowls from sliding.  The colors are really pretty.  These bowls are a great quality and are not flimsy.  I am very happy with this purchase .",
    "post_time": "Reviewed in the United States on January 29, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Love them",
    "rating": "5.0 out of 5 stars",
    "content": "Work the money very easy to storage and stack, lids are a big help as well",
    "post_time": "Reviewed in the United States on April 15, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The lid on the 7 qt bowl will not seal. I have washed by hand rather than washing in the dishwasher so the lid would seal well. However , it has never sealed properly. Please replace lid?!",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Worth the money",
    "rating": "4.0 out of 5 stars",
    "content": "I love these bowls, they're lightweight but sturdy, they stack well, but even after watching the videos, I can't get the lids to seal. It's not because I haven't tried all the different tips, these lids are just a bit too small for the bowls.",
    "post_time": "Reviewed in the United States on November 26, 2023",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "These seam great so far. A little worried that the tops won’t last forever/aren’t seal tight. But the bowls are great",
    "post_time": "Reviewed in the United States on December 9, 2023",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Lid needs replaced",
    "rating": "2.0 out of 5 stars",
    "content": "HATE the lids, LOVE the bowls. After washing the bowls & lids in the dishwasher (and nowhere does it say you should not) after unpacking them, no matter what 'video or write-up' I follow to properly use / place these lids, they will not stay seated and make that airtight seal. I have 'adjusted' as shown in the product video - bent, place in a deep at an angle, pressed down hard - it rises up and no airtight seal is provided. Lids should not be rocket-science. Perhaps I just got a bad batch of lids & bowls OR the dishwasher (only air-dry setting) wrecked them. Not a single one will seal.  I am not 'putting them on wrong' and  I have 'aligned them properly' .... nope. I will do something else with the lids as I passed my return window.  AND, the lids do not stack inside like other sets, they must linger about on top taking up space.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "All sizes were here. They were nicely stacked and organized in box. Very sturdy and thick. Can't wait to use them.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "The bowls are great, the lids, not so much.",
    "rating": "5.0 out of 5 stars",
    "content": "I bought these for my wife so that she could stop using our Tupperware for tumric and they being stained orange.  She loves them.  No complaints.",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "B07Q2BJBJ6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use them myself and also gift them. People love them and I see them use them all the time. My college kids love the fact that they take up no space!",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "B07Q2BJBJ6"
},
]