[
{
    "name": "        CUSHIONAIRE Women's Lane Cork Footbed Sandal With +Comfort       ",
    "stars": [
        "71%",
        "14%",
        "7%",
        "3%",
        "4%"
    ],
    "pid": "B07RYX8F1C",
    "ratings": "65,537 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "2nd time was a charm",
    "rating": "4.0 out of 5 stars",
    "content": "We had a bit of a pickle with this one. We ordered the sandals, received the sandals, and noticed that each shoe was a different size! How does that happen? - anyway, we returned it with no issue and received the correct order on the 2nd go-around. These are for my daughter and she loves them. They are comffy, look like the expensive brand, do not cost as much as the expensive brand, and she loves them! Definitely order a half size or one size up.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I saw some of the reviews were mixed on sizing. I’m 5’10 and a size 10 shoe. I’ve never in my life had to upsize until I got these. The 10’s were very narrow, my heel was slightly over the edge and I had tons of toe cleavage. Not a good look. I was a little mixed on quality they definitely were less quality of Birks but I didn’t want to pay Birks price right now. I returned the 10 ‘s and got 11 wide. I have never worn an 11 wide in my life and I’m a little traumatized but hey they fit and I saved some money for now.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Size up",
    "rating": "4.0 out of 5 stars",
    "content": "First and foremost these are great shoes! I find them comfortable and easy to wear all day without issue.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Some things to keep in mind:",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Size up!",
    "rating": "4.0 out of 5 stars",
    "content": "1) you definitely need to size up. I usually wear a 10 in every brand but these I needed an 11 and I have literally no wiggle room",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "2) the toe is very pointed in the big toe area and if your toes aren’t the same shape then they’ll hurt",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Pleasantly surprised",
    "rating": "5.0 out of 5 stars",
    "content": "3) the arch support is veryyyyy minimal if any",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have only worn these sandals for one day but so far they are a keeper. First off I did order a half size up from my normal size of 7.5 so the size 8 is the right length. I have another pair of cushionaire in a different style and the 7.5 is long so it was odd that this style is sized a bit differently. The foot bed is comfortable in fact more cozy than the name brand sandal that I own that has a hard footbed. I was able to wear them right out of the box and there was no break in period. A few things about this sandal is that the style is a bit square in the width so for people who do not have much girth to their foot, they feel a bit loose and the straps are not easy to adjust so I just left them the way their arrived. With this style there is a lip that trails along the toe edge and I have to be carefully not to walk too fast or wear for too long as my toes will be irritated by that edge. But overall I was able to wear them all day at work, granted I sit at my desk most of the day, but they were comfy and quiet to walk in. I think for the price they are an excellent alternative to the name brand look alike.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Cute and Fits Wide Feet",
    "rating": "4.0 out of 5 stars",
    "content": "I needed some non fancy navy blue slip ons, and these fit the bill. The foot bed is comfortable but stiff, and are wide enough to fit my wide foot. They're not so great that I'd get them in every color, but they're good enough for a slip on and go sandal.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My birks were worse for wear after 5 years of heavy use. I got these to use on a family vacation and because I didn’t want to spend $150 on a new pair. These are great dupes. They’re comfortable and come in a variety of colors.",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Just try them!",
    "rating": "5.0 out of 5 stars",
    "content": "Since these are back in style, and I never had a “name brand” pair, I thought I’d try these. I’ve been wearing them over the last 2 months or so. I’m not sure how comfortable they would be walking around, since I’ve mainly worn them to work a desk job and just running out to grab a few things from the store, but they are super cute. Worth a try if you like the style.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These sandals look just like Birkenstocks and are very comfortable.  I spend a lot of time on my feet and my feet don’t hurt at the end of the day when I wear these.  The only downside is they wear out a lot quicker than Birkenstocks.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Comfortable Sandals",
    "rating": "5.0 out of 5 stars",
    "content": "I have worn these sandals practically everywhere all summer long. They are comfortable even for a day at the amusement park with lots of standing/walking. I will defiantly be buying more once the ones I have are worn out. They also look cute with just about any outfit!",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nice shoes for comfy, cozy shoes for cute outfits. There is a bit of a breaking in period. I wear them around the house and outside all the time.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "So good!",
    "rating": "4.0 out of 5 stars",
    "content": "The delays in delivery was a bit long as I ordered them for my granddaughter for school and they kept getting delayed. My granddaughter loves them.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is my second pair of these sandals. They are comfortable and great quality, especially for the price! I’ve worn each pair almost daily and they last years. I got the stone color this time and because they are lighter in color I can see some dirt marks on them and need to figure out the best method for cleaning. True to size, great shoes overall!",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Cute House Shoes",
    "rating": "5.0 out of 5 stars",
    "content": "As I person with wide feet, I find that this buckle strap design is an absoulte necessity.  Rich, blue color. Comfortable insole design with good support.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Bought for someone after my dog chewed one of my friends same shoes!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Delays",
    "rating": "5.0 out of 5 stars",
    "content": "She said they fit well; they just need to to be broken in.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are such a good substitute for the overpriced brand. They have held up very well to almost daily use this summer. They clean easily as well.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "They’re super comfortable and stylish,",
    "rating": "5.0 out of 5 stars",
    "content": "\"My daughter \"had to have\" these CUSHIONAIRE sandals, and now all her friends have them too! She absolutely loves them—they’re super comfortable and stylish, with the cork footbed providing great support for all-day wear. She wears them everywhere, and they look great with everything from jeans to dresses. The quality is fantastic, and they’re holding up really well, even with constant use. It’s no surprise that these sandals have become the go-to for her and her friends. If you’re looking for trendy, comfy footwear, these are a must-have!\"",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "These sandals are very comfortable. I ordered the stone nubuck 10W since I wear XX wide shoes. Because of the adjustable buckles I was able to fit in these.  Love the color which will blend in well with all outfits.  I gave a 4 star review because they run short.  I normally wear a size 10 and had to exchange them for an 11. These are going to be perfect for the summer and my upcoming Mexico vacay!",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Comfortable and cute ... but too short!",
    "rating": "5.0 out of 5 stars",
    "content": "I love them and I wear them pretty much everyday, I’ve had them for a few months now and they’re still going strong, they’re super comfy too. They’re comfortable from the start but even better when you break them in.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "since I found Cushionaire shoes I have ordered pairs for two of my granddaughters, who love them, and another pair for myself. They have several really cute styles to chose from at a price 3 and sometimes 4 times less than that other brand whose prices start around $100. They are very comfortable with soft foot beds that give when you walk.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Loveeee them",
    "rating": "4.0 out of 5 stars",
    "content": "They seem like they’d be pretty comfortable if they fit. I’m usually an 8 1/2 and nines were too small.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Daughter likes these sandals for the price. She said they’re more comfortable than the much more expensive Birkenstock.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Comfort at a great price.",
    "rating": "5.0 out of 5 stars",
    "content": "run and add to cart immediately! They are so comfortable and feel more cushion-y and supportive than the real Birkenstocks.  I walked 7mi in them around NYC, my first time wearing them and my feet never hurt or got blistered. Absolutely in love with this purchase, plus who doesn’t want to save two-thirds the price with two day shipping and so many color/design options!! ✅",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Seriously I love these shoes...they are actually more comfortable then my true Birkenstocks. And I think they are just as cute. I wear these everywhere. Great purchase at 1/3 the price.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "cute but small",
    "rating": "4.0 out of 5 stars",
    "content": "I have found these to be some of the most comfortable sandals I've purchased recently. When I wear them a decent length of time my feet get a little raw on the bottom outside edge by my pinky toes - otherwise absolutely no discomfort! They seem supportive but cushy too. I probably will be purchasing a second pair in the future. (I do like that the straps are adjustable as I have wide feet. I also went with my normal size which was half a size larger than amazon recommended)",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are an excellent dupe for birks. They are easily adjustable and do not take too long to accustomed to your feet. I get several compliments when I wear them.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "comfy and worth it",
    "rating": "5.0 out of 5 stars",
    "content": "Bought these as a knock of to Berks and I decided these were just as good if not better. After a few months I still use these daily and they are just as good as the day I got them. My children want me to order them a pair as well. Will buy more in different colors",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very comfy! Fit TTS. The fabrication is a little cheap looking if you examine closely. They look cute at a distance. Why will shoemakers put a white sole on a black and tan animal print? It really cheapens the appearance. But for 29 to run around in the summer at the beach, they are fine. Looks cute with white jeans, shorts and shirts and a black tee.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Sole should be black",
    "rating": "5.0 out of 5 stars",
    "content": "I have other similar sandals by the more popular brand name but thought I’d give these a try and see if they were up to par for less money. They are very comfortable and fit to size. I wear them often with jeans, maxi dresses and shorts. They did stretch a bit with wear but the adjustable straps are great to tighten them back up. I always seem to have good luck with Comfortaire shoes.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great buy for the money!  I have a lot of foot issues and these fit very well and are comfortable with or without socks.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Comfortable and cute",
    "rating": "5.0 out of 5 stars",
    "content": "I have worn these shoes ALLLLLLLLLL summer. I did not want to spend $100 on the classic ones and these seemed just as good. I have a hard time with sandals like these getting smelly after one summer and there has been no issues whatsoever. They are perfect. I would not recommend for walking dogs, I did get a blister on the bottom of my foot but that was user error because I wear them looser. But like I said, user error. I would recommend these shoes 100% and will be ordering them again when these give out.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "While they are comfortable and softer than real Birks, I would say the run a bit smaller and more narrow. I’m a solid 11.5 and ordered 12 as some others have noted the sizing. They JUST fit. I would recommend sizing up if you’re a half size and if you actually need a wide shoe, these likely won’t cut it. While my feet are not narrow, I generally never need to purchase wide. In these, I needed wide with the straps buckled on the loosest hole.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Very comfy and well made.",
    "rating": "4.0 out of 5 stars",
    "content": "All that aside, I would still recommend based on comfort and price point.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "These were comfortable immediately for occasional wear.  I have never braved the break-in and cost of the real deal.  These \"Birken-nots\" or \"Birken-knocks\" were a cool addition to my summer footwear selection.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "ABSOLUTELY LOVE",
    "rating": "5.0 out of 5 stars",
    "content": "I was so happy with my first pair of white Cushionaire cork footbed sandals that I bought a second pair (to keep in reserve).  These sandals are comparable to Madden Girl's Brando style, which I've purchased in a variety of colors, but available in a wider color range.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "For the price and quality of these dupe Burks, I love them! The color is great. The fit is great.  I did go up a half size, but my normal size still would have worked for me, I just like a little wiggle room in my sandals.  I will be purchasing more!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Good fit, cushioned well",
    "rating": "5.0 out of 5 stars",
    "content": "These were a good fit, cushioned well but without arch support. They have a thickness to the sole, but would not recommend to anyone needing arch support as they are very flat in the foot bed.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "So I bought the viral Cushionaire Birkenstock dupes on prime day b/c I’ve been wanting Birks for awhile but they’re too pricey. I ordered two diff sizes b/c the reviews were all over on sizing. Spoiler alert - the 9.5 and 10 I got were the exact same size and width. So which color do I choose ? The oily brown seem to look more like leather but maybe the “rustic brown” on the left might be more versatile in color? I saw in another review photo that the oily brown color tends to show scuff marks easily, but it does make it look a little bit more like real leather like that. If this doesn’t bother you, I think that the oily brown looks More like natural, leather, and less plastic PU leather. They seem pretty comfortable out of the box, but I don’t know which ones to return.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Sizing inconsistent",
    "rating": "5.0 out of 5 stars",
    "content": "So incredibly comfortable and look just like the real deal. I am obsessed with these and will buy more. If you are thinking of buying, do it!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Loved these and seemed comfy but had to return because of size. I take a 7 but comments say size up so I got a 7 1/2, but too big in the width. 7 or 61/2 would have been good.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "LOVE THESE SHOES",
    "rating": "5.0 out of 5 stars",
    "content": "I had been wanting these for a while, finally got them and I'm glad I did.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Really cute slip on sandals, they go with so many outfits, and comfortable too. The straps are adjustable but if you tighten them they do rub a bit on the side of your pinky toe at first. I am usually a size 6.5 or 7.  I went with the 7 and they just barely fit just right. Now I have to order in another color!",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Great Rose Gold Color",
    "rating": "5.0 out of 5 stars",
    "content": "I love the look and feel of these sandals. They're a reasonable dupe for those \"other\" sandals. However, this style is slightly smaller than expected. My toes push against the very edge. Other style have fit just right.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These sandals are a great dupe for the Birkenstock. They are very comfortable and I have been wearing them all summer and they still looks new.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "I dig them",
    "rating": "4.0 out of 5 stars",
    "content": "IMO more comfortable than the real brand & much less expensive. I wear these almost every day when it’s appropriate. I stand a lot and I am not careful with my shoes and these hold up well. Definitely worth the purchase & will be repurchasing!",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Comfy shoes after you wear them in a fit. I got a size 9 and should have sized up half a size but they still technically “fit”. I think they are definitely worth the $ at $30.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Fit",
    "rating": "4.0 out of 5 stars",
    "content": "Not as soft and less arch support than I expected.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought a pair of these sandals eight years ago for $20. I wore them very consistently during those eight years. They were one of the most comfortable and reliable pair of shoes I have ever had. The old ones still fit and are still comfy, I only bought a new pair because the tread is so worn that it makes it a little slippery when it’s wet out.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Buy them!",
    "rating": "5.0 out of 5 stars",
    "content": "These shoes are a bargain! Buy them!",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Most comfortable shoes I own! And yes, I wear them with boho socks! Just in time for fall. Here in the Midwest,  it's customary to remove your shoes when you enter a home. These are perfecto. Haven't found one flaw.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Absolutely perfect!",
    "rating": "4.0 out of 5 stars",
    "content": "I love these shoes. I didn’t think they’d be as comfortable as the name brand, but they really were. And so much cheaper!",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall seems nice, but I was expecting to find more arch support. I didn’t like the curve on the tool as it out of proportion. Not for me.  I am returning it.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Super comfy!!",
    "rating": "5.0 out of 5 stars",
    "content": "Love these ! They didnt have to be “broke in” never have left blisters on my feet. I prefer these over my Birkenstocks",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Confortable -no arch support",
    "rating": "5.0 out of 5 stars",
    "content": "Just love these sandals. With so many different color options to choose fyour possibilities are endless. I made sure to spray them with waterproof spray before using them.This makes sure that they are protected in any spills can be easily wiped clean. You cannot beat the comfort of these sandals versus the leading brand. I highly recommend purchasing them. They fit true to size.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve rebought these a few times because they last so long. I wear them all day every day and they are so comfortable",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Comfortable",
    "rating": "4.0 out of 5 stars",
    "content": "Very cute and comfortable. Fits true to size",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Birthday present for my granddaughter she has the beige pair and I gave her black and she loves them so much like Birkenstocks",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Love",
    "rating": "4.0 out of 5 stars",
    "content": "I like these, don't love the color I purchased but kept them anyway. I have plantar fasciitis in my left foot and these are really comfy and supportive. I will say--these shoes are squeaky! I wish they weren't. I wear a 9.5 and that is what I purchased and they were true to size.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love these true to size and so comfortable!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Comfy but squeaky",
    "rating": "4.0 out of 5 stars",
    "content": "I read the reviews and ordered up by one full size. My regular size is 8.5 and I ordered a 9.5 and they fit. There are buckles that you can tighten the straps. They are hard and there is a little bit of arch support but not soft and cushioning like I expected.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These shoes are durable, easy to wear wanna be Birkenstock. The color resembles Birkenstocks and they are easy to care for.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Love these shoes",
    "rating": "5.0 out of 5 stars",
    "content": "I have plantar fasciitis that comes and goes, along with an old ankle surgery so I do need supportive footwear and adequate toe room for proper alignment.  I started feeling tight in my calves and feet at the beginning of sandal weather this year, and then I purchased these.  Since then, my feet have been doing great all summer.  They did take a week or so to break in but even then, they were not uncomfortable.  The material is soft feeling, the soles are supportive with the right amount of firmness and cushion, and (for me) they go great with a variety of styles.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s obviously not an exact dupe but still an awesome shoe on its own. Got this to wear on vacation so I don’t ruin my Birkenstocks. The Cushionaire feels higher since it has more of a cushion under the foot. My birkenstocks are older and worn in so they’re more comfortable and softer, but these are still very comfortable to wear immediately. So far the top strap feels kinda hard and is occasionally irritating but I would think with time it will soften and loosening it did help. Will keep these and see how they wear.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Order 1 full size larger",
    "rating": "5.0 out of 5 stars",
    "content": "The shoes are good quality and very comfortable! I would recommend sizing up one cause they do seem to run small.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered a half size up after reading the reviews but ended up returning for my regular size because surprise, it was too big. I can see these lasting years on end. Would buy another color!",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Amazing dupe!",
    "rating": "5.0 out of 5 stars",
    "content": "Love these shoes! They’re supportive, durable, and I love the color. I can wear them all day without foot pain.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "OMG how I love these shoes. They are comfy and inexpensive. I've used them to do my yard work and they haven't gotten water stains. The straps softened very quickly. The bottom is pretty smooth, but not slippery. I love the look of Birkenstock, but they hurt my feet as I have flat feet and can only wear them for a day or two, but these are much softer. Really love these and would definitely repurchase!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "LOVE LOVE LOVE",
    "rating": "5.0 out of 5 stars",
    "content": "These are such a great dupe for Birkenstocks . I wear these non stop. They are comfortable and very durable!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered a half size up (9.5) like the reviews recommended. However, one I tried them on they seemed too small. I thought to myself, \"Let me adjust the straps first.\" Once I did that the fit was much better and now that they are broken in, I was able to adjust the straps back to what they were when I took them out of the box. I am so happy I thought of making that adjustment before returning for a whole size up!",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Birkenstock Dupe !!!",
    "rating": "5.0 out of 5 stars",
    "content": "Exactly as adverstised CUSHION AIR! Love these and will go back for more colors.  Thank you for the vegan leathers.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I needed these for a vacation, but i had an accident.. And I did not,get to go so no needed!",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Adjust the straps before ordering a whole size up! Break them in!",
    "rating": "5.0 out of 5 stars",
    "content": "I got these for my son he loves them! They are just like Birkenstocks but wayyyyy cheaper and comfortable too!!",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very comfy.  Able to walk for long periods of time without any discomfort.  Looks nice with anything casual",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Cushioning, Solid Quality & Vegan",
    "rating": "5.0 out of 5 stars",
    "content": "I have never worn birks and when I try them on they just don’t feel comfortable to me. Everyone says you have to give them time to break in but I don’t want to spend a lot of money on something that may not work, so these where a great trial pair. Price is great, quality is great, support is great and they’re so cute. I find I go to these every time I run errands instead of my usual Olakai flip flops",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B07RYX8F1C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "These sandals are very cute, and I like that the straps are adjustable. The comfort is just ok — not completely uncomfortable but a little stiff and hard. I’m not sure if it will break in with more wear, but right now I can’t picture wearing the sandals all day or walking long distances in them. Overall, worth the price for a good Birk dupe.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B07RYX8F1C"
},
]