[
{
    "name": "        INEVIFIT EROS Bluetooth Body Fat Scale Smart BMI Highly Accurate Digital Bathroom Body Composition Analyzer with Wireless Smartphone APP 400 lbs 11.8 x 11.8 inch (Black)       ",
    "stars": [
        "81%",
        "10%",
        "4%",
        "1%",
        "4%"
    ],
    "pid": "B07S7FWMC7",
    "ratings": "2,663 ratings",
    "other_info": {
        "Brand": "INEVIFIT",
        "Color": "Black",
        "Recommended Uses For Product": "Adults",
        "Special Feature": "Smart, Muscle Mass, Body Fat, Body Mass Index",
        "Display Type": "LED"
    },
    "discount_price": "$ 99.",
    "normal_price": "$99.99",
    "about_this_item": [
        " ENJOY TRACKING YOUR FITNESS JOURNEY: This smart body composition scale tracks 13 key fitness metrics, including Body Weight, Body Fat Percentage, Water, Muscle Mass, BMI, BMR, Bone Mass, Skeletal Muscle, Fat-Free Body Weight, Subcutaneous Fat, Protein, Metabolic Age and even Visceral Fat directly on your smartphone.  ",
        " POWERFUL FREE APP: The Eros Scale app is simple to use, supports unlimited number of profiles for you and your whole family to get & stay healthy. The best part is that it seamlessly syncs with your favorite health apps & services: Fitbit, Apple Health, and Google Fit.  ",
        " PREMIUM QUALITY: Upgraded auto-calibrating sensors for precise and consistent measurements on a thicker 6mm tempered glass platform to weigh up to 400 lbs. Finally, a durable body weight scale you can depend on that stands the test of time.  ",
        " DELIGHTFUL EXPERIENCE: Designed here in Southern California to complement the décor in any room yet be functionally efficient. The large 3.6” luminous LED display, turns on automatically when you step on and your body composition appear in your smartphone with a simple touch.  ",
        " STAY CALM & GET YOUR TRACK ON: The Eros Smart Scale comes with 7-day real USA customer support and our products include the industry leading quality. You can rest assure that you will be 100% satisfied with the INEVIFIT experience.  "
    ]
},
{
    "title": "Use it every day; like the data",
    "rating": "5.0 out of 5 stars",
    "content": "Best scale I’ve had so far.  Seems accurate and is definitely more repeatable than any other scale I’ve had.  Weight is in 0.2 increments, which is ok.  iPhone app connection often takes many seconds to connect, wish it were faster but it works.  The app works well and shows a lot of potentially useful data.  Not sure how accurate the foot sensor info really is, but it’s interesting.  Overall, a great scale and highly recommended",
    "post_time": "Reviewed in the United States on January 7, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This scale has really helped me dial in my meals and make me accountable for what I consume on a daily basis. The app on the phone is great to track your day to day progress. First month tracking with it down 8Lbs and 1% body fat.",
    "post_time": "Reviewed in the United States on March 15, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Amazing..!!",
    "rating": "5.0 out of 5 stars",
    "content": "Product works great definitely worth it to help you set goals and get to where you want to be at But the truth hurts keep ur head up 😭",
    "post_time": "Reviewed in the United States on April 23, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I've been using it for a few months now and all seemed well, but a few weeks ago it gave me wildly different readings literally from 7am to 4pm, and it's stuck with that since. 26% body fat to 18% and kept steady. Let's just say I'm definitely not at 18%😅so not too sure on the readings but the data tracking and compatability with Google fit is great. Just wish there was a way to test or calibrate the electrodes",
    "post_time": "Reviewed in the United States on May 2, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "I did a 3D full body scan and then got this scale. They were extremely close in measurements, enough that I’m comfortable with the accuracy and can use it to ensure I’m staying in shape!",
    "post_time": "Reviewed in the United States on March 23, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this new scale.  Researched a lot, love the messages straight from the company when I purchased.  App is super easy and can add other family members too.",
    "post_time": "Reviewed in the United States on March 31, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Decent scale, inaccurate readings",
    "rating": "4.0 out of 5 stars",
    "content": "The Pros:",
    "post_time": "Reviewed in the United States on February 19, 2020",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The scale seems to work great. I know the weight is accurate. The BMI is very close to what a BMI calculator shows. It syncs great with my Fitbit app.",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Great scale for athletes!",
    "rating": "5.0 out of 5 stars",
    "content": "The Cons:",
    "post_time": "Reviewed in the United States on April 17, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Due to lack of documentation, I'm still not sure about using this with more than one person.",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Happy I Bought This",
    "rating": "5.0 out of 5 stars",
    "content": "First: I am very happy that they followed up with me after I purchased the scale. This was the first time a seller followed up with me directly, and I think that’s important.",
    "post_time": "Reviewed in the United States on October 10, 2022",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Now, I has this scale for a few months now, and I love it! I used this scale in the gym with my trainer, but once COVID hit, I thought I should get my own since I wasn’t too comfortable going back to the gym. I’m happy I did. Seeing the changes over time is a great motivator. It also helps to know that it’s not always about how much you weigh, but also other factors that contribute to your health and fitness. I haven’t had any glitches yet and I bought this in April. So far so good.",
    "post_time": "Reviewed in the United States on November 18, 2023",
    "pid": "B07S7FWMC7"
},
{
    "title": "Essential scale, Top Quality",
    "rating": "5.0 out of 5 stars",
    "content": "There are other, cheaper brands on the market, but this one absolutely steals the top spot for me. The app is great, and easy to use, and I like being able to see my everyday progress. The scale is very nice, with round edges, so no accidents early morning. Absolute winner in every way.",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After trying several scales, this is best scale I’ve ever bought!❤️❤️❤️",
    "post_time": "Reviewed in the United States on September 24, 2022",
    "pid": "B07S7FWMC7"
},
{
    "title": "The best scale!",
    "rating": "2.0 out of 5 stars",
    "content": "If you’re looking for an accurate scale, that will encourage you while keeping an accurate record over time then this is your scale. I bought this when we moved to Iowa as we left our original scale at our first home. I can’t praise the scale enough.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The only complaint I have is the app has poor user management in regards to editing user data for example, my wife weighed the children and it went into my profile but I was unable to move the data or delete the data.",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Incredible Scale",
    "rating": "5.0 out of 5 stars",
    "content": "Additionally, when I added the children  as they grow there seems to be no way to modify their height.",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "But to be clear the scale is incredible if they improve the app it would be five stars across-the-board",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Wonky",
    "rating": "5.0 out of 5 stars",
    "content": "The Eros scale required another app which means it does not interface with the INEVIFIT app.  Weight seems fine but other measures are not reliable.  Likely a care of too much too soon.  This was not an upgrade but a waste.  Back to the old INEVIFIT and this one back to Amazon or worse.",
    "post_time": "Reviewed in the United States on February 28, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Very easy and informative",
    "post_time": "Reviewed in the United States on March 14, 2023",
    "pid": "B07S7FWMC7"
},
{
    "title": "Awesome scale",
    "rating": "5.0 out of 5 stars",
    "content": "Love the accuracy and connectivity",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There is a bit of a learning curve with this scale but the video helps. I am enjoying this scale and look forward to reviewing my progress daily. This is a nice product and a good value.",
    "post_time": "Reviewed in the United States on February 23, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Loads of information and very reliable",
    "rating": "4.0 out of 5 stars",
    "content": "This is a very good product, it does what it’s supposed, and though it’s not 100% accurate specially if you’re holding excess water I think it gives you a pretty good idea of your body fat levels.",
    "post_time": "Reviewed in the United States on March 1, 2020",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Besides measuring body fat it of course functions as a regular scale, which you can also use to weigh out other things, up to the recommended weight limit.",
    "post_time": "Reviewed in the United States on February 7, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "It does what it supposed and it does it well.",
    "rating": "5.0 out of 5 stars",
    "content": "In addition to your body fat it can also measure a number of other bio metrics like protein, though to be honest I don’t know how accurate it is at measuring other things that aren’t fat and weight. But since I only care about my weight and body fat levels the rest of it’s features are kinda irrelevant to me. But that’s just me the rest of the features may be important to you so that’s something to consider.",
    "post_time": "Reviewed in the United States on April 17, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This scale also has a Bluetooth app which is really good and you needed if you want to see all your biometrics.",
    "post_time": "Reviewed in the United States on December 13, 2023",
    "pid": "B07S7FWMC7"
},
{
    "title": "Easy to use and set up.",
    "rating": "5.0 out of 5 stars",
    "content": "In conclusion I love this scale, I love how it looks, feels and functions and the price is fair, I think so anyway. And yes I don’t really have many negatives to say about this product because I haven’t really found many, if and when I do I will update this review.",
    "post_time": "Reviewed in the United States on February 12, 2020",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Do I recommend it? yes I do.",
    "post_time": "Reviewed in the United States on February 16, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Great quality!..",
    "rating": "5.0 out of 5 stars",
    "content": "I was a little apprehensive… I presumed, like most things made in China, it wouldn’t work very well. But it set up easily and has been working for the last many months. So far so good :-)",
    "post_time": "Reviewed in the United States on November 21, 2023",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is the best scale I've ever had!",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B07S7FWMC7"
},
{
    "title": "Excellent package, excellent product",
    "rating": "5.0 out of 5 stars",
    "content": "The packaging of the product is excellent.  Well protected.  Easy to remove the product from the packaging.  Easy to set up the product.  Simple instructions.  Easy to install and set up the Eros App from the iPhone app store.  Simple to connect to the smart scale.  Working in seconds.  So far, highly recommend.",
    "post_time": "Reviewed in the United States on September 16, 2023",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I got this scale after a nutritionist recommended it.  It gives me all kinds of data about my health and has motivated me to pay more attention to all the factors it measures.",
    "post_time": "Reviewed in the United States on December 21, 2023",
    "pid": "B07S7FWMC7"
},
{
    "title": "Tells me more about my bodily health.",
    "rating": "4.0 out of 5 stars",
    "content": "This is a very nice (bathroom) scale.. I love the design.. Thin sleek look.. My husband thought it was funny how it was shipped in the original box and not in another one to cover up what it was.. No worry to me.. It was easy to install the app.. The only bad thing and this may be user error is that it took me about 15 to 20 min to figure out how to get all the tiles to give me their readings.. But it was just as simple as going into my phone settings and pairing the scale with my phone and there it was working.. Once paired it makes the cutest sound when you step on it and it is recieved to your phone.. My phone is a Android.. But I will say I would buy more products from this company.. This scale compared to my other scale was only off by 4 to 6 oz.. Not much to complain about.. I'm a big stickler to watching my weight and that few oz off aka difference didn't bother me at all..",
    "post_time": "Reviewed in the United States on May 26, 2020",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s been about a week and this is great scale giving me a lot of info that I still need to figure out what it all means. My only complaint is the syncing with the app part. It says you have to remain still for at least 9 seconds for everything to load. There’s no sync button on the app so you have to wait and see if it syncs. Sometimes it takes a few minutes or opening and closing the app? I think I just have to get used to the delay but might be nice to have a sync button on the app. But it is all linked up with my apple health app and is super nice to streamline all the data to see what’s really working for my health!",
    "post_time": "Reviewed in the United States on March 18, 2022",
    "pid": "B07S7FWMC7"
},
{
    "title": "Great bathroom scale..",
    "rating": "5.0 out of 5 stars",
    "content": "This is the best scale ever.  It has helped me to get my health back on track inside out!!! I recommend this scale for anyone wanting to lose the right amount of visual fat bad fats to lower cholesterol and blood pressure .  I have already recommended it to my family and friends.",
    "post_time": "Reviewed in the United States on September 24, 2023",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great innovative scale with many health measures (e.g., weight, BMI, % body fat, % visceral fat, biological age relative to actual age). Track changes on your phone. Have gifted several.",
    "post_time": "Reviewed in the United States on December 24, 2023",
    "pid": "B07S7FWMC7"
},
{
    "title": "Great scale!",
    "rating": "5.0 out of 5 stars",
    "content": "I really like the way this scale shifts my focus away from strictly weight as a measure of health to more important metrics.  I'm 53, and have spent too many years being sedentary.  I recently started a fitness program and if I were to just look at the weight loss it would be entirely too easy to get discouraged.  But by seeing the muscle gain and the lowering of my BMI, I get the reassurance that I'm doing the right thing and am motivated to improve those numbers week by week. Highly recommend, whether you are working towards a goal or just want to monitor your healthy body composition.",
    "post_time": "Reviewed in the United States on September 26, 2022",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Realmente el producto es muy bueno. Lo llevo probando un par de días con mi señora con dos usuarios y la cantidad de información que levanta es precisa. Estoy muy conforme con la compra.",
    "post_time": "Reviewed in the United States on June 13, 2023",
    "pid": "B07S7FWMC7"
},
{
    "title": "Excellent product",
    "rating": "4.0 out of 5 stars",
    "content": "Yo soy de Chile y el envío llego tres días antes de lo esperado.",
    "post_time": "Reviewed in the United States on September 22, 2023",
    "pid": "B07S7FWMC7"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Solo como punto a comentar o mejora a considerar en la aplicación del celular es pedir  que las letras y números fueran un poco más grandes y que el fondo sea gris o negro, para que sea más fácil la lectura",
    "post_time": "Reviewed in the United States on June 14, 2023",
    "pid": "B07S7FWMC7"
},
]