[
{
    "name": "        Kitsch Ice Roller for Face & Eye Puffiness, Cold Skin Care for Facial Lymphatic Drainage, Dark Circles & Migraine Relief, Self Tool for Wrinkles, Valentines Day Gifts for Women Face Massager (Pink)       ",
    "stars": [
        "75%",
        "13%",
        "7%",
        "2%",
        "3%"
    ],
    "pid": "B07VHCNHF6",
    "ratings": "2,166 ratings",
    "other_info": {
        "Use for": "Eyes, Face",
        "Power Source": "Manual Freezer",
        "Material": "Stainless Steel",
        "Item Weight": "0.07 Kilograms",
        "Brand": "Kitsch"
    },
    "discount_price": "$ 17.99",
    "normal_price": "$17.99",
    "about_this_item": [
        " COOLING FACIAL: This stainless steel face ice roller from kitsch will become your new favorite addition to your skin care routine. It provides much-needed relief from puffiness, sore muscles and headaches through a cold, soothing facial treatment that promotes blood circulation to your face & neck to keep you feeling young and healthy!  ",
        " SOOTHES SKIN IRRITATION: If you’re looking to soothe irritated skin, look no further. Our ice roller for face helps skin irritation with face ice roller skin care and promotes blood circulation to reduce toxins. As a result, it soothes skin irritation, inflammation and redness resulting from breakouts, sunburn, hair removal or shaving.  ",
        " AT-HOME SPA: Skip the expensive salons with our cold face roller, and give yourself a cooling ice facial in the comfort of your own home or on-the-go! Our women's facial ice roller massager can leave you feeling more beautiful than ever before while saving you time and money.  ",
        " HIGH-QUALITY TOOL: Expertly crafted with high-quality surgical stainless steel, our ice skin roller for face & eye puffiness relief calms inflammation & increases blood circulation. Stainless steel stays cold for longer and promotes a youthful-looking complexion.  ",
        " PERFECT GIFT: Our face depuffer reliever is the perfect mothers day gifts for mom. Each package includes 1 ergonomic & lightweight ice facial roller for face. Kitsch is a self-financed, woman owned company. All Kitsch products are designed with love in Los Angeles, California.  "
    ]
},
{
    "title": "Best cold roller out there",
    "rating": "5.0 out of 5 stars",
    "content": "This is a HOLY GRAIL facial tool. I keep this in the freezer and use it nightly. I gently roll it across my cheeks, chin and forehead as well as over my brows and eye lids. I do this once after moisturizer until it doesn’t  feel cold anymore, then again after facial oils and it is cold all over again. Some may complain about this becoming warm quickly, but to me it’s very impressive and lasts much longer than my rose quartz roller. The trick is to use it until it doesn’t feel cold anymore and then come back to it a few minutes later. I’ve repeated that process up to 3 times and I could have used it a 4th time as well. Very impressive!",
    "post_time": "Reviewed in the United States on August 23, 2020",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I cannot say enough about how impressed I am with this; it truly does work!! Mild wrinkle improvement and texture after a month of daily use and defiantly noticeable instantly in reducing puffiness around my eyes in the mornings.",
    "post_time": "Reviewed in the United States on July 10, 2022",
    "pid": "B07VHCNHF6"
},
{
    "title": "Bought the mini set on whim and WOW",
    "rating": "5.0 out of 5 stars",
    "content": "Get the mini set try it love it carry it with you and I’m getting the larger one now also!",
    "post_time": "Reviewed in the United States on August 18, 2019",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Absolutely love this thing! I keep it in the freezer, and it’s my favorite go to facial tool. I use it after any sort of abrasive skin treatment, and just when my face needs a cool down. I live in Texas, and it’s been brutally hot this summer, and this thing has been a god send. Does it do what it says it does? I can’t say for sure, but it feels so refreshing, and I do feel like the bags under my eyes have gone down a bit after I hold the roller underneath them every time I use it. Overall, well worth a try, as it’s a relatively cheap beauty purchase.",
    "post_time": "Reviewed in the United States on September 14, 2020",
    "pid": "B07VHCNHF6"
},
{
    "title": "Refreshing and cooling",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely loved using this roller! It was easy to use and after not getting much sleep the night before, it was really refreshing first thing in the morning! Only downside is it doesn’t come with a case/travel bag. So if I wanted to pack this with me, I wouldn’t be able to. I just used the box it cane with to store it in the freezer. 5 stars for sure if Kitsch includes a travel bag!",
    "post_time": "Reviewed in the United States on June 27, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Stays cold, clean and much better than my Gua Jade roller.",
    "post_time": "Reviewed in the United States on December 1, 2022",
    "pid": "B07VHCNHF6"
},
{
    "title": "Super Calming!",
    "rating": "4.0 out of 5 stars",
    "content": "It’s def a great buy. I have heat flashes and this helps.",
    "post_time": "Reviewed in the United States on January 13, 2021",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This roller really does work. I’ve heard that using an ice cube gives the same effect, by somewhat freezing lines and wrinkles temporarily. However, this item is easy to hold, just roll it over the desired area and you will see results in tightening.",
    "post_time": "Reviewed in the United States on August 12, 2019",
    "pid": "B07VHCNHF6"
},
{
    "title": "Feels amazing.",
    "rating": "5.0 out of 5 stars",
    "content": "Ive had it for about 2 weeks now. I haven’t noticed anything different as far as puffiness or lack of fine lines. BUT nonetheless, it feels awesome and soothing. Some of the reviews say that it doesn't keep cool, but once you’ve used it for a while it will warm up for obvious reasons...🙄 Give it a few minutes and its ice cold again. It’s apart of my nightly routine now!",
    "post_time": "Reviewed in the United States on March 28, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve used this product several times now and notice that it definitely helps temporarily relieve some of the puffiness around my eyes. It’s easy to use and actually feels really nice to use right now since it’s so hot outside. I haven’t been using it long enough to notice much difference in my skin but I have noticed that when I use this product at night with moisturizer my skin always looks fresh when I wake up the next day.",
    "post_time": "Reviewed in the United States on February 19, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Weird sticky residue",
    "rating": "1.0 out of 5 stars",
    "content": "I bought this and it looked fine and clean when I first opened it. Used it for a couple of days and then this morning noticed some strange clear sticky residue seeping out the sides, have no idea what it is and now pretty disgusted and worried because I rolled it all over my face. Returning this right away! Saw a few other reviews that said there was a residue and they thought it was used. I don’t think it was used but I question what the heck is coming out of it. I thought perhaps it was some sort of residue inside the stainless steel roller in order for it to freeze properly but stainless steel should be able to freeze by itself without anything inside. And if I’m wrong, then fine, but this clearly is defective because that stuff should not be coming out. I pray that I don’t have any weird bad reaction on my face after using this thing not very happy highly doubt reviews will get read by the company though.",
    "post_time": "Reviewed in the United States on July 21, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Helps so much with inflammation of the face and definitely better than using an ice cube.",
    "post_time": "Reviewed in the United States on June 21, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "New Skin Care Routine!",
    "rating": "2.0 out of 5 stars",
    "content": "I would not buy this product again. Since the roller is metal, it very quickly looses its chill. I have another ice roller from a different brand that actually has frozen beads in the roller and it stays cold for significantly longer",
    "post_time": "Reviewed in the United States on January 4, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "the metal stays cold for a while and it is the perfect size to get all areas of the face! I have already bought a couple others for gifts to share the love (:",
    "post_time": "Reviewed in the United States on December 27, 2022",
    "pid": "B07VHCNHF6"
},
{
    "title": "There are cheaper options that work much better",
    "rating": "5.0 out of 5 stars",
    "content": "The one I own is essential in my daily facial routine",
    "post_time": "Reviewed in the United States on July 18, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've read about cryotherapy and how ice rolling in the morning can help with puffiness. I'm going to be honest and say I don't know if it's truly working but I find the process super refreshing in the morning. You stick the roller in the freezer and take it out for use.",
    "post_time": "Reviewed in the United States on December 14, 2020",
    "pid": "B07VHCNHF6"
},
{
    "title": "favorite ice roller ever",
    "rating": "5.0 out of 5 stars",
    "content": "Only gripe is that I find it odd to not have a protective case over the roller part so I do put in a baggy.",
    "post_time": "Reviewed in the United States on April 17, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I stuck this in my daughter’s Easter basket and she absolutely loves it. Especially because it’s portable!",
    "post_time": "Reviewed in the United States on June 21, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Love the product purchased fr my mother",
    "rating": "2.0 out of 5 stars",
    "content": "Amazing for facial puffiness and just feels great! Perfect gift idea too ;)",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s nicely made and a good size. Overall good until you begin using it. Squeaks so loudly and makes the experience anything but relaxing.",
    "post_time": "Reviewed in the United States on October 12, 2020",
    "pid": "B07VHCNHF6"
},
{
    "title": "De puffing  my eyes",
    "rating": "5.0 out of 5 stars",
    "content": "It’s convenient to travel with",
    "post_time": "Reviewed in the United States on July 30, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Doesn’t stay cold for long- a few minutes max",
    "post_time": "Reviewed in the United States on July 3, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Wish it stayed cold longer",
    "rating": "5.0 out of 5 stars",
    "content": "If there’s one thing 2020 has taught me, it’s self care. This year has been awful, and the last months have been especially hard personally (my cat suddenly passed away). I wasn’t sleeping well and started noticing dark circles under my eyes. I found this kitsch ice roller and it has been great! I use it first thing in the morning to help de-puff my eyes and face, and it’s also just a nice way to feel refreshed.",
    "post_time": "Reviewed in the United States on December 8, 2020",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was skeptical about these cold rollers being effective, and after trying this stainless steel facial roller for my first facial roller, I'm hooked! The stainless steel definitely gets very cold in your freezer, so make sure to leave it out to defrost a bit as recommended before using it on your face. My favorite part of using these rollers is the cold really does help me de-puff my face and calm down my redness. I'd definitely recommend as part of your skincare routine.",
    "post_time": "Reviewed in the United States on August 13, 2019",
    "pid": "B07VHCNHF6"
},
{
    "title": "Great ice roller",
    "rating": "3.0 out of 5 stars",
    "content": "I bought this because I usually use an ice cube to “ice” my face before my morning/night skincare routine. It’s amazing for your skin and boosts collagen! But the ice cubes melt and I use a paper towel. So when I found this I thought it would be great since the metal will freeze cold and I can save paper towels and ice haha. Well it works for what you want only it doesn’t stay that cold. I get a couple of rolls in and the metal immediately matches my skin temp. Great roller but for what I wanted it to be fully used for.",
    "post_time": "Reviewed in the United States on April 29, 2020",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "The size is perfect, and it rolls on the face well, BUT it does not stay cold for more than a minute. Wish I had bought a different type",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Cooling and refreshing!",
    "rating": "5.0 out of 5 stars",
    "content": "Fells great on my face. And for headache's.",
    "post_time": "Reviewed in the United States on June 10, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "i love that it’s not actually ice so it doesn’t melt in my face, but still gives the cooling sensation i’m searching for in the mornings! the pink is also super cute",
    "post_time": "Reviewed in the United States on June 14, 2022",
    "pid": "B07VHCNHF6"
},
{
    "title": "Doesn’t stay cold",
    "rating": "5.0 out of 5 stars",
    "content": "Using to depuff my face in the morning. Love it so far.",
    "post_time": "Reviewed in the United States on March 27, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I get crappy sleep with have 2 littles and my eyes always suffer from it. I get bad dark eye circles and puffiness. This helps so much with it. The puffiness goes down quite a bit and so does the darkness. Definitely worth the money!",
    "post_time": "Reviewed in the United States on December 1, 2021",
    "pid": "B07VHCNHF6"
},
]