[
{
    "name": "        Kitsch Ice Roller for Face & Eye Puffiness, Cold Skin Care for Facial Lymphatic Drainage, Dark Circles & Migraine Relief, Self Tool for Wrinkles, Valentines Day Gifts for Women Face Massager (Pink)       ",
    "stars": [
        "75%",
        "13%",
        "7%",
        "2%",
        "3%"
    ],
    "pid": "B07VHCNHF6",
    "ratings": "2,167 ratings",
    "other_info": {
        "Use for": "Eyes, Face",
        "Power Source": "Manual Freezer",
        "Material": "Stainless Steel",
        "Item Weight": "0.07 Kilograms",
        "Brand": "Kitsch"
    },
    "discount_price": "$ 17.99",
    "normal_price": "$17.99",
    "about_this_item": [
        " COOLING FACIAL: This stainless steel face ice roller from kitsch will become your new favorite addition to your skin care routine. It provides much-needed relief from puffiness, sore muscles and headaches through a cold, soothing facial treatment that promotes blood circulation to your face & neck to keep you feeling young and healthy!  ",
        " SOOTHES SKIN IRRITATION: If you’re looking to soothe irritated skin, look no further. Our ice roller for face helps skin irritation with face ice roller skin care and promotes blood circulation to reduce toxins. As a result, it soothes skin irritation, inflammation and redness resulting from breakouts, sunburn, hair removal or shaving.  ",
        " AT-HOME SPA: Skip the expensive salons with our cold face roller, and give yourself a cooling ice facial in the comfort of your own home or on-the-go! Our women's facial ice roller massager can leave you feeling more beautiful than ever before while saving you time and money.  ",
        " HIGH-QUALITY TOOL: Expertly crafted with high-quality surgical stainless steel, our ice skin roller for face & eye puffiness relief calms inflammation & increases blood circulation. Stainless steel stays cold for longer and promotes a youthful-looking complexion.  ",
        " PERFECT GIFT: Our face depuffer reliever is the perfect mothers day gifts for mom. Each package includes 1 ergonomic & lightweight ice facial roller for face. Kitsch is a self-financed, woman owned company. All Kitsch products are designed with love in Los Angeles, California.  "
    ]
},
{
    "title": "Feels amazing!",
    "rating": "5.0 out of 5 stars",
    "content": "This face roller is absolutely amazing.  Some have suggested not to put it in the freezer as it gets too cold, but in my opinion it is just fine.  I just wait a minute or so and give it a wipe before I start rolling in on my face and it feels amazing. It is definitely cold at first, but your face adjusts pretty quickly.  For those that say that it does not stay cold long enough, I think it's because your face gets used to the cool feeling, but if you take a break and wait a minute or two to allow your face to start warming back up again, you'll see that the roller is still very cold when you go to roll your face again. This is a great little massage routine I try to do in the morning and before bedtime...very soothing to my face, relaxing and helps to get rid of puffiness in the face.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I keep in them in my little skincare fridge and they feel so amazing! And the little bag they come with is perfect. They're easy to clean, well made, and the price is right. Love them!",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Perfect!",
    "rating": "5.0 out of 5 stars",
    "content": "My eyes always get puffy if I sleep in the wrong position or, heaven forbid, shed even just a few tears at night.  And now as I age, the bags under my eyes have started showing up.  Thought I'd give this a try and I absolutely love it.  I take it out of the freezer and roll it over my eye areas, above & below, right after washing in the morning, and I swear any puffiness is greatly reduced.  And it feels so refreshing!  I will also roll it on the back of my neck after working out and it really helps to cool me down.  After every use I wipe it down with a mixture of hydrogen peroxide and water that I keep on my bathroom counter.  This is a real winner for me.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I truly am a fan of this ice roller! I feel like the quality of this feels like it would be more expensive than it is. I love the pink color and the curves of the handle.",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Really love this thing!",
    "rating": "5.0 out of 5 stars",
    "content": "After I take it out of the freezer, I typically let it sit for a minute or so or I roll it on my arm first before putting it on my face, otherwise I’ve found it can stick to my face if its not fully dry (make sure your face is dry lol) or just be too cold!",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After I use it, my face is SOO soft & feel tight & so good. I really do think it helps with puffiness and redness.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Great for the price!!",
    "rating": "3.0 out of 5 stars",
    "content": "I will say I feel like I have to use it quickly once I start though, because it seems to get warm within a minute or two of rolling my face. I can get my whole face done in that minute or two, but I’m not sure if its meant to be that quick.",
    "post_time": "Reviewed in the United States on February 7, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall would recommend to anyone curious about ice rolling & wanting something decently priced but high quality!",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "So tiny",
    "rating": "5.0 out of 5 stars",
    "content": "The metal is very cooling under the eyes, and the other one has points to be used as a massager! They are much smaller than expected, but I love that they fit inside a clutch or small purse to bring with you anywhere",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I really enjoy using this roller in the morning. I suffer from puffy eyes and the older I've gotten the worse my under-eye bags have gotten as well. I put my roller in my fridge and every morning I take it out and roll it underneath my eyes and just place it over my eyelids too. My goodness, It feels so cool and nice, love it! it helps reduce the puffiness.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Ok for the price",
    "rating": "4.0 out of 5 stars",
    "content": "As described, for the price it’s fine. Doesn’t stay cool very long unfortunately but it’s better than nothing",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This works great and it’s very sturdy. I’ve owned 3 jade rollers that don’t seem to hold up well so I decided to find a similar product that will hold up through wear and tear, travel, etc.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Love it!",
    "rating": "4.0 out of 5 stars",
    "content": "I have been  looking for an ice roller and this one was available on prime day for a good price. The only reason I am not giving it 5 stars is because the roller part makes the awful load squeezing noise. But otherwise it is good.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved it!!!! I use to smooth my skin!!!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Nice for the price.",
    "rating": "4.0 out of 5 stars",
    "content": "I wanted to try the ice roller to help with puffiness and circulation. This roller is the perfect addition to my skin care routine. This effect feels so nice against my skin, I do put this in the refrigerator, not the freezer like box says. The freezer was too cold and I did not enjoy it, but the refrigerator makes it the perfect temperature.",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I use this in the morning when I wake up and I feel puffy or at night after a long day I love rolling this on my neck. I feel as though it helps my skin care routine.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Everything was perfect!!! The seller and the product!!! Thank you so much!!",
    "rating": "5.0 out of 5 stars",
    "content": "The quality of the product is awesome and very durable. The handle is comfortable to hold, and this is a refreshing addition to your skin care routine.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "These facial tools function as described. The metal roller feels cool and helps calm puffiness. when using the other tool with the silicone ridges, it feels like a pleasant face massage. With this said, the tools are small (mini), so it’s somewhat uncomfortable to do this for an extended time. Felt like my hand was going to cramp.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Nice addition to skincare routine",
    "rating": "4.0 out of 5 stars",
    "content": "I needed this in a hurry for a gift and I was not disappointed. Very cute set that is easily packable for travel.",
    "post_time": "Reviewed in the United States on April 3, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wanted to de puff my eyes first thing in the morning and wake myself up a little so I bought this to help! I love using it first thing after I wash my face. It gets the job done. Doesn’t stay cold for long but still satisfied with it.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Probably not the person for it",
    "rating": "3.0 out of 5 stars",
    "content": "Nothing bad to say about this product besides the fact that its purpose is far from served",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This product is fantastic.  I put it in the freezer and when I took it out, it stayed cold for several hours thereafter.  Highly recommend it,",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "better than I thought",
    "rating": "5.0 out of 5 stars",
    "content": "Feels fantastic and de-puffs your face like a champ!",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great ice roller! Feels great to cool your face on a sweltering hot day too.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Feels fantastic",
    "rating": "4.0 out of 5 stars",
    "content": "Update: kitsch reached out and refunded my order after I wrote my last review, which I really appreciated. I was also able to use some WD-40 on the roller which helped with the squeaking. That being said, I would prefer not to have to use WD-40 on something that goes on my face. Either way, I appreciate the refund and have amended my rating.",
    "post_time": "Reviewed in the United States on October 13, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "——————-",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Awesome thing, feels great on a hot day!",
    "rating": "5.0 out of 5 stars",
    "content": " I would I would love this roller except when I use it a horrible squeaking noise, not unlike nails on a chalkboard, emanates from it. It’s awful. I got this so I could use it while laying in bed at night but now I can’t because it’s so noisy.",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I understand this says “mini,” but this thing is super duper tiny. Think American Girl doll and your expectations will be on par.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Stays cold but SO SQUEAKY (updated)",
    "rating": "5.0 out of 5 stars",
    "content": "I got this for my forehead and face and it feels amazing. I literally got it today and tried it this evening after washing my face. It feels cool and didn’t put it in the fridge. I’ve been struggling with pain on my forehead when pressing on my forehead. This feels so great! I judged little face rollers in the past but this is so worth every penny already.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The size of the roller works perfect around the eyes. It's a lifesaver coming out of the freezer. A must have!",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Great little kit",
    "rating": "5.0 out of 5 stars",
    "content": "Great little kit to grab on the go or travel. It comes with an adorable velvet bag for safe keeping.",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So fun and easy to use! Stays cold for quite a bit and I truly notice a decrease in my skins puffiness!",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Fun product!",
    "rating": "2.0 out of 5 stars",
    "content": "I wanted to love this roller so badly.  I love all my Kitsch hair products and have had positive experiences with all.  I have an auto-immune so I try to remove as much plastic from my life as possible. I purchased this roller since the barrel is stainless steel and I recently learned ice rolling is beneficial for rosacea.",
    "post_time": "Reviewed in the United States on February 6, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The first sign this wasn't going to be a great experience was that the directions/box mention a storage case for the roller.  However, there was no storage case in said box.  Okay, confusing but we can deal.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Squeaky Roller - Porous Plastic",
    "rating": "4.0 out of 5 stars",
    "content": "However, the plastic it is made from must be incredibly porous because after the first time I took it out of the freezer, I could smell the freezer burn/fridge on the roller.  Nothing like starting your morning smelling leftovers and freezer burn.",
    "post_time": "Reviewed in the United States on August 31, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Smell aside, the roller is incredibly squeaky.  Like, rusty hinge or broken wheels on a cart squeaky.  It definitely needs WD-40.  Something I'm not going to use on a product for my face.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Love!!",
    "rating": "5.0 out of 5 stars",
    "content": "The roller has a nice handle, fits well in your hand and isn't heavy. It does glide nicely over the skin. It gets the job done and I do notice some reduction in swelling.  However, the materials used to create this product just take away from what could be a great experience. Especially when you are looking for a spa-like experience.  It is just not up to par that other Kitsch products have set.",
    "post_time": "Reviewed in the United States on March 14, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect for travel!!!",
    "post_time": "Reviewed in the United States on January 24, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Great for travel",
    "rating": "5.0 out of 5 stars",
    "content": "The regular size of any face roller isn't really that big to prevent one from traveling with it, so I don't know why I thought I really needed this mini ice roller and face roller set LOL. The ice roller works fine, but the face roller does not seem to do anything at all. I actually like their normal roller better. If you're deciding between the two, get the normal size.",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Was a gift my sister loves",
    "post_time": "Reviewed in the United States on December 13, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product! It's so soothing to use and makes for a great step in your skincare routine. Easy to use too!",
    "post_time": "Reviewed in the United States on April 10, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this for my sister in law. When it arrived i opened it up to have look and was immediately wanting to keep it for myself. This is a nice set and the quality is really good. I am now purchasing one for myself instead of stealing hers.",
    "post_time": "Reviewed in the United States on January 18, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "selfish",
    "rating": "5.0 out of 5 stars",
    "content": "I use this every morning in my skincare routine and I am LOVING it!!",
    "post_time": "Reviewed in the United States on April 10, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "While, there are a ton of ice rollers out there on the market, I loved the packaging and branding of this one. That is ultimately why I chose this one, and I’m very pleased with my decision, as it really was such a great gift simply because of the packaging",
    "post_time": "Reviewed in the United States on January 3, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Refreshing",
    "rating": "5.0 out of 5 stars",
    "content": "I had to buy this one after the plastic one I had broke. This one is much more solid and durable and stays cold longer which is crucial because I use it for my headaches",
    "post_time": "Reviewed in the United States on February 14, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's very good",
    "post_time": "Reviewed in the United States on April 29, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Perfect gift!",
    "rating": "4.0 out of 5 stars",
    "content": "I like how it works to depuff my face and the material. It gets very cold very fast, but it seems to warm up kinda fast, almost as fast as my jade roller. But i still like it.",
    "post_time": "Reviewed in the United States on June 28, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Got for my fiancé s Valentine's day. It was cold straight out of the package. It retains the cold well and she really enjoyed it fresh out of the shower. She hasn't complained, but concerns I have include: why doesn't it include a separate baggie/box for freezer storage and why isn't the roller removable for sanitary reasons? Other than that, a wonderful gift I'm sure she'll enjoy.",
    "post_time": "Reviewed in the United States on October 31, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Super sturdy and stays cold",
    "rating": "5.0 out of 5 stars",
    "content": "It feels great after being in the freezer overnight",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent quality product, used daily.",
    "post_time": "Reviewed in the United States on March 19, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Very small!",
    "rating": "2.0 out of 5 stars",
    "content": "I didn’t realize before purchasing how teeny tiny this tool was. See photo for reference next to a small coffee cup!",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I don't know how long others stay cold this is cold the first few passes you could roll the surface of your face like three times but not more than that",
    "post_time": "Reviewed in the United States on May 16, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Doesn't stay cold long",
    "rating": "5.0 out of 5 stars",
    "content": "I have been a Prime Member for years and I have purchased MANY things. This has been my BEST PURCHASE EVER. My husband had a migraine on our way to our Summer Cruise Vacation and this was AMAZING in helping him get better.",
    "post_time": "Reviewed in the United States on September 4, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I like this roller and use it quite often. It is easy to clean and keep in your refrigerator. The only downside is that it doesn’t hold the cold for very long. I wish it could stay cold, then I would give it a five star rating.",
    "post_time": "Reviewed in the United States on February 27, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "The best!",
    "rating": "5.0 out of 5 stars",
    "content": "Feels amazing!",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Super cute! I keep this little guy in the fridge and roll out my face a few times a week. It travels very well, I tossed it in my carryon and was able to land with a lot less puffiness around my eyes. It’s super cute, the soft pink is a darling color choice and the little bag it comes with is super convenient for travel and keeping the rollers clean.",
    "post_time": "Reviewed in the United States on March 21, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Great but does not stay cold long",
    "rating": "5.0 out of 5 stars",
    "content": "I usually use this in the morning after I wash my face. If you keep it in the freezer it's definitely super super cold. I usually hold it in my hand for a second or two before I roll it on my face. Not sure what it's exactly doing but it does feel refreshing.",
    "post_time": "Reviewed in the United States on July 11, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I’ve been using a plastic ice roller, but was interested to see if the steel roller kept colder longer or felt more effective. This one definitely is much colder, but it’s very squeaky. It’s not very conducive to a relaxing routine.",
    "post_time": "Reviewed in the United States on October 16, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Buy it!",
    "rating": "5.0 out of 5 stars",
    "content": "I love kitsch so much. Everything I get from there I fall in love with. This is the perfect way to treat myself and I love how it’s always cold!",
    "post_time": "Reviewed in the United States on October 20, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "GD likes this roller…. So I’m good too.",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Disappointed",
    "rating": "3.0 out of 5 stars",
    "content": "Product was received and was much smaller than expected. It might be big enough for a child.",
    "post_time": "Reviewed in the United States on December 24, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've been so tempted by the TSC face roller & I'm so happy I got this Kitsch one instead! It's big, cold, & works just as well for a fraction of the cost! Thank you!!",
    "post_time": "Reviewed in the United States on September 3, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Just as good as the expensive version",
    "rating": "5.0 out of 5 stars",
    "content": "Game changer in my skincare routine.",
    "post_time": "Reviewed in the United States on July 12, 2021",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the first beauty/skincare product that I can't stop raving about! After buying one for myself and enjoying it so much, I have now bought extra and given one to my mom, my coworker, my soon to be sister-in-law, my friend, my hairdresser...",
    "post_time": "Reviewed in the United States on October 29, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "I love this thing!",
    "rating": "5.0 out of 5 stars",
    "content": "I love the size of this roller and that it is stainless steel. The quality is great and definitely worth the sub-$20 price. This roller has helped with puffy eyes, headaches, a hangover, and just to give my skin a little bit of a glow on those mornings where I feel like I'm dragging. It feels great to use, the handle is comfortable to hold, and the stainless steel stays cool enough to roll over my face for a few minutes. LOVE this product!!",
    "post_time": "Reviewed in the United States on January 1, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this mini set. It works great from bridge of nose right under your eye to help with puffy eyes",
    "post_time": "Reviewed in the United States on September 18, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Mimi ice roller set",
    "rating": "5.0 out of 5 stars",
    "content": "So easy to use and feels amazing! great quality",
    "post_time": "Reviewed in the United States on October 21, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This feels so nice on my face in the summer! I haven't used it consistently enough to talk about less puffiness, etc. but it's great for really hot days.",
    "post_time": "Reviewed in the United States on December 21, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "love",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first ice roller ever, and I just tried it. Very refreshing, glides smoothly on my face.",
    "post_time": "Reviewed in the United States on January 19, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "gets warm within a minute or two.",
    "post_time": "Reviewed in the United States on November 16, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Best cold roller out there",
    "rating": "5.0 out of 5 stars",
    "content": "This is a HOLY GRAIL facial tool. I keep this in the freezer and use it nightly. I gently roll it across my cheeks, chin and forehead as well as over my brows and eye lids. I do this once after moisturizer until it doesn’t  feel cold anymore, then again after facial oils and it is cold all over again. Some may complain about this becoming warm quickly, but to me it’s very impressive and lasts much longer than my rose quartz roller. The trick is to use it until it doesn’t feel cold anymore and then come back to it a few minutes later. I’ve repeated that process up to 3 times and I could have used it a 4th time as well. Very impressive!",
    "post_time": "Reviewed in the United States on August 23, 2020",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I cannot say enough about how impressed I am with this; it truly does work!! Mild wrinkle improvement and texture after a month of daily use and defiantly noticeable instantly in reducing puffiness around my eyes in the mornings.",
    "post_time": "Reviewed in the United States on July 10, 2022",
    "pid": "B07VHCNHF6"
},
{
    "title": "Bought the mini set on whim and WOW",
    "rating": "5.0 out of 5 stars",
    "content": "Get the mini set try it love it carry it with you and I’m getting the larger one now also!",
    "post_time": "Reviewed in the United States on August 18, 2019",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Absolutely love this thing! I keep it in the freezer, and it’s my favorite go to facial tool. I use it after any sort of abrasive skin treatment, and just when my face needs a cool down. I live in Texas, and it’s been brutally hot this summer, and this thing has been a god send. Does it do what it says it does? I can’t say for sure, but it feels so refreshing, and I do feel like the bags under my eyes have gone down a bit after I hold the roller underneath them every time I use it. Overall, well worth a try, as it’s a relatively cheap beauty purchase.",
    "post_time": "Reviewed in the United States on September 14, 2020",
    "pid": "B07VHCNHF6"
},
{
    "title": "Refreshing and cooling",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely loved using this roller! It was easy to use and after not getting much sleep the night before, it was really refreshing first thing in the morning! Only downside is it doesn’t come with a case/travel bag. So if I wanted to pack this with me, I wouldn’t be able to. I just used the box it cane with to store it in the freezer. 5 stars for sure if Kitsch includes a travel bag!",
    "post_time": "Reviewed in the United States on June 27, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Stays cold, clean and much better than my Gua Jade roller.",
    "post_time": "Reviewed in the United States on December 1, 2022",
    "pid": "B07VHCNHF6"
},
{
    "title": "Super Calming!",
    "rating": "4.0 out of 5 stars",
    "content": "It’s def a great buy. I have heat flashes and this helps.",
    "post_time": "Reviewed in the United States on January 13, 2021",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This roller really does work. I’ve heard that using an ice cube gives the same effect, by somewhat freezing lines and wrinkles temporarily. However, this item is easy to hold, just roll it over the desired area and you will see results in tightening.",
    "post_time": "Reviewed in the United States on August 12, 2019",
    "pid": "B07VHCNHF6"
},
{
    "title": "Feels amazing.",
    "rating": "5.0 out of 5 stars",
    "content": "Ive had it for about 2 weeks now. I haven’t noticed anything different as far as puffiness or lack of fine lines. BUT nonetheless, it feels awesome and soothing. Some of the reviews say that it doesn't keep cool, but once you’ve used it for a while it will warm up for obvious reasons...🙄 Give it a few minutes and its ice cold again. It’s apart of my nightly routine now!",
    "post_time": "Reviewed in the United States on March 28, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve used this product several times now and notice that it definitely helps temporarily relieve some of the puffiness around my eyes. It’s easy to use and actually feels really nice to use right now since it’s so hot outside. I haven’t been using it long enough to notice much difference in my skin but I have noticed that when I use this product at night with moisturizer my skin always looks fresh when I wake up the next day.",
    "post_time": "Reviewed in the United States on February 19, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Weird sticky residue",
    "rating": "1.0 out of 5 stars",
    "content": "I bought this and it looked fine and clean when I first opened it. Used it for a couple of days and then this morning noticed some strange clear sticky residue seeping out the sides, have no idea what it is and now pretty disgusted and worried because I rolled it all over my face. Returning this right away! Saw a few other reviews that said there was a residue and they thought it was used. I don’t think it was used but I question what the heck is coming out of it. I thought perhaps it was some sort of residue inside the stainless steel roller in order for it to freeze properly but stainless steel should be able to freeze by itself without anything inside. And if I’m wrong, then fine, but this clearly is defective because that stuff should not be coming out. I pray that I don’t have any weird bad reaction on my face after using this thing not very happy highly doubt reviews will get read by the company though.",
    "post_time": "Reviewed in the United States on July 21, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Helps so much with inflammation of the face and definitely better than using an ice cube.",
    "post_time": "Reviewed in the United States on June 21, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "New Skin Care Routine!",
    "rating": "2.0 out of 5 stars",
    "content": "I would not buy this product again. Since the roller is metal, it very quickly looses its chill. I have another ice roller from a different brand that actually has frozen beads in the roller and it stays cold for significantly longer",
    "post_time": "Reviewed in the United States on January 4, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "the metal stays cold for a while and it is the perfect size to get all areas of the face! I have already bought a couple others for gifts to share the love (:",
    "post_time": "Reviewed in the United States on December 27, 2022",
    "pid": "B07VHCNHF6"
},
{
    "title": "There are cheaper options that work much better",
    "rating": "5.0 out of 5 stars",
    "content": "The one I own is essential in my daily facial routine",
    "post_time": "Reviewed in the United States on July 18, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've read about cryotherapy and how ice rolling in the morning can help with puffiness. I'm going to be honest and say I don't know if it's truly working but I find the process super refreshing in the morning. You stick the roller in the freezer and take it out for use.",
    "post_time": "Reviewed in the United States on December 14, 2020",
    "pid": "B07VHCNHF6"
},
{
    "title": "favorite ice roller ever",
    "rating": "5.0 out of 5 stars",
    "content": "Only gripe is that I find it odd to not have a protective case over the roller part so I do put in a baggy.",
    "post_time": "Reviewed in the United States on April 17, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I stuck this in my daughter’s Easter basket and she absolutely loves it. Especially because it’s portable!",
    "post_time": "Reviewed in the United States on June 21, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Love the product purchased fr my mother",
    "rating": "2.0 out of 5 stars",
    "content": "Amazing for facial puffiness and just feels great! Perfect gift idea too ;)",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s nicely made and a good size. Overall good until you begin using it. Squeaks so loudly and makes the experience anything but relaxing.",
    "post_time": "Reviewed in the United States on October 12, 2020",
    "pid": "B07VHCNHF6"
},
{
    "title": "De puffing  my eyes",
    "rating": "5.0 out of 5 stars",
    "content": "It’s convenient to travel with",
    "post_time": "Reviewed in the United States on July 30, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Doesn’t stay cold for long- a few minutes max",
    "post_time": "Reviewed in the United States on July 3, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Wish it stayed cold longer",
    "rating": "5.0 out of 5 stars",
    "content": "If there’s one thing 2020 has taught me, it’s self care. This year has been awful, and the last months have been especially hard personally (my cat suddenly passed away). I wasn’t sleeping well and started noticing dark circles under my eyes. I found this kitsch ice roller and it has been great! I use it first thing in the morning to help de-puff my eyes and face, and it’s also just a nice way to feel refreshed.",
    "post_time": "Reviewed in the United States on December 8, 2020",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was skeptical about these cold rollers being effective, and after trying this stainless steel facial roller for my first facial roller, I'm hooked! The stainless steel definitely gets very cold in your freezer, so make sure to leave it out to defrost a bit as recommended before using it on your face. My favorite part of using these rollers is the cold really does help me de-puff my face and calm down my redness. I'd definitely recommend as part of your skincare routine.",
    "post_time": "Reviewed in the United States on August 13, 2019",
    "pid": "B07VHCNHF6"
},
{
    "title": "Great ice roller",
    "rating": "3.0 out of 5 stars",
    "content": "I bought this because I usually use an ice cube to “ice” my face before my morning/night skincare routine. It’s amazing for your skin and boosts collagen! But the ice cubes melt and I use a paper towel. So when I found this I thought it would be great since the metal will freeze cold and I can save paper towels and ice haha. Well it works for what you want only it doesn’t stay that cold. I get a couple of rolls in and the metal immediately matches my skin temp. Great roller but for what I wanted it to be fully used for.",
    "post_time": "Reviewed in the United States on April 29, 2020",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "The size is perfect, and it rolls on the face well, BUT it does not stay cold for more than a minute. Wish I had bought a different type",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B07VHCNHF6"
},
{
    "title": "Cooling and refreshing!",
    "rating": "5.0 out of 5 stars",
    "content": "Fells great on my face. And for headache's.",
    "post_time": "Reviewed in the United States on June 10, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "i love that it’s not actually ice so it doesn’t melt in my face, but still gives the cooling sensation i’m searching for in the mornings! the pink is also super cute",
    "post_time": "Reviewed in the United States on June 14, 2022",
    "pid": "B07VHCNHF6"
},
{
    "title": "Doesn’t stay cold",
    "rating": "5.0 out of 5 stars",
    "content": "Using to depuff my face in the morning. Love it so far.",
    "post_time": "Reviewed in the United States on March 27, 2023",
    "pid": "B07VHCNHF6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I get crappy sleep with have 2 littles and my eyes always suffer from it. I get bad dark eye circles and puffiness. This helps so much with it. The puffiness goes down quite a bit and so does the darkness. Definitely worth the money!",
    "post_time": "Reviewed in the United States on December 1, 2021",
    "pid": "B07VHCNHF6"
},
]