[
{
    "name": "        ECOWALSON Waist Trainer for Women Corset Cincher Body Shaper Girdle Trimmer with Steel Bones Extender       ",
    "stars": [
        "66%",
        "14%",
        "9%",
        "4%",
        "8%"
    ],
    "pid": "B081J2T6V8",
    "ratings": "42,041 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Gives illusion of smaller stomach",
    "rating": "4.0 out of 5 stars",
    "content": "Bought a medium but couldn’t even get it to close because it was way too small! Bought XL (felt bad about myself for having to buy an XL! ) it does make a difference in flattening out that mom belly and hiding those love handles since I’ve been too lazy to exercise! Lol",
    "post_time": "Reviewed in the United States on May 11, 2023",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I would wear a longer tank top underneath it because it’s long on me and rubs my left lower abdomen raw due to friction. It is a corset so it shoves your boobs up high which I’m not fond of since I’m already a DD! I haven’t worn it under a dress or out to shy events because I like to be comfortable and I feel this would frustrate me being tucked in, and sweaty with my boobs up to my chin! Lol I mainly wear it to work out in and keep my stomach muscles from getting lazier than they are!",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B081J2T6V8"
},
{
    "title": "Comfortable and effective",
    "rating": "5.0 out of 5 stars",
    "content": "The extenders make it simple to move up over time.  Comfortable to wear.",
    "post_time": "Reviewed in the United States on April 23, 2024",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Es una cinturilla muy cómoda, los soportes no se doblan y se mantienen en su lugar. No molesta aunque esté gran parte del día sentada. Tiene un corte largo o sea cubre desde el vientre hasta debajo de los pechos. Soy de caderas voluminosas y esta faja no deforma mis caderas ni mi espalda en comparación a otras que he tenido. Estoy complacida y compraré otra de menor tamaño una vez que esta me quede grande.",
    "post_time": "Reviewed in the United States on April 28, 2021",
    "pid": "B081J2T6V8"
},
{
    "title": "Excelente",
    "rating": "5.0 out of 5 stars",
    "content": "First it is a well made product. The wires r strong enough to support your posture. Beathable and so far 5 hours wearing with no irritation or rash. The onlything is the size, i read viewers before purchase and many adviced to buy 1 size smaller than your usual size as you have extention. I am size S for everything and i bought XS so now i can only use with extention on outer hooks and it is tight, my suggestion- buy your size.",
    "post_time": "Reviewed in the United States on September 15, 2022",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Secondly. I am 1.68m heigth and my torso is quite long but this waist trainer is even a bit too long for me I have to pull it down all the way to my bikini lines still it push up my breasts a bit, especially when i sit which put pressure on your breast and it is uncomfy in that sense.",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "B081J2T6V8"
},
{
    "title": "Good enough",
    "rating": "5.0 out of 5 stars",
    "content": "Thirst, the shape of the waist trainer is not really fit me well. It has one smaller end and the other end bigger. So you meant to wear the big end below your belly button and smaller end up. So for me, the lower part is very tight and the upper part is still loose. May be just my body shape. Just wish the upper part is smaller.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Beside that, over all, this is a good product compare to what i have used in the past.",
    "post_time": "Reviewed in the United States on June 19, 2023",
    "pid": "B081J2T6V8"
},
{
    "title": "Postpartum review.",
    "rating": "4.0 out of 5 stars",
    "content": "First i definitely barely even have time to give a review on any items that I buy on Amazon. Lol but here I am.  Ima give an honest opinion about this waist trainer since I would definitely recommend to anyone who is thinking about it.",
    "post_time": "Reviewed in the United States on June 6, 2020",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "1- I have to say when I received the waist trainer I immediately wore- I am 5’2 and my postpartum weight currently is 139.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B081J2T6V8"
},
{
    "title": "Love it",
    "rating": "5.0 out of 5 stars",
    "content": "Pulls everything together",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great for adding to workout regimen",
    "post_time": "Reviewed in the United States on December 31, 2021",
    "pid": "B081J2T6V8"
},
{
    "title": "Size Guide Measurements are off",
    "rating": "5.0 out of 5 stars",
    "content": "Some Context: I have a few years experience in tight lacing/waist training with steel boned corsets. I wouldn’t consider these the proper waist trainers when wanting to displace the fat more dramatically, but these are helpful in other ways.. Since being a year postpartum I have been at my largest size and really uncomfortable with the excess weight in my abdomen that makes tightlacing a lot more uncomfortable to bend & move in.. so I opted for binding with these instead.. I’m using them as a support & smoothing aid while working on my weight loss.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A few things to note- the measurements are off on the size guide. I ended up purchasing the 2XL & XL in 11.5inch torso length with the 25 “steel” bones- which afforded me a little space so that my bra & shaper don’t rub. The 2XL fit on the first try without the extenders (My measurements are: Underbust 41inches, waist 37-39inches, 13inch torso, and 47inch hips at widest).. I make sure to wear maidenform shapewear comfort camisole underneath to protect both my skin and the shaper. I love that it’s very easy to bend & sit in which makes it comfortable to do 12 hour shifts in. The added support also helps with stomach bloat, anxiety, and portion control which is something that corsets aided with greatly.. Glad I get those features with this as well.",
    "post_time": "Reviewed in the United States on February 19, 2021",
    "pid": "B081J2T6V8"
},
{
    "title": "great product!",
    "rating": "4.0 out of 5 stars",
    "content": "I do feel that it does help with removal of excess water weight in the abdomen area when I sweat. But they’re not to be mistaken as use for dramatic waist training that proper corsets offer. These have helped me with keeping my vision/goal in mind when used in combination with proper eating and exercise. It also boosts my confidence when I feel like everything is in place and not hanging out lol.",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "i am 5’7 and weight 160 i got a size small!!!",
    "post_time": "Reviewed in the United States on April 15, 2024",
    "pid": "B081J2T6V8"
},
{
    "title": "Not your grandma's girdle",
    "rating": "5.0 out of 5 stars",
    "content": "it has great compression for the lower belly and very flexible and breathable!! great to do home workouts with btw. i very much recommend",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "After having my daughter 2 years ago I never got my body back. I actually gained a lot  while struggling with postpartum depression.  All this to say to say that I'm fat, but trying to start becoming less fat. Diet has helped me lose a ton already, but for the first time in my life my belly is bigger than my thighs. I realized a lot of it is posture and my abs having been \"unzipped\" while pregnant. Core exercises are really difficult at the moment because of my size and back pain from not having ab strength, it's a vicious cycle. I decided to try waist training to get a jump-start on getting my belly troubles fixed. Holy moly am I glad I did.",
    "post_time": "Reviewed in the United States on November 11, 2021",
    "pid": "B081J2T6V8"
},
{
    "title": "great",
    "rating": "5.0 out of 5 stars",
    "content": "By the size chart I should have ordered a 7X or 8X. After reading tons of reviews and answered questions I went with a 5X. It is very tight. I've got back fat muffin top lol. But I'm not using this to look good in my clothes. I'm sculpting my body. I took about a week to get used to wearing it and working my way up to longer periods of time.",
    "post_time": "Reviewed in the United States on August 1, 2021",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I currently wear it for about 4 hours at a time, one to two sessions a day. In a week of doing this I've already shrunk an inch when not wearing it! I'm also finding my posture is improving habitually and my low back pain is getting better. Even though it's super tight, it's really comfy. I usually wear it while doing my housework, gardening, or crafts. I can move, bend, sit - it's supportive without being restricting.",
    "post_time": "Reviewed in the United States on July 30, 2023",
    "pid": "B081J2T6V8"
},
{
    "title": "FINALLY FOUND THE TRUTH !!",
    "rating": "5.0 out of 5 stars",
    "content": "Now THIS IS THE TRAINER I have been looking for!!! So y’all I have a 32 inch waist but I have an hourglass figure so i have a small waist compared to my hips. I got the XS because I’m on a weight loss journey and ddnt want to get a trainer that was too big that I wouldn’t be able to use after a while because it’s too large. I’m so happy I got the xs because I can work with it along my journey. I AM SO THANKFUL it comes with an extender because I definelty would not have been able to fit the XS without it. As my waist gets smaller I will be able to take off the extender and use the belt on its own and I’m so happy. The quality is amazing as well it really makes you sweat. I worked a GOOD sweat just putting the thing on! The material is awesome because it does not over stretch! It has enough give for you to get into it. I’ve used other waist trainers that are made of spandex and polyester and after like a day or two I’m already on the last ring which I hated! If you are looking to use the product long term I recommend you size down from the recommendation especially since it comes with an extender. So happy I found this!",
    "post_time": "Reviewed in the United States on May 28, 2020",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this waist trainer I went from a medium to a small. I’m on last row on the small. Wear it everyday and you’ll get used to it. I can’t wearing mine. I wear mine 3-4 hours a day. Sometimes at night for 2 hours. Wear it while cleaning or moving around the house. When you sit down it not the best comfortable position. The tighter the better. I’m excited to into size xs",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B081J2T6V8"
},
{
    "title": "It really tight",
    "rating": "4.0 out of 5 stars",
    "content": "It’s something about these clips. I got this in a large and a small guess which one I bought first.. it didn’t fit. Not even a little so I got the large I figured with the extender I could skip the medium. But the clips are v difficult to put on I cut myself with my nail after my hand slipped because I couldn’t clasp this. And it actually fits. I didn’t know I could do that.",
    "post_time": "Reviewed in the United States on January 5, 2022",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m laying in bed rn with the top and bottom latched and the center unlatched because I got tired of sucking it in 😂☠️ To put this on. So I took a break to write this.",
    "post_time": "Reviewed in the United States on January 4, 2023",
    "pid": "B081J2T6V8"
},
{
    "title": "I have 2",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first day with it hopefully it gets easier because I have 2 🥴",
    "post_time": "Reviewed in the United States on August 21, 2021",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Update. I love this waist trainer so much. I’m almost down to the first row of the small now. The times I stopped using this I preferred to size back up instead of hurting myself or giving up. if you stop using it you’ll go back to the size you just worked to slim down. So keep going.  💪",
    "post_time": "Reviewed in the United States on December 2, 2020",
    "pid": "B081J2T6V8"
},
{
    "title": "Absolutely Fantastic",
    "rating": "5.0 out of 5 stars",
    "content": "I am so pleased with this trainer. I've owned many. And until recently I was a loyal Yianna waist trainer customer.  Crazy as it sounds, I'm allergic to latex. It's critically important that latex doesn't not touch my skin. After multiple births i needed a sturdy waist trainer to protect my middle from further injury. So, as I lost weight, i went through many Yianna waist trainers that had the polyester spandex outter cover,  cotton interior cover on it. Due to recent triple hernia belly repair and diastasis recti repair surgery, a sturdy waist trainer was again neccessary.  After trying to reorder through Yianna 3 times and receiving the wrong item (latex exposed,  I couldn't even open the package) and the company failing to send me the correct item,I turned to this company for a waist trainer with polyester spandex outter/cotton interior, latex middle layer. I AM SO HAPPY I DID!! Not only is this trainer more comfortable, I love that they send an additional panel extender so that customer can effectively aear the same trainer longer, and not having to order the next size down as quickly. Nothing but 5 stars for this company!! I'll never go back to the other brand. Choose this trainer! You won't be disappointed!!",
    "post_time": "Reviewed in the United States on September 23, 2023",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Let me start by saying wow. I’ve seen the trend and never really given it much thought. Over the last year I’ve lost 60 pounds and a friend recently turned me on to waist trainers. I researched and read reviews for 3 days straight. I found this one. I love it so far. It comes with an xtender so I purchased a size down. It fits but I have to use in largest setting on the extender however when I see progress and remove the extender (which will be a long time from now lol) I won’t have to purchase a smaller one. Good quality. Comfortable. My back fat does pop out at the top a little but other than that not really noticeable under comfort fitting clothing. I got the 25 steel bones for added posture support. Supports core really well and is flattering unless I wear a tight top.  I plan on wearing it everyday following a waist training schedule for 21 days when I leave in my vacation to Florida. Happy so far. Shipping was breeze and although I haven’t had to deal with customer service, the reviews give them 5 stars. It’s hard to get on though. Definitely do this before your makeup cause you’re gonna break a sweat getting into it. I fasten the bottom half way up pull over my hips (I have small hips) and tug at until I get it where I want it then I suck it  in or lay on bed and fasten the rest from bottom up. Makes it a little easier if you don’t have help or strong arms. I’m 5’2” and weigh 140 lbs. waist now about 28-29. Hoping to get down to 26.",
    "post_time": "Reviewed in the United States on November 12, 2020",
    "pid": "B081J2T6V8"
},
{
    "title": "Omygosh!",
    "rating": "4.0 out of 5 stars",
    "content": "I was hesitant at first due to the negative reviews. What drew me in was the extension. I have been having light back pain lately due to constantly sitting for long periods of time every day (school and work). I’m hoping this helps me from slouching as well. Another reason why I decided to buy this was to help me control my intake of food. I have been cooking more lately from being home a lot. I’m hoping the waist trainer would assist me in controlling how much I eat throughout the day. Over all the package arrived two days early. I would say the material of the waist trainer is a lot better than the other waist trainers I’ve bought from the past and is the only one within the price range of 25 and under that does seem to support my back and provide much better comfort. The measurement is true to size. I’m about 5’6 and 155 pounds with a waist of 29. (I’m not skin tight skinny. I love food). I ordered a medium but I would recommend getting a size smaller if you are trying to lose weight or shape your waist which is what I was hoping to maybe do later down the road. The waist trainer fits comfortably on the first row without the extension. My fiancé and I are planning on probably having a child sometime next year so I will not return the waist trainer for a smaller size because I do not want to wear this after giving birth if it is super tight (if all is good after it does happen I’ll order a smaller one to waist train). I will post an update in a few months. I will plan to wear it for about 6-8 hours a day. I do run every once in a while (about 3x a week) when I have the time. Usually short runs. I hope this post helps.",
    "post_time": "Reviewed in the United States on May 28, 2021",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So like im happy for the extender came with it. Once i tried to put on the waist trainer, it wouldn’t fit. So i was going to return it and get another one up a size. I got an XL my usual size and i already ordered another XXL just incase the XL didn’t fit. But what i did to make it fit, i latch 2nd or 3rd bottom row and put it over my head and started doing the top row and went on down from there i missed like 2 latches in the process but its fine. The downside is the top 2 latches keep unlatching so i put it on the 3rd latch and it stop unlatching the struggle i went through🙃 but i still recommend going up a size to avoid going through all of this. But I will be wearing this quite often to look snatch tho💅",
    "post_time": "Reviewed in the United States on October 30, 2022",
    "pid": "B081J2T6V8"
},
{
    "title": "Order a size or 2 smaller than what you measure",
    "rating": "4.0 out of 5 stars",
    "content": "This is the second one I ordered.  The first was by my measurements which were 3 xl.. that was too big. So I returned and ordered this one in medium.  I should have ordered a large, but with the extender, this will work. It was really hard to clasp, I started from the top to the bottom. It hasnt rolled on me, but it does bulge at the top and the bottom. So if u have the extra baby fat, like me, just beware, it makes massive back rolls and a \"sack\" of fat at the bottom of your stomach from squeezing everything in. I covered both with sport bra and tucked into shorts. I see a bit of a difference in my shape tho, and I can feel the sweat dripping down my back. It IS visible in tight fitting clothes if anyone was thinking of wearing it in public.  If anything changes, I will update.",
    "post_time": "Reviewed in the United States on June 17, 2020",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Update: sent the second one back, it wasnt long enough, I had to keep readjusting it because it kept creeping up and sliding down. The \"steel bones\" kept jabbing me and it was just really uncomfortable.  Not because of the product,  but because I was sent the wrong length. Will re order eventually,  maybe.",
    "post_time": "Reviewed in the United States on July 27, 2021",
    "pid": "B081J2T6V8"
},
{
    "title": "Postpartum Bride to Be Praise",
    "rating": "4.0 out of 5 stars",
    "content": "I've worn it for 1 day for 11 hours and I already see results!! I'm 4 months postpartum and am super uneasy about having to fit into a wedding dress in just one month. I've been so discouraged about not having the shape I once had to pull off the dress.  BUT LOOK NO FURTHER",
    "post_time": "Reviewed in the United States on May 23, 2020",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It fits great! Super comfortable I could wear it all day, 5 or 6 hours in I noticed slight sweating underneath but it still remained comfortable. It even felt like I could feel the car AC through it. It really holds up my posture and engages my abs into a casual work out all day.",
    "post_time": "Reviewed in the United States on November 6, 2021",
    "pid": "B081J2T6V8"
},
{
    "title": "this product is a keeper!!",
    "rating": "4.0 out of 5 stars",
    "content": "I've tried 3 other shape wear types in which I was an XL or L, but through reading comments I got an 29 bar 11\" size medium of this product to get the longest use out of it. I'm 5'6\" with a basketball players curvy body, usually 155 lbs but 187 lbs atm. My waist is 33\" at the belly button and 39\" at front hip bones. my largest issue is is excess skin and fat hanging on my belly that gravity pulls down rather than sucking back into place.",
    "post_time": "Reviewed in the United States on January 11, 2021",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It was a tight squeeze the first day but my fiance helped latch me in as I laid down reaching above my head. Today, it was a lot easier to get into already. When I woke up, I noticed my belly was even lifted and supported itself on its own better. I assume I'm seeing faster results since I'm in postpartum recovery. It' amazing how much confidence you can gain from one simple product :P",
    "post_time": "Reviewed in the United States on April 23, 2021",
    "pid": "B081J2T6V8"
},
{
    "title": "LOVE THIS BUT….",
    "rating": "5.0 out of 5 stars",
    "content": "this product arrived BEFORE time. they do run large ladies. the returns are awesome so its a decent company. i didn't know they ran large so i had to send what i thought would be my size bacc. once i got that one i had to send it bacc it two was to large. my returns where THE NEXT DAY. as soon as i got it i was excited put it on right away to big sent it back either that day or the next day. so that could have had something to do with it as well- i don't know. now DOES IT WORK? i saw a difference in TWO dayz-no lie! i sleep with mine on. that way no one is aware of what i'm trying, i'm lying still so once its in the right place it stays there all night. i'm a real person/customer single mom full scheudle work, school, the mommy thing and this seemed \"like a time saver\" BUT still with results. good luck ladies, i've had this product for seven days now-no complaints. it does have extended length where it reaches down to your crotch area/pubic whatever you perfer to call it preventing that little pouch everyone warns about in those who are inexperienced with waist training. it also goes down to your lower back as well. nice quality no smell. packaged well and worth every penny. i will be ordering an additional one when this one becumz to big for me.",
    "post_time": "Reviewed in the United States on September 3, 2020",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "OBSESSED! I’m 6’ - 1590-160. And brought a xsmall. (Pant size 0-4 depending on brand) I like to barely be able to breathe lol. It comes with an expander. (If your a large but don’t want to spend double the money the expander will help fit a size up, and once your down a bit… now you have just the trainer … don’t have to buy two trainers!) the expander also gets you use to being in the trainer. I only used the expanders for the weekend. I waist train often. So, my body was use to the compression already. I’m now comfortably on the second loop. By med December I hope to be on to a xxsmall.",
    "post_time": "Reviewed in the United States on October 24, 2022",
    "pid": "B081J2T6V8"
},
{
    "title": "I'm a 12/14 and I got a large...",
    "rating": "5.0 out of 5 stars",
    "content": "I wear it to work, but I have to wear a lose shirt or a suit jacket to hide the little bra fat I have. I wear this to sleep. I waist train until I’m uncomfortable. In my old trainer I kept it on at ALL time minus showering.",
    "post_time": "Reviewed in the United States on April 15, 2023",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The one down side to this is it makes my stomach itchy. You can not wear against your skin. It immediately irritated my skin. It leaves temporary marks. Like wear soaks that are a bit tight on your calves. When you roll them down, your super itchy. This trainer does the same, like a tight bra… itchy when you take it off. For the results I see… I push through.",
    "post_time": "Reviewed in the United States on July 17, 2023",
    "pid": "B081J2T6V8"
},
{
    "title": "I love this!!",
    "rating": "5.0 out of 5 stars",
    "content": "Just what I needed to bring my my waist and give me that curved look for my wedding night.",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I was also able to move down THREE notches after a WEEK of using it daily!",
    "post_time": "Reviewed in the United States on January 15, 2021",
    "pid": "B081J2T6V8"
},
{
    "title": "Overall, the sizing is crazy, it is comfortable, has a great stretch, but not so flattering.",
    "rating": "5.0 out of 5 stars",
    "content": "I read so many of the reviews before I bought this waist trainer and I'm glad I did.",
    "post_time": "Reviewed in the United States on January 15, 2023",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "First of all, my hip size is not on the size chart. I have pretty big hips and a small waist. My hips measure 44in and that's not an option on here so I moved down to 39in because all of the comments said to size down but a 6xl seemed REALLY big. I ended up buying a 4xl and its perfect!",
    "post_time": "Reviewed in the United States on April 12, 2023",
    "pid": "B081J2T6V8"
},
{
    "title": "Extender is genius",
    "rating": "5.0 out of 5 stars",
    "content": "There is 3 rows of clips and I can use the second row perfectly! It also came with the extender ( thankfully in case I got the wrong size.) The only down side is that my body is not proportioned right and my waist is so much smaller than my hips so when I put this on, it fits snugly on my hips but I have a ton of loose space at the top under my breasts. It also is not too flattering in my opinion. Not really something you could wear under regular clothes, more like something to work out in. It's pretty thick and has a rubber feeling which makes your clothes sort of stick to it.",
    "post_time": "Reviewed in the United States on July 12, 2022",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Overall, the sizing is crazy, it is comfortable, has a great stretch, but not so flattering.",
    "post_time": "Reviewed in the United States on August 13, 2023",
    "pid": "B081J2T6V8"
},
{
    "title": "Update: Missing extender, no more",
    "rating": "5.0 out of 5 stars",
    "content": "The extender helped to fit in all the extra bits. This way the trainer can grow with you, and or shrink with you! It flexes with my movements. I feel hugged and held comfortably. The sizing was off for me. According to the sizing I should have gotten a 5x. However, upon reading another reviewer with the same measurements who sent it back for a perfect fitting large, I did the same on the first try. Success. I wore it the same afternoon I received it and even slept in it over night. A very noticeable difference in the morning! I am on hook number 6, and will continue to shrink with it.",
    "post_time": "Reviewed in the United States on February 16, 2020",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Update: January 25, 2023",
    "post_time": "Reviewed in the United States on September 21, 2022",
    "pid": "B081J2T6V8"
},
{
    "title": "Perfect Postpartum",
    "rating": "5.0 out of 5 stars",
    "content": "Down to the next hook! Hook number 5 now.",
    "post_time": "Reviewed in the United States on May 8, 2021",
    "pid": "B081J2T6V8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Update: February 6, 2023.",
    "post_time": "Reviewed in the United States on June 30, 2021",
    "pid": "B081J2T6V8"
},
]