[
{
    "name": "        Gskyer Telescope, 70mm Aperture 400mm AZ Mount Astronomical Refracting Telescope for Kids Beginners - Travel Telescope with Carry Bag, Phone Adapter and Wireless Remote.       ",
    "stars": [
        "64%",
        "16%",
        "9%",
        "4%",
        "7%"
    ],
    "pid": "B081RJ8DW1",
    "ratings": "20,561 ratings",
    "other_info": {
        "Brand": "Gskyer",
        "Model Name": "Astronomical Refracting",
        "Optical Tube Length": "400 Millimeters",
        "Eye Piece Lens Description": "Barlow",
        "Objective Lens Diameter": "70 Millimeters",
        "Telescope Mount Description": "Altazimuth Mount",
        "Product Dimensions": "24.8\"D x 4.92\"W x 8.46\"H",
        "Focus Type": "Manual Focus",
        "Power Source": "Adapter",
        "Finderscope": "Reflex"
    },
    "discount_price": "$ 96.99",
    "normal_price": "$129.99",
    "about_this_item": [
        " Quality Optics: 400mm(f/5.7) focal length and 70mm aperture, fully coated optics glass lens with high transmission coatings creates stunning images and protect your eyes. Perfect full positive telescope for astronomers to explore stars and moon.  ",
        " Magnification: Come with two replaceable eyepieces and one 3x Barlow lens.3x Barlow lens trebles the magnifying power of each eyepiece. 5x24 finder scope with mounting bracket and cross-hair lines inside make locating objects easily.  ",
        " Wireless Remote: Free includes one smart phone adapter and one Wireless camera remote to explore the nature of the world easily through the screen and take amazing celestial images.  ",
        " Adjustable Tripod: This telescope allows for many different viewing positions with a adjustable aluminum alloy tripod and a carry bag, the telescope and tripod can fit inside the bag for easy traveling and storage.  ",
        " Satisfaction: TWO-YEAR warranty. And technical support from our team of experts in 24 hours.  "
    ]
},
{
    "title": "Good",
    "rating": "5.0 out of 5 stars",
    "content": "Kids love it",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My nephew loved his telescope! Made the perfect birthday gift.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Gift",
    "rating": "4.0 out of 5 stars",
    "content": "The mobility of the telescope, nice travel bag and informative brochure.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A great starter kit!  Finally got to use it for the lunar eclipse and super moon last night so decided to write the review now.",
    "post_time": "Reviewed in the United States on May 27, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Size, great for travel",
    "rating": "5.0 out of 5 stars",
    "content": "Firstly, there was a slight mishap during shipping or maybe it could have been a defect coming in, but can't tell.  There was a dent on one of the tripod legs.  Not a biggie for me, but wanted to rate this fairly.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The kit came complete, took a few minutes to assemble, actually quite easy esp with the visual instructions. But maybe it would have been better to have some basic instructions on the actual usage and tips to experience your first view of the skies.  There's a lot of info on the internet, but it would have been best to have it specific to this scope. For a beginner, I believe that's key rather than having to do research and figuring out themselves how to apply those information to this specific scope.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Great Value, Good for Beginners, Some Minor Improvements Recommended",
    "rating": "4.0 out of 5 stars",
    "content": "I still have to figure out how to use the barlow effectively.  For now, I was only able to use the 10mm and 25mm. The quality and resolution were fantastic.  Even with the 25mm, I could see the moon's crater clearly on the clear day.  I'm excited to try this out on a more zoomed view and try to find other objects in the sky.",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Mobile phone holder was a bit hard to align but eventually figured it out especially if the smartphone used has multiple cameras.  It also took a while to understand that the distance of the phone and the lens matters, so as to avoid reflections or blurred outcomes.  This information could have been useful if included.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Great Customer Service",
    "rating": "4.0 out of 5 stars",
    "content": "Material wise, the whole scope setup is quite flimsy and unstable.  With its lightweight feature, this makes it difficult to keep the scope in place. A bit of a tap on setup will move the scope away from your view, there needs to be a bit of weight for stability which is compromised by the lightweight feature unfortunately. The knobs and lever for adjusting are also a bit too rough if you're wanting to make small movements.",
    "post_time": "Reviewed in the United States on December 16, 2023",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Lastly, I love that it's so portable and easy to bring alone, very lightweight and folds up easy without having to disassemble anything much.",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Good beginner telescope (here are tips from fellow beginners)",
    "rating": "4.0 out of 5 stars",
    "content": "Ordered 3 months ago and used it 3 times so far. Very good beginner telescope, easy to assemble! Right off the bat, very easy to use for the moon! We've been using the app \"Sky Map\" to locate planets.",
    "post_time": "Reviewed in the United States on August 29, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I labeled the cardboard as I unpackaged it for the first time because I knew I would want to pack it up back into the box, not having a case. Grateful I did!",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Great for seeing the moon.",
    "rating": "4.0 out of 5 stars",
    "content": "A few things we've learned (as amateur astronomers) from trial and error and especially YouTube videos:",
    "post_time": "Reviewed in the United States on July 4, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "-The moon and planets move surprisingly fast!",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "B081RJ8DW1"
},
{
    "title": "Great telescope for beginners like me!",
    "rating": "3.0 out of 5 stars",
    "content": "-Smaller number on the lens means larger magnification.",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "-The adjuster handle, which does the up-down alignment, tends to shift the telescope when you tighten it or let go of it. Takes some getting used to.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Awesome for the $100 i spent on this!",
    "rating": "4.0 out of 5 stars",
    "content": "-It's crucial to align the finder scope before looking for planets. YouTube astronomers recommend aligning the finder scope in the daytime with a distant object in Earth's landscape. In our experience, it also worked well to use the moon to align the finder scope! (Find more details through YouTube research)",
    "post_time": "Reviewed in the United States on March 8, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "-The moon itself can be a source of light pollution for the planets, so using the moon to align the finder scope has that trade-off. However, we were still able to see Jupiter's Galilean moons and Saturn's rings with both planets being near a waxing gibbous moon!",
    "post_time": "Reviewed in the United States on July 4, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Not worth the money!",
    "rating": "5.0 out of 5 stars",
    "content": "-Interference can come not only from light pollution (which we expected) but also from temperature changes, vibrations in the ground, and the \"wavy\" effect of the atmosphere. Among other things I'm sure.",
    "post_time": "Reviewed in the United States on February 6, 2019",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "-There isn't much support from the source company, so astronomy YouTube videos are your best help.",
    "post_time": "Reviewed in the United States on October 26, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Seems ok",
    "rating": "2.0 out of 5 stars",
    "content": "Seems ok for the price. Only complaint so far Is that the little spotting scope that came with it, when looking through it everything is upside down ... no way to adjust or fix it and I don't feel like sending everything back just for it.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I'm new to astronomy, I have only used very small, very cheap telescopes. After reading a little decided on this one. I have found it to be a great beginner scope even with the higher price tag. There are a lot of options among other name brand scopes but this one consistently impresses. It is not perfect. The finder scope felt like it was machined backwards and it was not focused. Those were the only issues, and they were easily resolved. I have found that this scope, 90x600 gives wide sharp views of even moderately faint objects. It will resolve the double star at the foot of cygnus with the widest eyepiece. Even with the 10mm eyepiece on a Barlow in the middle of town you can see both stars clearly, one red and the other smaller one blue. The short focal length gives a wide view and the 90mm objective gathers quite a bit light. I took the scope out to an astronomy club viewing night and both people that looked thru it were impressed with the view. The mount leaves a little to be desired but it is stable. Would be a 5 star review if the finder scope was made correctly, but I will add both the scope and finder are right side up image corrected. Highly satisfied.",
    "post_time": "Reviewed in the United States on January 6, 2019",
    "pid": "B081RJ8DW1"
},
{
    "title": "Unsure at first but not disappointed.",
    "rating": "4.0 out of 5 stars",
    "content": "I went into this expecting professional quality for around $100. If that is your expectation, everything will disappoint you.  I hated this thing at first. The knobs don’t flow all that smoothly.  There were dust particles behind the lens.  I returned one and got a replacement. It wasn’t much better. BUT! The fact is, that this is about as good as you can expect without dropping serious money. For my 9 year old, I removed the 3x main piece and dropped the 10x piece directly in to see the moon. It made spotting, locking in and focusing that much easier. Seeing craters in greater definition was perfect. If you go in expecting Hubble image quality, you are going to spend a LOT more (and still be disappointed) than this handy, portable, basic, intermediate telescope. I replaced an elementary age, all plastic component microscope with this. It was a significant upgrade by comparison. It is not a collegiate/professional level telescope…as should be expected with the reasonable price tag.",
    "post_time": "Reviewed in the United States on June 17, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Over all, I like this telescope for being a beginner. Great looks at the moon and you can see the moons of Jupiter on a good dark night. Only reason I gave 4 stars is it’s obviously cheaply made, but really, you get what you pay for. Just hold your breath and don’t touch it when you go to take a look after you dial it in and you’ll be fine.",
    "post_time": "Reviewed in the United States on August 6, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Adjust your expectations",
    "rating": "5.0 out of 5 stars",
    "content": "****iPhone 11 Pro Max user notice**** I was only able to get my phone to correctly line up while taking a time lapse of the moon one time with the provided phone mount. But with there being three cameras on my phone, I would get one of them lined up perfectly with the phone mount, then mount it to the telescope and it would auto adjust to a different camera. Then you try to adjust the mount and the phone switches to another camera. It was pretty frustrating honestly and I quit trying to use the phone mount. I was pretty bummed about that because taking pictures was what I was most excited about, but overall this is a good telescope for a beginner and for the money.",
    "post_time": "Reviewed in the United States on July 29, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "We got this for our kid's 10th bday.  She LOVES it and it is easy to use.  Out of the box, we had it together and zoomed in on the moon in less than 10 minutes!  We experimented with both the 10mm and 25mm lenses and they look sharp!  I was surprised that the phone attachment stretched far enough to hold my iphone 11pro max!  The bluetooth camera remote control shutter button paired with my phone and works well.  We haven't attached the DSLR adapter yet, (and didn't notice the feature when comparing telescopes on amazon), but after I read it is an option and saw the attachment for it is included, we'll definitely give that a go, too!",
    "post_time": "Reviewed in the United States on January 7, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Good for beginners, NOT FOR IPHONE 11 PRO MAX",
    "rating": "4.0 out of 5 stars",
    "content": "For reference, when using the 25mm lens, the moon's diameter takes up over 1/3 of the view.  The attached photos were taken with the 25mm lens.  On the day I took these, I couldn't figure out how to attach the phone attachment to the telescope, so I took this while just holding the phone camera over the telescope.  You can see the craters and everything!  For a beginner telescope, this is great.  The only downfall about this scope, is that when you are zoomed in that far, you have to adjust the telescope every 5 seconds or so to keep the moon in view.  However, to get a telescope that tracks with the earth's rotation, you're going to have to spend a lot more-so for what you are paying for, this is a great scope.",
    "post_time": "Reviewed in the United States on January 1, 2023",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "On time delivery as promised. Good quality of the product",
    "post_time": "Reviewed in the United States on September 13, 2023",
    "pid": "B081RJ8DW1"
},
{
    "title": "Great Beginner Telescope!",
    "rating": "4.0 out of 5 stars",
    "content": "This has caused so much frustration trying to figure out how to get it to work. There’s a spot on it that takes over the actual picture and there is not much you can do to get the lens to focus. The finder view is upside down. The camera does not work with my iPhone 11. We are past our return window, but we do not recommend purchasing.",
    "post_time": "Reviewed in the United States on February 26, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Update:",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Terrible tripod, otherwise nice little telescope for the price",
    "rating": "4.0 out of 5 stars",
    "content": "I live close to a city and don't generally get a good view of stars because of the light pollution. So I wanted something inexpensive and easily portable, so I could look at the moon or occasionally take it a little further away from the city for some better views. This fit the bill and works pretty well, but the tripod it comes with is awful. It's almost impossible to tighten it into position once you've got the something in view. The side-to-side swivel tightens okay, but the up and down is terrible. It always sags down a little from whatever position you try to lock it into. It's rather frustrating. So, if you really want to enjoy this telescope, keep in mind that you might find yourself spending another $30 or $40 on a better tripod after you get it.",
    "post_time": "Reviewed in the United States on November 20, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's nice. Great for what I needed. The quality of the microscope is good.",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Beginner",
    "rating": "5.0 out of 5 stars",
    "content": "I was highly impressed with our first telescope. The view was so clear. My kids use it nightly to search the skies for stars and planets",
    "post_time": "Reviewed in the United States on February 6, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "The optics/lenses on this telescope seem fine. What breaks the deal is the fact that the poor focusing and azimuth (vertical) adjustments are basically non-functional. To locate and view distant objects you need smoothly-functioning adjustments. With this telescope the mechanisms are so stiff that the entire tripod moves when you try to adjust the azimuth. The focusing mechanism is also difficult to adjust, and does not work smoothly or accurately.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "So clear",
    "rating": "4.0 out of 5 stars",
    "content": "Both of these mechanisms could easily have been built in acceptable ways. I should also add that the customer service phone and email contacts for the manufacturer are also non-functional! I was never able to reach that company.",
    "post_time": "Reviewed in the United States on October 5, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "We haven't had an opportunity to use the telescope yet so I cannot tell you if my 6-year old will be able to see the moon or not.  The sole purpose of this gift is to determine if there is an interest in star gazing, in which case a $300-$500 telescope will be next.  The unit is about what you should expect for sub-$100 telescope.  Everything was in the box and directions were good enough to get parts put together.  We gazed at trees in daylight and everything seems to be in order.  Could use better instructions and/or a link to some sort of web page with basics for beginners.  I can find that elsewhere but would have been nice for it to be included and would have resulted in 5 stars from me.",
    "post_time": "Reviewed in the United States on December 23, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Focus and azimuth adjustments very poor quality.",
    "rating": "3.0 out of 5 stars",
    "content": "12/25/2020",
    "post_time": "Reviewed in the United States on July 17, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Wow I can find the moon and stars through the finder scope but not the actual telescope.  I am still working on it.  As with others had I had the money to drop on an intermediate scope I would have.  But I figure we all have to start somewhere. Figure it will make me more appreciative of what the beginning astronomers has to go through.  I don’t know how they did it...  it I hope to get a better hang of it.",
    "post_time": "Reviewed in the United States on August 26, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Looks like about what I expected",
    "rating": "4.0 out of 5 stars",
    "content": "12/23/2020",
    "post_time": "Reviewed in the United States on March 2, 2023",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Pretty easy to assemble, there is one know where you tighten the main scope to, its a bit tricky to tighten. Everything is very light weight.  A lot of plastic pieces. I have to use it, hopefully tonight  though.",
    "post_time": "Reviewed in the United States on December 8, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Great telescope for beginners and price",
    "rating": "4.0 out of 5 stars",
    "content": "Comes in a nice portable case , was pretty easy to assemble. The directions weren’t very specific when it came to setting up the camera attachment for your phone. You have to unscrew the silver part from the 10mm attachment and add the black piece from the cellphone attachment to both sides of the 10mm attachment. It doesn’t tell you how to setup the remote for to snap pictures. I’m going to try and take apart the 25mm attachment and try it on my phone. The cellphone attachment is also slightly difficult to work with the iPhone 12 pro max which has three camera lenses. I would recommend setting it up inside first and looking through your camera to see how it reacts when you zoom and your phone switches to a different lens. Here are some pictures I snapped tonight of the moon with the IPhone 12pro with the 10mm attachment.",
    "post_time": "Reviewed in the United States on February 27, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great beginner telescope.",
    "post_time": "Reviewed in the United States on November 18, 2023",
    "pid": "B081RJ8DW1"
},
{
    "title": "Good stuff",
    "rating": "1.0 out of 5 stars",
    "content": "Absolute garbage don’t waste your money awful product. Make sure if you’re gonna try to use the phone attachment. You have an iPhone 11 or older absolutely ridiculous advertising faulty, product absolute garbage don’t waste your money. It’s sad that a company would send this out as a recordable product. Can’t believe it’s reviewed as high as it is absolutely unacceptable directions are non-helpful just an absolute joke of the product. Truly wish I could drive to the companies front front door and drop it off myself.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "With so many good reviews I'm wondering if I got a dud.  The overall unit was missing some hardware, but I figured out how to make it work.  I set it up and started with the 25mm lens.  It works good!  As others note in reviews, its hard to get this unit to shift slightly to see objects (up/down and left/right).  At first, it was so hard to move that I really had to push on it hard.  Then, it loosened so much it didn't hold itself up.  I removed some covers to access the hex bolt that tightens the unit.  It has a design flaw that will loosen itself as you move it up and down.  If you don't move it, its fine.",
    "post_time": "Reviewed in the United States on July 26, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Wish I could give zero stars",
    "rating": "4.0 out of 5 stars",
    "content": "I tried to combine this with the 3x Barlow lens.  Impossible to focus clearly.  Clearly it is a very cheap lens.",
    "post_time": "Reviewed in the United States on October 10, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I moved to the 10mm lens.  I couldn't get it to focus.  I spent a long time working on it, researched the internet, and ultimately noticed there is a small bubble in the edge of the lens.  I'm no expert on optics, but I know enough that small imperfection can have big issues. After about an hour of working on it, I decided to move on.",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "swing and a miss!",
    "rating": "3.0 out of 5 stars",
    "content": "Finally, the 5mm lens!  This was supposed to be the exciting lens that gets you closest to the stars!  Like the 10mm, this one had a bubble in the lens and is impossible to focus.  About 30 min of working at it to no avail.",
    "post_time": "Reviewed in the United States on October 14, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "While the 25mm works great, 1 of 3 lenses working is ridiculous.  The Barlow lens is cheap and pointless.  While I don't expect an amazing telescope at this price point, it should be decent for a beginner.  This one missed the mark and will be returned.",
    "post_time": "Reviewed in the United States on June 30, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Unable to use to fully review. *Great customer service*",
    "rating": "1.0 out of 5 stars",
    "content": "Super upset with this item. I bought this for my husband because he's always wanted one so I decided to buy him this one as a beginner. Not one but two of the lenses popped out of the lens holder so he was never actually able to use it. This product isn't cheap just to buy and it fall apart.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "**Update**",
    "post_time": "Reviewed in the United States on September 22, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Excellent for the family",
    "rating": "5.0 out of 5 stars",
    "content": "Love it so so much!  Great telescope",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was a Christmas present for my wife, but we have both come to enjoy it. We are both beginners and our initial experience was a bit frustrating trying to site in celestial objects. A little research and I found we had the wrong lenses for what we were attempting to view. Using the phone attachment helped and made viewing more enjoyable.",
    "post_time": "Reviewed in the United States on December 27, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Good Beginners Telescope",
    "rating": "3.0 out of 5 stars",
    "content": "When viewing the moon, use the 10 mm lense without the Barlow lense. We were able to see Jupiter and Saturn using the 25 mm lense and then added the Barlow lense. We use the telescope in conjunction with Stellarium on our computer or phone to locate planets and stars.",
    "post_time": "Reviewed in the United States on March 22, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall this is a great telescope for beginners and would recommend to a friend.",
    "post_time": "Reviewed in the United States on September 1, 2022",
    "pid": "B081RJ8DW1"
},
{
    "title": "Disappointed:(",
    "rating": "5.0 out of 5 stars",
    "content": "As much as I wish I could say I love this telescope.. I just can’t :( I nearly have a nervous breakdown every time I use it. When using the phone attachment... it is nearly impossible to get a stable shot. Once you finally get whatever you are looking at in view and focused, the second you let go, the weight of the phone pulls it down and whatever you’re looking at out of view. It’s also nearly impossible to get my phone camera lens to line up with the viewfinder without physically holding it there. I tried to use the telescope during last years “Great Conjunction” and was so frustrated at the amount of time it took for me to get a half way decent photo. I spent more time trying to get the telescope to cooperate than I did just getting to watch and enjoy the “once in a lifetime event”. Also the tripod is worthless. I use it with a Manfrotto tripod instead. I have managed to get some decent photos of the moon but the amount of effort it took was beyond frustrating.",
    "post_time": "Reviewed in the United States on January 17, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Now at first I thought it was broken or I didn't assemble it properly as I kept looking out and it was just pitch black. But then I removed the Barlow lens and just used the regular 10mm one and found something like a star or moon and adjusted the telescope to focus on it.",
    "post_time": "Reviewed in the United States on January 9, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Beautiful",
    "rating": "5.0 out of 5 stars",
    "content": "I then removed and fixed the Barlow lens in front of the other lens and bam! There was the moon, you can even spot a detail or two. I'm yet to explore this with the phone but so far, I'm sold!",
    "post_time": "Reviewed in the United States on February 8, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Bought for my son because it had a lot of good reviews.  We put it  together following the picture diagram and that took maybe an entire 10 minutes; if that.  We then went outside and started to focus in on the brighter stars in the sky.  At first we didn't see anything and all the len covers had already been removed.  We were very pleased to see how well it worked after moving the telescope around a little.  All of a sudden my son saw something first and he said \" Mm yeah it works\".  That was his excited voice.  I was able to see the stars after he explained I needed to move the telescope around and adjust my eye in the scope.  We are happy with the purchase.  I have not tried out the phone feature yet. It was cold and we couldn't take staying outside long.",
    "post_time": "Reviewed in the United States on July 8, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "I think I'll keep IT!",
    "rating": "5.0 out of 5 stars",
    "content": "We got it today and set it up in about 15 minutes. The directions are written by someone who does not speak English as a first language but with the pictures we were able to figure it out. My only complaint is there is no other directions with this thing. No manual or anything so I literally had to look up online what the diff lens do etc. I was able to capture a picture of a star on our first night trying it out. So far I’m extremely pleased. We don’t have any idea what we are doing but we wanted a beginner telescope so we can play around with trying to find planets and stars etc. super exciting!",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Where I live I am able to see the stars at night. One night, not being able to sleep I stepped outside, looked up and saw the Milky Way galaxy. I could not believe my eyes. It was beautiful. I knew then I wanted a telescope to further study the night sky. After doing some research and an unexpected lighting deal, this baby was mine. It is exactly what I expected and wanted. Easy to assemble, I assembled mine in about twenty minutes. Easy to operate, I am a beginner and I was able to understand all aspect of the telescope. Also, my came with a carrying bag, which I love because I can take it with me on my husband's fishing trip and watch the sky while he fishes. Once I advance I will get a more powerful one but for now this baby is perfect. I love my telescope.",
    "post_time": "Reviewed in the United States on May 23, 2023",
    "pid": "B081RJ8DW1"
},
{
    "title": "Pretty Basic, but good.",
    "rating": "4.0 out of 5 stars",
    "content": "Just got the Telescope today, and I think I finally got it set up correctly. It's a little hard for a newbie to set up at first. The directions are basically just a series of pictures, with a small amount of text.. So it takes a bit to decipher.",
    "post_time": "Reviewed in the United States on December 11, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Also, If your a little taller, you may want to consider a different type of tripod. The one that comes with it, is short. For a child.",
    "post_time": "Reviewed in the United States on March 17, 2023",
    "pid": "B081RJ8DW1"
},
{
    "title": "You can see Jupiter",
    "rating": "4.0 out of 5 stars",
    "content": "The attachment that comes with it, is designed for an IOS (iPhone) and doesn't open up very far, so if you have a wider phone, the attachment may not work for you.",
    "post_time": "Reviewed in the United States on June 14, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Can't wait until this evening to give it a try!",
    "post_time": "Reviewed in the United States on March 24, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Gskyer Telescope",
    "rating": "4.0 out of 5 stars",
    "content": "Liked: Not Mt. Palomar but could see Jupiter and Saturn.  Of course I could see that with good binoculars. Problem is that a challenge to line up.  too low on the ground vertically to sit in chair and use spotting scope to first find planet then use the real scope to see.  So a real learning curve.  Hard to know if spending $$$$ would help.  As it is, perfectly adequate but intrinsically not stable, can't move viewing with the earth's rotation readily and awkward angle and height.",
    "post_time": "Reviewed in the United States on December 14, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The delivery was as expected, packaging was intact and product was undamaged. For that I give a 5 star rating.  We are disappointed because we ordered this particular model so we could use the camera of our phone to take pictures, and the adapter to get the phone apparatus to hook onto the scope was not included.  There doesn’t seem to be away to reach Amazon customer service to ask for assistance in getting the part.  We haven’t really used it so to speak yet because without the adapter I will probably return the telescope.  It’s a wonderful beginners telescope.  Easy to assemble, light weight and tripod legs are properly positioned to give it stability.",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Works great",
    "rating": "4.0 out of 5 stars",
    "content": "EDIT: i kept messing trying to use and it hust worked, its really hard to get the moon sometimes if it isnt really big in the sky so thats why i was seeing black at first, you think youre pointing at it but youre not lol but works great other than me bot finding the moon. Would totally recommed!!!!",
    "post_time": "Reviewed in the United States on September 8, 2022",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "First review: Works great in the day time. CANT SEE ANYTHING AT NIGHT. i saw a star once with it but it was just a little  blurry dot worse than my regular vision. Tried to look at the moon with it but all i see is a big bright blurry ty light as if the moon is way too wide/ big for the telescopes view. I was SOOOO  excited  and now am extremely disappointed",
    "post_time": "Reviewed in the United States on January 23, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Great for the price",
    "rating": "2.0 out of 5 stars",
    "content": "Very easy and fast setup.  Very light.  Really good telescope for the price.  Was able to see Jupiter, it's moons, and Saturn and it's rings. but they were small and could not see Jupiter's bands really.  Also very hard to see/focus with the 3x Barlow lens so pretty much never use it.  The smart phone adapter and Wireless camera remote are great add in.  fit my S10+.  But having this scope does make me want to get a better one.",
    "post_time": "Reviewed in the United States on March 2, 2023",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "PS: Planets looked better in the scope then the pictures.  I didn't know how to change my cameras setting yet but will try again another night.",
    "post_time": "Reviewed in the United States on January 21, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Good beginners telescope.  Assembly instructions are sparse but sufficient.",
    "rating": "5.0 out of 5 stars",
    "content": "I received the telescope on a cloudy day (the first in more than a week) so I haven't been able to evaluate it with the night sky yet.  I did do a test watching some insects on plant about 100 feet away.  It looked like I was using the macro lens on my camera.  The delivered scope and accessories were as described on Amazon.  It appears to be well built and the carrying case is a nice way to store and transport the scope.  The tripod is sufficient but not great.  It is a good value for a beginner's scope (which is what I wanted).  I was incentivized for leaving a comment but this did not affect my evaluation (which is based on only having the scope for one day).",
    "post_time": "Reviewed in the United States on September 24, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was tired of my grandson being occupied by video games.  I decided to get him interested in the amazing universe by giving him the tools to explore the heavens.  He has not been the same.  From the first night we started traveling through the skies, he has cranked up his interest in all things science.",
    "post_time": "Reviewed in the United States on February 23, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Now is the time for science",
    "rating": "5.0 out of 5 stars",
    "content": "This telescope is ideal for little people.  It is built a little lower to the ground - just the right height for a 7-year-old.",
    "post_time": "Reviewed in the United States on October 19, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The Gskyer Telescope has planted the seed and he is always ready to tell me what he has been watching lately.",
    "post_time": "Reviewed in the United States on July 2, 2023",
    "pid": "B081RJ8DW1"
},
{
    "title": "It works perfectly",
    "rating": "5.0 out of 5 stars",
    "content": "Reasonably priced, this is a great starter telescope.",
    "post_time": "Reviewed in the United States on January 25, 2021",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Couple this telescope with a subscription to Astronomy Magazine and you will tempted to change his name to Carl Sagan.",
    "post_time": "Reviewed in the United States on March 19, 2022",
    "pid": "B081RJ8DW1"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "This telescope is great. It is light weight and super easy to assemble. It has a bluetooth camera shutter and phone mount which are great. At first I had problems with seeing anything through it, but then I soon realized what the problem was. It required the full cover to be removed, not just the obvious one. After I figured that out I have been able to enjoy stargazing and moon watching. I absolutely love it as do my children. The images I provided are just a few I have taken through the telescope with my phone using the provided phone mount and the 10mm eye lense.",
    "post_time": "Reviewed in the United States on August 21, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m really impressed with this telescope. It did take me a little bit of time to figure out how to use it but it is my first time ever having one so that’s to be expected. Once I learned how to properly use it though I am obsessed. It’s easy to assemble and the phone adapter with remote to take pictures is wonderful. I do however wish the stand was a bit taller I’m only 5’2” and it’s a bit short for me but that’s my only complaint on it. If I were to look through the scope the whole time it would cause back pains but I put my phone up to it and I’m able to view things just as well if not maybe even better.",
    "post_time": "Reviewed in the United States on July 1, 2020",
    "pid": "B081RJ8DW1"
},
{
    "title": "Very good for the price",
    "rating": "5.0 out of 5 stars",
    "content": "Great telescope takes some practice to get it focused, and it's not super sturdy every time the kid bumped it to look through it I had to get it set up again lol, but great buy for the price and I love how you can hook your phone up to it to take pictures",
    "post_time": "Reviewed in the United States on January 19, 2024",
    "pid": "B081RJ8DW1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wanted a quality telescope that was affordable. This telescope definitely fit the bill. A good range of objectives and viewing magnification. I was able to look at Jupiter, visibly seeing four of its moons. I also observed Saturn with its rings. Completely awesome",
    "post_time": "Reviewed in the United States on February 13, 2024",
    "pid": "B081RJ8DW1"
},
]