[
{
    "name": " The Four Winds: A Novel ",
    "stars": [
        "70%",
        "21%",
        "6%",
        "2%",
        "2%"
    ],
    "pid": "B0882VNQKS",
    "ratings": "162,420 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "Excellent writer",
    "rating": "5.0 out of 5 stars",
    "content": "I read 3 of her novels best author I ever read",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I don’t know how she does it, but it seems to me like almost every book stays in my heart and a way that is hard to explain. This book reminded me of Steinbeck’s grapes of wrath.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Another amazing book by Kristen Hannah",
    "rating": "5.0 out of 5 stars",
    "content": "She is such a great writer and does it with such heart",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved that Kristin Hannah wrote this realistically. None of the perfect beautiful woman and the romantic strong man that saves the day. A time of greed and desperation. Living moment to moment and trying to survive. Definite recommend for those who want to dive into what living was like during the dust bowl.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "surviving the dust bowl.",
    "rating": "5.0 out of 5 stars",
    "content": "So beautifully written - brings the characters and time alive. Brings such gratitude as a reminder for all we have.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A great author: original, authentic and gets into my heart.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "incredibly moving - couldn’t put it down",
    "rating": "5.0 out of 5 stars",
    "content": "This book kept me reading all day.  The writing made me feel as if I was there and as if the author had lived it herself.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I literally could not put this book down. Beautifully written. A story of strength, love, determination, family and what we are willing to do to protect it.",
    "post_time": "Reviewed in the United States on February 3, 2021",
    "pid": "B0882VNQKS"
},
{
    "title": "Loved, loved, loved it",
    "rating": "5.0 out of 5 stars",
    "content": "It's now 3:00AM and I'm sitting in my living room, and I'm so moved and ready to fight..",
    "post_time": "Reviewed in the United States on April 10, 2021",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As we enter a new year with the same pandemic and political strife, so much of this book will open your eyes to the plight of those less fortunate trying to feed their families and make a living in dire times and trying to right wrongs. Sound familiar? It's Heartbreaking that we are fighting for the same BASIC human rights as we did 90+ YEARS AGO!!!",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Compelling Story of Hardship and Perseverance",
    "rating": "5.0 out of 5 stars",
    "content": "This is an exceptionally story about the tremendous hardship and pain a family endures in the Great Depression. They are warriors and fight their way through it. Highly recommend!",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've read several of her books so far. As expected, this book didn't disappoint. You will root for the characters. Be prepared with tissues. I really wished the author had ended this story differently.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Another Great Kristen Hannah Book!",
    "rating": "5.0 out of 5 stars",
    "content": "Great story and a tear jerker. Such tragedy how people can treat their fellow human. Americans are tough and resilient",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In spite of ugly crying multiple times throughout this book, I could not put it down. Although these are works of historical fiction, the thing I love about Kristin Hannah's books is how she weaves together a story that is both tragic and triumphant that pulls the reader in to some of the darker times in our country's history. I obviously knew about the great depression, the dust bowl and the migration out west for better opportunities, yet I never really appreciated and fully empathized with the human experience of it all. I highly recommend this book not only for the incredible story, but for it's usefulness in opening one's heart to learning more about these moments in time, from the non-fiction aspect.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "such struggles",
    "rating": "5.0 out of 5 stars",
    "content": "It was a sad book, and it has a sad ending!",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Elsa started her life with an unloving family. She wanted: “A life, not merely an existence. That was her dream: a world",
    "post_time": "Reviewed in the United States on July 18, 2021",
    "pid": "B0882VNQKS"
},
{
    "title": "Heartbreaking beautiful",
    "rating": "5.0 out of 5 stars",
    "content": "in which her life and her choices were not defined by rheumatic fever she’d contracted at fourteen, a life where she uncovered strengths heretofore unknown, where she was judged on more than her appearance.” And so her saga begins. Being desperate for love and life, she ventures out in a red dress, and ends up eventually getting pregnant by a young man named Rafe.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Her parents pretty much abandon her and disown her, where her father drops her off to live with Rafe’s family. Rafe’s parent’s end up being genuinely good and decent people, who eventually take her in as a daughter and love her, and help her to become a real trooper in helping raise her two children and contribute substantially to being highly helpful in farming chores. They are living on a lovely wheat farm when the dust bowl years enter in the Texas scene, and literally they watch, live and experience the full force of dust bowl destruction, the sand papering, dust-in-nostrils and lungs, dust dunes, and destruction of every green thing. It grinds people down so far that they end up leaving.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Great book!",
    "rating": "5.0 out of 5 stars",
    "content": "Elsa finds herself leaving with the kids on her own to California.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There are echoes in this part of the book to some of the times we have now. Migrants in the dust bowl states are arriving heavily in California for work, and the people in California are still feeling the threat of instability from the Great Depression, where they don’t feel there are enough good jobs for themselves, and the “good” jobs should be reserved for them. They feel threatened and angry of the migrants, and treat them badly, for the most part, where they don’t pay them well, and tell them to stay away because they are “diseased.” There are a few good people to the migrants, but overall, they are treated pretty badly. When it comes to history, Capitalism has a way of cycling through time of being fairly decent to people, and other times where the greed of Capitalists can be very appalling. During the dust bowl years, the farm workers were treated very badly, where they were paid so poorly, that the workers cannot make a living wage.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Excellent",
    "rating": "5.0 out of 5 stars",
    "content": "A great read.  Poignant look into the an era of strength, determination and heart break. I never realized how devastating that time was.  I never really knew that history.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fast read great author good plot",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Great book. Love this author",
    "rating": "5.0 out of 5 stars",
    "content": "Wife reads books. Wife want book. I buy book. Wife be happy. Make me happy!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this book, it's was a education for me.  Was the first book I've read about the \"dust bowl\" period.  Now I want to read the \"Grapes of Wrath\".  Never read it when I was young.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Book for wife",
    "rating": "5.0 out of 5 stars",
    "content": "Really liked it. She is such a good writer. Develops your character so well you actually feel like you know these people.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Although it is fiction, it is history of a time in the lives of those that came before us. Interesting! Not in the history books that kids are taught today, but should be!",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Another great book by Kristen Hannah",
    "rating": "5.0 out of 5 stars",
    "content": "\"The Four Winds\" by Kristin Hannah\" kept me engrossed of the times our ancestors, my grandparents, my parents, father born in 1910.  The struggle and starvation they went through. The Great Depression and before as their were troubles with weather, no work, etc. My father, the youngest of nineteen, with his hard earned High School Diploma left the State of Maryland, a suitcase, a few odds and ends in hand travels to the State of California from the State of Maryland with two other fellow friends. They all had high hopes and dreams of what was waiting for them in what is known as the San Francisco Bay area. A future with work, a place to live. They all found little work, no housing nor food. Bread lines, people starving, homelessness. Meals, food consisted many times of ketchup and water for soup. Bread lines, and working odd jobs for a dime. The rough years of the Great Depression.  He did make it in his knowledge of horticultural that he studied growing up with his nineteen siblings. His Father was a sharecropper. My father and his siblings were hardworking, some scholars. My father studied Latin in school, played soccer, studied commercial art and architecture. Well spoken, kind and shy \"his classmates\" they said of him. So handsome,  the youngest of nineteen. Many of his siblings stayed in Maryland. But my father headed to the Golden State of California. He did odd jobs and then found himself  as the Master Gardener and worked the whole of \"Live Oak Park\" in Berkeley, California which still exists today. Long hours, and on weekends, with the exception of Mass on Sundays, but then work for him being the personal gardener of the well off people in Berkeley and Oakland Hills, California. At times he would take the older of us along with him. He fed his family of ten. We grew up with a decent home over our heads, healthy, mostly homegrown food. My Mother baked and cooked. My father shopped the list my Mother made for him. They made it through hard times and never wanted any government hand out. We grew up without much, but they made it. My parents taught all of us the of love gardening, baking, reading, going to the library and how to survive. Chickens were a big help to us. I know many families washed their clothes and hang them out to dry. My Mother taught us well. I know there were times I questioned why we did not have what others had as I know my sister's and brothers did. One big Catholic family.  Today there are an abundance of homeless people, out of work and some who choose not to work. All States have been going through droughts, floods, fires, disease and now the Covid Virus. Some are mentally ill, or physically ill. Others have turned to some sort of Addiction, alcohol, drugs, etc. Something is wrong how everyone is so divided today. We all need to unite again. I do realize the pandemic has not helped. After reading Kristin Hannah's \"For Winds\" I feel it is going around in a Big Circle. This novel is a must read on my list! Thank you Kristin Hannah for this excellent read. As all your novels are!",
    "post_time": "Reviewed in the United States on December 17, 2021",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Enjoyed the book but a little depressing.  I guess that is to be expected because it is about the Depression and Texas dust bowl.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "A lot of historical data.",
    "rating": "5.0 out of 5 stars",
    "content": "Another great read by one of my newly discovered favorite authors.  It was written so you felt the grit and the determination of the character in the book.  The book explained so vividly the trying times of the  effects of the stock market crash and the people caught up in the dustbowl of  the plains during the drought.  I couldn't put the book down and finished it in two days. I look forward to reading another book written by Kristin Hannah ASAP.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Hannah captures attention all the thru this book.  She tells a very grim but hopefulstory of the people who suffered during the Great Dust bowl years.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Great read!",
    "rating": "5.0 out of 5 stars",
    "content": "This was the very best book I've read. What a story of survival for single mother and two children.  I will continue to read Kristin Hannah!",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The incredibly talented Kristin Hannah’s newest effort, “The Four Winds,” once again, showcases her writing ability: a remarkable story with unforgettable characters, reader appeal, and grammatical sparkle.  There are not many authors like Hannah around, so it is refreshing to get a new book from her every now and then.  As usual, my counsel is to not miss it.",
    "post_time": "Reviewed in the United States on March 20, 2021",
    "pid": "B0882VNQKS"
},
{
    "title": "HANNAH IS AMAZING",
    "rating": "5.0 out of 5 stars",
    "content": "Elsa Wolcott, enters the 1920s at a stressful time for her.  After being newly married at an age considered too mature by most, times get hard in Texas.  She and her husband, Rafe, struggle on their Texas farm until 1934, when husband, worn down to a life of morbid desperation caused by poor weather and even poorer soil and failing crops, can’t take the tough life anymore, packs up and leaves for parts unknown, abandoning his equally disparate wife and two raggedy children, all of them sick and hungry.  Elsa struggles to keep it together through relentless dust storms and droughts that continue to ravish the already crusty soil, further diminishing the skimpy crops until it also becomes too much for her to handle.  She is forced to make a choice.  She will probably perish if she stays on the land she loves or she can move to golden California where life is easy and much kinder, or so she is told.  Making a hard decision, she packs their meager belongings, gathers what little money they have, and, with children in tow, begins the trek to an easier life in an old, broken-down truck.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "But California is not that golden.  Too many people like her have fled their horrible existence and reached the promised land already, making harsh demands on the land that can’t be met.  So now she has to continue working like a dog, picking cotton for little or no money, struggling to get food for her family, fighting the resentment of California natives over “Okies” moving in, and trying to find jobs where none exist.  Living in a huge farm worker settlement alongside a dirty water ditch, her existence is worse than before.  But she struggles on.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "a great read",
    "rating": "4.0 out of 5 stars",
    "content": "This story is about unbending willpower.  The author has piled immense hardship on her characters and has ways of communicating the privation that will bring tears and gut-wrenching pain to her readers.  Her protagonists struggle along, dragging readers with them actually passing along their pain and discomfort as actual physical events to those that are reading about them.  Think of Jack London and his characters suffering the immense cold of below zero temperatures or tortured slaves as they suffer through their chained existence in the stinking holds of sea-tossed slave ships.  The adversity is actually physically felt by the reader.  Hannah has that kind of reality in her writing.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "No spoilers here.  You’ll actually have to read this book to get relief from the agony, and I recommend that you do.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Steinbeck’s Grapes of Wrath in Microcosm",
    "rating": "5.0 out of 5 stars",
    "content": "Schuyler T Wallace",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": " Author of TIN LIZARD TALES",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Similar the Ceaser Chavez story.",
    "rating": "4.0 out of 5 stars",
    "content": "I loved how the author intertwined the history of the Dust Bowl and Depression with the deep development of the characters. I could not put his book down!",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a bold, painful and compelling story of the dust bowl suffered by a west Texas family who ventured to CA for survival. From the very first page I was drawn to the character of Elsa, a tall awkward girl, rejected by a family with superficial values. She does find acceptance by in~laws and has two children but the trajectory of her life parallels the drying and betrayal of the land. There is little relief from personal and social devastation, which becomes almost unbearable about 2/3 of the way through. But Elsa and her daughter find purpose in the migrant strikes of 1934. While the novel’s conclusion made me cry, hope for the next generation’s future held promise. The writing, through tragedy and joyful moments, reflects a boldly truthful examination of the plight of farm workers in the 1930s. I strongly recommend this novel that’s unforgettable.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Be brave",
    "rating": "5.0 out of 5 stars",
    "content": "A stunning and gruesome account of the dust bowl and depression. This book is for mothers and daughters and everyone. As you read it, be brave.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You will so enjoy this story.  So full of love, challenge and enduring belief in what is right.  Elsa lives on.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "fabulous",
    "rating": "5.0 out of 5 stars",
    "content": "A very interesting storyline, which keeps the reader's interest, well written, like all of her books.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I only gave the book a 4 star rating because I didn’t feel like the characters or the plot as good as some of her others.The Nightingale is still my favorite and getting ready to read The Women.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Excellent story and characters.",
    "rating": "5.0 out of 5 stars",
    "content": "Elsinore has grown up feeling ugly, unloved, and like she’s a burden to her family. They tell her she’s too tall, not pretty, and sickly. It’s the 1920’s and women tend to be married and have children by the time they’re twenty years old and Elsinore is twenty-five. She wants a change and wants to enjoy life so she cuts her waist-length hair to her chin and buys red silk and creates a flapper dress. She sneaks out one night to go to the speakeasy in town but they won’t let her in and tell her to go home when they realize it’s her. She walks down the street and meets an eighteen-year-old Italian man who wants to have fun. They both admit they’re lonely and see each other a few times to have sex. Rafe calls Elsinore “Els”; she likes the nickname and feels wanted when she’s with him. She ends up with morning sickness and her parents disown her and her father takes her and one packed suitcase to Rafe’s family farm. Elsinore's father tells Rafe's parents what’s going on and leaves her there, stating that their family is done with her. Rafe’s parents have saved for him to go to college for a better life but he seems happy to stay on the farm with Els and says that he doesn’t want to go to college anyway. Elsa and Rafe have a girl then a boy. His parents are grateful for Elsa because she’s strong, brave, a hard worker, and a good wife and mother. When the Great Depression hits, Rafe leaves his family behind because he can’t stand staying on the farm anymore. His parents help Elsa raise their grandchildren and they all take care of the farm together. When the land turns into a dust bowl, life gets even worse! The people and animals struggle to survive the heat, the powerful winds, and the extreme dust everywhere. Ant, the youngest grandchild, becomes deathly sick with dust pneumonia and that’s when they decide it’s time to leave the Great Plains behind. When Elsa leaves for California with her children, she’s terrified but sees no other solution. They make it to California but find discrimination and harsh prejudice, horrible working and living conditions, and struggle to survive because of little and sometimes no income. The three do discover strength and loyalty and what they are truly capable of. A story of great strength, determination, and unbelievable perseverance, 5 stars!",
    "post_time": "Reviewed in the United States on May 7, 2021",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is unbelievable, although it shows that trials in our country are cyclical. We are still unfortunately struggling with various migrant issues 80+ years after this story ends. When will we ever learn and recognize the worth of people who are not like \"us\"? Thank you!",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "A good read",
    "rating": "5.0 out of 5 stars",
    "content": "I loved The Four Winds! I love every Kristin Hannah book I've read. I always look forward to each new book. I give The Four Winds 5 stars*****",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This story is a gut-grabber!  It brings the dust bowl depression right in your face.  Which is how I think the story should be told.  I learned something new about how the dust effected animals and humans.  The closed border relevance was gripping.  Read this book",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "A story of great strength, determination, and unbelievable perseverance!",
    "rating": "5.0 out of 5 stars",
    "content": "This is a fabulous read.  I was engrossed in this book from beginning to end.  I learned a lot about the Great Depression and the tremendous suffering it brought.  I cried reading some of the pages and felt a real sense of sympathy for those who suffered.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great read.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Heartache and Sorrow",
    "rating": "5.0 out of 5 stars",
    "content": "Heartache and Sorrow filled this story but Warriors all.  Thank you.  I pray our land is not headed once again in this direction.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered this to read on my upcoming cruise.  Haven’t read it yet but recently read, The Great Alone also by Kristin Hannah and it was very good.  Can’t wait to start The Four Winds.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Reading for upcoming cruise",
    "rating": "5.0 out of 5 stars",
    "content": "When Elsa, who believes herself to be unattractive and useless in a family that treats her \"less than others\" finally gathers enough courage to sneak out of the house and see what it's like to go someplace other than church she meets a young man and gets pregnant. Her family forces her to marry the boy she doesn't really know.",
    "post_time": "Reviewed in the United States on January 26, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In time the successful wheat farming Martinelli family learns to love her and her children with acceptance and more love she has ever experienced.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Family ties, historical about the Dust Bowl",
    "rating": "5.0 out of 5 stars",
    "content": "The Dust Bowl days and years begin near Dalhart, Texas causing hardship that worsens year after year. Elsa finally decides to go to California to start anew with her children after her son develops a lung condition.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "California is filling up with emigrants day by day. Work is almost nonexistent. Families live in squalor and disease. They are taken advantage of by the wealthy farmers.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Wonderful Read",
    "rating": "5.0 out of 5 stars",
    "content": "Eventually, Elsa and her children join others to protest the conditions. Many injuries and deaths occur from violence while continued illnesses, deprivation, and giving up take many lives.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Having known families who experienced the dust bowl this book broke my heart and stole it at the same time. Kristin Hannah does her research and it always shows. I gave this book five stars because it is brutally honest with strong characters who think they're weak and poignant attention to emotional detail.",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Important today",
    "rating": "5.0 out of 5 stars",
    "content": "From the beginning, I could not put this book down! I read it in two days! I could absolutely picture my grandparents and parents living through the depression and the hardships they endured! I loved the book!",
    "post_time": "Reviewed in the United States on February 4, 2021",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this book. Great story, well told.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "A wonderful book about family and hardships.",
    "rating": "5.0 out of 5 stars",
    "content": "It's amazing what strength you can summon up because of the love of family during hardships.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "But then, almost every new read by Hannah becomes my favorite.  The Four Winds is an exceptional book historically and psychologically",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "My favorite!",
    "rating": "5.0 out of 5 stars",
    "content": "Set in Texas and California during the Great Depression Hannah paints a heartbreaking story that many families of the time could relate to. She shares the harsh realities of living in Texas during the dust bowl, of breathing in dust day in and day out until you came down with Dust Pneumonia, something I had never even heard of before and far too many died from. Of sleeping in gas masks just so you didn’t wake up with dust crusting your every orifice. The true potential the droughts and dust storms had to damage the land. And then to escape those only to find oneself in another horrible situation in California, where hope was supposed to be found.",
    "post_time": "Reviewed in the United States on April 28, 2023",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The narrator did a phenomenal job bringing the characters to life and expressing their emotions.",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Heartbreaking tale of the Great Depression",
    "rating": "5.0 out of 5 stars",
    "content": "This is, apparently, my first Kristin Hannah book and certainly won’t be my last. I could have sworn I read one before, but alas my records say not. I stayed up until nearly 4am finishing this book and don’t regret a moment of it.",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Elsa’s story is absolutely heartbreaking, from growing up unloved, to finding herself with a husband who doesn’t love her nearly as much as she does him, to the heartbreaking (yes that word is worth using this many times) moment that he left her and their family. Elsa is a strong woman and mother of the plains and I’m so grateful that she found family with her husbands parents and her children.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Love is what remained",
    "rating": "5.0 out of 5 stars",
    "content": "Loreda was a wonderful point of view for the story, sharing the hardships of a young teen who has experienced almost no good times in her life. She has many rights to be angry at the world as a starving girl with sacks for clothes and broken shoes. I appreciated her drastic need for change when they were in California and the change of heart she experienced there.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I did not realize this was going to be such a heart wrenching book about the Great Depression  and the Dust Bowl that soon followed. My mom and dad went through 12 years of it. They were okies like Elsa Martinelli and her children. I think that's what made people back then so strong and afterwards also. Try to get someone today to work 10 hours on hands and knees for 40 cents so they can feed their children because their husband ran off an left them. This is a very moving book that should be a must read in schools today. Greatly researched and well written.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Another Five Star Novel",
    "rating": "4.0 out of 5 stars",
    "content": "I'm not sure why I waited so long to read \"The Four Winds,\" another five star novel from Kristin Hannah.  A brave woman and her family endure endless dust storms on their family farm in Texas.  Longing for a better life for her two children, Elsa drives them to California for the American dream, which ends up being a nightmare of struggles.  Elsa never gives up on her children and trying to provide a decent life for them during the Great Depression.",
    "post_time": "Reviewed in the United States on March 25, 2024",
    "pid": "B0882VNQKS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Such a gifted writer. This story grabs you by the hand, and doesn’t let go , until the tearful end. Such a beautiful story of the strength and capability of every young woman as she goes from daughter to woman to mother . Will read again and again.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0882VNQKS"
},
]