[
{
    "name": "        Cell Phone Stand with Wireless Bluetooth Speaker and Anti-Slip Base HD Surround Sound Perfect for Home and Outdoors with Bluetooth Speaker for Desk Compatible with iPhone/ipad/Samsung Galaxy       ",
    "stars": [
        "73%",
        "13%",
        "7%",
        "3%",
        "4%"
    ],
    "pid": "B08GC1G4Y9",
    "ratings": "9,837 ratings",
    "other_info": {
        "Brand": "JTEMAN",
        "Speaker Maximum Output Power": "3 Watts",
        "Frequency Response": "1 KHz",
        "Connectivity Technology": "Bluetooth",
        "Audio Output Mode": "Stereo"
    },
    "discount_price": "$ 23.99",
    "normal_price": "$35.99",
    "about_this_item": [
        " 2 in 1 Bluetooth Speaker + Phone Stand:Jteman cell phone stand with bluetooth speaker gadget gift, the phone stand allows you to free your hands,the bluetooth speaker makes your phone sound louder and clearer,The built-in microphone speaker can help the hearing-impaired elderly hear the sound more clearly.This cool gadgets makes a practical birthday gifts for men and women  ",
        " Widely Compatible:Jteman bluetooth speaker with phone holder is suitable for most 4-13 inch smartphones,tablets and e-readers with bluetooth function.The hook fits devices up to 0.59 inches (15 mm) thick. NOTE:This product does not have a power bank function and cannot charge your phone  ",
        " Adjustable Angle,Foldable Stand:Multiple angles can be adjusted to meet your different viewing needs.Let you enjoy music, watch videos and Facetime easily. Foldable stand design,easy to carry and save space.Jteman phone stand speaker for desk is a useful gadgets  ",
        " Stable and Anti-slip:Jteman 2 in 1 Bluetooth Speaker with Stand is a practical gift.The hook is stable and reliable, and the cushion back and bottom of the phone holder are fully covered with anti-slip silicone,which can provide maximum protection for your device and prevent any scratches and sliding  ",
        " Christmas Gifts for Men and Women:The foldable Bluetooth speaker phone holder is simple and easy to use, making it an ideal gifts for men and women.It is also suitable as a kitchen gadgets,Christmas gifts,birthday gifts, white elephant gifts for adult,mothers day gifts,fathers day gifts,Valentine's Day,mens gifts,and various anniversary gifts for him  "
    ]
},
{
    "title": "Big Sound Great Connection!",
    "rating": "5.0 out of 5 stars",
    "content": "I definitely do my research before I buy, so I was impressed with not only the sound for the size but how easily it connects to my Bluetooth each time I turn it on!  I tried to use it as a speaker phone during a call, but I just couldn’t get it to work- but that’s not the reason I bought it in the first place.  I wanted more sound than just my phone, and the ability to take it outside or use it when I was getting ready. Impressed especially for the price!",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a really nice cell phone stand and speaker combo! I've used a few in the past with sound quality issues, but this one is fantastic. It's easily rechargeable, and just a bit bigger than a typical power bank, making it easy to store and travel with. The top piece simply folds up with a little flip tab to rest your phone on and angle as needed, and it has additional rubberized pads to keep everything secure. It takes just five seconds to set up and turn on, giving you a nice bluetooth connected mini entertainment station! The buttons are also convenient, featuring skip, back, pause, and volume controls, as well as call answering and ending functionalities. The sound quality is very impressive, it even sounds like you're listening to a television if you aren't looking right at it. All in all, I'm super impressed with this and would definitely recommend it!",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Very Impressed with the Sound Quality and Connection! Great for Travel!",
    "rating": "5.0 out of 5 stars",
    "content": "I am very pleased with this speaker/phone stand. I had to return the first unit I received because it was defective but the support rep was willing to replace the unit quickly and they did. The Bluetooth light was not coming on without the speaker being plugged in even though it was fully charged. I am appreciative of the help and fast response and the product suits my needs and is easy to use. It's affirdable and it sounds great too.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I got this speaker because I’ve been listening to a lot of audiobooks, and at the highest volume on my phone, it was still just too quiet. This speaker was a nice addition to being able to have a phone holder and a speaker in one. It’s been nice because the volume is a nice increase. I do not have to have my phone at the full for me to hear it. It runs completely at the phone’s volume. No volume of its own like other speakers, so when you turn the speaker, vs on the phone. It’s the same functioning. It was a bit of a disappointment for me at first. But then, I realized JUST how loud the speakers are, and I’m to keep it at halfway and feel like it’s louder than before the speaker with the volume all the way up.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Very Nice",
    "rating": "5.0 out of 5 stars",
    "content": "Now where the problem lies. It has been skipping my audiobooks. I have reset everything so many times, and had no better luck from anything. I cannot figure out why it’s happening. Why it continues to happen. Worst yet, why it seems to happen more so with males than females. Though it WILL happen with females if that have a deep enough voice that they are using. Or I should say where they’re registering a “suspenseful presence.” I know that it’s the speaker vs a complication with the app or my phone because after getting frustrated from spending at least ten minutes on this problem. I undid the bluetooth, and just played it by my speaker so I could hear this characters part. I had to go back to the beginning of this part because I hadn’t realized just HOW MUCH I’d missed. They can be subtle skips where it’s a word, and it doesn’t sound THAT off. But once you HEAR the difference. WOW! So that can suck that that’s happening. I’m not sure WHY that’s happening. And honestly, for this reason alone, I would give the quality of the sound maybe three stars. Because while it IS loud, it does manage to skip sounds for whatever reason.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "And while others could argue that it’s a cheap speaker and that “you get what you pay for.” I had a “big name” brand speaker previous to this one that I’d used maybe a total of five months, owned it for a few years. But one day, it just stopped charging. When I talked to the company, they said that the charging port was probably loose or dirty. It had a cover, I kept it on it. So that couldn’t have been the correct thing, but I cleaned it all the same. I was offered a measly discount to get a new one, but why? So I could have it crap out on me again as soon as the warranty was over? It doesn’t matter the price you pay. I’ve had off brand, “low quality” items and had them outlast ALL my big name brands, and vice versa. I think a big thing is it comes down to how you care for your materials. I myself, I can be hard on my stuff. Not intentionally, but I can be clumsy. So as often as possible, I’ll buy bumper cases. I try to add to the protection of what I have because I know that I cannot always have the best spacial awareness. Worst than that I have two young boys who make my house an active war zone of destruction and chaos where nothing is safe for long. So lately, when I am buying, I opt for a lower cost, but try to get a better quality. As it is possible. And then I do what I can to maintain the quality for as long as I can. I feel like this is the spot of this speaker. No, it’s not a JBL or Bose. And that’s ok. It’s a “cheap” speaker, but it has a lot of good qualities to it. In spite of the fact that it’s skipping in the audiobook area.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "It does an adequate job",
    "rating": "3.0 out of 5 stars",
    "content": "Some of the ways that the speaker does reign so high is that it has the “grippers” on the back and fold out bottom. That actually works at holding my phone in place, so long as I do nothing to upset the table or walk around with it where it will tip out. Although I HAVE walked around with it, and it’s kept an impressive amount of balance in its place. The holding part folds away, and it goes down relatively flat so you can store it away for travel. The part that holds the phone moves up and down and at an forward angel which has come in handy when I needed to do something on my phone, but didn’t want to have to pick it up to do it. I love that I can take this speaker, and speaker alone, and go to the farthest parts of my house with it. Leaving my phone behind and still getting the same quality in sound as when the phone was right next to it. I’ve had bluetooth devices that they have to stay in tandem together or loose the connection, loose the sound, or whatever. So the fact that I can leave my phone behind, and JUST take the speaker while I grab food in the kitchen. Leaving me one less thing to carry back with me is so nice. I HATE earbuds. HATE the feeling of things in and on my ears. So this is a perfect alternative, and it’s provided me so much entertainment of the weeks that I’ve had it. I don’t regret getting this speaker/ phone holder at all.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love that when I have had it off, and turn it back on, the speaker automatically connects back to my phone. Making the audiobook appear on my Lock Screen. No having to hunt for it, or unlocking my phone to get it. It’s a quick and easy transition back to my story, which I appreciate. My expensive speaker I’d always have to resync it to the phone, and then I’d have to reopen where I was getting the audio from. It was a lot of trying steps just to enjoy what I wanted. Now it’s all so streamlined for my enjoyment.",
    "post_time": "Reviewed in the United States on June 5, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Splendid sound and even better value",
    "rating": "5.0 out of 5 stars",
    "content": "So it comes down to recommendations? Would I or wouldn’t I? I would! I would gift this to someone. I would tell ANYONE about this. It’s why I’m choosing to write a review about it. I’m a little flummoxed about the skipping audio. But again, it’s something that could have happened on any number of devices at any number of cost ranges. It could be happening for any number of reason. But I think that this is an outstanding speaker that has been amazing for me. Probably one of my better ones I’ve own. Not that I’ve owned a lot. But unlike the Alexa’s that have to remain plugged in at all times, this one allows for freedom, and the JBL’s that are “surround sound,” but then get a “loose charging port” easily. This is just a low expectations speaker. Even IF I “get what you pay for.” Then, I’ve gotten what I’ve paid for in comparison.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Wasn’t expecting much at this price but what a pleasant surprise. I’ve collected thousands of CDs, mostly classical, but as often listen to live or otherwise unobtainable performances on YouTube.This little device has turned my phone into Aladdin’s genie, except that it offers an infinite number of wishes - now in good sound! It’s also sturdy and compact. Don’t hesitate.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Good speaker",
    "rating": "5.0 out of 5 stars",
    "content": "It did take a bit to connect to my phone but once it was completely charged it connected with no issues.  It has a good output of sound, and I can hear it as someone who is hearing impaired!",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love my Bluetooth speaker for zoom,idea size good quality design, set it and it connects right to your phone!! Keep up the good work. Praise!!!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "This yall is the Bomb!! It works like magic on zoom meetings!",
    "rating": "5.0 out of 5 stars",
    "content": "Love love love this item is all I can say.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I found this device great for playing music and taking calls without having to use earpods. Also, the charge last for a long time which is very convenient.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Speaker plus cell phone holder",
    "rating": "5.0 out of 5 stars",
    "content": "The first one I ordered was defective and would not charge up. Because the Bluetooth phone stand did cost very much  I decided not to box it up and drive it to a UPS store for a refund, but I did initially give it a bad review. The seller reached out to me and offered to replace it at no charge and with me having to go through the hassle of returning the defective one. I gave the seller my shipping address and had a new one a couple of days later. The new one works great. It's a good little portable speaker. I like that I can have music or a pod cast on in the kitchen while I am cooking and I  can hear it over the kitchen noises. It's also great if you like to soak in the tub like I do, but don't want to risk dropping your phone in the tub. I can turn on my Amazon music Playlist and not have to put my phone on the edge of the tub to hear it.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "CON-",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Very useful device",
    "rating": "4.0 out of 5 stars",
    "content": "1. doesn't fit phones well with popsockets attached or thick cases.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "PROS-",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Great Customer Service",
    "rating": "5.0 out of 5 stars",
    "content": "1. Quick delivery",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "2. Rechargeable",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Convenient",
    "rating": "5.0 out of 5 stars",
    "content": "Great for watched movies for videos on your phone. Also great for listening to music. Love it.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Speaker sounds great and a great hands free option for home or office",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Hands free for your desk",
    "rating": "5.0 out of 5 stars",
    "content": "This contraption automatically links via Bluetooth to my phone for phone calls and for watching videos. No batteries!  It charges up with your phone charger!",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My niece love this, got for her as birthday gift and she now use it everyday. It's very loud too",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Works wonderfully!",
    "rating": "5.0 out of 5 stars",
    "content": "This product is great, works great, and quality is great! Will purchase again for gifts!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The Jteman phone amplifier works well. Operation is simple and so far reliable. I am hard of hearing and so this amplifier helps significantly to improve my hearing of phone conversations. The maximum volute level is fairly good. It works for me. I have not tried this with several people on my end participating in the call, but I am confident that it will do the job adequately.",
    "post_time": "Reviewed in the United States on December 14, 2022",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Great price, great buy",
    "rating": "5.0 out of 5 stars",
    "content": "I would say that the build quality if about the same as with most electronics made in China .  It seems to be sturdy and well made.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The phone stand is adjustable for the angle you wish. It is simply a holder for your phone. You can set your phone of almost any size and shape on the stand. The phone can be in either a horizontal position or vertical position. The base of the holder folds up into the unit so that the back portion can be folded down against the speaker.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Buy it!",
    "rating": "4.0 out of 5 stars",
    "content": "The self contained rechargeable batteries are charged using a USB-C connector, so any USB charger with a \"C\" type connector on one end of the cable will work. The proper cable is provided with the amplifier.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If I were to fault this phone amplifier, I think there are two things I would mention. The first is that the clarity of the speaker is somewhat mellow, so that higher frequencies are lost to a degree. I find this to be the major fault for me with my hearing loss. I would like a crisper tone designed to give clear voice amplification as that is what I primarily use this amplifier for.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Sturdy phone holder.",
    "rating": "5.0 out of 5 stars",
    "content": "Adjustable phone holder works well. Use it everyday watching YouTube. Much easier than holding phone.😄",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a great portable speaker. Sound quality is great, very portable and would be easy to take on vacation. Also good for FaceTime or Zoom calls because the stand holds the phone perfectly. If it actually charged the phone I would give it 5 stars but it is still a great product.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Portable Speaker",
    "rating": "5.0 out of 5 stars",
    "content": "My husband uses this thing everyday. He will stand it up in his area while his doing whatever it is he does and watches his phone. Super loud, sleek and easy to use. This think will last awhile.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I liked the product so well I ordered 4 more for all of the father’s in my life!",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Husband uses",
    "rating": "5.0 out of 5 stars",
    "content": "My husband rarely likes things I buy for him but he loved this. I'm even thinking about getting one for myself.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've had mine several months and love it. I'm hard of hearing and that's the main reason I got it. I was hoping it would help to understand what was being said especially when I'm watching videos. I hear every word and the quality is great. It was worth every penny and more !!",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Awesome Father’s Day Gift",
    "rating": "5.0 out of 5 stars",
    "content": "Doesn’t take to charge up",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The only way this could be better is if it charged the phone at the same time",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Husband loves it",
    "rating": "5.0 out of 5 stars",
    "content": "Great sound enhancement",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Decent product! Good to put your phone on and watch Netflix while you wash dishes or do something where your hands will be busy and you are away from the TV",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Me salió defectuoso el del primer envío.",
    "rating": "3.0 out of 5 stars",
    "content": "Compré una y me salió malo el sonido. Informe a Amazon y me reenviaron otra que salió muy buena tiene buen sonido. El cobro de mi tarjeta fue doble también. Los dos artículos me los descontaron de mi tarjeta crédito; desde Colombia me salía más caro hacer la devolución del que salió defectuoso. Eso fue lo que NO me gustó ya me desanime de hacer pedidos por Amazon.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Not only holds the phone but has a speaker",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Not only holds the phone but has a speaker",
    "rating": "5.0 out of 5 stars",
    "content": "Works perfectly.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just what l needed",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Prrfect",
    "rating": "5.0 out of 5 stars",
    "content": "The sound is very good",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this product, easy to carry anywhere any place",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Love the color and the weight",
    "rating": "4.0 out of 5 stars",
    "content": "The price,sound quality and convenience of a phone holder make it a great portable device.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My husband loves to play music while he's working in the garage. This unit is the perfect size & the sound quality is great!",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "great sound quality",
    "rating": "5.0 out of 5 stars",
    "content": "I’m picky and I have standards and this is actually a good item. Would be five stars if it had better mounting securement.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Purchased for my 70 plus year old dad. He said he loved it. Used regularly there.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Perfect white elephant gift!",
    "rating": "4.0 out of 5 stars",
    "content": "Got this for christmas white elephant, my grandma ended up recieving it and loves it for when shes cooking in the kitchen!",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s perfect for charging",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "That it works",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great Product will keep your hands from hurting and holds in place, Very good Sounding gets Loud !",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I would recommend this. Elderly and hard of hearing would benefit from this product as most cell phone are hard to hear without a speaker system. This product is all it was purported to be.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "It's Solid and Sturdy",
    "rating": "5.0 out of 5 stars",
    "content": "This phone stand/speaker is great. The sound is crystal clear. The speaker is weighted to prevent tipping. The perch for the phone has free range to put the phone at any angle you wish. The bluetooth function connected to my iPhone 14 with ease. If you plug the charging cable into a PC, the speaker will play audio from the PC, if not connected to your phone's bluetooth. I love the versatility and compact size of this phone stand. It is perfect for my gaming desk set up.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great for talking on the phone no hands",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "It was all I expected it to be",
    "rating": "5.0 out of 5 stars",
    "content": "This volume enhancer for smartphones gives out perfect higher volume that sounds like a lower-level Speaker. After syncing it with your bluetooth you can conveniently remove your phone from the holder and operate your phone by hand. The bluetooth power does not last a lot of time, but it Repowers this speaker in a short time. So always store its power cord with the volume enhancer.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Has really great sound",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Small but powerful",
    "rating": "3.0 out of 5 stars",
    "content": "ok",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Its compact,the sound is amazing.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "This product magnifies the sound greatly.",
    "rating": "5.0 out of 5 stars",
    "content": "This product works great with my cellphone to magnify the sound so that I can listen to my podcasts and music all over house.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Received as described, good manufacture, does what it says it does, Good design, quick recharge , Easy to understand, good value, good delivery, good seller, would buy from them again.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Function",
    "rating": "4.0 out of 5 stars",
    "content": "It was good",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I  bought  this for my husband for his birthday and he loves it. Sound is clear can't speak on battery life because he keeps it plugged in.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "It was good",
    "rating": "5.0 out of 5 stars",
    "content": "A1 Great item",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This little beast has far better sound than I anticipated. Which is good, and one planned use is to listen to music and sound effects as I go to sleep. I expect that it will be WAY better as a speaker phone than the speaker and mic built into the phone. The portability is nice. I can take it on long trips and enjoy it's benefits. In the car, in hotel rooms, at camp sites.We'll see how it holds up in the long run. So glad I found it!",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "I got rid of our landline and got one of these to stop paying $30 per month for my desk landline phone.  This is working well.  A little different, but worth it to save over the long term.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a gift for a family member, and they were very excited to receive this Birthday gift! They do a lot of desk work, so when they answer the phone they do not have to balance it under their chin to talk or run the risk of dropping the phone. They just touch a button and the phone answers without having to pick it up.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Very loud",
    "rating": "5.0 out of 5 stars",
    "content": "The best for me",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It sounds good, works well anywhere!  Good purchase for sure.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "So far so good",
    "rating": "4.0 out of 5 stars",
    "content": "My wife says it works good",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I never knew I needed this until I did hahah I love watching shows while I do dishes or cook dinner and this works great for that and it’s plenty loud for the size! Definitely recommend",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Awesome",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered this product for my son, I was impressed with the quality. It works great. I looks good, is portable and the sound is perfect. Durable!! My son loved his gift.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this product to listen to music from my phones and to turn up the volume so I  could move around.  I was pleasantly surprised with the quality of the sound.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Phone holder with speaker.",
    "rating": "5.0 out of 5 stars",
    "content": "The portability the quality and the fit of this device in any area and project the sound as the seller claims it will is very accurate. The appearance is nice and neat because it fits anywhere out in the open or tucked back out of the way",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I Like the Volume … Nice size weight to it … I think it will hold up for some time , made well and holds my iPhone 12 securely but it really would be great if it charged phone as well while playing .",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Quality Sound",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this as a gift for my husband, He loves it!",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It’s an okay product, my husband doesn’t use it very much.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Excellent sound for product size and price",
    "rating": "5.0 out of 5 stars",
    "content": "Had a problem with the product and they worked quickly and professionally to solve the problem. They shipped a new unit promptly. Hopefully, there won't be another problem with it, but I highly recommend this seller based on their handling of this transaction.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It came with enough charge on it to check how loud it was. So I connected it to my Bluetooth (which was easy). And it was already amazingly loud (like a television) but then my bass drop and this little thing got bass!!!! Lol! Now my mom and sister wants one. Definitely worth the purchase and absolutely amazing.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Great Little Speaker",
    "rating": "5.0 out of 5 stars",
    "content": "I wasn't sure about this speaker when I ordered it.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I was really surprised when it worked so very well.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Works ok",
    "rating": "5.0 out of 5 stars",
    "content": "Everyone says the sound quality is amazing for such a little speaker.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use it a lot while grilling.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Awesome gift",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this so we wouldn't have to prop the phone up while listening to Bluetooth when outside. Wish the volume would go a little louder but for an inexpensive speaker it's ok,  not great but it works.",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Got this for my husband as he likes to watch games and fights while traveling and out and about… always holding his device. Not only it’s a stand stand but the volume is crazy loud for this little box. I now gotta buy one for my son",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "My wife loves hers.",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for my wife and she absolutely loves it. She takes it with her everywhere.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was in need of something to help me hear my pod cast & music when I’m working. I use ear buds most if the time but in reality they can restrain you from being alert to other sounds & even your surroundings. This small portable speaker can be taken from room to room & fits just about anywhere. I get the best of both worlds. I’m now using it when I play music to lighten up the atmosphere during Estate Sales for clients. The sound is great! Excellent purchase!",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Great Quality&  Perfect sound",
    "rating": "5.0 out of 5 stars",
    "content": "The sound of the speaker is not that much better than the sound quality and volume on my phone. But it's nice to have this speaker/holder parked in front of my desk while I work.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Surprised by the sound quality and volume. I am 74 ,partially blind & my phone wasn't giving me the volume I needed. So I purchased a screen enhancer & this little gadget.  It's simple to set up, takes less than a minute. I have a large case on my phone & this will accommodate it nicely. I highly recommend it for those of us that need more volume as we get older 😏 Also..sturdier than expected. Go 4 it.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Good product. Sound is able to get loud.Great value",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoy this product, it's really great for people that have problems hearing with their normal volume on their cell phone. It's very sturdy and it holds your phone like it's a mini TV stand. The volume works very well and I would recommend it.It would also be great for an elderly person because of the volume, how easy it is to use, and the sturdy stand.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was one of my favorite purchases, mostly because of how well it works and the value for the price.  I purchased it for my husband because he loves watching YouTube and anime on his phone.  He was so happy I got this for him so he doesn’t have to hold up his phone, especially when he falls asleep watching lol.  He puts his phone on the stand and then puts the speaker right on his belly to watch haha.  It connects easily via Bluetooth and you can adjust the volume either with the phone buttons or with the buttons on the speaker itself.  It gets pretty loud, we’ve actually huddled around his phone to watch a movie together, love this!  We had it for a while and he uses it pretty frequently.  It’s easy to charge and haven’t had any issues with it.",
    "post_time": "Reviewed in the United States on December 9, 2023",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Favorite purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Gave this as a gift, and our friend loves it. They're using it every day...especially in the kitchen!",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Sounds quality and durability is a WOW. Pretty amazed. Daughter loves it. Barely have to recharge it. 2 thumbs up!",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Great product! Works really well!",
    "rating": "3.0 out of 5 stars",
    "content": "When listening to podcasts or audiobooks I found the audio quality was very poor - constantly cutting in and out skipping words. I did not notice the same issue on calls but to be honest, the call quality wasn't of utmost importance to me. Also found it cumbersome to have to plug in my phone separately - would be better if the the stand had a cable dock so that you could charge and listen conveniently.",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Volume for zoom meeting host is improved with this item.",
    "post_time": "Reviewed in the United States on March 23, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Sound Quality",
    "rating": "4.0 out of 5 stars",
    "content": "Wish it was a charger as well.",
    "post_time": "Reviewed in the United States on March 18, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Mis read product info  want one with wireless charging as well",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Poor Audio Quality",
    "rating": "5.0 out of 5 stars",
    "content": "I saw this on Huffington Post and was intrigued. When doing dishes or other work around my place, I like to listen to podcasts or music, but don't like using headsets and my tech doesn't have enough oomph volume-wise.",
    "post_time": "Reviewed in the United States on November 29, 2023",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Managed to catch this on a sale and couldn't be happier with it.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B08GC1G4Y9"
},
]