[
{
    "name": "        Cell Phone Stand with Wireless Bluetooth Speaker and Anti-Slip Base HD Surround Sound Perfect for Home and Outdoors with Bluetooth Speaker for Desk Compatible with iPhone/ipad/Samsung Galaxy       ",
    "stars": [
        "73%",
        "13%",
        "7%",
        "3%",
        "4%"
    ],
    "pid": "B08GC1G4Y9",
    "ratings": "9,832 ratings",
    "other_info": {
        "Brand": "JTEMAN",
        "Speaker Maximum Output Power": "3 Watts",
        "Frequency Response": "1 KHz",
        "Connectivity Technology": "Bluetooth",
        "Audio Output Mode": "Stereo"
    },
    "discount_price": "$ 23.99",
    "normal_price": "$35.99",
    "about_this_item": [
        " 2 in 1 Bluetooth Speaker + Phone Stand:Jteman cell phone stand with bluetooth speaker gadget gift, the phone stand allows you to free your hands,the bluetooth speaker makes your phone sound louder and clearer,The built-in microphone speaker can help the hearing-impaired elderly hear the sound more clearly.This cool gadgets makes a practical birthday gifts for men and women  ",
        " Widely Compatible:Jteman bluetooth speaker with phone holder is suitable for most 4-13 inch smartphones,tablets and e-readers with bluetooth function.The hook fits devices up to 0.59 inches (15 mm) thick. NOTE:This product does not have a power bank function and cannot charge your phone  ",
        " Adjustable Angle,Foldable Stand:Multiple angles can be adjusted to meet your different viewing needs.Let you enjoy music, watch videos and Facetime easily. Foldable stand design,easy to carry and save space.Jteman phone stand speaker for desk is a useful gadgets  ",
        " Stable and Anti-slip:Jteman 2 in 1 Bluetooth Speaker with Stand is a practical gift.The hook is stable and reliable, and the cushion back and bottom of the phone holder are fully covered with anti-slip silicone,which can provide maximum protection for your device and prevent any scratches and sliding  ",
        " Christmas Gifts for Men and Women:The foldable Bluetooth speaker phone holder is simple and easy to use, making it an ideal gifts for men and women.It is also suitable as a kitchen gadgets,Christmas gifts,birthday gifts, white elephant gifts for adult,mothers day gifts,fathers day gifts,Valentine's Day,mens gifts,and various anniversary gifts for him  "
    ]
},
{
    "title": "The size and sound",
    "rating": "4.0 out of 5 stars",
    "content": "Its compact,the sound is amazing.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Received as described, good manufacture, does what it says it does, Good design, quick recharge , Easy to understand, good value, good delivery, good seller, would buy from them again.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Function",
    "rating": "4.0 out of 5 stars",
    "content": "It was good",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I  bought  this for my husband for his birthday and he loves it. Sound is clear can't speak on battery life because he keeps it plugged in.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "It was good",
    "rating": "5.0 out of 5 stars",
    "content": "A1 Great item",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This little beast has far better sound than I anticipated. Which is good, and one planned use is to listen to music and sound effects as I go to sleep. I expect that it will be WAY better as a speaker phone than the speaker and mic built into the phone. The portability is nice. I can take it on long trips and enjoy it's benefits. In the car, in hotel rooms, at camp sites.We'll see how it holds up in the long run. So glad I found it!",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "I got rid of our landline and got one of these to stop paying $30 per month for my desk landline phone.  This is working well.  A little different, but worth it to save over the long term.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a gift for a family member, and they were very excited to receive this Birthday gift! They do a lot of desk work, so when they answer the phone they do not have to balance it under their chin to talk or run the risk of dropping the phone. They just touch a button and the phone answers without having to pick it up.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Very loud",
    "rating": "5.0 out of 5 stars",
    "content": "The best for me",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It sounds good, works well anywhere!  Good purchase for sure.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Great Little Speaker",
    "rating": "5.0 out of 5 stars",
    "content": "I wasn't sure about this speaker when I ordered it.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I was really surprised when it worked so very well.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Works ok",
    "rating": "5.0 out of 5 stars",
    "content": "Everyone says the sound quality is amazing for such a little speaker.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use it a lot while grilling.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Awesome gift",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this so we wouldn't have to prop the phone up while listening to Bluetooth when outside. Wish the volume would go a little louder but for an inexpensive speaker it's ok,  not great but it works.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Got this for my husband as he likes to watch games and fights while traveling and out and about… always holding his device. Not only it’s a stand stand but the volume is crazy loud for this little box. I now gotta buy one for my son",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "My wife loves hers.",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for my wife and she absolutely loves it. She takes it with her everywhere.",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Muy práctico y funcional. I love it.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Es una maravilla",
    "rating": "5.0 out of 5 stars",
    "content": "The volume is perfect and I love that you can adjust the stand forward or backwards.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was in need of something to help me hear my pod cast & music when I’m working. I use ear buds most if the time but in reality they can restrain you from being alert to other sounds & even your surroundings. This small portable speaker can be taken from room to room & fits just about anywhere. I get the best of both worlds. I’m now using it when I play music to lighten up the atmosphere during Estate Sales for clients. The sound is great! Excellent purchase!",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Good product. Sound is able to get loud.Great value",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoy this product, it's really great for people that have problems hearing with their normal volume on their cell phone. It's very sturdy and it holds your phone like it's a mini TV stand. The volume works very well and I would recommend it.It would also be great for an elderly person because of the volume, how easy it is to use, and the sturdy stand.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was one of my favorite purchases, mostly because of how well it works and the value for the price.  I purchased it for my husband because he loves watching YouTube and anime on his phone.  He was so happy I got this for him so he doesn’t have to hold up his phone, especially when he falls asleep watching lol.  He puts his phone on the stand and then puts the speaker right on his belly to watch haha.  It connects easily via Bluetooth and you can adjust the volume either with the phone buttons or with the buttons on the speaker itself.  It gets pretty loud, we’ve actually huddled around his phone to watch a movie together, love this!  We had it for a while and he uses it pretty frequently.  It’s easy to charge and haven’t had any issues with it.",
    "post_time": "Reviewed in the United States on December 9, 2023",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Favorite purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Gave this as a gift, and our friend loves it. They're using it every day...especially in the kitchen!",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Purchased 2 of these. One for myself - the only downside is that the volume doesn't increase/decrease evenly, slowly - it jumps in increments; similar to a low, medium, high, very high volume. For the price it's still a good buy. Convenient and long lasting so far.",
    "post_time": "Reviewed in the United States on January 9, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Great product! Works really well!",
    "rating": "5.0 out of 5 stars",
    "content": "Sounds quality and durability is a WOW. Pretty amazed. Daughter loves it. Barely have to recharge it. 2 thumbs up!",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "When listening to podcasts or audiobooks I found the audio quality was very poor - constantly cutting in and out skipping words. I did not notice the same issue on calls but to be honest, the call quality wasn't of utmost importance to me. Also found it cumbersome to have to plug in my phone separately - would be better if the the stand had a cable dock so that you could charge and listen conveniently.",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Big Sound Small Speaker",
    "rating": "4.0 out of 5 stars",
    "content": "Volume for zoom meeting host is improved with this item.",
    "post_time": "Reviewed in the United States on March 23, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Wish it was a charger as well.",
    "post_time": "Reviewed in the United States on March 18, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Sound Quality",
    "rating": "3.0 out of 5 stars",
    "content": "Mis read product info  want one with wireless charging as well",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B08GC1G4Y9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It definitely gives you a bit more volume than normal I love that part. However I got it for work to hold my iPad when I watch movies. I have a 10inch ipad with a case. It's not a real thick bulky case and even tho it somewhat support it, it could have been made better. the loops at the bottom should have been made out of a metal or thicker plastic and it should have been wider and extended out more for bulky cases if needed. I do respect the concept of their idea. If they could change those couple complaints it would be well worth the money 1 out of 10 I'd give them a 8. If you take off your iPad case it won't weigh it down as much and would mostly be a better fit. I'm just not willing to compromise the case, I'm somewhat careless and would probably drop the iPad I. that minute 😳  Hopefully this was helpful to someone",
    "post_time": "Reviewed in the United States on February 14, 2023",
    "pid": "B08GC1G4Y9"
},
]