[
{
    "name": "        ComfiLife Gel Enhanced Seat Cushion – Office Chair Cushion – Non-Slip Gel & Memory Foam Coccyx Cushion for Tailbone Pain - Desk Chair Car Seat Cushion Driving - Sciatica & Back Pain Relief (Black)       ",
    "stars": [
        "65%",
        "17%",
        "9%",
        "4%",
        "4%"
    ],
    "pid": "B08HPQVJMW",
    "ratings": "102,976 ratings",
    "other_info": {
        "Brand": "ComfiLife",
        "Special Feature": "Cooling Gel + 100% Premium Memory Foam Cushion",
        "Color": "Black",
        "Size": "one size",
        "Fill Material": "Gel Memory Foam"
    },
    "discount_price": "$ 36.76",
    "normal_price": "$59.95",
    "about_this_item": [
        " Most Comfortable Gel Memory Foam Cushion On The Market - ComfiLife's all-in-one features are unrivaled: Non-slip rubber bottom, built-in handle for easy transport and machine-washable zippered velour cover for easy cleaning. The ComfiLife Coccyx Cushion is the best gel memory foam seat cushion on the market made of premium quality durable memory foam with cool off gel layer on top for superior comfort  ",
        " Supports Tailbone and Relieves Pressure - Ergonomically designed seat cushion provides maximum support and comfort while reducing pressure on the coccyx / tailbone and promotes healthy posture  ",
        " Provides Lower Back Pain & Sciatica Relief, Great for Office Use, Driving & Traveling - Supports recovery from lower back problems, herniated discs, tailbone injuries, sciatica and other spinal issues. Great for office, home, travel, car seat or wheelchair use. Machine-washable zippered velour cover for easy cleaning and built-in handle for easy transport  ",
        " Our Customers Love ComfiLife Cushion - \"I have already recommended this to all my office mates that sit all day, as well. I love it, and some advice...Lock it up after you use it, or I guarantee one of your sneaky cube mates will swipe it!\" \"This has saved my life as one with lower back pain due to pinched nerve roots\" \"I have herniated discs and sciatica for many years, this cushion allowed me to drive cross state with little to no pain\"  ",
        " Personalized Comfort - We want to emphasize that while our cushion is designed to suit a wide range of preferences and needs, it might not be the ideal fit for all body types or comfort preferences. This is a common characteristic of products designed for ergonomic support and comfort. We encourage giving the cushion a fair trial period to adapt to its feel and support.  "
    ]
},
{
    "title": "Must buy",
    "rating": "5.0 out of 5 stars",
    "content": "This was used on a roadtrip from Missouri to Virginia. From the support it provided after 17hrs she had minimal hip pain! She also confirmed it has a cooling effect.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this cushion a couple of years ago, and I decided I liked it so much I just purchased another one for another chair!",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "This is my 2nd purchse.",
    "rating": "5.0 out of 5 stars",
    "content": "This cushion is great for sitting on or as a backrest. I use it at my desk, watching tv and in the car. Love it",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Bought this to compensate for the lack of cushioning on my office chair. Felt a difference in about 2 days. My lower back stopped hurting and I felt more aligned and upright while sitting and working. Would've been 5/5 if cushion had a better grip or way to secure to seat.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Great xushion",
    "rating": "4.0 out of 5 stars",
    "content": "This is a bit narrow for me but it retains its shape well.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This order came quickly and is as expected.  I have used this cushion only once but it was very comfortable as I had to sit for many hours at a time.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Helped with lower back pain",
    "rating": "5.0 out of 5 stars",
    "content": "Got this for my office chair, due to recently diagnosed herniated disc. Took a few days to mold to my rear end shape but now it works great. My back feels much better sitting all day than it did before. Great purchase.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried several seat cushions over the years and most work “ok”. Recently after losing 40 lbs, my tailbone started hurting after sitting a while on any of my existing cushions.  I even learned the “proper” to sit on a cushion with the tailbone over the open area and the sit bones on the main part of the cushion. My tailbone still hurt!  I imagine the cushion’s flattened too much. After reading the reviews on this cushion and specifically by someone with similar issue I decided to try it. Within a few days my tailbone pain gradually disappeared.  2 weeks in use now and still wonderful.  I highly recommend this cushion.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "Offers great support for my back.the quality is great. Very easy to use.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was the perfect gift for my mom. Gave her height in the car and comfort on hard chairs. Nicer than expected.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "This Cushion split in half with normal use. Within a few days.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Might be a little too firm for those that are more senior.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Effective product",
    "rating": "5.0 out of 5 stars",
    "content": "Works great. Love the cool when first sitting on it.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use it every day on a hard chair.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Happy with it.",
    "rating": "5.0 out of 5 stars",
    "content": "Excelente calidad y funcionalidad.  Cómodo alivia los dolores al sentarse",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It really makes a difference in comfort.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Comfy",
    "rating": "5.0 out of 5 stars",
    "content": "Loved the design and removable cover.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Use this daily. I’m 315lbs and it always goes back to normal after 8 hours of sitting. Doesn’t shift on chair either",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Excelente Calidad",
    "rating": "5.0 out of 5 stars",
    "content": "This is my 4th cushion to try, all different price points.  So far I have sat on it one full day and it hasn’t compressed.  The seller reached out to me as a new buyer to give me instructions and information.  The instructions said that in a few days, the cushion will conform to my buttocks.  The cushion is about medium size and fits me.  I’m 5’8” and 223 pounds.  The cushion is comfortable and I don’t have to get up frequently to “walk off the pain.”  For the men out there, there’s not a big shoe horn of cushion in the middle front so you too, can put the 2 separated pieces in the back.  The cover is soft and feels like suede.  The price point is good for the pain relief you get.  I’ve tried some cushions near $100 that were laughable because they compressed immediately and provided no relief at all.  The reasons I need a cushion include that I lost 75 pounds which takes away muscle, fat, collagen, and elastin.  So it’s painful to sit on your two buttocks bones with no cushion.  I also have lumbar back and hip pain.  So those conditions are helped with this cushion for me.  I hope this cushion helps others for my conditions and other situations.  I’m very happy with my cushion.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "UPDATE:  After the first day, the cushion flattened to my hard chair seat.  My buttocks went numb with pain.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "A MAZING!!!!!!",
    "rating": "5.0 out of 5 stars",
    "content": "This cushion is the best one ever!!!!  No hip pain, leg weakness or even back ache!!  Love it!!  Don't be skeptical, buy it!!!  You won't be sorry!!!",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have an old office chair that I was considering to replace then thought, what about a good cushion?? Now I have a new chair at a fraction of the price",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Worth every cent of this purchase!",
    "rating": "5.0 out of 5 stars",
    "content": "Brother needed it after a major operation. He found it very comfortable for the amount of time he used it.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My husband uses this for comfort and support at work. He loves it. Great quality item. Highly recommended.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Comfort",
    "rating": "5.0 out of 5 stars",
    "content": "This has helped my butt bone tremendously! By the end of the day my rear end was hurting so bad that I would have to constantly reposition and avoid my tailbone. Since using this cushion for the last week, the pain is nearly non existent. I have intermittent pain, so when it starts, I’ll be sure to bring out the cushion!",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This cushion is awesome, especially if you have to spend much time in hard seating and it doesn't slide around",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Very good",
    "rating": "5.0 out of 5 stars",
    "content": "Very comfortable and my back doesn’t bother me at all when I get up after long periods of sitting still",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I push about between 2-4 hours a day commuting for work and started noticing some lower back discomfort. This solved the issue and now I cannot drive my car without it. If I try then the back pain slowly comes back.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Great cushion",
    "rating": "5.0 out of 5 stars",
    "content": "I just started working from home, and at the end of the day my hips and bottom were quite uncomfortable. However, this seat changes all of that and by the end of the day I am just as comfortable as i was at the beginning of the day.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Really like the warranty.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Great after a few weeks",
    "rating": "5.0 out of 5 stars",
    "content": "The chair cushion was overly firm at first but gradually softened after a couple of weeks.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Improves posture and increases the ability to sit for long periods.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Cushion",
    "rating": "4.0 out of 5 stars",
    "content": "Excellent! Great feel. Very comfortable!",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I sit all day for the most part behind a computer screen. After sitting for awhile by tailbone area starts to hurt. Never happened while i was younger... the cost of aging it seems. I bought a posture correcting seat and it helped alleviate some of the issues but not all. Thought I would try this. Seemed a bit better but still the occasional pain. I'll give this more time and see the long term and come back again to comment",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Little better than my posture correcting seat",
    "rating": "5.0 out of 5 stars",
    "content": "Wonderful product but was too thick to fit in my car bucket seat comfortably. In the lowest seat position I sat up too high to drive my car. Disappointed because this is a great product and the customer service is excellent !",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Recovering from back surgery and disc replacement. I use the cushion with a small pillow supporting my lower back.  Thinking it will be perfect in the car, for longer trips, and on plane rides.  Definitely provided relief from uncomfortable, hard surfaces! Nice and thick and comforms to your body.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Great product but too thick for my car",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for my sewing machine chair. I use a rolling office chair to sit at my machine. I have a bad back and sitting sewing for a long time kills my back. A friend recommended it to me because she has one and loves it. I haven't used it much yet, so it seems a little stiff. I'm sure as I sit on it more it will mold to my bum, and it will be better. My friend also purchased the back support cushion, and she also likes that. I will keep trying the seat cushion first and see how that works before I decide to buy the back cushion.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this from my elderly mother and she loves it because sitting for a long time it can get uncomfortable so cushion helps a lot.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Comfort and relief from pain",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this for my husband. He works a lot in hotels, and the chairs are always terrible at their desk so he puts this little cushion in there. It’s very relaxing helps his back so I do recommend it.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B08HPQVJMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It really shapes my posterior to a comfortable OA work/charting computer chair.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B08HPQVJMW"
},
]