[
{
    "name": "        Kenmore 600 Series Friendly Lightweight Bagged Canister Vacuum with Pet PowerMate, Pop-N-Go Brush, 2 Motors, HEPA Filter, Aluminum Telescoping Wand, Retractable Cord and 4 Cleaning Tools, Purple       ",
    "stars": [
        "64%",
        "14%",
        "6%",
        "5%",
        "12%"
    ],
    "pid": "B08JTVDQ2G",
    "ratings": "11,676 ratings",
    "other_info": {
        "Brand": "Kenmore",
        "Special Feature": "Lightweight, HEPA",
        "Filter Type": "HEPA Filter",
        "Included Components": " ",
        "Is Cordless?": " "
    },
    "discount_price": "$ 291.26",
    "normal_price": "$349.99",
    "about_this_item": [
        " BAGGED CANISTER VACUUM: Multipurpose design w/swivel head cleans all areas and surfaces in your home, den, kitchen, car and garage.Suction power(hose end) ≥183W. Number of Amps 12.Cleaning Width (in.) : 14, Features : Multi Surface.  ",
        " POWERFUL CLEANING: 2-motor system excels in suction strength and includes 2 floor nozzles with exclusive Pop-N-Go floor brush. 3 additional attachments are included: crevice tool, dirt brush and bare floor tool  ",
        " TRIPLE HEPA FILTER SYSTEM: Enhanced HEPA filter traps 99. 97% of dirt, trapping dirt inside the vacuum  ",
        " PET POWERMATE & POP-N-GO BRUSH: Motorized attachment lifts stubborn pet hair, and dirt quickly from surfaces. Eliminates hair from tangling around the brush.Stores inside vacuum, attaches to handle and wand in a snap for bare floor cleaning  ",
        " ALUMINUM TELESCOPING WAND: Adjustable lightweight wand lengthens to an extended reach of 10. ' to access difficult areas. Lightweight at 22. 6 lbs, 28' cord is retractable, accessories and attachments fit within vac  "
    ]
},
{
    "title": "At the Moment, it Works Very Well",
    "rating": "4.0 out of 5 stars",
    "content": "Cleaning the house",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Cheap POS with a $400 price tag. The old kenmore vacuums no longer exist. This was shipped to me less than 1 year and 2 months ago. THIS next section was my previous review. Ok I wanted another Kenmore vacuum because I've always used Kenmore canister vacuums. My first one was purchased in 1979 and lasted for years. My 2nd \"premium\"Kenmore was very good and I still use it but it busted in a couple of places after us fell down a flight of steps so a little bit of hassle to use. I tried to purchase the best canister model that was sold by Sears and then Kenmore on Amazon but after I ordered I received notice they were out of stock. So I bought this one. It's supposed to be the same but a different color.  It's much more cheaply made than my previous Kenmore Vac. The wheels are sooo cheap. The plastic it's made of is very static and collects dog hairs so I have to vacuum the vacuum before I put it up. I have hardwood and tile floors so prefer the pop out style instead of the heavy carpet style. When I have used the carpet attachment to vacuum a rug it's not the best so if you have carpet buy a different model.",
    "post_time": "Reviewed in the United States on July 17, 2021",
    "pid": "B08JTVDQ2G"
},
{
    "title": "See update! This is a POS! Decent vacuum Cheap useless tools",
    "rating": "4.0 out of 5 stars",
    "content": "Here is THE BEST thing about this vac and the reason I had to have it... it's the motorized attachment that can be used on furniture. It's very powerful and will pick up that dog hair.",
    "post_time": "Reviewed in the United States on August 17, 2023",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Here's the BAD: the cleaning tools are absolutely WORTHLESS! Hairs collect all over the brush tool. Every few minutes I have to get out the crevice tool to clean the brush. The crevice tool has an opening on the sides and will such in anything around it...like the bed skirt. Even the floor attachment is not that great and hairs and lint collect on the little brush. It doesn't appear to suck up the dust that great because of the design. So a vacuum with a strong motor and great pet tool but the worst attachment tools ever. Honestly they should redesign and send replacements to all who previously purchased this vac. Kenmore is obviously no longer Kenmore. I'll never buy another Kenmore. I purchased this model in August 2021. It was supposed to come with a pet powermate. It did not. The attachments are awful. I still use my older model Kenmore ( however the pet power are no longer works) and this newer model  sits in the closet , is there anything I can do ? Can I get the pet power mate that was supposed to come with this model? Have the attachments improved at all. The brush attachment collects hair and dust but leaves it outside the brush instead of sucking it in the vac. I've had Kenmore canister vacs since 1979. Or is it $400 down the drain and I know  to never ever purchase a Kenmore product again?",
    "post_time": "Reviewed in the United States on February 9, 2024",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Love my Kenmore vacuums",
    "rating": "5.0 out of 5 stars",
    "content": "I have always loved these vacuums, this is my 3rd one of this brand and style. My first lasted 10+ years, the second lasted about 4 and the wand broke in half 🤷‍♀️🤦‍♀️ after that I decided to try a shark, it was good at first but lost suction after some use and is now my garage vacuum.",
    "post_time": "Reviewed in the United States on January 24, 2024",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I decided to go with Kenmore again and I do live the vacuum, it's definitely a lot better than the shark but I feel like they've gotten cheaper when making them. The carpet floor head doesn't connect correctly and will randomly slide off while I'm vacuuming, super annoying! One of the features I loved about my last one was the ability to adjust how strong the suction is, this model has that option but again, not as good as it used to be, it's a simple full suction or not, while the last one I could adjust until it didn't suck up my throw rugs in my kitchen, this one sucks it up no matter what.",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Cumbersome",
    "rating": "4.0 out of 5 stars",
    "content": "Lastly, the hard floor head attachment, is a lot smaller than they used to be so it gets clogged easily with like small pieces of paper or whatever my kids leave on the floor.",
    "post_time": "Reviewed in the United States on October 15, 2023",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Overall I am happy with my purchase, especially since I got it at a great price on prime day. It does do an awesome job with dog hair, we have 3 dogs, one long haired Aussie and 2 labs, much better than the shark was with it!",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Much More Than Expected",
    "rating": "4.0 out of 5 stars",
    "content": "I don't really do reviews, but I have been very impressed with this machine. I have put this machine through its paces except for a shag rug. Most canister vacuums suffer the same fate, I would imagine. This device is a bit cumbersome. I have used it on about 4k sq ft so far on concrete floors, linoleum, low pile, medium pile, and hardwood. Depending on the attachment, it does a great job on every surface. It works great for dusting molding and baseboards as well. My only major issue was cleaning the carpeted stairway with walls on either side. The stair-balancing pieces work great to make sure it says on the stairs with me (within Reason). But with the stiff hose and general size of everything, I was bumping into both walls constantly. Overall, I am extremely happy with this unit.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Wow!",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Exceeded our expectations.",
    "rating": "4.0 out of 5 stars",
    "content": "We had a Kenmore Canister vacuum for over twenty-five years and were quite happy with it.  When it finally gave up the ghost, I looked for a suitable replacement.  When I saw the Kenmore advertised on Amazon, I knew I di not need to look any further.  It arrived a day later than initially projected, but no matter.  When it was run for the first time, I was amazed at hos much poer powerful it was than the older Kenmore.  Quite satisifed.",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One small point.  What type of a replacement bag does it take?",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Vacuum",
    "rating": "5.0 out of 5 stars",
    "content": "I really like this vacuum. I bought it to replace a 20+ year old Electrolux. So far, I like it much better. It's easy to use, compact and lightweight. I love that all the attachments are tucked away in compartments right on the canister. The light weight & design make it easy to vacuum the stairs. The telescoping tube is a nice feature instead of having to attach a separate extender. The suction is powerful. The bags and filters are easy to replace. It seems well made. I'd recommend it.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the vacuum and being able to do a deep clean all over but my only complaint is it's very heavy and doesn't move easy when cleaning the living room, hall and rooms with carpet.",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Cleans Great!",
    "rating": "5.0 out of 5 stars",
    "content": "As soon as I opened the box, you could tell this vacuum was built study. The hose was thick, felt high quality and unlikely to break or bend. The suction has an adjustment knob, which is beneficial for all the different attachments (high suction for my couch covered in dog hair, lower for curtains so you’re not sucking them up constantly). The hard floor attachment if effective. I do worry some about the abrasiveness of the wheels of the main head but the suction seems appropriate. At first use, it is quick, effective. Also the way the bag collects duct and doesn’t spread it back through a room is amazing. I’ve had previous canister vacuums that put half the dust back into the room. Bags seems like a pain, but I think that’s the key to keeping the dust and odors in the vacuum and not in the room.  Looking forward to using this more!",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Easy to assemble. Great suction when cleaning floors and rugs. Able to clean under beds and tables. Solid machine.",
    "post_time": "Reviewed in the United States on May 21, 2023",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Quality for the Cost!",
    "rating": "4.0 out of 5 stars",
    "content": "PROs",
    "post_time": "Reviewed in the United States on September 20, 2023",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "26 or 28 foot cord",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "Maneuvers easily",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B08JTVDQ2G"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Great assortment of attachments",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B08JTVDQ2G"
},
]