[
{
    "name": "        BELLA 3 Qt Touchscreen Air Fryer Oven and 5-in-1 Multicooker with Removable NonstickDishwasher Safe Crisping Tray and Basket, 1400 Watt Heating System, Matte Blue       ",
    "stars": [
        "76%",
        "13%",
        "4%",
        "2%",
        "5%"
    ],
    "pid": "B08P28VMQF",
    "ratings": "2,037 ratings",
    "other_info": {
        "Special Feature": "Programmable",
        "Product Dimensions": "15.11\"D x 15.11\"W x 14.68\"H",
        "Color": "Matte Blue",
        "Capacity": "2.9 Quarts",
        "Material": "Aluminum, Plastic"
    },
    "discount_price": "$ 64.",
    "normal_price": "",
    "about_this_item": [
        " EFFORTLESS COOKING AT YOUR FINGERTIPS: Say goodbye to complicated buttons and hello to delicious, hassle-free dishes! Our small air fryers boast a digital touchscreen, which make cooking easy and fun. Enjoy creating delicious, gourmet meals in minutes  ",
        " PERFECT FOR SMALL GATHERINGS: With a capacity of up to 2.5 pounds of food, this mini air fryer can feed up to 2-4 people. From crispy french fries and fish sticks to mouthwatering chicken thighs and wings, it's a crowd-pleaser for any occasion  ",
        " UNLEASH YOUR CULINARY CREATIVITY: Our 5-IN-1 Multi-Cooker lets you Air Fry, Broil, Bake, Roast, or Reheat meals with ease. Powered by a 1400 watt heating element and Circular Heat Technology, the deep fryer ensure even cooking and always-crispy foods  ",
        " INDULGE IN HEALTHY DELIGHTS: Enjoy guilt-free meals with 88% less fat and 65% fewer calories than typical fast food restaurants. The PFOA-free Nonstick basket and crisping tray are removable and dishwasher safe, making cleanup of the mini oven a breeze  ",
        " COMPACT SIZE: Thanks to its compact size, our electric fryer fits easily on any countertop, saving you valuable space without sacrificing performance. These kitchen appliances are absolute new house essentials and a must-have for your college dorm  "
    ]
},
{
    "title": "Late to the air fryer party...",
    "rating": "5.0 out of 5 stars",
    "content": "A few years ago I made a conscious decision to eat healthier and fried foods were the first thing to go.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Along comes these new fangled air fryer things and I've shunned them for years because of the word \"fryer\". Yes, I know the word \"air\" is there but I couldn't wrap my mind around \"frying\" food and being healthy.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Quality product!",
    "rating": "5.0 out of 5 stars",
    "content": "I finally broke down and ordered this one because the price was right and the vibrant color is gorgeous, (matches my other kitchen counter appliances).",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This air fryer comes with an excellent How-to booklet since I'm a first-timer at this and there are even a dozen recipes included which are helpful and welcomed. No preheating makes for getting meals out faster when you are in a hurry, too.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "beware it is really small ,but so worry free, ez to clean  wish controls were in front v.s on top",
    "rating": "5.0 out of 5 stars",
    "content": "EFFORTLESS to use with a cool looking touchscreen, food is ready in MINUTES and it is so easy to clean. The auto-off safety feature is simply a bonus.",
    "post_time": "Reviewed in the United States on October 8, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Worth the real estate space on my counter, in a compact footprint.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Great little air fryer",
    "rating": "5.0 out of 5 stars",
    "content": "Versatile and a most excellent addition to my kitchen.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "HIGHLY recommended!",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Glad I Took The Plunge!",
    "rating": "4.0 out of 5 stars",
    "content": "Love this air fryer, they are the greatest kitchen accessory. We use this all the time for a variety of foods. Everything tastes great, crispy and hot! Easy to use the buttons, see video!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "could have been a wee bigger wish controls were in front v.s on top . Otherwise I love it . Cooks nice its fast ,super E.Z to clean ,space saver Color looks great price was right.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Suel",
    "rating": "5.0 out of 5 stars",
    "content": "Great little fryer!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "She really likes this air fryer. It is working well for her.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Got this for my sister in law",
    "rating": "5.0 out of 5 stars",
    "content": "This cute air fryer is the perfect size for 1-2 people. It heats up quickly without a bunch of noise. And the touch screen is really nice. I'm still new to air fryers but the instructions manual has a few recipes in it that I would love to try.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "To be honest, I really wasn't expecting much.  My beloved Cosori was under recall, and I looked for one of the least expensive air fryers available, so that I could still cook my daily \"hash browns\" for breakfast.",
    "post_time": "Reviewed in the United States on April 24, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Perfect size",
    "rating": "5.0 out of 5 stars",
    "content": "Well, considering that Cosori has more than fumbled the football by making me wait 2 months for a replacement, and the fact that this little air fryer actually out performs the Cosori, this might be the airfryer that reigns supreme in my Kitchen.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The small size of this fryer means there is almost no need to \"preheat\" the unit.  It is much quieter than my Cosori, and the touch screen controls are intuitive and responsive.",
    "post_time": "Reviewed in the United States on April 24, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Purchased to be a backup, destined to become my primary unit",
    "rating": "5.0 out of 5 stars",
    "content": "The system does not have a \"dual basket\" system, but instead has an \"screen insert\" which simply raises the product about 1/4 inch off the bottom to allow airflow underneath.  It works fantastic.  And is much easier to clean than Cosori's two basket system.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": " I've done French Fries, and Hashbrowns and Garlic Toast in this little unit just like I did in the Cosori, and it has achieved equal results with equal speed.  Good Job Bella.",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Smart efficient air fryer",
    "rating": "4.0 out of 5 stars",
    "content": "My replacement Cosori, if it ever arrives, is going to be relegated to the pantry, and we'll bring it out only if we need to.  In the meantime, Bella gets the use and the counterspace.  And at $50.00 you can't ask for much more.",
    "post_time": "Reviewed in the United States on February 18, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I learn how to use it once I l love  it now my go to for cooking",
    "post_time": "Reviewed in the United States on December 19, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Love, love, love!",
    "rating": "5.0 out of 5 stars",
    "content": "This air fryer is the perfect size to leave on my kitchen counter all the time.  It’s super easy to use and clean!  I love it!",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After buying a Ultrean and using it (which was a very good one by the way) then dropping it and cracking the shell of the unit and unable to use it anymore I searched for another one, but a bit smaller. Found another one, but had to return that because of a toxic smell it gave off during cooking. Now they say third times a charm, which is true.  Bought this Bella 2qt counter top air fryer.  Perfect size for counter, I don't have to find room for storage.  Great for 1-2 person household.  Cooks well and fast. Good choice for me. Recommend it highly.",
    "post_time": "Reviewed in the United States on May 29, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Perfect for Counter",
    "rating": "5.0 out of 5 stars",
    "content": "This product is wonderful for single households, just the right size",
    "post_time": "Reviewed in the United States on March 31, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I gave this to my boyfriend for Christmas.  He loves it and uses it daily.  I use it as well and it does a fantastic job.",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Air fryer",
    "rating": "5.0 out of 5 stars",
    "content": "I had an Ultrean prior. Wanted something smaller. Nothing wrong with Ultrean but now I can compare the Bella to it, Ultrean had 4.8 stars when i purchased it. I would give this Bella brand 10 starts if I could.",
    "post_time": "Reviewed in the United States on October 5, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Clean up. Coating is far superior to any I have used. 10 🌟",
    "post_time": "Reviewed in the United States on April 13, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Good value.  Great appliance",
    "rating": "5.0 out of 5 stars",
    "content": "Food tastes great. Way less grease in pan after cooking which surprised me. I add no oil to either brand when cooking but the Ulrean left more food grease in the bottom.",
    "post_time": "Reviewed in the United States on June 28, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Cooking 10 🌟",
    "post_time": "Reviewed in the United States on October 7, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "OMG- this thing is amazing!",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use 10 🌟",
    "post_time": "Reviewed in the United States on May 3, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Size 10 🌟",
    "post_time": "Reviewed in the United States on October 21, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Effective",
    "rating": "5.0 out of 5 stars",
    "content": "Nice color,good size for smaller portions,cooks really well. Not real noisy. Nice to have temp adjustment. This convention cooker is a good choice for those smaller size meals.",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good quality! Great style and perfect for small spaces! Serves for single meal for 2 people. Totally recommend!",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Perfect size and great look!",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first air fryer and it's the best thing since sliced bread!  I can't imagine how much electricity I'm saving with this over my electric stove.  And it doesn't heat my whole house up in the summer like the stove does.  And food tastes delicious!  It cooks almost as fast as my microwave!  It cooks food in only a quarter of the time as a conventional stove.  And here's a tip for first timers:  Don't follow package cooking directions with this or you'll burn your food.  If the package directions say to cook at 400 degrees for 20 minutes for conventional ovens, try just cooking your item for 5 minutes.  After 5 minutes, you can check it and if you want to cook it for another minute or 2 you can.  That's not a flaw, it's a benefit!  This air fryer cooks fast.  I'll never be without one again.  I love it!",
    "post_time": "Reviewed in the United States on July 26, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "So far everything I've cooked has called for a 375 degree temperature, but this machine doesn't have that setting. Do I choose 370 or 380? And why would the manufacturers do this to its customers?",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Best Thing Since Sliced Bread!",
    "rating": "5.0 out of 5 stars",
    "content": "A stylish and useful addition to any kitchen.  Easy to operate and quiet.  I now use it more than my gas oven.",
    "post_time": "Reviewed in the United States on March 26, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This 2.9 Bella air-fryer is a perfect size for 2 people, easy to use and is a very nice red color.  It matches some of my red accent things in the kitchen.  The food tastes fantastic and very yummy!  I have  no complaints at all.",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Only has 10-degree increments",
    "rating": "4.0 out of 5 stars",
    "content": "Works great. Just wish it was a little bigger but either way amazing",
    "post_time": "Reviewed in the United States on December 2, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I had previously owned a 4 qt. Bella air fryer and loved it. Gave it away when we bought an air fryer toaster oven, and while that is nice, I missed my dedicated air fryer, so purchased this. This one works ok, but liked the 4qt i previously had better. This one is a bit louder than previous one.",
    "post_time": "Reviewed in the United States on July 7, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Light as Air",
    "rating": "5.0 out of 5 stars",
    "content": "I resisted purchasing an air fryer in spite of the fact that everyone I know that had one raves about them. I get it now. I’m glad I bought this model. It’s large enough, super easy to clean. I wish the print on the controls were a bit larger so my near-blind mom could use it for her beloved egg rolls, but it’s fine for people that can see.",
    "post_time": "Reviewed in the United States on November 12, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First time user. This sure beats cooking on the stove and in the oven.",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Luv the modern look . Basket is sturdy easy to clean . Quilter then last air fryer",
    "rating": "5.0 out of 5 stars",
    "content": "The handle area feels cheap & must open carefully so not to break off handle",
    "post_time": "Reviewed in the United States on February 1, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "For no reason the POWER Touch Button no longer displays.  Would love to know why?",
    "post_time": "Reviewed in the United States on July 30, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "After 8 months the POWER touch button no longer displays",
    "rating": "5.0 out of 5 stars",
    "content": "This is undoubtedly the best air fryer I have ever used. I bought this to replace an air fryer. I was currently using because I didn’t like it. This one is a lifesaver. I have four kids ages four and under. I can cook them up some healthy meals in this in a very short time. The food is always cooked perfectly. I don’t even put the air fryer away in my cabinets anymore. I just let it sit on my counter, because I use it so often.",
    "post_time": "Reviewed in the United States on February 14, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I was so excited to order and receive and use it, so immediately that's what I did. Then almost nothing. Such a goober. This air fryer is very easy to use and comes with a few recipes. I did make chicken 🍗, that came out crispy and juicy. Fries were great as well. I didn't have to 'burn off' any plastic smell like I've seen in some air fryer reviews. I would definitely recommend the Bella air fryer. And now, I have to try and use it more!",
    "post_time": "Reviewed in the United States on April 24, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Best Air Fryer!",
    "rating": "5.0 out of 5 stars",
    "content": "This is a powerful little air fryer. My food is always done extremely quickly. But because of it's size you can't put anything really greasy as it tends to burn because it's close to the cooking mechanism. It's great for reheating and crisping up small lightly oiled food👍",
    "post_time": "Reviewed in the United States on September 3, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this! was suggested to me by a coworker who likes it better than her full sized air fryer so I had to give it a go. This is my first air fryer and its a little louder than i anticipated but  i would buy it again!",
    "post_time": "Reviewed in the United States on August 15, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Must use it more!",
    "rating": "5.0 out of 5 stars",
    "content": "The was the perfect gift for my daughter she loves it",
    "post_time": "Reviewed in the United States on January 2, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Disculpen los inconveniente  Gracias",
    "post_time": "Reviewed in the United States on February 18, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Good for small food",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to operate",
    "post_time": "Reviewed in the United States on February 11, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have not used all the features but everything else works great and I love the nice clean look of it in the kitchen.",
    "post_time": "Reviewed in the United States on October 7, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "This little dude works great!",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for our office. All the employees love it. It is easy to use, has plenty of pre-set options, and a quality air fryer. We use disposable basket liners so we have not had to clean it yet and it still looks brand new.",
    "post_time": "Reviewed in the United States on June 30, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just know that the red is not like it looks on the picture.  It's more of a tomato red.  I'm not fond of it but I really don't care as I store it away after I use it.  And, it's cheaper than the most popular color, black.  Cooks great, super easy to clean and very simple to understand.  My new best friend.  :-)",
    "post_time": "Reviewed in the United States on November 14, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Love it but.....",
    "rating": "5.0 out of 5 stars",
    "content": "I am still learning how to make the best use of this appliance but like the convenience and energy saving.",
    "post_time": "Reviewed in the United States on October 22, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Nice Cooking device,A bit Bigger that i enticipated!",
    "post_time": "Reviewed in the United States on May 2, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Great for quick cooking.",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect for me",
    "post_time": "Reviewed in the United States on November 13, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I air fried some chicken legs just to try it out and it did an awesome job.  The air fryer bucket only had enough room for three legs. Not much room for a 2qt but it made my food very tasty and in a short period of time. After cooking it was so easy to clean. The food came off very easy.",
    "post_time": "Reviewed in the United States on November 15, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Contril the temperature  to get goid results.",
    "rating": "5.0 out of 5 stars",
    "content": "Looks great and does the job perfectly",
    "post_time": "Reviewed in the United States on December 7, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great product...use every day",
    "post_time": "Reviewed in the United States on October 24, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Cooks really goid",
    "rating": "4.0 out of 5 stars",
    "content": "Great product, saves time and mess from cooking food.",
    "post_time": "Reviewed in the United States on February 12, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have loved this air fryer, but I’ve only used it about 10 times and the non stick coating is already peeling",
    "post_time": "Reviewed in the United States on May 24, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Great color!",
    "rating": "5.0 out of 5 stars",
    "content": "This came with simple instructions. It came in the best condition and still works brand new",
    "post_time": "Reviewed in the United States on June 24, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use this for everything. Great size, easy and even bought my mom one and she loves it too!",
    "post_time": "Reviewed in the United States on May 15, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "This air fryer is exactly as described. It looks great in my small kitchen (which was important to me) and is very easy to use. You may have to experiment with cook times but you will love it and I highly recommend this air fryer.",
    "post_time": "Reviewed in the United States on July 15, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Easy to cook and clean",
    "post_time": "Reviewed in the United States on December 1, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Love this air fryer!",
    "rating": "4.0 out of 5 stars",
    "content": "Chicken doesn’t cook in 20 minutes it takes 30 to 40 minutes",
    "post_time": "Reviewed in the United States on September 22, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "the Teflon is not good. I will have to buy another soon.  Teflon is peeling like paint",
    "post_time": "Reviewed in the United States on April 5, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Easy to clean",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect for 2 people",
    "post_time": "Reviewed in the United States on August 12, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Only used it once, can't give a fair review yet, but worked great",
    "post_time": "Reviewed in the United States on May 31, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "90%",
    "rating": "3.0 out of 5 stars",
    "content": "I’m not sure if I’m gonna keep it has a very strong plastic like odor, I could even taste it in the food that plasticky taste…",
    "post_time": "Reviewed in the United States on December 3, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Going to use it a few more times and see if the older will go away",
    "post_time": "Reviewed in the United States on March 1, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Small one person air fryer",
    "rating": "3.0 out of 5 stars",
    "content": "I liked the color and compact size initially but the basket to cook on was smaller than I expected.  This is a good starter air fryer for College dorm rooms, just cooking very small batch wings, fries or burgers, cooking for one person or you just want to try air frying. This model can fit nicely on a countertop or on a shelf if space is limited.  I returned this one for a larger basket, more pre set cooking options for a near same price.",
    "post_time": "Reviewed in the United States on October 3, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I loved the color and size and truthfully loved it until today. 14 months after purchasing it...it just died. I'm so disappointed.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "I really wanted to love this",
    "rating": "3.0 out of 5 stars",
    "content": "The door came apart",
    "post_time": "Reviewed in the United States on November 10, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a game changer.  So easy to use.  Everything cooks great!  My favorite is using it to reheat pizza!  Everyone needs one of these.  It's not for making a lot of food.  It's single use.  Great product.",
    "post_time": "Reviewed in the United States on December 13, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Only year old and the door came off",
    "rating": "5.0 out of 5 stars",
    "content": "La recibí en tiempo y buen estado La estoy probando",
    "post_time": "Reviewed in the United States on September 11, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is smaller capacity than I envisioned. It works great. With an extra shelve it will do more food at one time. Wish it came with a cookbook, with the times to set for various foods. Finding that out by trial and error.",
    "post_time": "Reviewed in the United States on December 16, 2021",
    "pid": "B08P28VMQF"
},
{
    "title": "Must Have!",
    "rating": "5.0 out of 5 stars",
    "content": "So easy to use. Great price for a very useful kitchen item.",
    "post_time": "Reviewed in the United States on August 9, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this to replace my toaster oven. It can not hold as much as a toaster oven but it cooks the food much faster.",
    "post_time": "Reviewed in the United States on May 19, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Me gusta",
    "rating": "5.0 out of 5 stars",
    "content": "I love that the controls are on top! Easy to read and use. Has a nice size basket, you could fit a small chicken in. It has so many settings, air fry, broil, bake etc. Easy to clean. Nothing I don't like.",
    "post_time": "Reviewed in the United States on November 14, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "works OK but crisper deteriorated almost immediately.  I contacted them and was told that it was out of warranty by 6 days and they would not replace the part.  I'm not happy and would not recommend this.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B08P28VMQF"
},
{
    "title": "Great item, highly recommend",
    "rating": "5.0 out of 5 stars",
    "content": "I previously purchased another brand of air fryer & had some issues with it.  I decided to try the Bella.  Very happy with it, easy to operate, easy to clean.  Plan to purchase another one for our winter home.",
    "post_time": "Reviewed in the United States on February 24, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Could not be more satisfied with this air fryer. It is so esthetically pleasing. Works perfectly , easy to clean. Highly reccomend this item.",
    "post_time": "Reviewed in the United States on September 12, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Perfect Air Fryer",
    "rating": "5.0 out of 5 stars",
    "content": "I love this air fryer. It's very convenient in all my cooking.",
    "post_time": "Reviewed in the United States on February 4, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Es muy práctica solo que es algo pequeña",
    "post_time": "Reviewed in the United States on March 15, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Great cooker",
    "rating": "5.0 out of 5 stars",
    "content": "Love this air fryer very easy  to use and looks  good on my counter top …  you will want to use this air fryer daily good buy!!",
    "post_time": "Reviewed in the United States on May 14, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Blue appliances arent the easiest to find. it works as described. easier to clean if you the parchment paper sheets made for air fryers.",
    "post_time": "Reviewed in the United States on August 20, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Práctica",
    "rating": "5.0 out of 5 stars",
    "content": "My bbf got me this for a B-day gift. Came in wrong color. It was white instead of red, my fave color. They were great about it & the replacement was easy. Love it!",
    "post_time": "Reviewed in the United States on March 11, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Muy buen producto y fácil de usar queda la comida muy rica",
    "post_time": "Reviewed in the United States on January 6, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Cleans  easy and air fry’s very well makes a good house warming gift or for a dorm room",
    "rating": "5.0 out of 5 stars",
    "content": "This is the best air fryer ever! The design, easy to use, cooks perfectly, cleans in a zip and the color is beautiful! My favorite appliance 🤩👏🏼👏🏼👏🏼 Recommended. Not too bulky, but great capacity.",
    "post_time": "Reviewed in the United States on March 31, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It takes a little bit you know how long and how much oil you need to add etc. with the food really does taste different when you make it in the air fryer requires a little bit of play in practice",
    "post_time": "Reviewed in the United States on June 13, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "So fun to use",
    "rating": "5.0 out of 5 stars",
    "content": "As someone with food allergies I have to be creative with the foods I can eat. This makes it really fun and easy.",
    "post_time": "Reviewed in the United States on February 1, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This isn’t a very large air fryer but it does great for your basic food items like tater tots, fries and reheating items. The basket isn’t very big and is quite square so keep that in mind if you need to cook long items more often.",
    "post_time": "Reviewed in the United States on March 25, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Enjoy this tremendously!",
    "rating": "5.0 out of 5 stars",
    "content": "Sturdy little air fryer - perfect for cooking meals for a single person or couple.  Easy to operate and easy to clean.",
    "post_time": "Reviewed in the United States on December 29, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Overall pretty good and convenient. It is a little hard to clean though.",
    "post_time": "Reviewed in the United States on April 6, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Perfect for small meals",
    "rating": "4.0 out of 5 stars",
    "content": "This product works as promised. I'm very happy with my purchase.",
    "post_time": "Reviewed in the United States on April 18, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The unit itself is small, which is nice for counter space, but that also means that the frying basket as small as well.",
    "post_time": "Reviewed in the United States on May 3, 2023",
    "pid": "B08P28VMQF"
},
{
    "title": "convenient",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to clean very easy to clean more like just wipe it down and it is a little bit big for myself at least that's what I thought when I first got it but now after using it it's perfect my favorite thing the color the red is awesome touch screen is a Plus!",
    "post_time": "Reviewed in the United States on October 22, 2021",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s a very helpful tool for cooking food/reheating . just use it for a few mins to cook the food and its very delicious and not greasy yet crispy .you can use it on almost any food.",
    "post_time": "Reviewed in the United States on April 29, 2022",
    "pid": "B08P28VMQF"
},
{
    "title": "My first Air Fryer",
    "rating": "1.0 out of 5 stars",
    "content": "It’s a good size for 1-2 people. It’s easy to program and easy to clean. However it also has two (IMO) serious design flaws. One: no sound when time is up, so be sure to set a separate timer. Two: there’s a hole in middle of the rack/tray so it can be lifted out for cleaning. Unfortunately, the hole also lets food fall through. It then either burns, sits in grease, or gets cold. Wasteful and just poor design.",
    "post_time": "Reviewed in the United States on October 4, 2021",
    "pid": "B08P28VMQF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Update:",
    "post_time": "Reviewed in the United States on February 27, 2023",
    "pid": "B08P28VMQF"
},
]