[
{
    "name": "        2024 Flying Orb Ball Toy,Cosmic Globe Boomerang Hover Ball Galactic Fidget Spinner, Hand Drone Orbit, Cool Toys Gift for 6 7 8 9 10+ Year Old Boys Girls Teens Outdoor Toys(Blue)       ",
    "stars": [
        "60%",
        "14%",
        "11%",
        "5%",
        "9%"
    ],
    "pid": "B08QTP3MLT",
    "ratings": "14,017 ratings",
    "other_info": {},
    "discount_price": "$ 32.00",
    "normal_price": "$49.99",
    "about_this_item": [
        " High-Tech Hand Controlled Drone Toy With Cool RGB Light: The flying orb toy provides intelligent flight. Different throwing angles and speeds will create different flight lines and boomerang effect.You can use your ingenuity to create your unique way of playing.The colorful led at night will make your magic ball cooler  ",
        " Lightweight And Portable: This hover ball has undergone rigorous testing, made of high-quality materials, which are soft but durable, drop resistant, lightweight and flexible.You don’t have to worry that the flying toy will be damaged easily by your kids. It will stop automatically when it hit the furniture or any other pieces of stuff  ",
        " USB Charging: About 20 minutes full charge, 8-10 working duration. It enables various charging options such as charged by computer, power adapter, mobile phone, portable charger etc. The indicator light comes on when charging and goes off when fully charged. Rechargeable and can be played over and over again  ",
        " Endless Fun with Hover Ball:Experience uninterrupted fun with USB Charging feature of this flying orb ball.Achieve a full charge in just 20 minutes and enjoy 8-10 minutes of continuous flightIt supports versatile charging options,including computers,power adapters, mobile phones,and portable chargers.The indicator light provides real-time charging status updates, ensuring you're always ready for the next adventure  ",
        " Perfect Gift: This Flying Orb Ball Toys is a fun novelty gift for birthdays, Halloween, Thanksgiving Day, Christmas. This is a great choice for Easter, Father's Day, Mother's Day gift toys. It’s a perfect enrichment gift for kids, teenagers, adults  "
    ]
},
{
    "title": "Seems fun, if you can tackle it.",
    "rating": "4.0 out of 5 stars",
    "content": "Seems sturdy. Kinda hard to turn on and off and to charge because of the placement. We just could not get the hang of it and we are 22, 54, 77 years old.",
    "post_time": "Reviewed in the United States on November 28, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I can’t really give a review yet because these are Christmas presents. However, I thought the balls would be bigger and more sturdy….not made out of cheap plastic.",
    "post_time": "Reviewed in the United States on December 13, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Balls",
    "rating": "5.0 out of 5 stars",
    "content": "It’s a birthday gift for grandson.  He had trouble getting the ball to balance in the beginning. He keeps trying, day 3.",
    "post_time": "Reviewed in the United States on June 5, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kids loved it.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Beginner",
    "rating": "4.0 out of 5 stars",
    "content": "Not much else to say.  If my grandson loved it, I loved it!",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My great grandson loves it.",
    "post_time": "Reviewed in the United States on January 29, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Fun fun",
    "rating": "4.0 out of 5 stars",
    "content": "Maybe you could hit me up after Christmas, as of now, I have no idea.  It's what she wanted, so I feel safe.",
    "post_time": "Reviewed in the United States on December 22, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "They did not function as advertised. The video showed when it is released it was supposed to return to the person throwing it our/away, it did not return but just goes whichever way it decides to go without the “return-to-thrower” functionality as shown on the ads.",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Grandson loved it",
    "rating": "4.0 out of 5 stars",
    "content": "Whole family has fun with it. Only drawback is battery doesn’t last as long as you would like",
    "post_time": "Reviewed in the United States on January 16, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "It has died after six months. Will not charge or fly any longer.  I think 32 dollars is expensive for a toy that lasts six months.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Good for the price",
    "rating": "4.0 out of 5 stars",
    "content": "Grandkids loved it. Took a while to learn how to use. Biggest con, cannot put another battery in when it has run down. Need to recharge.",
    "post_time": "Reviewed in the United States on December 30, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Fun and sturdy but hard to control. Doesn't work like video... still fun for children",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Hard to control",
    "rating": "4.0 out of 5 stars",
    "content": "The two pack isn't that much more, and while using one you can charge the other.",
    "post_time": "Reviewed in the United States on February 8, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Aunque hace muchoo ruido, no es un juguete para dentro de la casa, recomendable para el exterior, ya que un golpe fuerte puede hacer que se doble o deforme, debido a que la estructura es plastica, espero no se dañe pronto y para conectar el cargador hay que hacer fuerza para que conecte bien.",
    "post_time": "Reviewed in the United States on October 2, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Buy the two pack",
    "rating": "5.0 out of 5 stars",
    "content": "The grandchildren and I had a blast tossing these in the air and back and forth during a visit.  I got two of them.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I searched multiple brands and it seems to be a normal thing for these balls to stop holding charges. This is actually a pretty cool toy when it is working. We have spent lots of time playing this the first week we got it and then it just stopped working. Luckily, it wasn’t expensive but still pretty bummed it will won’t last more than 5 mins now.",
    "post_time": "Reviewed in the United States on January 12, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "POR EXPERIMENTAR",
    "rating": "4.0 out of 5 stars",
    "content": "It’s a fun tout just don’t think it is great for indoor use.  Too cold to try it outside yet",
    "post_time": "Reviewed in the United States on January 21, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Grandson loved it! Only concern is will need adult supervision to charge and go over use.",
    "post_time": "Reviewed in the United States on December 26, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Great fun toy",
    "rating": "5.0 out of 5 stars",
    "content": "It is a little tricky to learn how to make it return and do the other things that it is supposed to do, but one you play with it for a while, you'll get it and it is capable of everything that is described. Much easier than learning to pilot a drone. It charges quickly and last for about 20 solid minutes of play time on a charge. It so far seems to be basically indestructible through normal use, though it probably could be broken if you focused enough effort on doing so.",
    "post_time": "Reviewed in the United States on January 5, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "We bought these for our adult kids for Christmas and we had a blast playing games.",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "B08QTP3MLT"
},
]