[
{
    "name": "  The Keeper of Happy Endings ",
    "stars": [
        "70%",
        "22%",
        "5%",
        "1%",
        "1%"
    ],
    "pid": "B08X48G5VL",
    "ratings": "106,693 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$21.88",
    "about_this_item": []
},
{
    "title": "heartwarming and intriguing",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed Barbara Davis’s writing.  The way she moved through the timelines.  The fact that you didn’t realize the connection until almost the end of the book.  Great read.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've read many of Barbara Davis ' books.  This one was one of the best.  Her books are a little hard to get into, but eventually you're hooked.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "The Keeper. A Great Book",
    "rating": "5.0 out of 5 stars",
    "content": "This book captured my interest and you cannot help but fall in love with Soline. she's young she's got ambition and through all the things that she goes through she's strong. She's a hero in her way.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You have romance you have hurt you have sorrow you have new beginnings and I found myself understanding how not only the characters felt that at times it actually brought tears to my eyes and yes I cried but also it can open your heart to others.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Endings of tomorrow",
    "rating": "5.0 out of 5 stars",
    "content": "It’s a multilayered love story and much more. I’ve become friends with the main characters and that doesn’t happen often.  Good job!",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Barbara Davis gives you characters you can fall in love with.  The story draws you into such believable characters and story lines, that makes it difficult to put down, yet at the same time, you want to savor the story and not wanting it end",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "it’s a ‘Keeper’!",
    "rating": "5.0 out of 5 stars",
    "content": "I wanted this book to last forever while at the same time I couldn't wait to see how the story would end. It was perfect. This book is well thought out and well written. It brings you with each character as they experience highs and lows and intricacies of different types of relationships spanning generations. This is a book worth reading.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This story was a page turner for me. Sometimes we find the words have been so closely woven to tell the hopes and losses of our own. I related so deeply to every aspect of Barbara David's writing in the novel. She captured the depth of emotions , turmoil and fears that can ravage a life while making it with living. Beautifully done.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Bravo Well Written.  Didn't want it to end",
    "rating": "5.0 out of 5 stars",
    "content": "Always knew a happy ending was in store for this yarn.  But happily surprised with the artful, manifold creativity in getting there.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It was a wonderful read. Everything was brought to a very happy way.  The characters were wonderfully described and given depth.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Only Someone with a Heart of Stone Would Not Like This Story",
    "rating": "5.0 out of 5 stars",
    "content": "A special story wonderfully told.  It will give your soul a lift.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the best book I have read in years. It may take the top spot as my favorite book of all time. I loved so many things about this book. The detail. The pain. The love. The forgiveness. I haven’t heard of this author and this was my first book of hers and now I am a huge fan.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Heartbreakingly beautiful",
    "rating": "5.0 out of 5 stars",
    "content": "It could have just been my opinion but the first hundred pages or slow took me a few weeks. After a certain point though I devoured the story so quickly that I’m still overjoyed with the twist.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had my hopes for things to be and am surprised that things did occur the way I thought.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "slow beginning",
    "rating": "5.0 out of 5 stars",
    "content": "There was also so much to learn through Soline’s experiences during the war and how France was at the time.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The bond between Soline and Rory, the talks of art and grief, different viewpoint have made this a book I’d love to recommend to others.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Heartaches, twists, and joy.",
    "rating": "5.0 out of 5 stars",
    "content": "I am not a reader or romance novels. This story is so much more. It stretches from the 1940s to the 1980s in an easy style. Take the time to sit down and read it.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One of the best books I've read in a long time. It's about mothers and daughters, lost love and newfound love, internal war, actual war, and a little bit of magic. I love all of these characters, but Soline has done something to me. Her story has equally crushed me and built me up. Even without Rory, Soline's story alone could carry this book. It was because of her that I could not put this book down. She is a woman I want to read more about and a woman I would love to know! This is definitely an emotional read in all the good and bad ways, but does not leave you depressed once finished. I finished this within a day and cannot stop thinking about it.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "This story has changed me",
    "rating": "4.0 out of 5 stars",
    "content": "Not only does this writer have a gift of storytelling, but she truly has a gift of telling it so beautifully. Writing is like most other talents. It either comes naturally or you work hard to develop your the skill. This book is effortlessly beautiful writing. A writer who truly was born with the gift. Davis' ability to turn a phrase is unmatched. I recently switched from physical books to a kindle. I read this on kindle and the amount of highlights I made in this book is absurd, but I want to remember these words forever. Easily one of my favorite authors and, now, another favorite book as well.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have always loved a happy ending. ...even when it wasn't believable.  This novel manages to be believable though making it that much more endearing. The characters were human, facing fear, pain, heartache, and still found the will to love.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "a great read",
    "rating": "5.0 out of 5 stars",
    "content": "An engaging an exciting read that captures you in the first few chapters and keeps you guessing until the very end.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wonderful book full of love, some suspense, a bit of history, and happy endings! Really enjoyed this book and Highly recommend.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "wonderful love story",
    "rating": "4.0 out of 5 stars",
    "content": "A good story with a few twists along the way. Two time scales - worth a read.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great book!  Really could not put it down. You need to read this as soon as you are able. Thanks!",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Worth a read",
    "rating": "5.0 out of 5 stars",
    "content": "It was a gift, so I cannot give a sound review.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I really enjoyed all the surprises in the story. The character development also kept it interesting. I needed a story with a happy ending just as the characters in the book did. If you like history, intriguing characters and many surprises along the way you should read The Keeper of Happy Endings!",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "So many twists!",
    "rating": "5.0 out of 5 stars",
    "content": "Did you ever had a first love that you always carry in your heart ?  Life may move on but that first love is always there.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was the fastest I have ever finished a book!  I loved it!",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Looks Good",
    "rating": "5.0 out of 5 stars",
    "content": "This story is a perfect mix of historical fiction and a romance of a different breed. Loop holes and twists and a bit slow to start but refreshing.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book had romance, history, bravery, heartbreak. Many lessons about living with pain, sadness and rejection. I would have liked more of Rory and Hux's  reunion.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Oh my heart 😭",
    "rating": "5.0 out of 5 stars",
    "content": "This book broke my heart and made me cry multiple times 😭😭 but I'm so glad there is a happy ending. Well, I hope I'm not ruining that for anyone. I mean it's in the title. Of course there is a happy ending, but before getting there, your heart will break so many times while reading this masterpiece. I absolutely loved this beautiful book. I don't even know how to describe it. Barbara Davis is a master storyteller and this is truly a masterpiece. There are two parallel storylines. In the past (during WWII), two young lovers separated by war and kept apart because of a cruel father's lies. Then in the present timeline (which is the 80s), a young woman is navigating life as a gallery owner who's suddenly lost in touch with her fiancee, who is doctor in a warzone, for several months. The two stories are  woven together beautifully and when you finally see how the two are connected, it all makes sense. It's a lesson in dealing with past hurts, lies, and wounds, forgiveness, and acceptance. It's a story about love and not just between lovers, but between mothers and daughters, grandparents, brothers and sisters. All kinds of love are explored in this story.",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It was a bit of a slow start, but the second half of the book picked up and you are pulled into the scene and feel all the emotions. I love the quotes by the dress witch at the beginning of Soline's chapters. They are all little nuggets of wisdom about love, life and perspective. I found myself highlighting some of them and rereading them again and again. I think I need to reread this book again to truly appreciate the details of the story. I missed a lot of things in the middle, especially when I was listening to some of it on audiobook. The voice of Soline has a heavy French accent so it's sometimes difficult to hear what she's saying clearly. But I like that they used the French accent to make the character come to life.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "this was such a happy story",
    "rating": "5.0 out of 5 stars",
    "content": "I thoroughly enjoyed it and will definitely be checking out more of Barbara Davis's books. This is the second book I've read by her now and I've become a huge fan.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Everything about it was great. I love the back stories and how they were developed as well as the characters. The pacing was perfect throughout",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Another spectacular story!",
    "rating": "5.0 out of 5 stars",
    "content": "Barbara Davis is such a gifted storyteller, who not only gives us unique human characters that we love, flaws and all, but she crafts such complex storylines that are finely wrapped up with a bow by the end. She had become one of my new favorite authors.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A war a couple and forty years. Soline and Anson were young when they met in Paris during the war. As the war intensifies Anson makes arrangements to get her to the states to his family where she will be safe. What happens next is a lifetime of lies and heartbreak. Soline has a bit of history in her family for weaving happy endings into wedding dresses but will there be one for her or only more heart ache. No spoilers here it is a wonderful read and has a number of twists to keep you guessing about magic.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Lost loves",
    "rating": "5.0 out of 5 stars",
    "content": "A poignant look at life and love across 3 generations. I thoroughly enjoyed it. Great insight into lost love and wars.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My first book by Barbara and I couldn’t put it down. Wonderful, breathtaking and a remembrance that true love always wins.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "A great read",
    "rating": "5.0 out of 5 stars",
    "content": "Finally. A tale of love that has such a storyline that you can't NOT wait with baited breathe for a well deserved fairy tale ending!! Well done Ms. Davis. I cried so many times throughout this story.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful story, it made me think deeply about my own relationship with my daughter.  A story where true love persevere’s life’s twist of fate.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Fantastic reading",
    "rating": "5.0 out of 5 stars",
    "content": "I did not want the book to end, but it was time all was in place and such good history thru it all, times we should never forget, thank you for a beautiful story",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Beautiful story, well plotted. I would have love to have more of the details at the end. Its dense, but worth it",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "great story",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed reading this book and finished it in 1 days, despite having a million other things to do.  I need to read another Barbara Davis book!!",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book for the beautiful ways the characters were brought to life! I love kizmic, that there is a reason for everything and she tells this story with so much awe and wonder!! It was a page turner!!",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "KUDOS!",
    "rating": "4.0 out of 5 stars",
    "content": "Decent book. I’m a lover of Colleen Hoover.  This author little different, but book was good.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book is an easy read and a good story.  A little to \"happily ever after\" for my taste hence my 4 stars rather than 5",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "So much magic and surprises!",
    "rating": "4.0 out of 5 stars",
    "content": "The story seemed disjointed to me. 2 separate stories mashed together. It started out being about magic and sewing, switched to basic mother-daughter issues, and they all lived happily ever after. It was not bad, I had hoped for more.",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Keeper of Happy Endings by Barbara Davis is a story about fate, second chances and hope. Soline Roussel is well versed in the business of happy endings. For generations, the women of her family kept an exclusive bridal salon in Paris. Where magic is worked into each stitch. It is said that every bride who wears a Roussel gown is guaranteed a lifetime of joy and happiness. When World War II arrives in Paris, Soline is faced with devastating loss after another. She arrives in America with one simple dress box. She places all her memories in it, stowing them away, determined to forget. Decades later, another young woman is dealing with her own tragic loss. Rory Grant is left reeling after her fiancé goes missing with no words as to his whereabouts or if he is even alive. When she comes across an old store front, she becomes determined to open her own art gallery. Inside the storefront, she discovers Soline’s old dress box. What happens is an unlikely friendship between Soline and Rory. While they both believe they were destined to meet, their connection would have a profound impact on their future.",
    "post_time": "Reviewed in the United States on March 16, 2022",
    "pid": "B08X48G5VL"
},
{
    "title": "Enjoyed this book.",
    "rating": "5.0 out of 5 stars",
    "content": "The Keeper of Happy Endings is my first book by Barbara Davis and it was widely praised and recommended. Now I can see why. It is a beautiful story of love, loss and finding hope when hope seems lost. From the very beginning, I enjoyed Soline’s story as well as Rory’s. Although there were a few twists and “aha” moments that I saw them coming before the big reveal. However, figuring out the twists didn’t take away from the emotional impact of the story. It is also more than just another historical story about war and love lost. It is about the eternal struggle between mother and daughter, the constant push and pull that they seem to be engaged in and the influence that one generation has on another. The Keeper of Happy Endings also serves as a reminder that hate doesn’t change with time. One of my favorite quotes is “People always find a way to justify their hate—and give others an excuse to fall in line. They put words in people’s mouths, plant them like viruses, then watch them spread.” Words that ring true today as they did over eighty years ago. I highly recommend The Keeper of Happy Endings.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Keeper of Happy Endings is available in paperback, eBook, and audiobook",
    "post_time": "Reviewed in the United States on March 24, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Excellent",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book, the prose was superb, the plot engaging, and the characters quickly made their way into my heart so I was quickly cheering for Happy Endings for all.  This book is a duel time line set in WWII and the mid 1980s.  It alternates between Solice a French dress maker and Rory an aspiring gallery owner.  Both have endured being separated from their soulmate whose fate is unknown.  Other ties bind them as well.  I liked that each character was given several chapters before switching back to the other.  This helped to avoid the clunky cadence I often find in duel timeline novels that makes me feel like I reading two novels shoved together rather than a complete story.  Barbara Davis was excellent in avoiding this, the two points of view and time lines were woven with the thread of her beautiful prose to create a masterpiece.  I can't believe this gem is been in my to be read like for so long!",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Keeper of Happy Endings by Barbara Davis is a first read for me. It has been on my TBR shelf for some time. The circumstances of life around me , had me searching my shelves for a book that would remind me of happily ever after. The Keeper of Happy Endings touched emotions deep inside of me; you could say it touched my soul! There is magic in Barbara's words, and she weaves it throughout this tale of women who can predict a brides chance of happiness and spell a charm to protect it in the future. It is not just an enchanting tale, it is a powerful drama crossing several generations. I devoured it as though it was food for my soul!",
    "post_time": "Reviewed in the United States on July 14, 2022",
    "pid": "B08X48G5VL"
},
{
    "title": "I laughed, I cried and devoured every word I read as though it was food for my soul!",
    "rating": "5.0 out of 5 stars",
    "content": "Barbara's characters were so well-developed it was like watching my own interactions with my mother played out on a stage in front of me. I was moved to tears as bittersweet memories of many a soul searing discussion with my own mother played out before me. But the real magic is in how Barbara Davis through the interactions of Rory, Camilla and Solene, shows not tells, the reader of the power of love, forgiveness and strength of family, brings the happy endings. It is as Solene points out:",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "\"for there have always been mothers who knew best. Just as there have always been daughters who knew better. It’s a contradiction that is part of every woman’s journey—the need to shape in one’s own image versus the aversion to being shaped at all.\"",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Happy Endings",
    "rating": "5.0 out of 5 stars",
    "content": "Barbara Davis offers a new perspective on how little daughter's truly know the and understand the lives our mother's lived before us.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": " Barbara's novel hit many a raw nerve but then offered calm, soothing healing as love and forgiveness as the story played out over time.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Absolutely loved this book!",
    "rating": "5.0 out of 5 stars",
    "content": "The settings described in rich detail throughout the novel again demonstrated Barbara Davis's artistry with words. Boston and the North Eastern Coastal area were described as a Master would have painted. Again it was feast for the senses and had me planning my next vacation to Boston!",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I am afraid my own words pale in comparison to Barbara Davis. I always thought I was so good with words, but the depth and breath of Barbara Davis's talent puts me to shame.",
    "post_time": "Reviewed in the United States on March 26, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "A cleverly crafted story.",
    "rating": "5.0 out of 5 stars",
    "content": "I highly recommend you pick up The Keeper of Happy Endings. But keep the tissues ready for the emotional roller coaster you will experience.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book surprised me! I enjoy reading stories about WWII and this one didn’t disappoint. I enjoyed it from beginning to end and fell in love with the storyline and the characters! This is a gem and a must-read. I look forward to reading more books by this author!",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Yes, a happy ending!",
    "rating": "5.0 out of 5 stars",
    "content": "I love the way the author changes  characters and flips through their minds.  It’s like you’re in their head.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I found myself not being able to wait to get back to this book.  I’d think of it and wonder how it would end.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Amazing",
    "rating": "5.0 out of 5 stars",
    "content": "There’s a very good twist to this story.  It’s about a dress maker during the war, and what happens to her.  Great read!",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A weaving of people and places, history and present day, memories and dreams - this story captures your heart and holds on to it until the vet end.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent book, enjoyed reading and couldn’t put it down. Loved the transition between past and present. You fall in love with the main characters. Highly recommend!",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love reading her books",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "great read!",
    "rating": "5.0 out of 5 stars",
    "content": "So thought provoking and wonderful for the heart!",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Thanks for a great read in good books are hard to find",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Amazing Story",
    "rating": "5.0 out of 5 stars",
    "content": "It's such an amazing story of lost love and family.  I just couldn't put it down and was sad to see the end of the story.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B08X48G5VL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Thought I knew what to expect but was surprised. Fantastic story and writing. Looking forward to read more from this author.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B08X48G5VL"
},
]