[
{
    "name": "        HATHASPACE Smart Air Purifiers - True HEPA Air Purifier, Cleaner & Filter for Allergies, Smoke, Pets - Eliminator of 99.9% of Dust, Pet Hair, Odors - HSP003 - 2800 Sq. Ft.       ",
    "stars": [
        "68%",
        "13%",
        "6%",
        "4%",
        "9%"
    ],
    "pid": "B08XWQ5XG6",
    "ratings": "169 ratings",
    "other_info": {
        "Color": "White",
        "Brand": "HATHASPACE",
        "Product Dimensions": "14.02\"D x 26.97\"W x 14.02\"H",
        "Specification Met": "Energy Star Certified, ETL Certified, CARB Certified",
        "Noise Level": "40 dB"
    },
    "discount_price": "$ 549.",
    "normal_price": "$549.99",
    "about_this_item": [
        " COMMERCIAL & LARGE SPACE SMART FILTER: Our 3-in-1 filter system targets pollen, dust, pet dander, VOC’s, smoke, and odors - the H13 HEPA filter captures 99.9% of particles down to 0.3 microns. Our lightweight device is portable, allowing you to improve air quality wherever you need it. Our smart air quality sensor & touch-screen display makes the purifier easy to use & adjust your settings, & also shows air quality information.  ",
        " EXCEPTIONALLY SILENT: Designed for quiet operation, making it perfect for use in bedrooms and living rooms. The purifier's efficiency in capturing dust and particles - see just how much our air purifiers for home can assist and support the body’s natural response  ",
        " EASY TO USE & INSTALLATION: Built to easily identify, access, and change your filters - our purifier comes with multiple fan speed options, enabling you to set the pace of air filtration to suit your needs. Included is a remote to easily adjust the speed to your preference and turn the light on & off when needed - with the auto mode as well to facilitate real-time adjustments based on your room's air quality, & ITS QUIET!  ",
        " REMOVE ODORS, SMOKE, & VOC'S: Both an air cleaner & odor eliminator, our air purifier features a unique honeycomb activated-carbon filter that absorbs odors, smoke, and VOC’s. With a state-of-the-art fan and motor, enjoy clean air delivered quietly and efficiently in your home, bedroom, office, kitchen, basement, dorm, apartment, or living room.  ",
        " FIND RELIEF: Our purifiers come with a 2-year warranty, award-winning customer support 7 days a week, and the peace of mind with a brand you can trust. You can also find our replacement filters to ensure you have fresh air all year around!  "
    ]
},
]