[
{
    "name": "        HeyNuts Essential Leggings, High Waisted Soft Pants Compression Workout Athletic Yoga Pants       ",
    "stars": [
        "76%",
        "12%",
        "6%",
        "3%",
        "3%"
    ],
    "pid": "B092498CH5",
    "ratings": "26,440 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Love",
    "rating": "5.0 out of 5 stars",
    "content": "So soft and fit great",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Tried these out, I am Medium and usually size 6/8 pants athletic build. They felt very tight in the butt and legs—I love some good compression especially for a run but they’re  almost a bit restrictive if I size down. I would have kept to “break in” but when I squat down there is slight gap in the back at the waist. If you have this issue with pants you’ll know what I mean. I have thicker legs compared to waist so just didn’t work with my specific shape and didn’t feel I could size down for the legs to be any tighter.  Without a very tight waist I find myself adjusting and pulling up.  Something like Yoga they could be perfect.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Maybe not for curves",
    "rating": "5.0 out of 5 stars",
    "content": "I want these in every color! I got them in brown and can’t wait to wear them this fall. It’s so hard to find a good pair of leggings you love. These are insanely comfortable, true to size and super flattering.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the material so soft. Not see through and perfect length",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Buttery soft! You need these!",
    "rating": "4.0 out of 5 stars",
    "content": "These leggings are very comfortable, buttery and soft. Would recommend for activities more like yoga just because they began to pill.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought 2 diff colors because I love these! I am 4”11 and the size medium 25” fit me perfectly! Usually leggings are too long on me so these are great :) Soft and stretchy!",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Not see through",
    "rating": "5.0 out of 5 stars",
    "content": "very soft, comfy, buttery. about to order so many more colors! i got the brown for fall and it’s perfect!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So so buttery soft! I want a ton more pairs . Just like",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Good option",
    "rating": "5.0 out of 5 stars",
    "content": "Lululemon, yet way cheaper!! Deff buy!",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m 5’10 and 150 lbs. the Large in 28” fit perfectly! Very comfy and the crouch doesn’t sag like happens with most leggings!",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Comfy",
    "rating": "4.0 out of 5 stars",
    "content": "Easy wear leggings. Not super structured though. Recommend for around the house or everyday wear. Not active wear.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I actually loved these but had to return them. I have a 33 in inseam and I ordered the 31 inch and same and they went on for miles longer than I needed. They look really great and are good quality but I couldn't use them being that long. If you are super long-legged, these are for you.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Looooong",
    "rating": "5.0 out of 5 stars",
    "content": "Fit just right",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Comfortable, soft fabric, and durable. So many colors to choose from. Great value for the money. 1/3 of the cost compared to lulu aligns.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Love them",
    "rating": "4.0 out of 5 stars",
    "content": "Color is pretty. But its little easy fit than the black one I bought before this.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Yea, it sure does roll down big time. So does the black one.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Lulu Align Dupe",
    "rating": "5.0 out of 5 stars",
    "content": "The most odd thing is it had a strange smell to it when it arrived and it has stayed even after washing couple of times.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are my new favorite leggings, both for everyday and for working out.  These are almost identical to the ones I was paying $100+.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B092498CH5"
},
{
    "title": "True Navy",
    "rating": "5.0 out of 5 stars",
    "content": "The best leggings ever ! Quality and they hold all the junk in the right spots! High waist and soft. Ordering more!",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love them, great fit, color not quite what I thought,  but great fit and good price",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Thin fabric",
    "rating": "4.0 out of 5 stars",
    "content": "Fabric is nice and stretchy. It's also very soft but a little se through.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are exactly as they appear in the pictures for color and pattern. They are so incredibly soft and work great for the gym. They are not see through at all. I highly recommend.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B092498CH5"
},
{
    "title": "So Soft!",
    "rating": "5.0 out of 5 stars",
    "content": "These are the best! Great quality, nice material, they aren’t see through (!!!) and they suck in all the unwanted stuff.. lol They are well worth the money if you have trouble finding good leggings like me. Plus they’re super comfy and soft.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased these for my 25 year old as a gift. They were on her Christmas list. A little late of a review but she has washed them and has warned them multiple times, and they are still going strong. Extremely durable, comfortable, the material is great, excellent purchase highly recommend. She does have a husky who sheds a lot and she says that she can easily get the hair off.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B092498CH5"
},
{
    "title": "My New Favorites!",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased due to the reviews and will be purchasing more! Great stretch and hold.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love this brand. The quality is great, lightweight and breathable, super comfy, and great legging for the price. Do not love that pet hair sticks to them so badly, but overall, a great option for the gym!",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Daughter loved them",
    "rating": "5.0 out of 5 stars",
    "content": "LOVE LOVE LOVE these leggings!! They remind me of my align leggings from lulu only they do not cost nearly as much and for a person who wears leggings over jeans whenever possible I love that I can get multiple pairs in different colors and not break the bank. They have great compression, do not fall or slip while working out and look great dressed up as well.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am a Nike girl at heart but I have fallen in love with these tights and own them in several colors. I love these because you can wear them for yoga, working out, around the house, or out running errands. I go from wearing them with a nike crew neck sweater to a dressy sweater out for dinner and they look great in both cases. I love that they're comfy!! They have some support but not too restrictive. If you've been considering it, try them! You won't have any regrets.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Best leggings!!",
    "rating": "4.0 out of 5 stars",
    "content": "Size: S - 115 pounds - 5 ft",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm 5'10\" and about 180. My weight is in my butt and thighs. These are my favorite gym go-to's now, I ordered the tall size. Plenty long, thick .. my only wish ... is that they had side pockets. That would get them a 5 for me, but as the are - I'll wear them to the gym every time over my prior name brand favorites. If you're tall, get the longs and you won't be sorry. I WISH they had more colors - I have the black and the red.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Great leggings!",
    "rating": "5.0 out of 5 stars",
    "content": "These are so cute and soft! Debated between S and M!  Went with small and happy I did!",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These leggings are buttery soft, and so comfortable. The band does not roll down like most leggings either. I wear them either for everyday outfits or to workout. True to size also. I have multiple pairs, love this brand!",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Soft, comfortable, and true to size!",
    "rating": "5.0 out of 5 stars",
    "content": "Love the material, not see through. Will definitely be buying again",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Literally my favorite leggings! I now have 4 pairs and will be buying more. I have full length as well as 7/8 and capri. I love how soft they are as well as they don’t cut in at the top.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Good leggings that pass the squat test",
    "rating": "5.0 out of 5 stars",
    "content": "They fit perfect. Good quality.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are as good as the more expensive brands.  Comfortable and washes well",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B092498CH5"
},
{
    "title": "SuperSoft",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve bought more lululemons than one should and these rival them, if not better. Although lulu never folded on top (and these do sometimes) the quality has gone down significantly. For the price point, these are UNREAL!! I just bought my 4th pair. I get the essential 7/8. I am 5”3 and weigh 170. I buy a medium. They are tight but I love them. I’ll for sure buy more and more.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Hello Lululemon dupe! These are so buttery soft and are half the price. Have multiple colors and will always suggest these for people looking at potential dupes for Lulu",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B092498CH5"
},
{
    "title": "These are amazing!",
    "rating": "5.0 out of 5 stars",
    "content": "Flattering, quality!  Fits great",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have so many pairs. They are so comfortable, wash well, and do not fade. They are just like lulu leggings expect half the price!!!!",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Good quality",
    "rating": "5.0 out of 5 stars",
    "content": "Soft and comfy",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Cannot beat these for the price. Especially if you manage to get them on sale. Was told they were a lululemon dupe. I think they feel more like Athleta. Comfortable and flattering .",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Beautiful leggings",
    "rating": "4.0 out of 5 stars",
    "content": "These leggings are super soft and lightweight. They not are compression leggings.  If you have ever bought true compression leggings from a \"fab\" VIP subscription company, You will not find that here. HOWEVER while the compression isn't there, I'm not sure if it was the print, because these are super flattering on. I am a size 4/ small.  I'm usually in the gym for about 3 hours and these held up to my routine. I do feel the tops roll down just a little but nothing crazy. It flops right back up when you stand up. Overall these are super comfortable to wear and when I would squat I did not see anything. Again, I cannot confirm if that's because of the pattern I chose, but everything was covered. I will buy these again and I will work out in these. I think these are worth it. And if you are looking for a new legging to try and you searched all over for decent leggings, try these! I would suggest making sure you buy the correct size for your body because as fabric stretches it becomes thinner. So if you order a size too small you might have issues when squatting.  I do not know how these hold up to running. I was jumping around, teaching class and I didn't have to adjust the pants. I do think a tighter compression would probably work better for running. This is perfect for for work, lifting,  or any kind of fitness classes.",
    "post_time": "Reviewed in the United States on February 13, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Soft and supportive material, gusseted crouch and length choices are what make these leggings a premium product.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Not compression, light weight, soft, squat proof red",
    "rating": "5.0 out of 5 stars",
    "content": "Absolutely LOVE how these fit and look! They’re so soft and comfy! Thick material that doesn’t show every little bump. I am planning on buying more in different colors. I bought a medium 25” inseam and they fit perfectly.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Absolutely love the fabric and price !! It’s  thick, good quality, and most especially squat proof. Only bad thing about it is the first couple of times you use it  it does fall down and you keep having to pull up , but after the third or so wash it does do it anymore . Worth it !!",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Worth the money",
    "rating": "5.0 out of 5 stars",
    "content": "These are literally the same buttery yoga pants from lululemon! They hold in all of my imperfections, are so soft, light weight (yet durable…)",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This are super soft and fit as expected. My daughter is 5’3 and 102lb for reference.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B092498CH5"
},
{
    "title": "So comfy",
    "rating": "5.0 out of 5 stars",
    "content": "I do not do reviews but this one deserves it and want to let people know how great these really are! They fit great,  hold everything in place, super luxe material, just simply 1000/10",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love the price and the quality. They are super snug and hold everything in nicely. Follow instructions for washing to make them last longer. I used to buy CRZ yoga which stretched out with wear and weren’t as compressed, however these have held up nicely. I have multiple colors and reach for these more than anything. Also love that they have the longer inseam for us tall girlies (I am 5’10”).",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Lululemon dupe",
    "rating": "5.0 out of 5 stars",
    "content": "They look and feel exactly like Lululemon pants. I definitely recommend.  They are amazing!😃",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "honestly my favorite pair of leggings, in my opinion they’re the best LuluLemon dupe. super comfy, super stretchy and less likely to rip in the thigh due to the double stitching",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B092498CH5"
},
{
    "title": "love these",
    "rating": "5.0 out of 5 stars",
    "content": "It is so hard to find 7/8 length for petite girls. I also love that there are no outside pockets!!!! These leggings have great compression and aren’t see through. They are true to size. Only complaint is if you are a sweaty person they definitely show your sweat lines. I did a light workout and had lots of visible sweat lines",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These feel and look exactly like Lulu",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Not for sweaty girls",
    "rating": "4.0 out of 5 stars",
    "content": "I ordered olive color camo and instead got another of the diamond gray tie dye color. These leggings are so soft and give just the right amount of compression. I only wish they had pockets!",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It was just what I was looking for. Great price and quality.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Good!",
    "rating": "4.0 out of 5 stars",
    "content": "I use them for Yoga and working out.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I usually wear Small, so I got small and they fit great",
    "post_time": "Reviewed in the United States on December 1, 2023",
    "pid": "B092498CH5"
},
{
    "title": "Got wrong colors delivered but that's okay.",
    "rating": "5.0 out of 5 stars",
    "content": "I love these leggings. Although they do pile between the thighs. They fit great and for the price I will continue to purchase. Definitely comparable to Lulu at a more affordable price.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B092498CH5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recently purchased Heynut leggings, and I must say, they've exceeded my expectations. These leggings not only offer great quality and a flattering fit, but they also provide excellent value for the price.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B092498CH5"
},
]