[
{
    "name": "        Tikduck Flying Orb Ball 2024 Toys Soaring Hover Boomerang Spinner Hand Controlled Mini Drone Cosmic Globe Spinning Kids Adults Outdoor Birthday Gift Cool Stuff for Boys Girls 6 7 8 9 10+ Year Old       ",
    "stars": [
        "59%",
        "15%",
        "11%",
        "6%",
        "10%"
    ],
    "pid": "B096LVFBMW",
    "ratings": "8,595 ratings",
    "other_info": {},
    "discount_price": "$ 32.00",
    "normal_price": "$43.99",
    "about_this_item": [
        " Super Cool High-Tech Hand Controlled Drone : Our flying orb ball featuring a gyroscope and smart AI chip that promises intelligent flight. Different throwing angles and speeds will create different flight lines and boomerang effect. This cool stuff not only brings fun to play but also helps to improve children's hands-on ability, operating skills, intelligence, and creativity.  ",
        " Lightweight Body: This flying ball drone toy is made of high-grade ABS material, which is lightweight and flexible, making it able to withstand countless crashes. The propellers are safely concealed within the ball drone. The enclosed propellers cause no worry that children will be hurt by their blades.  ",
        " USB Rechargeable: Simply connect it to the USB connector for 25 minutes to fully charge. (Flying time: 8 to 10 minutes, Battery life varies individually due to environmental factors). When the LED indicator flashes, it means that the aircraft needs to charged. The indicator light remains lit when charging, and turns off when charging is complete.  ",
        " For Anytime, Anywhere Fun: You don’t need a lot of space to take off with our hand operated drone. It is fun and easy to control anywhere. It’s designed to work indoors as well as outdoors, with a smooth flight pattern and boomerang effect. It’s the perfect backyard activity, but can easily be used indoors as well. This flying ball is a great conversation piece for family, school, and holiday gatherings. It’s a simple way to teach about physics and aerodynamics, even from a young age.  ",
        " Perfect Gift: This hand-controlled drone is a fun novelty gift for birthdays, Halloween, Thanksgiving Day, Christmas. This is a great choice for Easter, Father's Day, Mother's Day gift toys. It’s a perfect enrichment gift for kids, teenagers, adults, and the elderly.  "
    ]
},
]