[
{
    "name": "        HOBOT-2S Window Cleaning Automatic Robot with Ultrasonic Water Spray, Intelligent Cleaning, AI Smart Route Plan, Dual Replaceable Water Tanks, and Control via Smartphone or Remote       ",
    "stars": [
        "51%",
        "8%",
        "13%",
        "8%",
        "20%"
    ],
    "pid": "B097CM7P9L",
    "ratings": "55 ratings",
    "other_info": {},
    "discount_price": "$ 399.",
    "normal_price": "",
    "about_this_item": [
        " Effortless and efficient cleaning: Innovative ultrasonic water spray nebulizes water into dense mist to deliver unparalleled cleaning results without leaving water stains. A powerful vacuum (7kg ascending power) safely attaches the robot to the surface while extracting dust and removing all impurities.  ",
        " Safety and reliability design: An auto-adjustable pneumatic pad automatically controls the driving force and keeps the force between the caterpillar treads and cleaning cloth in balance. Auto-edge detection with AI-smart route planning navigates the robot in zigzag pattern in horizontal and vertical directions suitable for frameless windows. A long (15 ft) safety rope and embedded UPS (Un-interrupted Power System) prevents the robot from falling in case of a power outage.  ",
        " Large cleaning area and position memory: Large size (9.5 X 9.5 inches) cleaning cloth with extended corner coverage to reach deep into corners. Long power and included extension cords provide a wide range of cleaning coverage ideal for not only residential use but also small-scale businesses such as restaurants, cafes, offices, etc. The robot automatically returns to its starting point once the window is cleaned, ensuring easy access and removal in hard-to-reach areas.  ",
        " Dual replaceable water tanks and edge-leakage sensor: In case the ultrasonic spraying nozzle is clogged, simply replace the entire water tank or spraying nozzle with a standard screw driver. The edge-leakage sensor technology can detect air leakage caused by the slight lift around the window seal or the edge of the frameless windows.  ",
        " Voice Prompt. AI-technology and Control via Smartphone APP or Remote. 3 programs for automatic cleaning of surfaces. OTA Firmware update.Receive notifications and alerts on your smartphone, such as when a task is completed, by installing HOBOT APP. Please read the included manual before use. You can also use the link to video tutorial on the box. The robot works with power cord ONLY. Do NOT use on frames with non-rectangular (rounded) edges. Minimum surface cleaning area is 15х15 inches for glass of any thickness. FAQ are found on our Amazon store page.  "
    ]
},
]