[
{
    "name": "  The Love of My Life: A GMA Book Club Pick (A Novel) ",
    "stars": [
        "49%",
        "33%",
        "13%",
        "3%",
        "2%"
    ],
    "pid": "B098J337VY",
    "ratings": "24,837 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$15.75",
    "about_this_item": []
},
{
    "title": "A Thrilling and Unputdownable Masterpiece!",
    "rating": "5.0 out of 5 stars",
    "content": "I recently had the pleasure of delving into the captivating world of \"The Love of My Life\" by Rosie Walsh, a gripping thriller that had me on the edge of my seat from start to finish. This book is a true gem that I devoured in just three days, unable to tear myself away from its pages.",
    "post_time": "Reviewed in the United States on February 25, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "From the very first chapter, Walsh masterfully weaves a heartbreakingly beautiful tale that will leave readers both breathless and emotionally invested. The intricate plot twists and turns, keeping you guessing until the very last page. The author's ability to create such suspense and maintain it throughout the story is truly commendable.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Intriguing plot beautifully written.",
    "rating": "5.0 out of 5 stars",
    "content": "The characters in \"The Love of My Life\" are incredibly well-developed and relatable. Each one is flawed and complex, adding depth and authenticity to the narrative.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "One of the standout aspects of this novel is Walsh’s exquisite writing style. Her prose is elegant, yet accessible, effortlessly drawing readers into the story and making it impossible to put down. The pacing is perfect, with a careful balance between heart-pounding action and poignant moments of reflection.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B098J337VY"
},
{
    "title": "The Love of my Life",
    "rating": "4.0 out of 5 stars",
    "content": "I cannot recommend \"The Love of My Life\" enough. It is a true page-turner that will have you enthralled from the very first sentence. Rosie Walsh has crafted a masterpiece that deserves nothing less than a full five-star rating. So, grab a copy, buckle up, and prepare for a thrilling ride that will leave you breathless and wanting more!",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A story that rings true. Enough intrigue to keep a psychologist’s diary full. Rather drawn out by the end but full of insight. A pleasure to read even if the end where alls well that ends well is rather contrived.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Missing pages",
    "rating": "5.0 out of 5 stars",
    "content": "A bit confusing in the beginning because you don’t know who is talking or what is going on. However, it is a treasure to read as the story unfolds. Emily could be the girl next door with her unbelievable past. A wonderful story to cherish.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This story is very good but when I got to page number 150 it skipped to page 215.  After page 215 it went back to page 183, but nowhere in this book are the missing pages!",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Quick but a little confusing read",
    "rating": "5.0 out of 5 stars",
    "content": "I read this in a few days.  There were some interesting twists to the plot and what ended up happening was no where on my radar.  I had a little trouble following the story, especially in the beginning, but it all made sense by mid way through.",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The writing was good and the story was gripping. I started it and finished it in one day. I recommend!",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B098J337VY"
},
{
    "title": "quick read",
    "rating": "4.0 out of 5 stars",
    "content": "Good book. Quick read! Read in two days. Couldn't put it down. Was a very interesting story to follow through",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It started slowly. Then when I was finally really getting into it, at page 54, it went back & repeated pages 23 - 54. It skipped pages 55-86 entirely, resuming at page 87.  Those pages seem to be really important to the story, as they appeared to be getting ready to reveal the major secret that one character has been keeping from the other, & how the other reacts, etc.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B098J337VY"
},
{
    "title": "missing 32 key pages",
    "rating": "4.0 out of 5 stars",
    "content": "So, I'm goign to contact Amazon about it, & see if I can get a replacement copy that actually has all the pages.  As it is, I can't finish it, so I can't really review it properly. But, I wanted to let others know, as this seems to be an issue with more than just my copy (different pages missing in other copies, but still not good at all)....actually I'd rather not read something than have this happen.....but if I can get a replacement with all the pages, I do want to know what happens.  So, it's at least a promising story.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "edited to add that Amazon is replacing the defective copy",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B098J337VY"
},
{
    "title": "loved it",
    "rating": "5.0 out of 5 stars",
    "content": "I didn’t see the twist that this book delivered. It kept me attention the whole time. I enjoyed reading it.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This kept me on the edge of my seat. I reead thr whole thing in one day, I had to know what happened next! Highly recommend",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Lots of tests and turns",
    "rating": "4.0 out of 5 stars",
    "content": "I really enjoyed this book and the suspense of following along as Leo learned more about his Wife’s interesting past!",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good story so far. Great writing and easy to read",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B098J337VY"
},
{
    "title": "great book, couldn’t put down!",
    "rating": "3.0 out of 5 stars",
    "content": "I didn't know what to expect when I opened the book, but I do like it.  Conscientiously, I can't give it  5 stars because its not a memorable book.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It takes too long to get into the story",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B098J337VY"
},
{
    "title": "The Love of My Life",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed the book.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Requested a new copy but I have not received it yet. Apparently, others reported it, too.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Great read but 40 pages are missing",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book! It was a quick read, and the story was so compelling that it was difficult to put down. Highly recommended!",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Not many 5 star books in my library but this one deserved it. Unique, captivating, and well written. Did not know where this was headed and was really surprised when I found out.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B098J337VY"
},
{
    "title": "LOVED this book!",
    "rating": "4.0 out of 5 stars",
    "content": "Emma loves her husband Leo and their young daughter Ruby: she’d do anything for them. But almost everything she’s told them about herself is a lie.",
    "post_time": "Reviewed in the United States on February 4, 2023",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "And she might just have got away with it, if it weren’t for her husband’s job. Leo is an obituary writer; Emma a well-known marine biologist. When she suffers a serious illness, Leo copes by doing what he knows best – researching and writing about his wife’s life. But as he starts to unravel the truth, he discovers the woman he loves doesn’t really exist. Even her name isn’t real.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B098J337VY"
},
{
    "title": "A unique and mysterious love story with a shock",
    "rating": "3.0 out of 5 stars",
    "content": "When the very darkest moments of Emma’s past finally emerge, she must somehow prove to Leo that she really is the woman he always thought she was . . .",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "But first, she must tell him about the other love of her life.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B098J337VY"
},
{
    "title": "A WINDING JOURNEY...",
    "rating": "5.0 out of 5 stars",
    "content": "MY THOUGHTS:",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Their story unfolds in alternating narratives, and we are swept away by the secrets and lies, wondering what truth is behind The Love of My Life.",
    "post_time": "Reviewed in the United States on May 5, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Disappointed",
    "rating": "3.0 out of 5 stars",
    "content": "The story started out as interesting, with the potential to be one of those \" couldn't put it down\" books. It soon became formula and predictable, and the ending was very poorly done.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I knew exactly what would happen a short time after I started reading it.  The writing was good, the characters interesting, however, nothing that happened was a surprise to me.  Way too predictable, unfortunately, so that ruined it for me.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Very predictable",
    "rating": "5.0 out of 5 stars",
    "content": "This book was amazing. I love that it continually left you wanting more and reading more. I am someone who typically predicts all the twists, I did not with this. I love that there is a love story here but that is not the entire book. I will be sharing this with other reader friends!",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Decent but not sure it all adds up as smooth as I thought it would. I’d have to re read but I don’t enjoy doing that",
    "post_time": "Reviewed in the United States on May 2, 2024",
    "pid": "B098J337VY"
},
{
    "title": "I couldn't put it down!",
    "rating": "5.0 out of 5 stars",
    "content": "Love this story….and how the title is tied in with the story, especially at the ending. The story moves right along and kept me interested to the end….a love story that’s also filled with mystery. A perfect combination. Can’t wait to read another of her books.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Hommie just popped the question again, what, 72 hours after finding out the truth. C'mon.",
    "post_time": "Reviewed in the United States on April 27, 2024",
    "pid": "B098J337VY"
},
{
    "title": "decent",
    "rating": "3.0 out of 5 stars",
    "content": "All the other parts were believable, but the last bit seemed hurried and stretched.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Otherwise, good read.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Perfect title!",
    "rating": "3.0 out of 5 stars",
    "content": "This book was REALLY difficult for me to get into. I pushed through bc I don’t like to purchase books and then not read them. I will say, it did pick up in the middle and I really enjoyed the second half. Lots to unpack and reflect back on while reading along, but it is quite a story!",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The author keeps you guessing until the end! You will wonder about the mother's mental stability, and sympathize with her deceived husband, and think the mystery man in her life is everything he's not, and you keep getting jerked around to discover some element you hadn't considered. Who to trust?",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Bought new got used",
    "rating": "4.0 out of 5 stars",
    "content": "This isn’t a review of the book, sorry. Just disappointed that I order a “new” book and got something with all bent up.",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The plot is intricate but not difficult to follow. What IS difficult is believing that the author has fooled you time and time again, just when you think you have it figured out. I highly recommend this book and hope everyone who reads it is as enthralled as I was.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B098J337VY"
},
{
    "title": "A Wondrous Read!",
    "rating": "4.0 out of 5 stars",
    "content": "Kept me on my toes, always a twist sending the book in a different way than I expected. Nice ending",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This novel captured me from the beginning. The story intertwines the present with the echos of the past. An unforgettable love story about the depths of true love.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B098J337VY"
},
{
    "title": "good suspense",
    "rating": "4.0 out of 5 stars",
    "content": "Imagine waking up to find out the woman you’re married to, the love of your life, isn’t who you thought she was. This is a twisty, turny story of an obituary writer who is, well, just in case, preparing a deep dive into his well-regarded marine biologist and recent cancer survivor wife’s past for a preliminary obit and in doing so unearths some shocking surprises.",
    "post_time": "Reviewed in the United States on April 10, 2022",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Because of Leo’s wife Emma’s fame as a former host of a BBC series on marine wildlife, his line of work requires him to prepare what is called a ‘stock’ obit, and in his research, he comes across what he learns to be lies, lies, lies about her past. What he thought he knew to be true about her life is nothing but. How can he trust her? Is she the woman he loves?",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Love of My Life a Must Read",
    "rating": "3.0 out of 5 stars",
    "content": "It’s not only Emma and Leo tangled in the web of this domestic thriller as we soon learn others are involved in the betrayal. Inclined at first to dismiss Emma and her baggage, once you become caught up in the mystery, your feelings for her might change. Walsh has created an immersive and utterly suspenseful book that is so much fun to read.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed reading this book. I was able to finish it in two days. Told a few of my girlfriends about the book and they also really enjoyed it. Definitely give it a read.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Utterly suspenseful and a great read!",
    "rating": "5.0 out of 5 stars",
    "content": "This book took forever to get the plot across.  I almost didn't finish it.  About the last one third of the book was good.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I started reading this book today around 8 pm and couldn’t stop. I just finished it at 4:45 am. It’s suspenseful and the characters are amazing!",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Fast read",
    "rating": "5.0 out of 5 stars",
    "content": "Read this in 2 days. It surprised me the different turns it took. It really is a good book about what buried guilt can do to you.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I would give this book 4 stars, but the ending is frustrating. What happened? The ending seems rushed and doesn't tie up a huge loose end. The book is well written and has an interesting story. The detailed information about crabs and such was not necessary, and I rushed through those parts. The book kept my interest, but it wasn't something that I rushed to read at night.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "B098J337VY"
},
{
    "title": "3 1/2 stars",
    "rating": "5.0 out of 5 stars",
    "content": "I like everything about it.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great book but My book is missing 22 pages! It obviously is a miss print run of the book but now it’s over the time I’m able to return the book. Please help Amazon!!! It ends at page 278 and the next page is 311. See photo. Help please.",
    "post_time": "Reviewed in the United States on June 5, 2024",
    "pid": "B098J337VY"
},
{
    "title": "It is a wonderful book.",
    "rating": "5.0 out of 5 stars",
    "content": "I am a constant reader. I read at least 2-3 hours a day and average between 120-160 books a year. I love all genres. Obviously I read a *lot* of books. There are many books and authors I really enjoy but there are a handful of authors whose characters, plot lines, and details are so seamless and true to life it satisfies me entirely. This is one of those books for me.",
    "post_time": "Reviewed in the United States on August 25, 2022",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I will admit I struggled getting into the book at first as the characters and foundation were being built. But then it turned a corner and I couldn’t stop reading. The author put in small details that made the book a more realistic, well developed story. Small spoiler alert) Such as when Leo mentions early in the books that Ruby had been getting up after she had been out to bed every night. Then later in the story she got out of bed at a bad time at the cabin. A lot of writers would just put her hopping out of bed with no background. But for me all the small details like this made the story fuller and more real to me. The characters had flaws, made major mistakes in life, and suffered with guilt. Just like real people. And the writer also managed to surprise me a couple of times which is pretty hard to do. This is an author I will definitely watch for and read again without hesitation.",
    "post_time": "Reviewed in the United States on February 5, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Book is missing 22 pages. Help please Amazon!",
    "rating": "4.0 out of 5 stars",
    "content": "Everyone is different, but I thought this was an excellent book.",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "An interesting story, built around a secret past. Not being from England the many references to specific streets was unimportant and distracting. As the story unfolds you are drawn into guessing the outcome...that's always fun.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Wonderful book",
    "rating": "5.0 out of 5 stars",
    "content": "Be sure you are ready for a couple of day's heavy reading as both the story and descriptions are not for the fainthearted.  Goes deeply into what might happen when decisions are made without very careful thinking beforehand.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I just received this book prior to my camping trip. Its great so far- except it is missing a chunk of pages! So disappointing since its a suspenseful book!",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Meh",
    "rating": "3.0 out of 5 stars",
    "content": "I like to read and read different genres. I found this ok, kinda boring. I skipped some and got to the end, something i usually don’t do w books.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Slow start, but became a total page turner. Which would have made it a great book if all the pages had actually  been there. Missing 30 pages. It skips from 278-311. Pages are not there! I would recommend reading the book if  you can look at it before purchase. I would not order it online.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Missing pages",
    "rating": "4.0 out of 5 stars",
    "content": "But it's heart-wrenchingly hard to keep reading. At the core of it is the cruelest fate imaginable. It ends all to abruptly and unfinished, but it's worth the read just for the love and pathos you will feel.",
    "post_time": "Reviewed in the United States on January 16, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You think you're done midway through but the novel is only half over. The real story is still to come. This is a terrific novel about deception, grief, but ultimately about love. My concluding remark: Wow! A terrific story.",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "B098J337VY"
},
{
    "title": "You can't put it down-",
    "rating": "5.0 out of 5 stars",
    "content": "I read this one blind based on the rec of a trusted reader friend (thanks @kkadams) and I’m so glad I did. The description doesn’t nearly do the full book justice. Additionally, the title is misleading.  Until my friend made the recommendation, I skipped over this book multiple times as I wasn’t in the mood for a sappy love story.  This book is definitely not sappy or trite.",
    "post_time": "Reviewed in the United States on September 14, 2022",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Occasionally, I find an author whose characters, plot lines, and details are so seamless that the work satisfies me entirely with little to no complaint. Walsh is such an author and the newest addition to my “must read” list of writers.",
    "post_time": "Reviewed in the United States on August 12, 2023",
    "pid": "B098J337VY"
},
{
    "title": "All I can Say is \"Wow\"",
    "rating": "3.0 out of 5 stars",
    "content": "This book was engaging from page one. The characters were extremely well developed and believable. I felt vested in their well-being!",
    "post_time": "Reviewed in the United States on September 13, 2022",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The story includes some graphic scenes and depictions surrounding postnatal psychosis.  Typically, I would not consider this to be an enjoyable subject, but it surprisingly didn’t drag down the overall emotional quotient.  Similarly and thankfully, the subject was handled with all the delicacy it deserves.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Don’t let the title fool you…",
    "rating": "5.0 out of 5 stars",
    "content": "I recommend to all but it will pack a big punch with anyone who is a mother.",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been absolutely riveted all afternoon, eagerly turning pages to find out what secrets Emma was hiding, and why—and wondering what would come next for her and Leo. This is a story of true love between a man and a woman, and a story about the love a mother has for her child. It is a gripping mystery, as Emma’s true story is revealed, slowly, heartbreakingly, and shockingly. It is a story of a grief so deep that it is a miracle for anyone to survive and thrive and forgive and heal. The characters were so real, so perfectly imperfect, that there were no heroes or villains, just people. The emotions in this book were raw, gritty, and genuine; in a book built on lies, there is also brutal honesty.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B098J337VY"
},
{
    "title": "A good quick read",
    "rating": "4.0 out of 5 stars",
    "content": "Petty predictable. Enjoyed the story though.",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a twisty turny novel part mystery, part family drama part crab hunting. Very emotional ending that leaves the reader guessing. No vulgar salacious sex or violence but lots of thrills in British English. Bravo.",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B098J337VY"
},
{
    "title": "The Love of my Life",
    "rating": "5.0 out of 5 stars",
    "content": "Love the writer’s style, the tenderness, compassion, and humor of a gripping and engaging story. Sprinkled with humor and horror. Enjoyed every minute of this book.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Well written, good plot line.  Not predictable.  Wonderful characters.  Highly recommend.  Enjoyed it very much.  Want to see what else this author has penned",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Beautifully Crafted and Heartfelt",
    "rating": "3.0 out of 5 stars",
    "content": "Did not expect the ending.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very interesting characters",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B098J337VY"
},
{
    "title": "great story",
    "rating": "5.0 out of 5 stars",
    "content": "And plots..fun to read!!",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fast, great read, loved it",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Good read",
    "rating": "5.0 out of 5 stars",
    "content": "I read this book in 2 days. The story is captivating and the writing is gorgeous! I feel like I’ve met each of the characters in real life. I can easily imagine this story as a movie.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed the book, but my copy was missing pages 279-310.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B098J337VY"
},
{
    "title": "couldn’t put it down!",
    "rating": "5.0 out of 5 stars",
    "content": "Such a great read!  Surprising twists and turns and characters you grow attached to quickly.  I appreciated that this was a mystery but with no murders.  Read it in less than 48 hours.  Perfect escape on a rainy day",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Rosie Walsh grabs your attention with just enough detail and yet just enough mystery to keep you wanting more. A sweet tale about the tangled web our lives can so easily spin in to. She executes her writing with believability and also manages to keep us yearning for the love and acceptance Emma so desperately needs.",
    "post_time": "Reviewed in the United States on February 22, 2024",
    "pid": "B098J337VY"
},
{
    "title": "sweetly captivating",
    "rating": "5.0 out of 5 stars",
    "content": "My first by this author and wow did I enjoy this book. I appreciate books written by and set in the UK and this did not disappoint. I’ll be picking up her next one as soon as it drops.",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I read this book on an airplane. It kept me engaged and entertained until we touched down.  I actually enjoyed the drama and couldn't guess the outcome or the perpetrators.",
    "post_time": "Reviewed in the United States on April 27, 2024",
    "pid": "B098J337VY"
},
{
    "title": "and it won’t be my last…",
    "rating": "4.0 out of 5 stars",
    "content": "Not really a mystery, but I couldn’t guess all the twists and turns the story took..in its natural way, though, not too dramatic. I really enjoyed it.",
    "post_time": "Reviewed in the United States on November 16, 2023",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I prefer some excitement but as the story unfolds I can see this as a movie and probably cry through it.",
    "post_time": "Reviewed in the United States on December 5, 2023",
    "pid": "B098J337VY"
},
{
    "title": "Gripping",
    "rating": "4.0 out of 5 stars",
    "content": "This was a very good book",
    "post_time": "Reviewed in the United States on January 5, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good story line with lots of twists and turns but the ending was sadly predictable. I would recommend if you don't mind a predictable ending",
    "post_time": "Reviewed in the United States on November 9, 2023",
    "pid": "B098J337VY"
},
{
    "title": "Kept me guessing",
    "rating": "4.0 out of 5 stars",
    "content": "Did it knock my socks off - No. Interesting read with twist at end.",
    "post_time": "Reviewed in the United States on December 3, 2023",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Wasn't crazy about this book. It sometimes went on and on with irrelevant information! It was just ok.",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Brilliant",
    "rating": "5.0 out of 5 stars",
    "content": "I had no expectations ordering this but as soon as I opened it, I could not put this book down! It was a tad slow at first, but I read it in one sitting - paying no mind to the clock because it was that thrilling!",
    "post_time": "Reviewed in the United States on February 24, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I guessed some of what was happening - and kept thinking … oh….my…… word.",
    "post_time": "Reviewed in the United States on September 18, 2023",
    "pid": "B098J337VY"
},
{
    "title": "hang on for a wild ride!",
    "rating": "2.0 out of 5 stars",
    "content": "What a wild ride. I went through such a wide range of emotions. Anger, grief, sadness… joy…. You name it.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was not worth reading. It was meh at best with at least one character’s storyline that just dropped w/o a conclusion. I only read it because I was waiting on my kids at the water park and my phone died.",
    "post_time": "Reviewed in the United States on August 15, 2023",
    "pid": "B098J337VY"
},
{
    "title": "Not worth reading",
    "rating": "4.0 out of 5 stars",
    "content": "Interesting read that slowly sucked me in.  Have not read a book with a storyline like this one.  Where was this going?  I had no clue.  I like books that are not predictable.  Kept my interest.  Good read.",
    "post_time": "Reviewed in the United States on July 10, 2023",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "After reading a terrible summer novel suggested by the NYT critic, I found this one and double-checked all the reviews.  It is about a serious and loving relationship and some secrets that surface.  The author leads us down the wrong path for awhile which was smart.  Took me a few nights to read it and I enjoyed it.",
    "post_time": "Reviewed in the United States on October 10, 2023",
    "pid": "B098J337VY"
},
{
    "title": "Could not guess where this one was going!",
    "rating": "4.0 out of 5 stars",
    "content": "I expected more of a punch at the end based on how the story was unraveling. I did not appreciate that the women, who had legitimate mental health issues, were depicted with the men as their saviors, including son Charlie. I thought that the author was doing a great job with character development through 3/4 of the book but then let me down as a reader with the resolution of the story. I also regret that what could have a beautiful adoption story (which we do not hear enough of these days) was twisted by deception.",
    "post_time": "Reviewed in the United States on July 29, 2023",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Lies are the rust that corrode the relationships touched by them. Lies played a major role in the storyline of this novel.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Great summer read",
    "rating": "5.0 out of 5 stars",
    "content": "The Love of My Life is original and unpredictable. It is one of those books that you are willing to sacrifice sleep for. I certainly recommend it!",
    "post_time": "Reviewed in the United States on March 27, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Hard to put doen",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "B098J337VY"
},
]