[
{
    "name": "  The Love of My Life: A GMA Book Club Pick (A Novel) ",
    "stars": [
        "49%",
        "33%",
        "13%",
        "3%",
        "2%"
    ],
    "pid": "B098J337VY",
    "ratings": "24,830 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$15.75",
    "about_this_item": []
},
{
    "title": "Meh",
    "rating": "3.0 out of 5 stars",
    "content": "I like to read and read different genres. I found this ok, kinda boring. I skipped some and got to the end, something i usually don’t do w books.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Slow start, but became a total page turner. Which would have made it a great book if all the pages had actually  been there. Missing 30 pages. It skips from 278-311. Pages are not there! I would recommend reading the book if  you can look at it before purchase. I would not order it online.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Missing pages",
    "rating": "4.0 out of 5 stars",
    "content": "But it's heart-wrenchingly hard to keep reading. At the core of it is the cruelest fate imaginable. It ends all to abruptly and unfinished, but it's worth the read just for the love and pathos you will feel.",
    "post_time": "Reviewed in the United States on January 16, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You think you're done midway through but the novel is only half over. The real story is still to come. This is a terrific novel about deception, grief, but ultimately about love. My concluding remark: Wow! A terrific story.",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "B098J337VY"
},
{
    "title": "You can't put it down-",
    "rating": "5.0 out of 5 stars",
    "content": "I read this one blind based on the rec of a trusted reader friend (thanks @kkadams) and I’m so glad I did. The description doesn’t nearly do the full book justice. Additionally, the title is misleading.  Until my friend made the recommendation, I skipped over this book multiple times as I wasn’t in the mood for a sappy love story.  This book is definitely not sappy or trite.",
    "post_time": "Reviewed in the United States on September 14, 2022",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Occasionally, I find an author whose characters, plot lines, and details are so seamless that the work satisfies me entirely with little to no complaint. Walsh is such an author and the newest addition to my “must read” list of writers.",
    "post_time": "Reviewed in the United States on August 12, 2023",
    "pid": "B098J337VY"
},
{
    "title": "All I can Say is \"Wow\"",
    "rating": "4.0 out of 5 stars",
    "content": "This book was engaging from page one. The characters were extremely well developed and believable. I felt vested in their well-being!",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The story includes some graphic scenes and depictions surrounding postnatal psychosis.  Typically, I would not consider this to be an enjoyable subject, but it surprisingly didn’t drag down the overall emotional quotient.  Similarly and thankfully, the subject was handled with all the delicacy it deserves.",
    "post_time": "Reviewed in the United States on September 13, 2022",
    "pid": "B098J337VY"
},
{
    "title": "Don’t let the title fool you…",
    "rating": "3.0 out of 5 stars",
    "content": "I recommend to all but it will pack a big punch with anyone who is a mother.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been absolutely riveted all afternoon, eagerly turning pages to find out what secrets Emma was hiding, and why—and wondering what would come next for her and Leo. This is a story of true love between a man and a woman, and a story about the love a mother has for her child. It is a gripping mystery, as Emma’s true story is revealed, slowly, heartbreakingly, and shockingly. It is a story of a grief so deep that it is a miracle for anyone to survive and thrive and forgive and heal. The characters were so real, so perfectly imperfect, that there were no heroes or villains, just people. The emotions in this book were raw, gritty, and genuine; in a book built on lies, there is also brutal honesty.",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Dragged On",
    "rating": "3.0 out of 5 stars",
    "content": "Wasn't crazy about this book. It sometimes went on and on with irrelevant information! It was just ok.",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Lies are the rust that corrode the relationships touched by them. Lies played a major role in the storyline of this novel.",
    "post_time": "Reviewed in the United States on July 29, 2023",
    "pid": "B098J337VY"
},
{
    "title": "It's an unpredictable gem! 4 1/2 ⭐s",
    "rating": "5.0 out of 5 stars",
    "content": "The Love of My Life is original and unpredictable. It is one of those books that you are willing to sacrifice sleep for. I certainly recommend it!",
    "post_time": "Reviewed in the United States on February 24, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I had no expectations ordering this but as soon as I opened it, I could not put this book down! It was a tad slow at first, but I read it in one sitting - paying no mind to the clock because it was that thrilling!",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Brilliant",
    "rating": "4.0 out of 5 stars",
    "content": "This was not worth reading. It was meh at best with at least one character’s storyline that just dropped w/o a conclusion. I only read it because I was waiting on my kids at the water park and my phone died.",
    "post_time": "Reviewed in the United States on August 15, 2023",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Interesting read that slowly sucked me in.  Have not read a book with a storyline like this one.  Where was this going?  I had no clue.  I like books that are not predictable.  Kept my interest.  Good read.",
    "post_time": "Reviewed in the United States on July 10, 2023",
    "pid": "B098J337VY"
},
{
    "title": "Not worth reading",
    "rating": "3.0 out of 5 stars",
    "content": "After reading a terrible summer novel suggested by the NYT critic, I found this one and double-checked all the reviews.  It is about a serious and loving relationship and some secrets that surface.  The author leads us down the wrong path for awhile which was smart.  Took me a few nights to read it and I enjoyed it.",
    "post_time": "Reviewed in the United States on October 10, 2023",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I expected more of a punch at the end based on how the story was unraveling. I did not appreciate that the women, who had legitimate mental health issues, were depicted with the men as their saviors, including son Charlie. I thought that the author was doing a great job with character development through 3/4 of the book but then let me down as a reader with the resolution of the story. I also regret that what could have a beautiful adoption story (which we do not hear enough of these days) was twisted by deception.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Could not guess where this one was going!",
    "rating": "5.0 out of 5 stars",
    "content": "Hard to put doen",
    "post_time": "Reviewed in the United States on March 27, 2024",
    "pid": "B098J337VY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The direction of this story was not easy to figure out until over half way through the book.  It kept me guessing and wanting to read more.  Good story line.",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "B098J337VY"
},
]