[
{
    "name": "        Wine Bottle Opener Corkscrew Set – Luxiluxy [2023 upgraded, does NOT break!] Including Foil Cutter, Bottle Stopper, Opener Stand and Extra Spiral - corkscrews wine opener set- wine opener kit       ",
    "stars": [
        "69%",
        "11%",
        "5%",
        "3%",
        "12%"
    ],
    "pid": "B0999PNQPV",
    "ratings": "2,092 ratings",
    "other_info": {
        "Material": "Stainless Steel",
        "Color": "Elegant Silver",
        "Finish Type": "Stainless Steel",
        "Brand": "Luxiluxy",
        "Item Weight": "1.1 Pounds",
        "Product Dimensions": "6\"L x 5.5\"W",
        "Is Customizable": "No",
        "Manufacturer": "Luxiluxy",
        "UPC": "759992982909",
        "Manufacture Year": "2023"
    },
    "discount_price": "$ 27.",
    "normal_price": "",
    "about_this_item": [
        " 【Unparalleled Quality! 15% Heavier & Solid】 The 2024 upgraded wine bottle opener set is made with Top Quality and Commercial grade stainless steel for long-term durability. It is 15% heavier and more solid than offered on the market (1.1 lb vs others' 0.95 lb or less), which means this opener will last longer!  ",
        " 【Easy to use & No broken cork!】 The classic corkscrew bottle opener is famous for extremely easy to use one-pull operation that ensures fast and smooth usage. Our spiral is specially coated with Teflon to ensure smooth pushing into the cork with one single pull. No more struggle with broken cork or openers!  ",
        " 【All you need perfect wine gift set】 This complete 5-piece wine accessories gift set includes an opener, foil cutter, stopper, stand, and extra spiral for replacement making it a complete set all you need!  ",
        " 【Luxurious package for gift】 It comes with a luxurious matte box engraved with a silver logo package; making it the perfect gift idea for wine lovers, men and women.  ",
        " 【100% satisfaction】 If you are unhappy for any reason, contact us and we will send you another set free of charge. This is the last wine opener you ever need!  "
    ]
},
{
    "title": "Absolutely Love These",
    "rating": "5.0 out of 5 stars",
    "content": "These work great! I love them so much I buy them for gifts for friends. They make opening easy and last for several years. They are just as beautiful in person as they are in the pictures.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We bought this less than a year ago. It broke! Just by opening a bottle of wine the threaded piece busted right off. Contacted customer service approx 6 months ago (give or take), ZERO response! Buy something else!!!",
    "post_time": "Reviewed in the United States on April 1, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Don't buy it!",
    "rating": "5.0 out of 5 stars",
    "content": "Great quality  and I love the color. Looks so expensive",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I purchased the Luxiluxy Premium Wine Opener Set on 2/5/2024 and immediately loved it; aesthetically appealing and convenient to leave on the counter top. It functioned perfectly for six months, but then in August 2024, the lever mechanism broke, preventing the screw from retracting and removing the cork. Though perhaps of lesser importance, the coating on the wine bottle stop (included in the kit) peeled off after several months of use and became unusable. According to the statement on the Luxiluxy warranty card, “Your satisfaction is our No.1 priority”, and additionally provides several ways to contact the company, “If you have any questions or concerns with your purchase.”. That said, I sent an email (including photos) to CustomerService@Luxiluxy.com on 8/24/2024, explaining the situation and requesting assistance, but have yet to receive a reply. I would have expected this product to be one of quality and certainly would have expected their customer service department to, at the very least, respond to my email request for assistance. Very disappointed. I have since sent a follow up email to CustomerService@Luxiluxy.com, and should I get a reply from them, will post an update advising of such.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Easy to use and looks great",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this to replace a similar one I've used for years. It is very easy to use, but not as heavy as my previous one. I preferred the heavier weight opener,  but this is still nice.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and made of quality materials!",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Broke within 6 months and no response from company",
    "rating": "5.0 out of 5 stars",
    "content": "Makes removing corks simple",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had a heavy-duty, bar-top wine bottle un-corker but it broke. Not wanting to spend $100-$200 to replace it, I chose this handheld option. It works better than what it replaced. It firmly grips the bottle and the corkscrew easily does the job with almost no resistance or effort. When finished, it releases the cork flawlessly. The foil cutter works well, with one or two twists. The tool comes with a plastic stand that isn't fancy. It has a slot for the foil cutter and does the job. In short, this is extremely easy to use, space saving, and actually quite attractive setting on top of my bar.",
    "post_time": "Reviewed in the United States on May 5, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Easy wine opener",
    "rating": "5.0 out of 5 stars",
    "content": "I was leery of getting this because of the low price and suspected I was just buying junk. I'm happy to say I was wrong and highly recommend this.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "N/A",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "great product",
    "rating": "5.0 out of 5 stars",
    "content": "Does everything promised at a great price!!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a gift I selected because it was the best looking with the best reviews",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Looks Great",
    "rating": "5.0 out of 5 stars",
    "content": "I have not seen it in action",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Cheers",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "A really good wine opener",
    "rating": "5.0 out of 5 stars",
    "content": "I love the ease of opening wine bottles. This was a gift and they love it.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "iy was a gift and he loved it",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "works",
    "rating": "2.0 out of 5 stars",
    "content": "They love it!",
    "post_time": "Reviewed in the United States on May 29, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very Nice!",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "gift.",
    "rating": "4.0 out of 5 stars",
    "content": "I bought my Luxiluxy opener in March 2021 after breaking yet another rabbit-style opener that was mostly plastic. It's exactly the same product ID as the current one; they just seem to update the listing each year to have the current date. When I bought it this was pretty new on the market so it had mostly positive reviews... now it's been out a few years you can look at reviews from people like me that have had it for a bit and are disappointed. This is my fourth rabbit-style opener (the first was a low-cost legit one that used too much plastic) so I'm very familiar with how they work. This is by far the worst I have ever owned in terms of usability.",
    "post_time": "Reviewed in the United States on June 28, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "So, the critical parts are in fact metal, with minimal plastic used in the construction, and it is pretty heavy. The finish looks nice even a couple years later, and we don't bother with trying to keep it looking pretty. The foil cutter still works after several hundred bottles. Those are the plusses.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Broke opening a bottle of wine...",
    "rating": "4.0 out of 5 stars",
    "content": "After opening about 12 bottles of wine, the corkscrew broke.  Within an hour of their receiving my complaint and a photo of the issue, a new corkscrew was shipped to me. 5 stars for their customer service.  Thank you Bianca!",
    "post_time": "Reviewed in the United States on April 15, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought in copper to match my son's fall wedding and colors to open wine bottles for bridal table toasts..they didn't want champagne. Couldn't be happier! Heavy weight, sturdy, easy to use. Highly recommend!",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Beautiful piece",
    "rating": "4.0 out of 5 stars",
    "content": "We like the look and functionality of this corkscrew, but you need to plan for extra supplies. Within a few months, we had to replace the spiral/worm. The coating comes off and makes the corkscrew hard to use. Also, the plastic foil cutter broke, so we got a better stainless steel one. If you're willing to deal with the additional bits and pieces, this is a good corkscrew. Amazon carries the supplies:",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "YHJIC 2 Pack Replacement Corkscrew Spiral/Worm, Easily Change Out Spirals By Unscrewing The Old Piece",
    "post_time": "Reviewed in the United States on April 27, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Great corkscrew but needs maintnenace",
    "rating": "5.0 out of 5 stars",
    "content": "After many bottles, this corkscrew is a solid winner. Never a problem.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent  cork remover at a great price. I have used 5 different types and i think this is the best one so far.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Heavy duty. Well, made of good material.",
    "rating": "5.0 out of 5 stars",
    "content": "Just as good as before.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We have gone through many of the Setoris Rabbit wine openers, some breaking after only a few uses.  We have been using the Luxiluxy one for several months and it has not broken.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Cork it",
    "rating": "5.0 out of 5 stars",
    "content": "My wife has tried many different types, her hand strength is not great in her advanced years. This one works like a champ",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Easy to open wine with out the struggle!",
    "post_time": "Reviewed in the United States on June 22, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Solid and easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "Over the years, I have broken a couple of similar products when corks are hard and stuck.  It looks like this one will not break since it has steel teeth instead of plastic.  So far, so good.  And the price is reasonable, too.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I am revising my review after using the wine bottle opener 3 times.",
    "post_time": "Reviewed in the United States on October 14, 2021",
    "pid": "B0999PNQPV"
},
{
    "title": "Wonderful gift package! REVISED REVIEW of Oct. 22",
    "rating": "5.0 out of 5 stars",
    "content": "I actually works very well. Great pictorial directions are included in the gift/presentation box.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There are several simple and repetitive motions you do that insert the corkscrew into the cork, extract the cork and then removes the cork from the corkscrew.",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Birthday present for a friend",
    "rating": "5.0 out of 5 stars",
    "content": "A nice stand to hold the device at the ready on your counter is included. That stand also has a recess for the foil cutter that is included in the package.",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "With the opener in the stand, it takes up just a few inches or counter space. Not much.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Easy easy easy use and opening of wine bottles",
    "rating": "5.0 out of 5 stars",
    "content": "Would I buy it again? YES!",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Note in my initial review I said I would not buy it again, but after using the opener just 3 times, I gave it 4 stars and would definitely buy it as a gift.",
    "post_time": "Reviewed in the United States on January 10, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "rabbit style corkscrew",
    "rating": "5.0 out of 5 stars",
    "content": "Fake coppery/bronze finish with flaws. Did not work smoothly on first use and a plastic cap fell off, so overall, I lost confidence in the device.",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I would not buy it again. My guess is that its a cheap copy of the original Rabbit wine bottle opener. Made in China.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "it really is unbreakablele",
    "rating": "5.0 out of 5 stars",
    "content": "This is a very rugged wine opener.  just make sure you replace the cork screw ever so often",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "He tenido varios abridores de vinos y hasta intenté con uno de batería. Ninguno me dió tanto resultado como este. Es facilísimo de usar, sin mucho esfuerzo y, para mí algo muy importante, saca el corcho entero y de un solo tirón. Lo recomiendo mucho. Además la presentación es preciosa, si la quiere para regalo, esta es la elegida por mi.",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Lo mejor de lo mejor…",
    "rating": "2.0 out of 5 stars",
    "content": "They claim this unit does not break....I bought one in 2022 and it broke.......hold them to lying about the fact that it \"does not break\"!  It does, it will and it has!",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for myself because my wine key was old and completely busted. Now, when I want to open a bottle of wine without my husband's help, I can do so with ease! Starting with the foil cutter and then the corkscrew, my first bottle opened like a charm. My old wine opener made every bottle a challenge to open, so I'm already very satisfied.",
    "post_time": "Reviewed in the United States on July 11, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Their claims are bogus",
    "rating": "5.0 out of 5 stars",
    "content": "The set is super cute and could easily be sent as a nice housewarming/engagement/wedding gift. It comes with a little stand for the wine opener and the foil cutter -- this is a neat idea, but the jury is still out on its stability.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Hopefully, it will hold up over time.",
    "post_time": "Reviewed in the United States on November 17, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Pretty wine opener that works great!",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and works fine",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent method of removing corks from a wine bottle. I have chipped the edges of wine bottles - chips of glass and wine don't mix -  with those foldable screw-in ones that make you apply pressure with a metal claw thing on the top edge of the bottle while you brace the bottle to man-handle the cork out. This is so smooth and easy - a tipsy person can open another bottle with ease - not that I would ever do that, of course!",
    "post_time": "Reviewed in the United States on December 12, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Great Wine bottle opener",
    "rating": "4.0 out of 5 stars",
    "content": "I love this wine opener. It is so easy to operate and the cork comes right out. :)",
    "post_time": "Reviewed in the United States on September 15, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is my second purchase of this product, a Christmas gift for my mom. My wife and I have had one for over a year now and every time I use it I can’t get over how easy this tool makes opening a bottle of wine. I’m a stickler for quality, and I can’t imagine what I could do to improve this product, other than somehow automating the entire wine-opening process. Two thumbs-up.",
    "post_time": "Reviewed in the United States on April 15, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Good cork screw",
    "rating": "5.0 out of 5 stars",
    "content": "I had one similar to this, but it fell apart and bought this as a replacement. It seems more solid and certainly works well.",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Visually stunning as a gift, they loved it. Packaging was quite simple but well done.",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Visually Posh",
    "rating": "5.0 out of 5 stars",
    "content": "Having had a few of these models before, I can say that it works no differently than the others and appears to be a great value for the money so far. In terms of sturdiness, I'm knocking a point off the sturdiness factor in that it comes with this wimpy stand on which the bottle opener sort of hangs into via that metal rod at the front of it and the foil cutter feels cheap.",
    "post_time": "Reviewed in the United States on August 1, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Other than that though, it feels solidly constructed and I look forward to seeing if it lasts as long as it claims it will.",
    "post_time": "Reviewed in the United States on February 11, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Works as advertised",
    "rating": "4.0 out of 5 stars",
    "content": "This wine bottle opener  is fantastic. It has everything you need to open a bottle of your favorite wine.  Very easy to use and super sturdy. Also, it looks and and is a nice addition to my wine bar.",
    "post_time": "Reviewed in the United States on December 26, 2021",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "All we asked of this product was to remove the cork from a bottle of wine. It failed the test several times. We followed the directions without success. A wasted $25. Even more frustrating was the lack of phone number, address or website to contact for assistance.",
    "post_time": "Reviewed in the United States on March 26, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Never easier to open a bottle",
    "rating": "5.0 out of 5 stars",
    "content": "Edit: Managed to find a website to reach the company selling the product. Customer service has indicated they will solve the problem. Hope they do.  will report in again on the results.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Thanks to Amazon that put me in touch with the sellers. Within two days we received a replacement for the defective opener. The new one works perfectly and I can report that the person who worked on our case was pleasantly helpful. Thanks Amazon and",
    "post_time": "Reviewed in the United States on February 16, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Looks good but can't open a bottle of wine! Let’s take another look!",
    "rating": "5.0 out of 5 stars",
    "content": "Plastic housing broke after 14 months of use.  Otherwise functioned well.  Expense for an annual purchase item.",
    "post_time": "Reviewed in the United States on January 2, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The best I’ve found yet!",
    "post_time": "Reviewed in the United States on March 4, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Awkward to use",
    "rating": "4.0 out of 5 stars",
    "content": "It's pretty unstable when inserting the corkscrew.  I wish I had paid a bit more for the ones that grip the top of the bottle better.  Still, it does work.  With practice it does get better.",
    "post_time": "Reviewed in the United States on June 23, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Well..it worked for less than a year , now it's completely broken. Maybe they need a 2024 upgrade and a new product description!",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Is there a 2024 upgrade?!",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and great price",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Had to glue old one many times until I pitched it. I tried this opener. The product is working very well and easy to use. They stand by their product as well, many other companies don't - this is a great feeling after purchasing the product. Kudo's to them.",
    "post_time": "Reviewed in the United States on September 23, 2021",
    "pid": "B0999PNQPV"
},
{
    "title": "Winery tools",
    "rating": "2.0 out of 5 stars",
    "content": "Update:",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We have been using this now for 2.5 years and it is still holding together nicely and working well. We did have a few stubborn corks but I write that off to the winery/processor since the corks were very very tight.",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "As advertised - works well - easy to use Update",
    "rating": "4.0 out of 5 stars",
    "content": "Good product, company asked me if I was satisfied and checked if working as I wanted. I would recommend this product and kudos to the company.",
    "post_time": "Reviewed in the United States on October 12, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Bought this last September and then just broke today (the metal part of it actually cracked off)...worked very easily at first then as months went by it was more difficult to use, more stiff and required more exertion to use the opener. Had to rush out and buy a cheap opener today and that worked much much better than trying to wrestle with this thing. Not recommended.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Only lasted eight months...",
    "rating": "2.0 out of 5 stars",
    "content": "Took me a minute to understand it but once I got it I love it! Fancy. Good heavy duty quality.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good quality!",
    "post_time": "Reviewed in the United States on April 15, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Super Easy To Use",
    "rating": "5.0 out of 5 stars",
    "content": "I don't drink much wine, but I've bought it enough times that it's appropriate to relent and just buy a bottle opener (instead of the various inelegant ways I've gone about opening bottles before).",
    "post_time": "Reviewed in the United States on August 3, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This one checks all the boxes for me. It's easy to use, works well, has straightforward instructions, and looks nice. It even comes with a little stand and a plug for when I the bottle isn't finished the day it's opened.",
    "post_time": "Reviewed in the United States on April 29, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Corkscrew Opener Stand does not fit this product",
    "rating": "5.0 out of 5 stars",
    "content": "Opener seems sound enough but the stand it came is the wrong size. I have wasted time trying to figure out if I somehow have missed something.",
    "post_time": "Reviewed in the United States on December 5, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "UPDATE: Seller sent another opener, exactly the same problem. This appears to be a design issue, however, I remain happy with the opener itself.",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Easy to use, stress free — makes drinking a glass of wine even more special!",
    "rating": "4.0 out of 5 stars",
    "content": "I had one given to me by my sister in law as a gift and LOVED IT!  Used it with my brother and sister in law and they loved it and so bought one for them for Christmas!  It is wonderful!",
    "post_time": "Reviewed in the United States on November 14, 2022",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "great product",
    "post_time": "Reviewed in the United States on February 20, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "ease of use",
    "rating": "1.0 out of 5 stars",
    "content": "The unit is a little bulky and hard to store.  A stand is included to keep on counter top, but it takes up too much space, personally.  Mostly works pretty well, but sometimes hard to pull cork out.  i.e.; Plunging corkscrew into cork is easy, pulling it out is sometimes more challenging.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, works for what it is intended.",
    "post_time": "Reviewed in the United States on April 1, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Works, but bulky",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this as a gift for my husband, who has gone through several standard cork screws—they fail, the cork breaks, etc. Those are non issues with this device. It’s easy to operate, effective, sturdy, easily releases the cork for reuse. Very nicely presented in a gift style box. Great quality for the price. I find it to be much easier to use than a regular cork screw. Of all the gifts I got my husband for Christmas, he keeps thanking me for this one.",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I waited months to write this review trying to",
    "post_time": "Reviewed in the United States on September 22, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Best wine opener I owned",
    "rating": "5.0 out of 5 stars",
    "content": "Cork comes out easily with none of the struggling when using the waiters cork screw",
    "post_time": "Reviewed in the United States on March 28, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Product does exactly what it is suppose to do...Simple to use and looks just as pictured.",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Awesome Wine Cork Remover",
    "rating": "2.0 out of 5 stars",
    "content": "I bought it thinking that it could replace one that is similar. The old one lasted me 30+ years. This one \"Rattles\", it's loosely fitted. It is stained to look  and appear like it's made of a strong metal material. Feels light, as if it's made of plastic. Manufactured in China.",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Cheaply made. It does open a wine bottle but feels like it’s going to fall apart.",
    "post_time": "Reviewed in the United States on January 13, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Looks better in the picture than in real life",
    "rating": "3.0 out of 5 stars",
    "content": "We use it to open wine.  We have another one in our vacation home and love it.  It is very disappointing to have one break so quickly.",
    "post_time": "Reviewed in the United States on November 16, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "one broke after ten uses it jest came apart so I AM NOT HAPPY and I bought tow.",
    "post_time": "Reviewed in the United States on January 6, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Wouldn’t buy again",
    "rating": "3.0 out of 5 stars",
    "content": "While the box was pretty, the actual corkscrew was loose in multiple areas that u had to tighten manually. Also, when opening up a bottle of wine, you need to push the top lever as far down as possible or it won’t open up.",
    "post_time": "Reviewed in the United States on September 28, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The device is sturdy and it works a charm.  Also explains what you need to do if the cork won't come out.  The troubleshooting tips are great.",
    "post_time": "Reviewed in the United States on December 31, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "A pin has broken at the point where the piston goes up and down.  We have had it for a week.",
    "rating": "5.0 out of 5 stars",
    "content": "This is an upgrade to my previous one.",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s awesome.",
    "post_time": "Reviewed in the United States on January 28, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Do not purchase if you want Customer Service for your warranty",
    "rating": "1.0 out of 5 stars",
    "content": "This is the email I sent in regards to the broken wine opener on January 10 and have yet to hear back from anyone. They claim that there is a lifetime warranty on this wine opener but you cannot even get a hold of anyone so if you’re looking for someone that has Customer Service that is going to live up to their warranty, do not purchase this wine opener.",
    "post_time": "Reviewed in the United States on January 27, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m writing in regards to the wine opener I purchased in August. I believe I used it maybe 5 to 6 times when I went to use it the last time it was not usable I could not get my cork out of my wine was very very disappointed. A part of of the wine opener was dislodged from the rest of the wine opener and made it in operable. If you could please replace this item if you provide me with a return label, I will be happy to send this one back to you. Let me know what information you need and I will be happy to provide it to you, I have included pictures of the problem the best that I’ve could. I am also including screenshots of proof of purchase.",
    "post_time": "Reviewed in the United States on March 1, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Get’s the Wine to You",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent design. Takes up little space. Works easily and effectively. Highly recommend.",
    "post_time": "Reviewed in the United States on December 15, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have arthritis, which is hoping it makes it so much easier for me to open a bottle highly recommend it",
    "post_time": "Reviewed in the United States on February 1, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Very easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "Super easy to open bottles with.  Stury design.  Love it.",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good feel and weight- Solid and quality equipment for wine. Buy it.",
    "post_time": "Reviewed in the United States on April 12, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Very sturdy",
    "rating": "5.0 out of 5 stars",
    "content": "I had a Screwpull for 10+ years, when it died I got a Rabbit that I had for 10+ years. When that one died too, I was surprised to see all the available options. I bought this one because of the \"commercial grade\" claim, and it sure is a heavy duty one. It certainly is a very good value for the price.",
    "post_time": "Reviewed in the United States on March 22, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Don’t hesitate! Very easy to use.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Solid",
    "rating": "4.0 out of 5 stars",
    "content": "The first time or two that I use the corkscrew, it worked reasonably well.  Then, after 4 or 5 more uses. the corkscrew failed to penetrate the cork.  I no longer use the corkscrew since it does nothing but push the cork further into the bottle.",
    "post_time": "Reviewed in the United States on April 27, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very effective at removing a cork. Sometimes the cork doesn’t come off the screw but that’s probably me not using the corkscrew properly.",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "B0999PNQPV"
},
]