[
{
    "name": "        Wine Bottle Opener Corkscrew Set – Luxiluxy [2023 upgraded, does NOT break!] Including Foil Cutter, Bottle Stopper, Opener Stand and Extra Spiral - corkscrews wine opener set- wine opener kit       ",
    "stars": [
        "69%",
        "11%",
        "5%",
        "3%",
        "12%"
    ],
    "pid": "B0999PNQPV",
    "ratings": "2,092 ratings",
    "other_info": {
        "Material": "Stainless Steel",
        "Color": "Elegant Silver",
        "Finish Type": "Stainless Steel",
        "Brand": "Luxiluxy",
        "Item Weight": "1.1 Pounds",
        "Product Dimensions": "6\"L x 5.5\"W",
        "Is Customizable": "No",
        "Manufacturer": "Luxiluxy",
        "UPC": "759992982909",
        "Manufacture Year": "2023"
    },
    "discount_price": "$ 27.",
    "normal_price": "",
    "about_this_item": [
        " 【Unparalleled Quality! 15% Heavier & Solid】 The 2024 upgraded wine bottle opener set is made with Top Quality and Commercial grade stainless steel for long-term durability. It is 15% heavier and more solid than offered on the market (1.1 lb vs others' 0.95 lb or less), which means this opener will last longer!  ",
        " 【Easy to use & No broken cork!】 The classic corkscrew bottle opener is famous for extremely easy to use one-pull operation that ensures fast and smooth usage. Our spiral is specially coated with Teflon to ensure smooth pushing into the cork with one single pull. No more struggle with broken cork or openers!  ",
        " 【All you need perfect wine gift set】 This complete 5-piece wine accessories gift set includes an opener, foil cutter, stopper, stand, and extra spiral for replacement making it a complete set all you need!  ",
        " 【Luxurious package for gift】 It comes with a luxurious matte box engraved with a silver logo package; making it the perfect gift idea for wine lovers, men and women.  ",
        " 【100% satisfaction】 If you are unhappy for any reason, contact us and we will send you another set free of charge. This is the last wine opener you ever need!  "
    ]
},
{
    "title": "Super Easy To Use",
    "rating": "5.0 out of 5 stars",
    "content": "I don't drink much wine, but I've bought it enough times that it's appropriate to relent and just buy a bottle opener (instead of the various inelegant ways I've gone about opening bottles before).",
    "post_time": "Reviewed in the United States on August 3, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This one checks all the boxes for me. It's easy to use, works well, has straightforward instructions, and looks nice. It even comes with a little stand and a plug for when I the bottle isn't finished the day it's opened.",
    "post_time": "Reviewed in the United States on April 29, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Corkscrew Opener Stand does not fit this product",
    "rating": "5.0 out of 5 stars",
    "content": "Opener seems sound enough but the stand it came is the wrong size. I have wasted time trying to figure out if I somehow have missed something.",
    "post_time": "Reviewed in the United States on December 5, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "UPDATE: Seller sent another opener, exactly the same problem. This appears to be a design issue, however, I remain happy with the opener itself.",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Easy to use, stress free — makes drinking a glass of wine even more special!",
    "rating": "4.0 out of 5 stars",
    "content": "I had one given to me by my sister in law as a gift and LOVED IT!  Used it with my brother and sister in law and they loved it and so bought one for them for Christmas!  It is wonderful!",
    "post_time": "Reviewed in the United States on November 14, 2022",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "great product",
    "post_time": "Reviewed in the United States on February 20, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "ease of use",
    "rating": "1.0 out of 5 stars",
    "content": "The unit is a little bulky and hard to store.  A stand is included to keep on counter top, but it takes up too much space, personally.  Mostly works pretty well, but sometimes hard to pull cork out.  i.e.; Plunging corkscrew into cork is easy, pulling it out is sometimes more challenging.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, works for what it is intended.",
    "post_time": "Reviewed in the United States on April 1, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Works, but bulky",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this as a gift for my husband, who has gone through several standard cork screws—they fail, the cork breaks, etc. Those are non issues with this device. It’s easy to operate, effective, sturdy, easily releases the cork for reuse. Very nicely presented in a gift style box. Great quality for the price. I find it to be much easier to use than a regular cork screw. Of all the gifts I got my husband for Christmas, he keeps thanking me for this one.",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I waited months to write this review trying to",
    "post_time": "Reviewed in the United States on September 22, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Best wine opener I owned",
    "rating": "5.0 out of 5 stars",
    "content": "Cork comes out easily with none of the struggling when using the waiters cork screw",
    "post_time": "Reviewed in the United States on March 28, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Product does exactly what it is suppose to do...Simple to use and looks just as pictured.",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Awesome Wine Cork Remover",
    "rating": "2.0 out of 5 stars",
    "content": "I bought it thinking that it could replace one that is similar. The old one lasted me 30+ years. This one \"Rattles\", it's loosely fitted. It is stained to look  and appear like it's made of a strong metal material. Feels light, as if it's made of plastic. Manufactured in China.",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Cheaply made. It does open a wine bottle but feels like it’s going to fall apart.",
    "post_time": "Reviewed in the United States on January 13, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Looks better in the picture than in real life",
    "rating": "3.0 out of 5 stars",
    "content": "We use it to open wine.  We have another one in our vacation home and love it.  It is very disappointing to have one break so quickly.",
    "post_time": "Reviewed in the United States on November 16, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "one broke after ten uses it jest came apart so I AM NOT HAPPY and I bought tow.",
    "post_time": "Reviewed in the United States on January 6, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Wouldn’t buy again",
    "rating": "3.0 out of 5 stars",
    "content": "While the box was pretty, the actual corkscrew was loose in multiple areas that u had to tighten manually. Also, when opening up a bottle of wine, you need to push the top lever as far down as possible or it won’t open up.",
    "post_time": "Reviewed in the United States on September 28, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The device is sturdy and it works a charm.  Also explains what you need to do if the cork won't come out.  The troubleshooting tips are great.",
    "post_time": "Reviewed in the United States on December 31, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "A pin has broken at the point where the piston goes up and down.  We have had it for a week.",
    "rating": "5.0 out of 5 stars",
    "content": "This is an upgrade to my previous one.",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s awesome.",
    "post_time": "Reviewed in the United States on January 28, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Do not purchase if you want Customer Service for your warranty",
    "rating": "1.0 out of 5 stars",
    "content": "This is the email I sent in regards to the broken wine opener on January 10 and have yet to hear back from anyone. They claim that there is a lifetime warranty on this wine opener but you cannot even get a hold of anyone so if you’re looking for someone that has Customer Service that is going to live up to their warranty, do not purchase this wine opener.",
    "post_time": "Reviewed in the United States on January 27, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m writing in regards to the wine opener I purchased in August. I believe I used it maybe 5 to 6 times when I went to use it the last time it was not usable I could not get my cork out of my wine was very very disappointed. A part of of the wine opener was dislodged from the rest of the wine opener and made it in operable. If you could please replace this item if you provide me with a return label, I will be happy to send this one back to you. Let me know what information you need and I will be happy to provide it to you, I have included pictures of the problem the best that I’ve could. I am also including screenshots of proof of purchase.",
    "post_time": "Reviewed in the United States on March 1, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Get’s the Wine to You",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent design. Takes up little space. Works easily and effectively. Highly recommend.",
    "post_time": "Reviewed in the United States on December 15, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have arthritis, which is hoping it makes it so much easier for me to open a bottle highly recommend it",
    "post_time": "Reviewed in the United States on February 1, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Very easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "Super easy to open bottles with.  Stury design.  Love it.",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good feel and weight- Solid and quality equipment for wine. Buy it.",
    "post_time": "Reviewed in the United States on April 12, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Very sturdy",
    "rating": "5.0 out of 5 stars",
    "content": "I had a Screwpull for 10+ years, when it died I got a Rabbit that I had for 10+ years. When that one died too, I was surprised to see all the available options. I bought this one because of the \"commercial grade\" claim, and it sure is a heavy duty one. It certainly is a very good value for the price.",
    "post_time": "Reviewed in the United States on March 22, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Don’t hesitate! Very easy to use.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0999PNQPV"
},
{
    "title": "Solid",
    "rating": "4.0 out of 5 stars",
    "content": "The first time or two that I use the corkscrew, it worked reasonably well.  Then, after 4 or 5 more uses. the corkscrew failed to penetrate the cork.  I no longer use the corkscrew since it does nothing but push the cork further into the bottle.",
    "post_time": "Reviewed in the United States on April 27, 2023",
    "pid": "B0999PNQPV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very effective at removing a cork. Sometimes the cork doesn’t come off the screw but that’s probably me not using the corkscrew properly.",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "B0999PNQPV"
},
]