[
{
    "name": "        Ecolution Patented Micro-Pop Microwave Popcorn Popper with Temperature Safe Glass, 3-in-1 Lid Measures Kernels and Melts Butter, Made Without BPA, Dishwasher Safe, 3-Quart, Aqua       ",
    "stars": [
        "68%",
        "14%",
        "8%",
        "4%",
        "6%"
    ],
    "pid": "B09CX95397",
    "ratings": "68,467 ratings",
    "other_info": {
        "Brand": "Ecolution",
        "Color": "Aqua",
        "Capacity": "3 Quarts",
        "Material": "Borosilicate Glass",
        "Product Dimensions": "9.88\"L x 7.69\"W x 6.5\"H"
    },
    "discount_price": "$ .",
    "normal_price": "$49.99",
    "about_this_item": [
        " FAST GOURMET POPCORN: Choose beautiful, durable temperature safe borosilicate glass for better popcorn popping experiences. No oil or butter needed. Hot air circulates preventing burning. Melt butter with the dual function lid for gourmet results. Dishwasher safe for easy cleaning. A fun gift idea  ",
        " PREPARING AND SHARING: Great for a healthy snack, movie night, the big game or recipes including popcorn. Simply use the dual-function lid to measure the desired serving size, pour into the Micro-Pop and place in microwave for 3-minutes or less. Hundreds of fun and healthy snack recipe possibilities for your popcorn enjoyment.  ",
        " MONEY WELL-SPENT: Make homemade popcorn as an alternative to buying expensive single use prepackaged bags containing unwanted chemicals, ingredients, and calories.  ",
        " WHY GLASS IS BETTER: Watch your popcorn popping for perfect results. Temperature safe glass resists wear-and-tear and will not absorb acids or chemicals typically produced during use. Glass is made without BPA, hypoallergenic, and thermal shock resistant. Wide-mouth design and ergonomic handle add versatility and ease-of-use.  ",
        " USE AND CARE: For use with microwaves with turntables only. Only use popcorn popper in a clean, fully functioning microwave oven with unrestricted, rotating turntable. Do not use popcorn button or setting on your microwave. Make sure to use fresh popcorn kernels.  "
    ]
},
{
    "title": "This is great",
    "rating": "4.0 out of 5 stars",
    "content": "To have a way to add butter is a great idea.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is amazing.  I use it every night as my evening snack is always popcorn.  I love that I know exactly I am eating and that there are no additives.  I put a little butter in the cup before popping and it coats the popcorn just enough so that it holds the salt.  This is my second one because accidentally broke the first one after a few months.  I didn't want to be without one.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Wow!",
    "rating": "5.0 out of 5 stars",
    "content": "I like everything about this little guy. Hardly any un-popped corn. And I do add 1 tsp of flavored oil in the bottom without any problems. I do not melt butter on the top since that tends to burn unlike oil.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought the larger red popper. Not every kernel pops but that’s to be expected. The popcorn comes out delicious every time. The popper cleans very easily by hand and in the dishwasher. I bought another one as a gift for a family member.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Small popcorn microwave popper",
    "rating": "4.0 out of 5 stars",
    "content": "Product works exactly as described. Downside is that it leaves a lot of kernels unpopped and you can't repop them.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have 2 because I make popcorn for the birds and it works great 👍 I don't have to use oil.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Love it",
    "rating": "5.0 out of 5 stars",
    "content": "This popped is a unique design. Makes small portion. The kernels popped well. Does well in the dishwasher.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Have been using this for a while now and not too impressed.  If you put the butter on top when first popping then all the melted butter sits at the bottom and the kernels just sizzle.  Takes alot longer for popping.  And sometimes burns.  Oh another little hint, I saw this same popper in  Walmart cheaper!!!!!!",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Works Well Enough",
    "rating": "5.0 out of 5 stars",
    "content": "Great alternative when I don’t want a full bag of microwave popcorn to myself, and don’t want to burn the kernels on the stove. I like that I have control of what ingredients go in, if there’s any oil or butter, and how much salt, great for anyone with dietary restrictions. Instructions and fill lines are accurate, and I like the butter melting feature. Pretty colors. Holds up well in the microwave and the dishwasher. I kind of want a big one now as well.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It took a few tries to get the right amount of time for popping, but I love that it makes popcorn without all the fat and oil.  Makes for an easy healthy snack.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Works great as long as you don't follow the instructions!",
    "rating": "5.0 out of 5 stars",
    "content": "Directions say 2:30 to 3:00 minutes. I had to hit 20 and 30 seconds around 5-6 times and it still wasn't even done. I'll figure it out but other than that I think it's a great concept. You can pick your own popcorn, non GMO, Organic, or what have you as well as choose much healthier oils like, grass fed butter, ghee, coconut oil, etc.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It mays quick and easy batch of popcorn! Butter melts evenly throughout.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Makes great tasting popcorn!",
    "rating": "5.0 out of 5 stars",
    "content": "I have been using this bowl for more than a year now, and it works wonders. Popcorn tastes better than if you use a pot. In about 2-3 minutes, depending on your microwave, you will have the most amazing popcorn ever. Durable and high quality material",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wanted a popcorn maker that was not too big and just enough for a few servings. This popcorn maker is so easy to use and there is a measuring feature right in the lid. The popcorn pops very well. There are some kernels left over on the bottom, but that happens with most popcorn makers. It is very easy to clean as well.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Durable",
    "rating": "5.0 out of 5 stars",
    "content": "Got around black Friday at a great deal, I think $10. Great present",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The perfect gift for yourself or someone else. Works exactly as described and easy to clean.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Great!",
    "rating": "5.0 out of 5 stars",
    "content": "so cool!  easy to clean easy to loAd fast ACTING.  its great for everyone!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love love love this product!  No more chemical filled instant popcorn bags!  And we love adding different flavors after it's popped.  A household favorite for sure!",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Great",
    "rating": "5.0 out of 5 stars",
    "content": "Makes best popcorn for one!!  Perfect for me!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you like popcorn, but you don’t want to use oils to pop it in, and you’re not real sure what’s in the microwave stuff these days, this is for you! Just popped 3 qts of fresh popcorn with real butter melted over it in 3 minutes. No burning or scalding, and very few unpopped kernels left in the bottom. Excellent product!",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Update to (Too big).",
    "rating": "5.0 out of 5 stars",
    "content": "Too big for my microwave.  Had to remove the turntable to make it fit. Popcorn doesn't taste crunchy.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "PS. I tried adding more minutes to the microwave (6:30 mins) and it really tasted crunchy. So it's good for now.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Best I think",
    "rating": "5.0 out of 5 stars",
    "content": "It’s a gift",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The popcorn Popper works great.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Great Product",
    "rating": "5.0 out of 5 stars",
    "content": "Just don't over fill because it will start to burn for lack of space. I actually use a little less then the instructions say to. Otherwise I love it!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great for microwaving popcorn.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Works great",
    "rating": "5.0 out of 5 stars",
    "content": "It was very nice but very big. So we returned it. If big is what you want this would be great. Pretty blue too!",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "When the proper measured amount of popcorn is added, it pops very nicely without flying out all over the place.  Nice design of carafe.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Pretty and Functional",
    "rating": "4.0 out of 5 stars",
    "content": "I really like this product.  Super convenient way to cook popcorn for the family.  Only issue I had was that the first time I used it I put butter in the tray and it burned the popcorn down the middle of the container (admittedly we used vegan butter so that may well have been the issue).  I have not had that issue otherwise, and overall I would highly recommend this product.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The product came missing the pin that holds the bottom of the handle together as you can see in the picture but Amazon instantly sent me a new unit",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Love it but have to work with it",
    "rating": "4.0 out of 5 stars",
    "content": "The time they give you on instructions is not what you'll end up doing on any type of microwave. You'll have to mess around several times to find the sweet spot. Works well once you figure it out. Recommend.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for myself who lives alone and just wants a bowl of Popcorn. I bought the size that would fit in my small Microwave.  It wouldn't be difficult to make several serving as it only takes a few minutes to pop.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Works well for a single serving",
    "rating": "5.0 out of 5 stars",
    "content": "And putting butter on the cap gives you buttered popcorn",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love popcorn and I am always trying the reproduce the perfect movie theater popcorn. Till this day, this was the closest I could get to the movie theater popcorn. It’s really easy to clean too. The only downside is that the glass",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B09CX95397"
},
{
    "title": "This really works",
    "rating": "5.0 out of 5 stars",
    "content": "Is fragile and my husband and his light hands has already broken my previous one.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nice popcorn popper. Comfortable to hold. Easy to clean. Nice to have a butter dispenser but I don’t use that feature. Most all kernels pop. Recommend as a popcorn popper.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Movie theater popcorn",
    "rating": "4.0 out of 5 stars",
    "content": "No negative remarks on this little gem. I put the popcorn in the top to measure it, pour it in the container and put the microwave on two minutes and it is fully popped.  The other night I made three when the grandkids were here one after another and it still worked great.  Gives plenty to eat for one and no messy oils or popcorn flying all over with a air popper.  I love it and would recommend it highly.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Container easy to clean. No assembly required- take out of packaging, put lid on and done.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Convenient microwave popcorn popper",
    "rating": "5.0 out of 5 stars",
    "content": "My grandkids are in luv with this popcorn maker. They live to see the magic of it popping. U have to leav it a little longer than wat instructions say",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is consistantly good popcorn  I spray popped corn with avacado oil then I put on nutritional yeast (in place of butter  Then large amounts of spices including smoked paprika",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B09CX95397"
},
{
    "title": "This the easiest thing to use.",
    "rating": "5.0 out of 5 stars",
    "content": "I love this popcorn popper.  It is so easy to use.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love everything from the price to the size. I will gift it to someone and get the smaller size just for myself same perfect pink color",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Great size for a family",
    "rating": "5.0 out of 5 stars",
    "content": "I don't know if people know the toxic stuff that goes into bagged microwave popcorn aside from the fact microwave popcorn smells bad to me. Anyway this fixes that problem and results in the freshest popcorn ever without any chewiness to it. Love it for ease of use and freshness of the popcorn and no toxic bad microwave popcorn bag smell.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Suprised this actually works.  Works GOOD!",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Easy to use and delicious popcorn",
    "rating": "4.0 out of 5 stars",
    "content": "Experience will teach you what to do and not to do. For instance, when you add oil into the device before popping corn, the corn pops slower, and it does not pop as fluffy as if you pop it when the kernels are just dry. Also, melting butting in the lid while popping results in a less fluffy finished popped corn (in my experience). After popping, leave it for a few minutes to cool off! It gets very hot! No matter what settings I use, I can never get all the kernels to pop, but it is still okay. All-in-all, I like it.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Followed the directions the first time using and quickly realized I needed to make some adjustments.  The second time was perfect; had to adjust the timing for the smaller popcorn popper.  Love that I can control the amount of butter and that it melts while popcorn is popping.  This was a very good buy for me.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Amazing",
    "rating": "5.0 out of 5 stars",
    "content": "Makes the best popcorn I ever had",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I can't attest for how well the popcorn popper works because I purchased it as a white elephant party gift. The quality was great and I was actually sad to see the item go. However, I did hear back from the recipient and they liked the popper. I would encourage anyone to buy this as a gift for a host or gift exchange item. It was inexpensive while also feeling like a great quality item.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B09CX95397"
},
{
    "title": "It works well enough to use it.",
    "rating": "3.0 out of 5 stars",
    "content": "I eat popcorn every night and have been using a silicone one for the last few years, it needs to be replaced. This was cute and the right size, I put the same amount of popcorn I used to put in the other popper with same amount of time in microwave. Major problem is that when I use this my microwave stops working because it trips the GFCI in my kitchen. We use the microwave to heat or cook lots of things and it has never tripped the GFCI before. I’ve tried it several times with the same results.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I bought this because I saw it all over social media and my girlfriend and I love to eat popcorn while watching shows and movies. I grew up making homemade popcorn so I thought it be a good idea to get this one that everyone was raving about.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Live it.",
    "rating": "5.0 out of 5 stars",
    "content": "Takes a bit of experimenting to find the right time to match your microwave, but when you do, it's perfect. Love the butter cup!!! Buy it!",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Nice",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Nice",
    "rating": "5.0 out of 5 stars",
    "content": "With this microwave popcorn popper, I finally figured out how to pop my popcorn without burning it. Use water instead of oil or butter. That's right, water! I could never seem to pop my popcorn with oil or butter without burning it and end up having to throw it away.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Put about 2 tablespoons of water in the popper (don't add butter or oil), add popcorn kernels to cover the bottom, place the lid on the popper, and place the popper in the microwave to pop the corn.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Pop your popcorn with water? Yes, you sure can!",
    "rating": "5.0 out of 5 stars",
    "content": "I use the popcorn setting on my microwave, all microwaves are different so you will have to figure out how much time works for you. After your popcorn is popped you can add melted butter and enjoy.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "You're welcome 😁",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Excellent popper!",
    "rating": "4.0 out of 5 stars",
    "content": "I love this microwave popper! It is so easy to use! The popcorn was ALL popped and delicious !!! I am going to buy more of these and give them as gifts!",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Makes light fluffy popcorn. Just the right amount for one person (I capful of unpopped corn). Followed the easy directions, had about 10 - 15 unpopped kernals. I love that this is glass and I don't have to microwave my popcorn in plastic.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Best popcorn popper!",
    "rating": "4.0 out of 5 stars",
    "content": "Quickly pops corn as described. Have been using a hot air popper for decades, wanted something more efficient. Nice red color, arrived in a timely manner.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really like this popcorn popper.  its very easy to clean and use.  it might be the popcorn i am using, but it everytime i use it i have burned popcorn and quiet a few unpopped kernels.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Works perfectly—LOVE LOVE LOVE IT!!",
    "rating": "5.0 out of 5 stars",
    "content": "I love everything about this. I love that my popcorn is being popped inside a glass container (the only plastic being the tiny lid at the top). I love that it’s full proof. It pops my popcorn in three minutes, with about 10 kernels left unpopped. That’s a very good ratio. I love that I don’t have to pop my popcorn with oil anymore, making it a healthier snack. (I sprinkle cinnamon on my popcorn and just the tiniest smidgen of salt, so I tell myself it’s health food, LOL.) Anyway, this thing works like a dream. Perfect for a generous serving for one person (but I suspect for two people you might want two cycles with it). Just buy it, you won’t regret it. PS-I got the pale aqua color, which is really lovely, but there are lots of other colors as well. Whatever floats your boat!",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Had to replace this popper after only 2 weeks due to cracking the top edge when it bumped next to another item in the dishwasher.  However, it does an excellent job of popping corn.  So, I ordered another one.  Now I am much more careful about handling the popper and washing by hand.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Glass is very fragile.  Particularly around the top edge.  Be very careful when washing and drying.",
    "rating": "5.0 out of 5 stars",
    "content": "I used the product to pop popcorn in my microwave!  Works well and as described!",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "get a good quality popping corn put the butter on the top. Throw it in the microwave. Enjoy a good movie with your delicious popcorn.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Product is as described.",
    "rating": "5.0 out of 5 stars",
    "content": "So easy to use and perfect for a quick snack.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First of all Popcorn is a whole grain and a good source of fiber and low in calories as a snack. I used to get the bags for the microwave and then started to read the ingredients, where the kernels where from and was appalled so started to look for healthy alternatives. First bought nongmo organic popcorn and used a pot on the stove to pop it and it didn't turn out so well.  Then found this glass popper for the microwave which is essentially like using the popcorn bags but now controlling the type of popcorn that I can use. Buy nongmo organic bags of popcorn kernels. I'm super happy with this popper but let me give you some tips for success.",
    "post_time": "Reviewed in the United States on February 17, 2024",
    "pid": "B09CX95397"
},
{
    "title": "popping delight",
    "rating": "5.0 out of 5 stars",
    "content": "1. Do not add butter to the top of the cover as it will end up burning anyway before all the kernels are finished popping and taste bad. Add it after.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "2. Add fewer kernels than you think maybe half the top measure otherwise you will get burnt kernels before the last ones are popped. If you need more just do two sessions.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Easy to clean.",
    "rating": "5.0 out of 5 stars",
    "content": "3. Use the high power on  the microwave for 3 minutes. Place the popper in the dead center of the microwave tray, not rotating around the edge. That's very important.  You will then get the kernels popping the fastest and get a good batch. As soon as you hear the first 3 second lag of popping hit the stop button if there's too much time left. Be prepared to expect that some kernels may not be popped. Discard them as they are not reusable but hopefully you get better at guaging the pop level. Popping too long will result in yucky burned popcorn making good popcorn smell and taste bad so better to sacrifice some unpopped kernels for better popcorn.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "4. Although I've given you advice it may take a few sessions to get good at it so don't give up. I like the fact that the popcorn is being popped in a glass popper, not fried in a pot, not popped in a bag with who knows what chemicals are in it.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Pop-tastic!",
    "rating": "5.0 out of 5 stars",
    "content": "Yeah, the one in the pic is dirty. That’s because I use it all the damn time. Great way to have a clean, portion controlled snack on hand. Buying several more for stocking stuffers and fun gifts to have on hand.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So cute and works great , love how easy it is to use, the girls at work love having our popcorn snack without the chemicals from bags so now we have healthy popcorn",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B09CX95397"
},
{
    "title": "So cute",
    "rating": "5.0 out of 5 stars",
    "content": "It made perfect popcorn the very first time.  Delightful design and very easy to clean. No more bag popcorn for me!",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this thing. I use it regularly cause I love popcorn as a snack but wanted something healthier than microwave popcorn. I bought one for my mother and she loves it as well.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Absolutely love this!",
    "rating": "5.0 out of 5 stars",
    "content": "Not only does it make popping popcorn easy it is just right for one serving, and it is cute!",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just the right size for a single serving. Love that my ghee just melts from the tray on top to coat the popcorn. Well made! I do hand wash it. I found that 1½ to 2 mins to pop completely is good. However, keeping eye on it just in case.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Great popcorn popper",
    "rating": "5.0 out of 5 stars",
    "content": "Love this popcorn popper. Individual serving, that you can add butter and salt, or not. Pop in the microwave in less than two minutes",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I chose red, to go with my kitchen. I like the way it has a top that i can measure the popcorn, and melt the butter. It is just big enough for one cup of popcorn. Easy to clean. Very sturdy it pops quickly don’t have to wait too long. I would recommend it to my friends.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B09CX95397"
},
{
    "title": "So easy to use!",
    "rating": "5.0 out of 5 stars",
    "content": "I have both the 1.5 quart and 3 quart sizes. If you have a smaller microwave you probably need the smaller one, but otherwise the larger one is great. I've used mine almost daily for more than a year and haven't had any issues.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B09CX95397"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have not used this yet but it appears very sturdy, thick glass. Reminds me of a coffee pot. I will follow up when i have used it.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B09CX95397"
},
]