[
{
    "name": "        kelamayi Upgrade Broom and Dustpan Set, Large Size and Stiff Broom Dust pan with Long Handle, Upright,Ideal for Indoor Outdoor Garage Kitchen Room Office Lobby Use (Green)       ",
    "stars": [
        "67%",
        "17%",
        "9%",
        "3%",
        "4%"
    ],
    "pid": "B09LTY6RR3",
    "ratings": "36,537 ratings",
    "other_info": {
        "Brand": "kelamayi",
        "Color": "Green",
        "Recommended Uses For Product": "Floor Cleaning",
        "Bristle Material": "Polyethylene Terephthalate (PET)",
        "Handle Material": "Stainless Steel",
        "Bristle Type": "Unflagged Bristle",
        "Special Feature": "Stain Resistant",
        "Surface Recommendation": "Hard Floor",
        "Included Components": "Dustpan",
        "Product Dimensions": "11\"W x 51.18\"H"
    },
    "discount_price": "$ 26.99",
    "normal_price": "$39.99",
    "about_this_item": [
        " Extendable Pole Design: The optional extension pole makes the broom length from 38.18 to 50.39 inches, People can choose the appropriate length according to their height. And long handle allow you to Stand upright for comfortable sweeping. NO MORE BENDING!  ",
        " Heavy duty Broom bristles: Upgraded four-row bristles design, high quality broom bristle construction, More dense and durable. Eco-friendly fiber made from recycled PET bottles. Kelamayi insists on working hard to protect the environment.  ",
        " Easy Stand-up Storage: The clip-on feature makes the broom and dustpan upright a perfect space safer! Compact storage keep your home or work space clean and tidy. Works perfectly for multi-surface, Suitable for indoor use.  ",
        " Self-Cleaning Dustpan Teeth: Built in scraper and comb/Teeth for easy to Clean Broom into Dustpan , Clean Pet Hair and Human Hair with one Pull on the Teeth. The rubber lip of the dust pan is flush with the floor and the teeth clean out the bristles easily.  ",
        " Our mission: Make your live cleaner, and make your housework easier.  "
    ]
},
{
    "title": "Clean sweep!",
    "rating": "5.0 out of 5 stars",
    "content": "Love the color and sleek design.  Feels a bit stiff to maneuver.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Looks a little \"cheap\".  Works good and rte. tines clean the hair out of the broom really well.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Does a great job!",
    "rating": "4.0 out of 5 stars",
    "content": "this broom is very light, sweeps well, and easy to move around. I’m not sure about how sturdy it is because it’s so light, but it was easy to put together and I like that it folds up for storage.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this for my wife's 70th birthday as a joke present but she thinks it is wonderful",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "light sweeper",
    "rating": "5.0 out of 5 stars",
    "content": "We cook a lot and have two cats. Bending over to use the normal dust pan was really difficult with my herniated disk, but this works great.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have osteo arthritis in my hip and leg and it is very hard for me to bend to pick anything up from the floor. I have a cat and this is great to sweep and get all the hair off the brush!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Good dustpan and brush",
    "rating": "4.0 out of 5 stars",
    "content": "The broom is a little short. I like the color",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I really love the light green color and it nice enough to store in a corner instead of storing it in a closet. It is smaller than I thought, but works fine for light sweeping. Assembling was not difficult, but wished that the manufacturer would have added stickers to naming the separate poles. Bagging a single combined assortment of poles that were A1 through A3 and then B1 through B4 is not the best friendly user kind of instructions.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Back saver",
    "rating": "4.0 out of 5 stars",
    "content": "Not too bad, but the tubing for the handle could be more sturdy, as well as the connectors being metal rather than plastic. When I use the broom, it sometimes bends or loosens at the joints.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Sturdy broom AND dustpan.  The cleaning teeth are deep and sturdy enough to pull the broom through unlike others I have owned.  It is so much more effective than others and makes it easy to quickly spot clean and sweep up. Stores neatly away, too.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Good quality",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this as a work item, I’m a cleaner! It’s works very well & I love that the broom connects to the dust pan. It keeps me from having to bend over to sweep the dirt into the pan. Plus, it’s easy to transport! I highly recommend it!",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "How does anyone live without one of these? My advice is to get one for inside and outside.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Absolutely necessary",
    "rating": "5.0 out of 5 stars",
    "content": "I love this broom and dustpan set!! Very sturdy and made well. Takes the pain of bending over to sweep up the trash into the dustpan. Love the color!",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Doesn’t seem to be bent and dirt actually goes inside the dustpan. The dust pan handle stays upright without falling and stands in the corner without wobbling falling. The clip holds the broom securely. No complaints.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Very sturdy broom and dustpan",
    "rating": "5.0 out of 5 stars",
    "content": "I love this set. The previous one was really short and would make my back hurt from bending over while sweeping. The added bonus of the scraper to clean broom. Fast shipping and great product.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Broom works as expected. Item stands without falling down and it really does clean brush with the groves on dust pan. Just be careful when emptied.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Works nice",
    "rating": "5.0 out of 5 stars",
    "content": "I bought two of these because I love it so much.  It’s so easy to store.  It grabs dirt and especially hair very well and easy to dispose.  It’s is well made and I really prefer using it over all other brooms.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is really a set of broom and dustpan. When I received the package, I thought it was a false advertisement. The package was so small and I thought there wasn't a broom inside. The handle was connected with 3 (dustpan) or 4 (broom) short pieces. After one screw the pieces together with hand tight, the handle is sturdy.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Great!",
    "rating": "4.0 out of 5 stars",
    "content": "Would be nicer with a better quality metal for the handles",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "cute color, easy to put together, does the job, and a great height!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Great combo!",
    "rating": "5.0 out of 5 stars",
    "content": "High quality, soft but firm bristles, very sturdy handle & dustbin, thick dustbin, good capacity, excellent self cleaning feature. Surprised how nice this turned out to be.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I had a very old IKEA waist high sweeper set, which had a comfortable ergonomic handle (which I miss) - this new sweeper set is a little taller than I would prefer (and I have it on the shortest setting) - I wish the manufacturer would shorten by at least 3 more inches (and I am 5’7” tall, so I am not short!) and consider a more comfortable and ergonomic handle (so we don’t have to twist our wrists as much while sweeping.)  With that said, I do like the hard and sturdy bristles on the brush, and the fact it’s so narrow, it get in cracks well. I don’t think the “hair remover” comb on the base is necessary. I still have to manually pull off residual long hairs, so it’s not very efficient. I do like the deep well that debris goes into, and it’s easy to empty its contents into the trash. I wish you would consider even more colors to choose from. A light gray color would be nice (I have the dark gray.)",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Good, but…",
    "rating": "5.0 out of 5 stars",
    "content": "I bought the first one for a family member and they really liked it, so I got one for myself as well.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "its great for height adjustment and the extra wide pan makes it easy to catch everything.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Light and adjustable",
    "rating": "4.0 out of 5 stars",
    "content": "Mostly I like it because you don't have to bend down to use the dustpan.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Not sure about its durability in an industrial setting, but it's perfect for home use.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Good product",
    "rating": "4.0 out of 5 stars",
    "content": "Can stand on its own. Sturdy. Would have preferred a different color.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The poles don't really stay tight. Works. But annoying.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Works but....",
    "rating": "5.0 out of 5 stars",
    "content": "Works well.  Teeth on the pan to clean off the broom are great.  Would have given 5 stars but broom handle is too short,  otherwise pleased.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love that I don’t have to bend over to use this broom and that the comb on the dustpan easily cleaned the hair out of the broom. I just wish the broom head was a little wider and sturdier.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B09LTY6RR3"
},
]