[
{
    "name": "        kelamayi Upgrade Broom and Dustpan Set, Large Size and Stiff Broom Dust pan with Long Handle, Upright,Ideal for Indoor Outdoor Garage Kitchen Room Office Lobby Use (Green)       ",
    "stars": [
        "67%",
        "17%",
        "9%",
        "3%",
        "4%"
    ],
    "pid": "B09LTY6RR3",
    "ratings": "36,576 ratings",
    "other_info": {
        "Brand": "kelamayi",
        "Color": "Green",
        "Recommended Uses For Product": "Floor Cleaning",
        "Bristle Material": "Polyethylene Terephthalate (PET)",
        "Handle Material": "Stainless Steel",
        "Bristle Type": "Unflagged Bristle",
        "Special Feature": "Stain Resistant",
        "Surface Recommendation": "Hard Floor",
        "Included Components": "Dustpan",
        "Product Dimensions": "11\"W x 51.18\"H"
    },
    "discount_price": "$ 26.99",
    "normal_price": "$39.99",
    "about_this_item": [
        " Extendable Pole Design: The optional extension pole makes the broom length from 38.18 to 50.39 inches, People can choose the appropriate length according to their height. And long handle allow you to Stand upright for comfortable sweeping. NO MORE BENDING!  ",
        " Heavy duty Broom bristles: Upgraded four-row bristles design, high quality broom bristle construction, More dense and durable. Eco-friendly fiber made from recycled PET bottles. Kelamayi insists on working hard to protect the environment.  ",
        " Easy Stand-up Storage: The clip-on feature makes the broom and dustpan upright a perfect space safer! Compact storage keep your home or work space clean and tidy. Works perfectly for multi-surface, Suitable for indoor use.  ",
        " Self-Cleaning Dustpan Teeth: Built in scraper and comb/Teeth for easy to Clean Broom into Dustpan , Clean Pet Hair and Human Hair with one Pull on the Teeth. The rubber lip of the dust pan is flush with the floor and the teeth clean out the bristles easily.  ",
        " Our mission: Make your live cleaner, and make your housework easier.  "
    ]
},
{
    "title": "Absolutely a Back Saver ! Works Awesome!",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased 2, a black one for the back porch and the green one for inside. I have a spinal injury that keeps me in way to much pain to bend and my 78 year old Uncle whom I share a home with can hardly bend over himself.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This broom dustpan combo is amazing. The broom is tall enough so we don't have to bend to sweep and the dust pan just sits in an upright position while you sweep dirt, hair and whatever else in it and it holds alot. Once I need to dump it I just pick it up and turn it upside down above the garbage can still not having to bend to even do that. Once finished sweeping I just attach the broom to the dustpan and the entire dustpan and broom stay in an upright position ready for you to just grab next time. I absolutely couldn't live without one of these, now that I know what it's like to have them.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "I love the Dustpan",
    "rating": "4.0 out of 5 stars",
    "content": "The dust pan is great. I especially love how it says in the upright position by itself and the bin part doesn't flop around on the end of the handle.  The cleaning 'teeth' are great because I have pets and I don't like having to constantly pull fur off the end of my broom.  Okay, so that is the dust pan.  The broom is another story.  I am not a fan. First of all, it's not long enough. I'm 5'5 and it's too short for me. It needs to be about 6 inches longer to be comfortable. Next, it won't stay screwed together. I'm constantly needing to tighten it (it comes in multiple short pieces and gets twisted together). It's very lightweight, which some people might find is a plus. I don't. I want more heft to it. Lastly, the bristles are cut straight across.  I prefer my broom bristles to be angled. It's more comfortable to sweep that way.  I would buy this again just for the dustpan.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I just received this product yesterday.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Small but very capable",
    "rating": "5.0 out of 5 stars",
    "content": " After I spent the morning looking all over my house trying to find a broom, I went online and made this purchase. Lucky me, it was delivered the same day.  If your house is anything like mine, I have someone who lives here by the name of, I Don't Know.  If I can't  find anything, I Don't Know has it.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's smaller than I expected, when I received the box, I was very sceptical.  I looked at the directions for putting it together, easy breezy.  After putting it together, I went outside to tackle the job I wanted to take care of that morning; the birdseed the little feathered friends had scattered all over the concrete under their feeder.  The bristles are nice and sturdy.  The width of the broom is not very wide, hence the measurement noted in the product description.  The pole felt nice and sturdy, but light weight When putting it together, I made sure to twist the sections together tightly so they wouldn't come apart while I was using the product.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Bought for my husband...it kept stealing mine",
    "rating": "5.0 out of 5 stars",
    "content": "The dust pan has a nice rubber lip so that when you swep the debris in, there isn't a bunch gathered near the edge of the pan.  I love that I can run the broom through the teeth of the dust pan to clean out the bristles.  This comes in so handy when sweeping outside.  I hate having to pull junk out of the bristles, especially cobwebs.  I haven't had to do that at all.  After I swept up the birdseed, I was all over the backyard sweeping up little bits here and there, just to try out my new broom and dust pan.  This is perfect for small jobs around the house or yard, if you have bigger jobs to tackle, you'll want something bigger.  When my husband saw it, he wanted to know where I got it, so I sent him the link so he can buy his own.  If anyone touches this one, there will be bodily harm.  Just kidding, maybe.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have a fairly small broom and dustpan and my husband kept stealing it and taking it downstairs.  So I decided to buy him one that was taller and it could use on the indoor/outdoor carpet in our basement.  He loves it and has quit stealing my little one but now I am tempted to steal his because it is taller.  It was a little difficult to get together but once I looked carefully at the instructions I understood where the poles went. I was somehow making it more difficult then it needed to be.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "My perfect broom",
    "rating": "5.0 out of 5 stars",
    "content": "I have a huge shedding dog in a tiny home. This broom picked up all the dog hair and cleaned the broom with the teeth of the dustpan. I can sweep dirt right out the door and sweep my steps as it can be used indoor/outdoor. The broom hooks to the dustpan. If you're a senior or have problems bending over this broom is for you. The best broom I have bought. It came on time after hurricane Helene and during Milton!",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "We sort of needed a new broom in the house and I kept forgetting to pick one up at WalMart, or I saw the price and figured I'd look for an alternative.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Broom and dust pan",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent quality.  The broom fits on the dust pan and it has a thing on the pan that actually cleans the broom.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I thought it was a design but it has a purpose. I would definitely buy again",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Gift",
    "rating": "5.0 out of 5 stars",
    "content": "Bright this for my daughter. She said, it was just what she needed. Glad I purchased to make her life easier. Thinking about getting another",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Works great -- broom is good sweeper and allows you to put what you've sweeped up into the dustpan",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Very handy & effective",
    "rating": "5.0 out of 5 stars",
    "content": "w/o having to bend over.  Study and doesn't take much space to store.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Small and compact. Love the teeth to remove the built up hair and gunk. Works great!",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Perfect for apartment",
    "rating": "5.0 out of 5 stars",
    "content": "The broom and dust pan is sturdy and nice quality compared to others I have seen.  It folds up nicely allowing it to fit in a closet or corner.  I'm very happy with the product, and it is worth the cost and also easy to assemble.  Thank you for a quality product.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I got this several weeks ago and I love it!  I can actually sweep up the floor and never bend!  I am facing a fusion in my lower back and have much pain: however, this is another product that allows me the freedom to do some things I otherwise could not. 5 stars!!!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Sturdy and nice quality",
    "rating": "4.0 out of 5 stars",
    "content": "This is the best for cleaning up pet hair.  The swiffer was a pain, because I was always bending over, cleaning off the swiffer head.  This dustpan has 'teeth' on the front to clean the broom contents directly into the dustpan.  Saves time, AND my back. ... and meant I didn't have to empty the vacuum bag as often when I vacuum.  I also love that it's adjustable in length -- and that it can be extended to a typical broom handle length.  Finally, the dustpan folds up, and the broom clips to the dustpan handle to place out of the way.  Highly recommend.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We purchased this during the summer prime day. We keep one on each floor of the house. Product is great for sweeping up in the bathrooms and under the kids beds.  The dustpan has that awesome self cleaning options.  That really comes in handy cleaning up after a large family and pets.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Compact but Sturdy!",
    "rating": "5.0 out of 5 stars",
    "content": "My boyfriend was very skeptical about this broom working because it came in a very light, small, & compact box. I on the other hand, had a lot of faith— And I loved that the color matched some walls in my house as well! It came with very easy to read instructions on how to put it together. I am loving the bristles, The fact that it stands up on its own without being shaky or flimsy, and everything about it. So far a great buy!",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I LOVE this product!!! The only thing I can say wrong is I’ve only had it for about a month or so and the dust pan is already warped and I store it out of everything’s way. But other than that I love the broom and how well the bristles pick up the dog hair and teeth on the dustpan!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Great broom and dustpan combo",
    "rating": "4.0 out of 5 stars",
    "content": "I wanted to really love this because of the broom and the long handled dustpan and for the most part I do, but because the handle screws together every time I use it and put a little bit of pressure on it it comes loose where it connects. At some point, maybe I can use superglue to hold it together or tape the broom handle so it’s not so annoying",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Our house eats dustpans like some houses eat socks. So I got this combo broom and dustpan thing, and it makes it impossible to lose the dustpan. I like the little teeth that pulled the junk off the broom into the dustpan. I never knew I needed something like that!",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Almost perfect",
    "rating": "4.0 out of 5 stars",
    "content": "Works well just that it keeps unscrewing so it sometimes feels loose while using and you have to tighten it each time before and during sweeping otherwise it’s good.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Solidly build so it should withstand heavy use. Storage is easy and takes up minimal space. Most importantly, the soft rubber “ramp” leading into the dirt collector lies flat on the floor making it easy to sweep dust/dirt into the bin.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Keep losing dustpans",
    "rating": "4.0 out of 5 stars",
    "content": "Although the broom brush is a bit small leading to longer cleaning up time, it does seem to do a decent job getting dirt off the floors. I would love for an extra inch of brush on each side and then I’m sure it would be a 5/5",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the best broom it has the dust pan  that gets all the stuff off the broom when you finish sweeping so you don’t get that nasty broom bottom!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "It’s convenient",
    "rating": "5.0 out of 5 stars",
    "content": "Best broom and dust pan set we’ve ever owned. Kinda mad we didn’t buy one sooner. Feels heavy duty and just an all around great product. Would buy again for sure!",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The broom bristles are a bit stiff for my liking but it serves its purpose.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Perfect for pantries and classrooms",
    "rating": "5.0 out of 5 stars",
    "content": "Super durable, lightweight, fits well in a broom closet. I use it in my classroom and my fifth graders have a great time sweeping the floor. It’s been through the wringer and it’s still looks almost brand new.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this because my other dustpan left stuff on the floor whenever I used it.  This dustpan makes great contact with the floor and I don't have any problem with residue being left on the floor.  The broom is okay but that's not why I bought it.  I bought it for the dustpan and am very satisfied with my purchase.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Dustpan does not leave stuff on the floor",
    "rating": "4.0 out of 5 stars",
    "content": "Broom isn't the best but it's handy",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this set. The broom and dust pan came in a simple not heavy box. They were easy to assemble and easy to store. They are easy to use and the broom is long enough so I don't have to bend over to sweep. The dust pan is great not too big to store and not too small so I am able sweep up everything in one swoop. Great value and I use it every day!! I definitely recommend this product.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Handy",
    "rating": "4.0 out of 5 stars",
    "content": "Love the design. Bought two of them. They come in great color options and tilt easily for maximum debris collection and store efficiency.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very happy",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Great Broom and Dust pan Set",
    "rating": "5.0 out of 5 stars",
    "content": "My evening was interrupted by my wife crying in the kitchen.  She dropped a glass and cut herself trying to sweep it up.  That night I came across a video about new products and it had this dustpan and broom set on it.  I ordered one and we threw away the old stuff we had.  Super easy to use, and the \"teeth\" on the dustpan let you get those stupid dust balls off of the broom without having to pull them off by hand and make a new mess.  Well worth the money!",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this set because at my age I don’t have to bend down and sweep up the dirt I just swept. I recommend it to senior citizens like me!",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Space saving",
    "rating": "4.0 out of 5 stars",
    "content": "I work in an elementary school library and this has held up nicely even with students using it to clean up messes. We love how the handle has a holder for the broom to keep them together.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A note asked anyone who had any problem should contact them, but gave no way to do so.  Assuming it was from China I doubt anyone would try.  Good thing I'm short, so a missing link in handle of dust pan isn't going to bother me.  I used it on my 'pretend' wood floors and I liked it.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "So Happy I bought  it",
    "rating": "5.0 out of 5 stars",
    "content": "definitely appreciate the broom but the dustpan is the real winner!  It doesn't leave any particles behind.  Thanks for finally designing a dustpan that is truly functional",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent quality and pricing for a very functional dustpan and brush set. Adjustable shafts, heavy duty quality dust bin.  I am very pleased with this purchase, highly recommended.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Great Purchase!",
    "rating": "5.0 out of 5 stars",
    "content": "I like the broom because it seems to pick up alot,  also the dustpan picks up everything because of the rubber edge.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for my classroom, my grandma, and again for my home. It’s easy to assemble, the bristles are sturdy and good quality. Both the broom and dust pan are a good height and it cleans well! I appreciate how lightweight it is as well.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "The broom is lightweight and sweeps well",
    "rating": "5.0 out of 5 stars",
    "content": "This is my favorite broom/dustpan. It works ana inc at keeping hair/outfit in the dustpan. I use this almost every day. Highly recommend!",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought one for me and then one for a friend as a gif,t, is great for removing hair/dust balls off of the brush. Love that the bucket folds upwards, space saver for when not in use!",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Love it so much I’ve bought 3",
    "rating": "5.0 out of 5 stars",
    "content": "I bought it for the cute color but I love it for how practical it is.It was easy to assemble. The handles are long so I don't need to hunch over. The fungers on it are great at cleaning the dust bunnies off the broom bristles. It is also easy to store since the bucket folds up.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really love this broom and dustpan!  I have the knees and back of a well-lived long life and with this design I never have to bend down to the floor on my knees and use a dustpan and brush anymore. The standup broom can be slid through teeth on the dustpan to clean out the broom’s bristles, too!  It is so much easier to just sweep and cleanup with this standup design.  The dustpan bends upward when you are done cleaning so you can attach the broom with the ‘grabber’ attachment to the broom to keep them nicely together in less space, another plus!",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Easy cleanup",
    "rating": "4.0 out of 5 stars",
    "content": "Small but works ok",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The brush is picking up crumbs and dust. The dust pan edge efficiently collect s all of the debris. Easy to assemble.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "It’s great! Easy to clean up",
    "rating": "4.0 out of 5 stars",
    "content": "I love everything about this product except one thing, it is not as easy to adjust as advertised. You have to screw and unscrew metal parts everytime you want to adjust it, to the point where it’s just easier to leave it how it is most the time.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It is very nice and lightweight, easy to assemble, and very sturdy once that easy assembly is done! Also is very useful to get the debris out of the broom while cleaning as it has the remover thing on the dustpan! I have been looking at this type of product for almost a year and buying this one has not disappointed me!",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Broom set",
    "rating": "5.0 out of 5 stars",
    "content": "Enjoying the set but it could be a little more sturdy having to screw so many pieces together makes it a little on the side, but it’s still a very nice set",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really wasn't expecting this broom to work as well as it does. Since it screws on it tends to unscrew just a bit and we have to keep tightening it back on but it grabs the trash well even the smallest dust",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Sturdy",
    "rating": "5.0 out of 5 stars",
    "content": "Love this broom, I have arthritis really bad in my back. The broom sweeps really well, the teeth on the dustpan clean the broom well. I have three cats so need them. and I don't have to bend over to use a dustpan. It doesn't take a rocket scientist to put it together. hope it last my lifetime love it.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Every time I use this broom it makes me think of the folks sweeping the sidewalks at WDW - except without all the throngs of people. So, I whistle while I work!  C'mon, it's a broom and dustpan, and it works.  It stands up on its own, and my wife is happy.  Happy wife, happy life.  But a trip to WDW would make her happier!  So make your wife happy and buy her one of these brooms with a cool little dustpan.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "broom",
    "rating": "4.0 out of 5 stars",
    "content": "I am 5’2” and the height of the dustpan piece and the height of the broom as shown on be by by  are juuuust right. As of now, no complaints. It has been good at picking up husky hair.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good product, but the handles CAL wobbly",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "I know this is Amazon, but It's Like Disney Magic!",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this as a work item, I’m a cleaner! It’s works very well & I love that the broom connects to the dust pan. It keeps me from having to bend over to sweep the dirt into the pan. Plus, it’s easy to transport! I highly recommend it!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "How does anyone live without one of these? My advice is to get one for inside and outside.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Very sturdy broom and dustpan",
    "rating": "5.0 out of 5 stars",
    "content": "I love this broom and dustpan set!! Very sturdy and made well. Takes the pain of bending over to sweep up the trash into the dustpan. Love the color!",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this set. The previous one was really short and would make my back hurt from bending over while sweeping. The added bonus of the scraper to clean broom. Fast shipping and great product.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Great!",
    "rating": "4.0 out of 5 stars",
    "content": "Broom works as expected. Item stands without falling down and it really does clean brush with the groves on dust pan. Just be careful when emptied.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought two of these because I love it so much.  It’s so easy to store.  It grabs dirt and especially hair very well and easy to dispose.  It’s is well made and I really prefer using it over all other brooms.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Works great.",
    "rating": "5.0 out of 5 stars",
    "content": "This is really a set of broom and dustpan. When I received the package, I thought it was a false advertisement. The package was so small and I thought there wasn't a broom inside. The handle was connected with 3 (dustpan) or 4 (broom) short pieces. After one screw the pieces together with hand tight, the handle is sturdy.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Would be nicer with a better quality metal for the handles",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "I bought another one!",
    "rating": "5.0 out of 5 stars",
    "content": "cute color, easy to put together, does the job, and a great height!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love the color and sleek design.  Feels a bit stiff to maneuver.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "compact and adjustable",
    "rating": "4.0 out of 5 stars",
    "content": "Looks a little \"cheap\".  Works good and rte. tines clean the hair out of the broom really well.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "this broom is very light, sweeps well, and easy to move around. I’m not sure about how sturdy it is because it’s so light, but it was easy to put together and I like that it folds up for storage.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Good dustpan and brush",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this for my wife's 70th birthday as a joke present but she thinks it is wonderful",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It sweeps good and I love you can get hair and other stuff in it’s the broom on the teeth of the of the dust pan. Sturdy.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Awesome broom",
    "rating": "5.0 out of 5 stars",
    "content": "We cook a lot and have two cats. Bending over to use the normal dust pan was really difficult with my herniated disk, but this works great.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have osteo arthritis in my hip and leg and it is very hard for me to bend to pick anything up from the floor. I have a cat and this is great to sweep and get all the hair off the brush!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Back saver",
    "rating": "4.0 out of 5 stars",
    "content": "The broom is a little short. I like the color",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I really love the light green color and it nice enough to store in a corner instead of storing it in a closet. It is smaller than I thought, but works fine for light sweeping. Assembling was not difficult, but wished that the manufacturer would have added stickers to naming the separate poles. Bagging a single combined assortment of poles that were A1 through A3 and then B1 through B4 is not the best friendly user kind of instructions.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Great if you have pets!",
    "rating": "4.0 out of 5 stars",
    "content": "Not too bad, but the tubing for the handle could be more sturdy, as well as the connectors being metal rather than plastic. When I use the broom, it sometimes bends or loosens at the joints.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Sturdy broom AND dustpan.  The cleaning teeth are deep and sturdy enough to pull the broom through unlike others I have owned.  It is so much more effective than others and makes it easy to quickly spot clean and sweep up. Stores neatly away, too.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Broom is a little short",
    "rating": "5.0 out of 5 stars",
    "content": "High quality, soft but firm bristles, very sturdy handle & dustbin, thick dustbin, good capacity, excellent self cleaning feature. Surprised how nice this turned out to be.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I had a very old IKEA waist high sweeper set, which had a comfortable ergonomic handle (which I miss) - this new sweeper set is a little taller than I would prefer (and I have it on the shortest setting) - I wish the manufacturer would shorten by at least 3 more inches (and I am 5’7” tall, so I am not short!) and consider a more comfortable and ergonomic handle (so we don’t have to twist our wrists as much while sweeping.)  With that said, I do like the hard and sturdy bristles on the brush, and the fact it’s so narrow, it get in cracks well. I don’t think the “hair remover” comb on the base is necessary. I still have to manually pull off residual long hairs, so it’s not very efficient. I do like the deep well that debris goes into, and it’s easy to empty its contents into the trash. I wish you would consider even more colors to choose from. A light gray color would be nice (I have the dark gray.)",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Light and adjustable",
    "rating": "5.0 out of 5 stars",
    "content": "I bought the first one for a family member and they really liked it, so I got one for myself as well.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "its great for height adjustment and the extra wide pan makes it easy to catch everything.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Good product",
    "rating": "4.0 out of 5 stars",
    "content": "Mostly I like it because you don't have to bend down to use the dustpan.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Not sure about its durability in an industrial setting, but it's perfect for home use.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Works but....",
    "rating": "4.0 out of 5 stars",
    "content": "Can stand on its own. Sturdy. Would have preferred a different color.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The poles don't really stay tight. Works. But annoying.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "Works well.  Teeth on the pan to clean off the broom are great.  Would have given 5 stars but broom handle is too short,  otherwise pleased.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love that I don’t have to bend over to use this broom and that the comb on the dustpan easily cleaned the hair out of the broom. I just wish the broom head was a little wider and sturdier.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "First, this broom set is super easy to assemble and you can adjust the height by leaving out a rod. I've been using this for months and still works as well as when I first bought it, the only slight issue or slight grievance I have with it is when I try to dump the dust pan it unscrews a little so I have to tighten it back up Everytime. Other than that it works great, super light, hasnt broken even with 2 toddlers abusing it, in toddler attempts to help me clean. Overall I'm a happy with this.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B09LTY6RR3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the standing dust pan. The broom set works well, is sturdy, and easy to stored it also matches my kitchen which is a bonus!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B09LTY6RR3"
},
]