[
{
    "name": "        ANRABESS Women's Oversized Turtleneck Batwing Sleeve Spilt Casual Loose Knit Tunic Pullover Sweater Tops 2024 Fall Outfits       ",
    "stars": [
        "70%",
        "13%",
        "8%",
        "4%",
        "5%"
    ],
    "pid": "B09M8NNG9V",
    "ratings": "4,461 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "See why this sweater is flattering for everyone!",
    "rating": "5.0 out of 5 stars",
    "content": "This sweater has the perfect size turtleneck, not too tight or too short. The length of the sweater hits right around the bum area and fits loose but still flattering. The material is soft yet doesn’t change shape and the quality is amazing! Highly recommend!",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am usually a 16-18 and I decided after reading other reviews to purchase the large instead of X-Large.  I washed in cold water on gentle cycle.  I tried it on & love it!!  It’s soft and  looks Great.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Size is larger than needed",
    "rating": "5.0 out of 5 stars",
    "content": "I was very pleased with the sweater I ordered.  It was well made and thick enough material to hang right when I tried it on.  No clinging.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Really soft fabric that feels lightweight but also warm. It’s a really cute, flattering cut.",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Great sweater",
    "rating": "5.0 out of 5 stars",
    "content": "Apricot color is definitely a yellowy butter color…not a light cream like I thought? Not for my skin tone but I’ll return for another color!",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Fit and length perfect to replace a bulky jacket over light top.  Collar keeps the chill out.  Washes well. Arms are not too tight.  Not those silly bat wings. I think I bought a size down because it ran big.",
    "post_time": "Reviewed in the United States on October 25, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Cute fit but color is different than expected. It’s not for me.",
    "rating": "5.0 out of 5 stars",
    "content": "The sky blue color is a beautiful turquoise.  The fabric is soft and not scratchy and has good amount of stretch.  Size up 2 sizes to get the loose look in the picture.  I ordered my normal size according to the size chart and it was tight around the neck and sleeves and much shorter, so I returned it.  I would have ordered a larger size, but the price jumped over $15.  :-(",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Update: I did order the larger size.  The sleeves and neck are still tighter than shown in the picture.  The turtleneck is excessively long, and it does not lay nicely like in the picture when folded down once, because it's tight.  I have to fold it twice and then it fits like a snug turtleneck, not loose like pictured.  The back is a lot longer than the front, but I don't hate that.  I'm keeping it because it's soft and stretchy and I love the color.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Perfect sweater!",
    "rating": "4.0 out of 5 stars",
    "content": "I love the feel of the sweater and the size and color is perfect",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought 4 colors.  Finally a sweater that will cover my gut.  If you order down, the sweater will not be too big.  I usually wear an X-large.  The medium was a perfect fit.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Favorite Sweater of 2023/24",
    "rating": "5.0 out of 5 stars",
    "content": "I paired this with some faux leather pants and costume jewelry and its a staple outfit for the winter! It is a bit warm so i do save it for more of the colder days but you can get by without wearing an under shirt to make it more breakable.",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I was unsure if I would like this based on the other reviews. But when it came, I saw it was pleasant color green (for a Christmas dinner).",
    "post_time": "Reviewed in the United States on January 24, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Pleasantly surprised",
    "rating": "5.0 out of 5 stars",
    "content": "When it came out of the bag, it was wrinkled, but I used a garment steamer on it, and it worked just fine.",
    "post_time": "Reviewed in the United States on October 28, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Because I’m tall (5’10”) but slim, I’m always concerned about length, and how broad the shoulders are.  Again I was pleasantly surprised it covered my back and the sleeves were long enough.",
    "post_time": "Reviewed in the United States on October 26, 2022",
    "pid": "B09M8NNG9V"
},
{
    "title": "New favorite",
    "rating": "4.0 out of 5 stars",
    "content": "The only minus was that I wasn’t quite sure how to wear the neck. It’s a little too thick to be a turtleneck, but not big enough to do a true Cowell neck. So, I just wore my hair down and covered it.",
    "post_time": "Reviewed in the United States on October 16, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve worn it twice since then, and it seems like the neck is taking a good shape.",
    "post_time": "Reviewed in the United States on November 29, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Not pretty in pink (LOL) but almond color is true to photos",
    "rating": "4.0 out of 5 stars",
    "content": "I absolutely love this sweater! It’s very soft but has enough h weight to it that it holds a nice shape when wearing. The front is about 2 inches shorter than the back. This is great because it looks nice untucked but also works well with just the front tucked in. The turtleneck part is wide so it’s not constricting and has a nice drape to it. I’ve worn it multiple times with leggings (the back is long enough to provide sole cover) and with jeans. Washes well and keeps its shape while still being super soft. I’m going to buy a few more in other colors. I bought a small and fit is good (it’s generously sized and maybe for some will",
    "post_time": "Reviewed in the United States on December 5, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Be a bit wide but I like the relaxed fit)..I’m 5’5 and 125 lbs.",
    "post_time": "Reviewed in the United States on March 30, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Cool sweater",
    "rating": "4.0 out of 5 stars",
    "content": "2023 UPDATE: I ordered the almond color again, and it looks much better this year—I’m quite happy with the rosier tones in an overall light brown sweater. (The color is very true to photos.) I ordered a medium, and while it’s not as oversized as the photo shows in length and the sleeves, it’s still decently oversized in the back and width. So, not as long in the front hem or slouchy in the arms, but I’m keeping it because I know I’ll layer it with coats and such. If you want a truly oversized look, I’d consider sizing up.",
    "post_time": "Reviewed in the United States on December 15, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "****",
    "post_time": "Reviewed in the United States on February 5, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Buttery soft",
    "rating": "5.0 out of 5 stars",
    "content": "It’s the perfect comfy sweater for chilly weather…you won’t need to put a jacket over it!  Beautiful camel color!",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Vibrant color, good material.",
    "rating": "5.0 out of 5 stars",
    "content": "Color is beautiful and it's heavier than I thought. Perfect for sweater weather! Great price!!",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I wanted to love this but it just looked like a red garbage bag on me. I sent it back.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Really nice top",
    "rating": "3.0 out of 5 stars",
    "content": "This is a very high quality sweater, the red color is exactly as pictured. The sizing is right, I ordered a small, and it fit perfect, but it is NOT a long sweater like the pictures. The pictures show it coming down closer to your thighs, this one hit me right in the groin. It was still a really cute sweater, but I’m looking for something I can wear more like a sweater dress with leggings.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this top. It looks like a free people. The quality is amazing and it is perfect for a fall/winter day. I throw it on with my blue jeans and my tennis shoes and it is so comfortable and true to size.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "You need to right shape for this",
    "rating": "5.0 out of 5 stars",
    "content": "Thes sweater was most likely a return, it was literally stuffed in a bag much smaller than the other sweaters!",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love everything about this cozy sweater.  Color is great, perfect neutral size was great. oversize made it so yummy to wear.",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Dimensions off but good quality",
    "rating": "4.0 out of 5 stars",
    "content": "So leggings are not pants in my book so I love this sweater because it covers my behind. I teach yoga several times a week so I like to hide my yoga clothes under a long sweater. This fits the bill. It's warm but light enough for Texas winters. Colors are great. I bought one for my daughter, too. It is very full so you can size down but I wanted the length so chose my regular size.",
    "post_time": "Reviewed in the United States on February 16, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This sweater is soft and well made.  I just ordered 2 more.  I did size down as mentioned in other interviews.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Great style and color",
    "rating": "4.0 out of 5 stars",
    "content": "I wear this sweater a lot: it’s a great style and color. It’s a ‘feel good’ sweater, length and look for me with leggings. I would have given it 5 stars If the fabric held up a little better.",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I think they call the sweater I ordered green but there is a beauty to the yarn this sweater is made from. The color leans a bit to whatever color you're wearing it with--jeans blue, black, forest green and thus makes them look as if they were purchased together.  And it's the cuddliest sweater I've had since an angora I had in the early 60s.  What else? Let me name the ways:",
    "post_time": "Reviewed in the United States on November 28, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "This is my best clothing purchase of the year...",
    "rating": "3.0 out of 5 stars",
    "content": "1. Easy on.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "2. Great cowl--flattering.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Not My Favorite",
    "rating": "5.0 out of 5 stars",
    "content": "3. Greatest sleeves ever that hug without feeling too tight or need much adjusting when it's pulled on.",
    "post_time": "Reviewed in the United States on January 25, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "4. Sleeves a perfect length--not skimpy of overpowering.  They push  up nicely, too, if that is preferred.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Love this top",
    "rating": "4.0 out of 5 stars",
    "content": "5. Ample through the fanny. No pull across bottom or tummy.",
    "post_time": "Reviewed in the United States on February 18, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Yep, you'll look as if you lost weight.  Should I say again the feel and comfort are easily worth buying two--which I did after I became charmed with this first one.  The yellow one will be on my porch in two days!",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Perfectly Oversized, Soft, Very Comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "I loved the look on the model, but it was not for me.  This sweater made me look huge.  I ended up returning it.  The quality seemed fine, but I just did not want it that large.",
    "post_time": "Reviewed in the United States on January 16, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful sweater.  Dressy or casual.",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "very flattering",
    "rating": "5.0 out of 5 stars",
    "content": "i love loose sweaters and a high-low as well, the turtle neck part is not to tight OR bulky and im not a huge turtle neck person, i am 5'9 and chunky :) and it is very flattering, i get compliments all the time. def want it in more colors",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I haven't been able to wear this yet. Because, it, has been to warm.",
    "post_time": "Reviewed in the United States on November 16, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Gorgeous red, lovley, texture still tp hot to wear!",
    "rating": "5.0 out of 5 stars",
    "content": "However, when I tried it on it felt great on , I loved the color red and the soft silky feel of the yarn they chose.",
    "post_time": "Reviewed in the United States on January 12, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "But, the thing I notice most was the texture and the cut!",
    "post_time": "Reviewed in the United States on October 15, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Most flattering sweater!",
    "rating": "5.0 out of 5 stars",
    "content": "Both were excellent.",
    "post_time": "Reviewed in the United States on November 24, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I hope I get to wear this soon!!!",
    "post_time": "Reviewed in the United States on October 30, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Weird Sleeve",
    "rating": "3.0 out of 5 stars",
    "content": "I would strongly recommend this to everyone !",
    "post_time": "Reviewed in the United States on March 1, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wear this sweater all the time! I got the medium size when I was in shape and loved the lose fit of it, then I wore it throughout my pregnancy and postpartum journey when I was technically an XL. It was nice that the one size fit me throughout.",
    "post_time": "Reviewed in the United States on January 19, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Amazing staple piece",
    "rating": "5.0 out of 5 stars",
    "content": "The weight and color were great, but there’s a horizontal seam in each sleeve that was super noticeable. There’s no way I could wear it.",
    "post_time": "Reviewed in the United States on October 29, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This sweater is awesome!! The quality is amazing. The color was as pictured. I did size down. Whenever I buy blouses, shirts, dresses on Amazon I’m a medium but based on reviews I sized down to a small and am so happy I did. A medium would have been huge. I definitely want to buy more colors. This paired perfectly with leggings and boots for Thanksgiving.",
    "post_time": "Reviewed in the United States on November 26, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Nice sweater, good quality.",
    "rating": "5.0 out of 5 stars",
    "content": "Good quality. Bought in the gray and brown color. For reference I am 5’5” 155#, ordered the medium in brown and the small in gray. It’s a very loose fitting sweater, but the medium is almost too big overall and too long, but I do still wear it with leggings. The small was a better fit and can be worn with anything.",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I waited a few weeks to try this on and it was not flattering. When I attempted to return it I was one day too late….my fault!😢",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Try it on fast!",
    "rating": "5.0 out of 5 stars",
    "content": "This sweater is THEE CUTEST!",
    "post_time": "Reviewed in the United States on November 13, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It lays soo nice! Soft, & drapes on your body soo nicely. I LOVE IT!",
    "post_time": "Reviewed in the United States on December 28, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Omgosh, you guys!!!",
    "rating": "5.0 out of 5 stars",
    "content": "It has slits on both sides, so it’s longer in the back ( to hide your booty, if you wish). I am 5’4ish & 120lbs. I got a medium bc I like my sweaters bigger, BUT, the cool thing is, it does not look overly BAGGY/sloppy, but CUTE w skinny jeans or leggings! The turtleneck is not itchy either. Such a comfy, cozy sweater🥰😉!!",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very nice color and fit.  May be back shortly for more colors.",
    "post_time": "Reviewed in the United States on December 1, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Lovely sweater",
    "rating": "5.0 out of 5 stars",
    "content": "Honestly, wasn’t expecting too much but when I put it on, it looked very cute and good quality. I usually wear a medium, so that’s the size I ordered. Wasn’t too big at all. Also washed it and it seemed to hold up well. The maroon color was very pretty- might try other colors. Great winter wardrobe staple.",
    "post_time": "Reviewed in the United States on October 24, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I like the soft material and overall look. It just felt really big and wish I had ordered a smaller size",
    "post_time": "Reviewed in the United States on January 30, 2022",
    "pid": "B09M8NNG9V"
},
{
    "title": "Way cuter than expected",
    "rating": "4.0 out of 5 stars",
    "content": "I usually wear a M in tops but I got this olive sweater in S based on other reviews. It was the right choice because the S fits nice and loose as a M would. I washed it and put in dryer on low heat. It didn’t shrink, came out like new. I’m 5’2, 129 lbs and the length in back covers my bottom. Definitely not too long. This is a very soft and comfortable sweater. Love it! Olive color is rich and beautiful. Love it!",
    "post_time": "Reviewed in the United States on October 13, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Comfortable and easy to wear, but just not as nice in person.",
    "post_time": "Reviewed in the United States on November 25, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Turtleneck Sweater",
    "rating": "4.0 out of 5 stars",
    "content": "The sweater is just okay. I have long arms and the sleeves are barely long enough. I did size up thankfully or the sweater would have been a return item. It's thick sweater which will be nice for cold weather but I wish the front was a little longer for leggings.",
    "post_time": "Reviewed in the United States on October 28, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very soft and thick material. I have one of this style and a few of another from the same company. They pull easily but you can pull the loop through to the inside so it’s easy to fix. Washes well and stays soft. Runs big. I’m 5’4” 125#. Small fits perfectly. Ordered the pink and it’s nothing like the picture. It’s more of a dusty pink mauve.",
    "post_time": "Reviewed in the United States on September 18, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Really cute",
    "rating": "5.0 out of 5 stars",
    "content": "This sweater is my new favorite and I’ve already purchased 2 more since this black one! It is so soft, drapes lovely over the body, and hangs at just the right length for me to wear leggings with it.  For reference, I’m 5’3, 220, and an hour-glass shape with most of my weight in my chest and booty/thighs, and I ordered the XL.  I’m typically XL top and 14/16 bottom.  I say this drapes lovely on the body, because it flows over curves, hugging the right spots, while being loose in the spots you don’t want “clingy”.  I just received the green color today, and decided to downsize and try that in the Large.  Fit wise, they are almost identical, with the XL being slightly more roomy and maybe 2” longer for booty coverage.  I will be living in these because it looks so put together while feeling like your favorite sweatshirt.  Very classy looking. Keep in mind this is a “high/low” hem with the back being approximately 2-3” longer than the front.",
    "post_time": "Reviewed in the United States on October 5, 2022",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Soft, warm, comfortable.  Nice sweater",
    "post_time": "Reviewed in the United States on February 13, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Getting every color!!!",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this for the holidays, and while I am obsessed with it, I will say the this shade of brown is a tad more rust than I planned for, but I was so happy with the sweater itself, I kept it. I've learned to wash these sweaters inside out, alone, on delicate cycle, to prevent pilling and signs of wear. I also gently use am electric shaver when I notice any fuzzy spots. Planning to purchase more colors!",
    "post_time": "Reviewed in the United States on December 31, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Nice sweater, well made and flattering.  I ordered the green and the color was a bit too blah for me.",
    "post_time": "Reviewed in the United States on December 21, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Nice sweater",
    "rating": "5.0 out of 5 stars",
    "content": "I sized down 2 sizes in this sweater.  It's soft, comfortable and washes well.  It's my go to when I need to look put together.  It's great paired with leggings or skinny jeans.  I gave it four stars in the flattering category due to the oversized fit.  It's a very long sweater on my (longer than the picture shown)",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I saw this on Amazon and brought it to my wife’s attention.  She loves this type of garment for fall and winter wear.  She really liked the style and the wide range of colors available.  I was going to order one, but by the time I placed the order that number had grown to three.  She received them this week and has worn each one.  The overall quality is obvious and the colors are rich.  She’s already thinking of ordering several more because she says the price for these is exceptional.  Nice job Amazon!",
    "post_time": "Reviewed in the United States on October 28, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Obsessed",
    "rating": "5.0 out of 5 stars",
    "content": "No me gusta llevar ropa q no sea cómoda pero ese buzo es perfecto muy elegante y súper comodo",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I ordered my usually size but it was not over sized as pictured.  The fabric was soft and comfortable and the color was pretty.  The turtle neck was comfortable and not restricting.",
    "post_time": "Reviewed in the United States on October 21, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Don’t put it in the dryer!",
    "rating": "3.0 out of 5 stars",
    "content": "Loved the sweater before I wished it. Don’t put it in the dryer! It’s now almost a crop sweater and the sleeves are way too short 😭",
    "post_time": "Reviewed in the United States on March 30, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My top just arrived today and I think it'll be a favorite. I'm pleased with the color, and I'm happy I took the advice of many of the customers here and sized down one size. They weren't kidding when it was described as 'oversized'. Size down and you'll be happy with your purchase.",
    "post_time": "Reviewed in the United States on November 27, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Going to enjoy wearing this top",
    "rating": "5.0 out of 5 stars",
    "content": "Love this sweater!  Very flattering. I have gotten so many compliments every time I wear it",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It’s a nice sweater, lightweight and roomy, it’s a “high low” length great with leggings",
    "post_time": "Reviewed in the United States on October 21, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Fits well, very comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "I love this sweater.  It is big.  Order smaller size. Looks great with leggings.  I ordered white and love the color.",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I really wanted yo like this sweater.  I love the color & the softness, but the fit is… odd.  I’m 5ft 3 & a half, approx 140lbs & I got size small.  I was swimming in it.  The back tail of the sweater nearly came down to my knees.  I know oversized is the style right now, but I couldn’t figure out how you’re supposed to wear this thing & not look like a complete clown.  Clearly not meant for us shorties.",
    "post_time": "Reviewed in the United States on October 13, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "It’s a lovely blue",
    "rating": "5.0 out of 5 stars",
    "content": "I returned one sweater and got only a small refund.  The beige was flesh colored ugl",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Typically wear a large, medium is perfect for an oversized fit. So soft. Buying in more colors!",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Great sweater",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered this sweater for my wife for Christmas. I ordered it back in November and we didn’t receive it until last Friday. The sweater is great, but maybe take it down if you don’t really have it in stock.",
    "post_time": "Reviewed in the United States on January 7, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I initially ordered the Small. I’m 5’3” and 120. When it arrived it was way too large so I sent it back for an XS. It’s perfect. The weight is perfect for this time of year and the red is beautiful. I love it!!",
    "post_time": "Reviewed in the United States on December 16, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Great sweater!",
    "rating": "5.0 out of 5 stars",
    "content": "I love this sweater for those cold winter days. Fits true to size and it’s a perfect sweater for leggings.",
    "post_time": "Reviewed in the United States on February 18, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fits true to size.  Wonderfully soft - launders well.  A great winter sweater.  I would even purchase for a gift or in another color for myself.",
    "post_time": "Reviewed in the United States on January 12, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Got many compliments",
    "rating": "3.0 out of 5 stars",
    "content": "Thank you",
    "post_time": "Reviewed in the United States on January 10, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the fit and feel of this sweater however I have worn and washed it 2x (gentle cycle cold water) and it already pilling up.  In fact started balling up during the first wear.  Also I ordered grey and the color was more taupe.",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Love the look but quality not there",
    "rating": "4.0 out of 5 stars",
    "content": "Quality is great! I wear it often, with no balling.",
    "post_time": "Reviewed in the United States on November 9, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Comfortable, a trendy fit",
    "post_time": "Reviewed in the United States on December 15, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Quality",
    "rating": "5.0 out of 5 stars",
    "content": "True to size",
    "post_time": "Reviewed in the United States on November 23, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Ultra roomy and comfortable. I love this sweater it’s my favorite right now I wear it to holiday occasions. If it’s really cold I wear a vest over it. I got an XL and after washing there was no shrinkage it’s still big.",
    "post_time": "Reviewed in the United States on November 28, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Comfortable",
    "rating": "3.0 out of 5 stars",
    "content": "I have this sweater in 2 colors. Great for work with a skirt or dress pants.  Great for play in jeans or leggings. Covers the bootie nicely if wearing with leggings. The sweater is warm and great to wear with a vest.",
    "post_time": "Reviewed in the United States on November 12, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Ordered the light apricot and it does have a hint of a peach color. Unfortunately I got a medium on sale and it is probably a true medium.  Sleeves and shirt length are a bit short on me. Mock turtleneck lays nicely.",
    "post_time": "Reviewed in the United States on June 16, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Adorable heavy duty sweater",
    "rating": "5.0 out of 5 stars",
    "content": "This sweater is heavy. You can tell the quality is good. The color was a bit off then the picture, but I still love it. Here it looks more green, mine looks more like a mushroom color. It is comfortable and extremely warm. I always run cold and felt extremely warm in this. I would definitely order another one.",
    "post_time": "Reviewed in the United States on December 1, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I ordered two of these sweaters in the same size, which arrived at different times.  The first one I received fit great and was roomy around the neck, which is what I was seeking, as I don't like anything that's too tight.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Inconsistent sizing",
    "rating": "5.0 out of 5 stars",
    "content": "When the second sweater arrived, it was immediately obvious that it was smaller than the first that I received; body and sleeves were too short and neck opening was significantly smaller.  In addition, there was a sewing needle stuck in the sweater!  Seriously?  I almost got stuck.  So which sweater was incorrectly sized?  I've no idea.  But I'm keeping the first and returning the second.  This sweater is marketed as an oversized sweater, so guessing that the size on the second sweater was inaccurate.  Consider yourself warned!!",
    "post_time": "Reviewed in the United States on November 11, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very soft, comfy.  I knew before I ordered it that it was a loose fit and did not expect flattering, but happy to say the hang is good so it's \"not unflattering\".  As I do with all new clothing, I washed it first, gently dried it to barely damp, then laid out to finish drying.  I will get a lot of wear out of this garment.",
    "post_time": "Reviewed in the United States on February 5, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Well made, exactly as described",
    "rating": "4.0 out of 5 stars",
    "content": "This sweater is very attractive with leggings or fitted yoga pants. The material is comfortable and washable. I ordered an xl, then ordered a medium. Both look very cute on. I only have to roll sleeves up on the xl.",
    "post_time": "Reviewed in the United States on October 21, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great, quality sweater. The neck is a bit large, but overall nice. I get compliments whenever I wear it.",
    "post_time": "Reviewed in the United States on January 22, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "This sweater is oversized and you can downsize.",
    "rating": "3.0 out of 5 stars",
    "content": "This sweater is warm but not too warm.  The size runs true to the charts.  It looks classy with levis and with dressy leggings.  I love it and plan to buy another one in a different color.",
    "post_time": "Reviewed in the United States on December 30, 2023",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The beige color is almost like a pinky color. I did not like it. I was looking for a true beige/tan color. I did return it for a gray and I like it much better. It is oversized on me and I need to go down two sizes from my normal size. It’s heavy and thick and comfortable. It’s warm.",
    "post_time": "Reviewed in the United States on December 16, 2022",
    "pid": "B09M8NNG9V"
},
{
    "title": "Nice quality sweater",
    "rating": "5.0 out of 5 stars",
    "content": "So first let me say that I ordered the Silver but no way is it bright silver lol the photo. It’s almost like a light mauve. Ordered a Large although I usually wear a small or medium depending on if I want oversized so I knew that to get the oversized look but not sloppy, I ordered a large. Sleeves and length are perfect. Keeping it only because I can match the color with other things in my wardrobe.",
    "post_time": "Reviewed in the United States on March 23, 2024",
    "pid": "B09M8NNG9V"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Perfect length, weight and color. This is a staple in my closet! Can wear with jeans or leggings and it covers your booty.",
    "post_time": "Reviewed in the United States on December 24, 2023",
    "pid": "B09M8NNG9V"
},
]