[
{
    "name": "        SAM’U PH Sensitive Cream Mist | Daily Face Moisturizer for Men & Women | Korean Face Mist Hydrating Spray | Dewy Setting Spray for Makeup Long Lasting Fixer | Face Skin Care (3.38 Fl. Oz.)       ",
    "stars": [
        "73%",
        "8%",
        "9%",
        "7%",
        "4%"
    ],
    "pid": "B0B3MTMZCC",
    "ratings": "115 ratings",
    "other_info": {
        "Brand": "SAM'U",
        "Item Form": "Liquid",
        "Skin Type": "Sensitive",
        "Material Type Free": "Natural",
        "Product Benefits": " "
    },
    "discount_price": "$ 33.",
    "normal_price": "$9.76",
    "about_this_item": [
        " DEWY RADIANCE IN A MIST. Elevate your skin's glow with SAM’U PH Sensitive Cream Mist. Infused with Hyaluronic Acid and Ceramide, its fine mist particles provide quick and lasting hydration. Experience a natural radiance boost and moisturize your skin barrier, leaving your face soft and revitalized.  ",
        " HYDRATION ON-THE-GO. Unleash the power of a combined face cream and toner in one skincare mist. Perfect for daily moisturization or a quick post-workout pick-me-up. Centella Asiatica extracts and Allantoin work together to moisturize and soothe, fortifying the skin barrier by a remarkable 16.95%.  ",
        " REFRESH W/OUT THE RESIDUE. Our hydrating setting spray ensures no greasy feeling with a perfect pH balance of 5-6. Quickly absorbed, it preserves the oil-water balance, delivering an instant boost of hydration wherever and whenever. Ideal for setting makeup with a long-lasting fixer effect.  ",
        " HYPOALLERGENIC FACE CARE ESSENTIAL. SAM’U PH Sensitive Cream facial spray is your all-in-one skin care solution with a skin irritation index of “0.00”. This multitasking facial mist spray acts as a setting spray and facial moisturizer that gives you fresh and moisturized skin in a single spritz.  ",
        " KOREAN BEAUTY SECRET UNVEILED. Experience the luxury of Korean skincare with SAM’U pH Sensitive moisturizer face spray. This beauty essential combines the freshness and moisturizing benefits of SAM'U pH cream, providing added vitality to achieve a dewy complexion and maintain facial moisture.  "
    ]
},
]