[
{
    "name": " Hello Beautiful: A Novel ",
    "stars": [
        "61%",
        "26%",
        "9%",
        "2%",
        "2%"
    ],
    "pid": "B0B7VC23QG",
    "ratings": "88,929 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "Disappointed ---characters simply not authentic",
    "rating": "3.0 out of 5 stars",
    "content": "I bought hardcover & Kindle editions on day of release after seeing Oprah rave about it on CBS. What I appreciate most with Oprah's fiction picks is the selections tend to be a cut above (i.e. more literature) than morning show or other celeb book clubs. (I esp enjoyed Oprah's early picks back in late 90s.) I'm sad to report this was a big miss for me. Having been raised with 4 sisters in blue-collar Chicago, I thought it'd be a slam dunk, but I went from being underwhelmed to disappointed to annoyed. Pains me to write a mediocre review as author likely poured her heart and soul into it, but imo this book needed another year editing and revising, as this just wasn't there yet. A few specifics:",
    "post_time": "Reviewed in the United States on March 22, 2023",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "* I applaud author for attempting to give characters depth & complexity but she violated basic rule of show, don't tell. Too much of the characters' personalities were explained with excess exposition but not SHOWN to readers through actions or dialogue.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Just give me 3 more pages!",
    "rating": "5.0 out of 5 stars",
    "content": "* While I don't adhere that authors should write only what they know, it was obvious to me early on the author didn't grow up with sisters, nor grow up or spend years in Pilsen or blue-collar Chicago. Neither felt authentic. Felt more as if author was on outside observing or imagining versus having lived it. I can overlook some tells, but the more those slips/omissions/errors add up, the more a reader loses faith in the entire story.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "*William's upbringing also didn't ring true. I can understand grief-stricken parents emotionally absent in a child's life, but not to the degree explained (not shown) in the book. More development and examples were needed, as parents cannot simply ignore a child--they still need to nurse, feed, cloth and shelter, etc. It's easy to tell but author needed to again SHOW us how cold parents can be there, but not present.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Very well written",
    "rating": "5.0 out of 5 stars",
    "content": "* On plus side, the story & writing comes most alive to me with passages on basketball--the relationships, the tempo, the love of the game, the history. Here's where the author did her homework and really did a nice job translating it, esp to female readership (not to sound sexist, as I'm a woman who played basketball in her youth but still learned a few things or two and appreciated the insights she brought.)",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I'll leave it there as I don't mean to tear down a book that's not horrible, just not great. Possibly my disappointment is greater than most because I came up with high expectations and this just wasn't credible for me. As other reviewers noted, it's not a bad beach read, but not literature and not Oprah-caliber.  (Sorry for any typos--please don't review my review lol.)",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Family Forgiveness",
    "rating": "5.0 out of 5 stars",
    "content": "This is a beautifully written story with well developed rich characters. I was willing to read and enjoy all of their feelings, sorrows and triumphs with pleasure, even when it meant going over much of the same from different perspectives. Then just as I finally made it to the dessert, the icing on the fresh cake… the end… make it up yourself.  The epitome of leave the reader wanting-no- begging for just a little more. 🤷‍♀️",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Interesting book, characters fully real and fleshed out. Very good story",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Interesting Retelling of Little Women",
    "rating": "5.0 out of 5 stars",
    "content": "I loved a family’s ability to overcome a schism and heal despite awkwardness.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This was an interesting, creative retelling of Little Women.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "The good and bad of it",
    "rating": "3.0 out of 5 stars",
    "content": "I have mixed feelings about this novel. I bought it to read on a beach vacation, and read it over a few days time. At first I was intrigued by the characters and plot, but by the end I was tired of it and had trouble summoning the interest to finish the book. The big issue for me was the author's large amount of repetitious description about characters' feelings and what they \"now understood\" -- I felt manipulated, and I felt robbed of the opportunity to form my own reactions. Some readers describe being brought to tears; I never was.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book was really good for the most part. It seemed like it went on a little too long, for me.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Nice read",
    "rating": "4.0 out of 5 stars",
    "content": "Great book",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The best book I have read all summer.  Great character development.  I was sad when it was over.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Hello beautiful",
    "rating": "5.0 out of 5 stars",
    "content": "The service was prompt. The used book was in excellent condition. The novel was a page turner!",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I guess I’m just a curmudgeon. While the book was written well enough to be a relatively easy and unproblematic read, I simply didn’t like it much. Even though the story contained hardship and tragedy, there was still a certain overall saccharine sweetness to it that didn’t ring true to me. I felt that we were skimming the surface of these people’s lives rather than really understanding them.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Great Book!",
    "rating": "4.0 out of 5 stars",
    "content": "Characters were captivating  and you feel compelled to stick to the end .  This book would make a lovely movie.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "William Waters grew up in a house silenced by tragedy, where his parents could hardly bear to look at him, much less love him—so when he meets the spirited and ambitious Julia Padavano in his freshman year of college, it’s as if the world has lit up around him. With Julia comes her family, as she and her three sisters are inseparable: Sylvie, the family’s dreamer, is happiest with her nose in a book; Cecelia is a free-spirited artist; and Emeline patiently takes care of them all. With the Padavanos, William experiences a newfound contentment; every moment in their house is filled with loving chaos.",
    "post_time": "Reviewed in the United States on July 11, 2023",
    "pid": "B0B7VC23QG"
},
{
    "title": "Hello Beautiful Book",
    "rating": "5.0 out of 5 stars",
    "content": "But then darkness from William’s past surfaces, jeopardizing not only Julia’s carefully orchestrated plans for their future, but the sisters’ unshakeable devotion to one another. The result is a catastrophic family rift that changes their lives for generations. Will the loyalty that once rooted them be strong enough to draw them back together when it matters most?",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "An exquisite homage to Louisa May Alcott’s timeless classic, Little Women, Hello Beautiful is a profoundly moving portrait of what is possible when we choose to love someone not in spite of who they are, but because of it.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Beautiful",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this story of love, family and forgiveness. The characters were so relatable. It was beautiful just like the title!",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed getting to know the Padavano sisters and all their messiness. I also found the last few chapters to be especially thought provoking, especially reminding me how important family can be.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "A good family saga",
    "rating": "4.0 out of 5 stars",
    "content": "This was almost too realistic about how people lie too each other so they can still be friends. Thank God my family is all dead.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I can't think of a novel which has so deeply involved me in the lives, experiences and feelings of it's central characters.  I'm quite sad that I've just finished it, because I don't want to say goodbye to William and the close knit family of four sisters he married into.  My own spare childhood resembles William's.  Yet this novel is a way of seeing what it might be like to be raised in an exuberant, complicated, loving family... and how it evolves over time, as each girl becomes her own self... and William comes to realize that he matters.",
    "post_time": "Reviewed in the United States on February 16, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Really sad",
    "rating": "5.0 out of 5 stars",
    "content": "What impresses me most about the writing of Ann Napolitano is her ability to go to the heart of the matter.  She allows us to see the inner lives of her characters, their aspirations, self-doubts, determination, losses and joys.  There is grace here... saving grace.",
    "post_time": "Reviewed in the United States on June 20, 2023",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Perhaps I'm particulary drawn to a work like this because, as child psychologist, I've spent years studying how childhood experiences influence who we become, and the healing that is sometimes needed when those experiences have been less than ideal.  Napolitano shows here how it's often the people closest to us, who care about us, who facilitate our healing.  What the author has created here feels firmly based in reality and the challenges human beings face, and, thankfully, she draws these characters to unexpected reconciliation.",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "The Heart of Family Life",
    "rating": "4.0 out of 5 stars",
    "content": "‘23 - 5 STARS",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "DESCRIPTION : William Waters grew up in a house silenced by tragedy, where his parents could hardly bear to look at him, much less love him—so when he meets the spirited and ambitious Julia Padavano in his freshman year of college, it’s as if the world has lit up around him. With Julia comes her family, as she and her three sisters are inseparable: Sylvie, the family’s dreamer, is happiest with her nose in a book; Cecelia is a free-spirited artist; and Emeline patiently takes care of them all. With the Padavanos, William experiences a newfound contentment; every moment in their house is filled with loving chaos.  But then darkness from William’s past surfaces, jeopardizing not only Julia’s carefully orchestrated plans for their future, but the sisters’ unshakeable devotion to one another. The result is a catastrophic family rift that changes their lives for generations. Will the loyalty that once rooted them be strong enough to draw them back together when it matters most?",
    "post_time": "Reviewed in the United States on August 27, 2023",
    "pid": "B0B7VC23QG"
},
{
    "title": "BEAUTIFUL read !",
    "rating": "4.0 out of 5 stars",
    "content": "REVIEW :",
    "post_time": "Reviewed in the United States on December 5, 2023",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "TRIGGER WARNING : Depression & Suicide.",
    "post_time": "Reviewed in the United States on December 7, 2023",
    "pid": "B0B7VC23QG"
},
{
    "title": "Error on page 45",
    "rating": "4.0 out of 5 stars",
    "content": "2nd paragraph, last word should be care.  Not car.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Guess spellchecker wasn't working?  Or editor wasn't doing their job?",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "a good read second time",
    "rating": "4.0 out of 5 stars",
    "content": "All is good",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed this book even the second time I couldn’t stop reading; it is that well written, still kept my interest and enjoyment",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "It was ok",
    "rating": "4.0 out of 5 stars",
    "content": "A bit disappointing. Too ordinary, some depth as it pertains to  William in his depression and recovery.  I must be getting too used to more dramatic fiction",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Haven't finished book yet but I think it is worth reading.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Beautiful book",
    "rating": "4.0 out of 5 stars",
    "content": "I chose this as my favorite book to take to a book swap last week. I loved it! The characters came alive on the page, and the story was completely engrossing. I highly recommend it!",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book had interesting characters and was well written. It flowed a nice pace. it was touching and sweet and thoughtful. I would have given it a five but for the predictable call Hallmark movie ending (a tragedy strikes, which brings people back together).",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "On Oprah's book list!",
    "rating": "5.0 out of 5 stars",
    "content": "I liked the story, but it was a very slow read. I found myself having to make myself keep reading, as the story didn’t really drive me to want to read more.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Great read!  I absolutely loved it!  And so did the women in my book club.  The family dynamics are fascinating because there is such a strong bond between the women, and yet there are many dysfunctional things that happen.  Abuse and neglect lead to mental illness in one of the main characters. It’s amazing how love seems to conquer all.  I was in tears at the end of the book.  It was that good.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Well constructed",
    "rating": "5.0 out of 5 stars",
    "content": "Plausible narrative with interesting subjects. We feel that these people existed. It is a pity that the book ended already.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great book.  I really enjoyed it and have recommended it to others!",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Good Read",
    "rating": "4.0 out of 5 stars",
    "content": "Every family has stories that of bonds that draw them together and those that pull them apart.  This one was particularly well written and I loved all of the Padavano with their strengths and flaws.  Their journey from childhood through middle age made it hard to put the book down.  Good discussion of depression and impact of family dynamics early in a child’s life.  It is a good book for anyone looking to read about real family life, both the good and the bad.",
    "post_time": "Reviewed in the United States on March 1, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I read the book",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Life is Complicated",
    "rating": "4.0 out of 5 stars",
    "content": "This is a novel of the 4 Padavano sisters, from childhood to adulthood.  As a William Waters gets to know their many facets, and layers, we learn of his childhood and see him through adulthood.  The interpersonal relationships are complicated, as in any family.",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The book is a good read.  I enjoyed the storyline in its complexity, but found it redundant in sections and felt it dragged on in some parts.  Still worth the read, however. Character development was carried out with only some of the characters.  I would have like to get to know a couple of other characters.",
    "post_time": "Reviewed in the United States on February 18, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Great story",
    "rating": "5.0 out of 5 stars",
    "content": "The writing is beautiful. The character development is on point, which is good, because it is a character-driven story. The reader gets to know the characters really well, and the author allows her characters to have flaws - almost to the point of being unlikable.",
    "post_time": "Reviewed in the United States on August 1, 2023",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’m in a “it’s not you, it’s me” relationship with this book, because it was pretty perfect. But it was too much reality than I needed right now. I found it to be relentlessly hopeless. Absolutely a good book if you need a good cry, and you will cry, multiple times.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "family drama",
    "rating": "4.0 out of 5 stars",
    "content": "Hello Beautiful by Ann Napolitano is an emotional story about the Padavano family that includes four sisters who are best friends. Julie, the go-getter of the family; Sylvie, the bookish dreamer; Cecelia, the free-spirited artist; and Emeline, the gentle and compassionate sister. The readers are introduced to William Waters who comes from a dysfunctional background that changes everything, testing the strength, love, and forgiveness of the Padavano family.",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I loved the beginning and ending of this book.  I struggled with the in-between but I am so glad I continued did reading this emotionally charged book.",
    "post_time": "Reviewed in the United States on May 5, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "A good read",
    "rating": "5.0 out of 5 stars",
    "content": "Very interesting and engrossing.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "William Waters had the saddest childhood ever, and he is emotionally stunted as a result. So when, in college, a strong-willed and optimistic young woman nabs him as a fixer-upper, he's all too happy to obey. I use these words intentionally, because that's how it felt to me. Julia's family is warm and welcoming...except there are some seeds that develop through the story and burst into full toxic bloom. What surprised me was that the once-in-a-lifetime horribleness of William's parents' behavior was actually true as well of people in his new family, and I found that a little unimaginative. The way Julia and Rose, her mother, cut people dead was horrific. The ending was long in coming and not fulsome enough. I admit I skimmed some of the midsection, but I felt like the author was trying to draw out the resolution in a gratuitous way. Miscommunication and failing to speak are my least favorite plot mechanisms, and this book is built on them.",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "The story had so much promise.",
    "rating": "5.0 out of 5 stars",
    "content": "A complex novel interweaving the lives of 4 sisters and a young man William. The story covers many years of each person's life from childhood to the mid-40s including the lives of their parents. It's a modern day story with complex thought processes where various family members are isolated from each other for many years of time.",
    "post_time": "Reviewed in the United States on July 16, 2023",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A story of William who suffers depression and a feeling like he doesn't belong. The story of his first wife Julia (the oldest sister) who dreams of creating a life of success and perfection; only to find once she accomplished this feat she has isolated herself and daughter and all the love of her family she left behind. The second daughter Sylvie who married William, after her sister divorced him, to save him and herself from their own depression. And the two other sisters who are intertwined throughout the novel.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Family ties run deep",
    "rating": "4.0 out of 5 stars",
    "content": "It is a wonderfully written novel, easy to read. Excellent syntax and detail provided in a way like you personally know each person who enters into this story. Most of all is the message of love and acceptance always prevails, even when life isn't perfect or doesn't go the way you planned, the family ties to your roots will pull you out of the deepest well and love will prevail.",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "BOOK WAS IN GREAT CONDITION AND A GREAT READ!",
    "post_time": "Reviewed in the United States on April 10, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "GREAT CONDITION & GREAT READ!",
    "rating": "4.0 out of 5 stars",
    "content": "This story covered so many of the ups and downs of life. When life was going well tragedy strikes. Then we pick up the pieces and move on remembering all of the stories that make up who we are and who we love. This book has it all.",
    "post_time": "Reviewed in the United States on August 13, 2023",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I enjoyed every page of this book. The sisters were a joy to spend time with and I didn’t want it to end. This read took me longer than most because every page was filled with a reminder of things in my own life. I would read a sentence and start thinking. The themes were so beautifully interwoven and important. I cried a lot and laughed soon after. This reminded me of one of the e epic novels by John Irving. The detail and feelings are so astute. The parallels with“Little Women” really added another dimension to my enjoyment. I definitely will read this one again. It is such a beautiful story about a beautiful family and their relationships. Bring the tissue.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Life",
    "rating": "5.0 out of 5 stars",
    "content": "I did like this book, but I had to put it down several times because it made me sad. I needed to stop reading for a few hours or even a day so that I could gather myself before continuing. I won’t go into the plot as so many other reviewers already have, but I will say that the characters were richly drawn, and you do eventually care about each and every one. The novel drags a bit, but if you stick with it you’ll discover new and interesting events that hold you to it.  I have to say that the last hour or two of reading will stir up many emotions, and I cried a lot during that time. William’s character is the one that affected me the most, and I don’t think too many people will not be affected by him.  Even through the tears and sadness I experienced reading it, I think it’s worth the read.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book was long and felt drawn out. However, there were many everlasting gems. The bond between family is like no other. Depression is real, and it takes a village to help you through it. And love is the most important of all.",
    "post_time": "Reviewed in the United States on March 14, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Entertaining",
    "rating": "5.0 out of 5 stars",
    "content": "Good story about a confused family.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Growing up with three sisters and one brother I can so relate to this book. It is a difficult story of pain, loss and reconciliation but well written and intriguing enough to capture the reader.  It takes us deep into the characters personal transformations and historical celebrations and it surprises you occasionally. I enjoyed it and would recommend it.",
    "post_time": "Reviewed in the United States on February 25, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Families like this one I know.",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first novel by Ann Napolitano and overall it is this a magnificent book that deserves every one of the five stars I am rating.",
    "post_time": "Reviewed in the United States on November 23, 2023",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Napolitano writes an extraordinarily moving and gripping family drama focused around 4 sisters. The novel is inspired by Little Women, mentioned in the book as well as a favorite of the sisters.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Sad, big hearted and brilliant story",
    "rating": "5.0 out of 5 stars",
    "content": "There are several sub-storylines that are held together by the complex and highly developed characters. Napolitano create a captivating and distinct set of Padavano sisters, all strong in their different ways, but challenged when cracks begin to appear in their unity.",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The story is heart-wrenching, emotional, saga that will shake you to the core. The ending will tug at your heart strings and give you all the feels. I  devoured this book in basically one day while on a long haul flight.",
    "post_time": "Reviewed in the United States on April 6, 2023",
    "pid": "B0B7VC23QG"
},
{
    "title": "Beautiful Story.",
    "rating": "3.0 out of 5 stars",
    "content": "I highly recommend this sad, big hearted and brilliant story.",
    "post_time": "Reviewed in the United States on April 5, 2023",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I throughly enjoyed this book.  One of my top 10 books!  The story goes through many years of four close sisters and their different paths of life.",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "A beautiful read",
    "rating": "3.0 out of 5 stars",
    "content": "From the moment you open this book to the last line written, you will not be disappointed. If any part of this book is autobiographical, I thank the author profusely for sharing it with her readers. This book allows the reader to experience the characters as if you were in the same room. Can’t say enough - I loved it.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B0B7VC23QG"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "One of the most touching heartfelt books I've read.  Beautifully written about four sister's, their love for one another and the betrayal of one sister to another.  There was Julia the oldest daughter, Sylvie who was next in line and closest to Julia.  Then the twins, Emeline and Cecelia.  The were each different.  Julia was an independent daughter who grew up, went to college and met and married William.  William had a sister who died at an early age.  Her  name was Caroline.  When she died so did any feelings of love for William.  This left him broken as a young boy and broken as a young man.  Julia thought she could fix everything about him but she was wrong.  The had a baby girl named Alice.  Shortly after the birth of Alice William tried to take his life.  He asked Julia for a divorce and walked out on her and gave up rights to his daughter.  William worked as a Basketball assistant and made lifelong friends at North Western.  His friends along with Julia's sister saved him.",
    "post_time": "Reviewed in the United States on August 22, 2023",
    "pid": "B0B7VC23QG"
},
]