[
{
    "name": "        Hockvill LCD Writing Tablet for Kids 8.8 Inch, Kids Toys for Girls Boys Drawing Pad for 3 4 5 6 7 8 Year Old Kid, Toddler Drawing Doodle Board Travel Essentials Christmas Birthday Gift for Kids -Pink       ",
    "stars": [
        "72%",
        "13%",
        "8%",
        "3%",
        "4%"
    ],
    "pid": "B0B9G2SJVX",
    "ratings": "3,663 ratings",
    "other_info": {
        "Brand": "hockvill",
        "Color": "Pink",
        "Material": "Acrylonitrile Butadiene Styrene (ABS)",
        "Recommended Uses For Product": "Home Outdoor Travel",
        "Mounting Type": "Tabletop Mount"
    },
    "discount_price": "$ 9.99",
    "normal_price": "$14.48",
    "about_this_item": [
        " Educational Learning Kids Toys：Hockvill LCD kids doodle board is a creative education and learning toy, perfect support for drawing, writing, spelling, math, memos, and notes which can let your kids freely release their natural instincts and inspire your kids' creativity and imagination. The kids drawing pad can let your kids be away from electronics and protect their eyes from now on. NOTE：Portable ultra-lightweight materials, structured drop-proof design, ideal for 3-8 years old children to use  ",
        " Eye Protection & Brighter Colorful Writing：In pursuit of a better writing experience, Hockvill drawing doodle board adopts the newest LCD pressure-sensitive technology which produces no radiation and protects eyes, and provides vivid rainbow colors at the same time. Your kids can draw colored lines of different thicknesses with the doodle board which depends on the pressing force with a stylus, nail or any hard thing. Press the cute cat-erase button to clear the screen. And the lock key can save the screen contents  ",
        " LCD Writing Tablet for Kids：Hockvill toddler writing board is designed in cute cat style are great girls toys. The bright color can stimulate children's interest in writing and painting, which can make your children fall in love with and develop the habit of using LCD writing pad. It provides endless graffiti fun for your child in a period of creativity. Hockvill kids writing tablets can be used as a preschool learning toy, toddler toy, doodle board, kids drawing pad, or toddler drawing board. And the doodle board also can be Thanksgiving Day, Halloween, Valentine's gifts for kids, easter basket stuffer for kids, Mother's Day gift  ",
        " Reusable 200000+ Times：The electronic educational writing tablet for kids is easy to use, just use the stylus to write, draw, scribble, doodle anything you want! Press the erase button to clear the screen in one second. Or press the lock key to save the screen contents. Our magic reusable drawing tablet is built in a button battery (holds up to 12 months of use, replaceable), which can work for a while with 200000+ erasing  ",
        " Safe & Durable & Portable Toddler Travel Toys：The doodle board made with safe & non-toxic & durable material, to ensure the health and safety of your children, Our doodle board is a lightweight and portable airplane travel toy for girls 3 years old+ kids, perfect for entertaining your child on long car journeys or playing with other children, and you can use it in a variety of scenarios including cars, planes, and outdoors. It's the star of the show wherever it goes and can keep kids busy for hours on end  ",
        " Ideal Gift for Kids：The multi-functional LCD writing tablet is a perfect toddler gift for kids of all age groups. It can be an educational girls toys for preschoolers. It can also be a travel toy for long drives and road trips. A perfect parent-pick gift for 3 4 5 6 7 8 year old girls and boys on birthday, Valentine's gifts for kids, back to school, homeschool, Children's Day, Mother's Day gift, Thanksgiving Day, Christmas, Halloween, Easter basket stuffer for kids and any occasion  "
    ]
},
]