[
{
    "name": "        Oil Sprayer for Cooking Olive Oil Sprayer Mister for Air Fryer Vegetable Vinegar Oil Portable Mini Kitchen Gadgets for Baking,Salad,Grilling,BBQ,Roasting (2)       ",
    "stars": [
        "68%",
        "14%",
        "8%",
        "4%",
        "6%"
    ],
    "pid": "B0BDDPBQD3",
    "ratings": "259 ratings",
    "other_info": {
        "Brand": "ZEREOOY",
        "Material": "Stainless Steel, Glass",
        "Capacity": "100 Milliliters",
        "Recommended Uses For Product": "Cooking",
        "Number of Items": "2"
    },
    "discount_price": "$ 13.99",
    "normal_price": "$14.99",
    "about_this_item": [
        " ✿ NEW DESIGN SPRAYER - The oil sprayer for cooking is a new design sprayer,it bring you new cooking experience.The olive oil sprayer will make a good control for oil and bring you a healthy life style.It is a practical kitchen gadgets.  ",
        " ✿ HEALTHY SPRAYER - The oil sprayer mister for air fryer is made of premium 304 stainless steel and food grade glass bottle. It adapt to people who would like to control oil on cooking.Fill it with your favorite oil and go out to grill.  ",
        " ✿ BETTER SPRAY - The cooking oil sprayer is perfect for oil,vinegar,cooking wine,vegetable oil,soy sauce,water,many kinds of oils.It is convenient for oil control.You can get better spray when cooking.  ",
        " ✿ EASY TO USE - The olive oil spray bottle is very easy to use.The new design on sprayer make you feel easy to cook.The new design is portable.You will love to cook with the sprayer.  ",
        " ✿ WIDELY APPLICATIONS - The oil mister spray bottle have widely applications such as cooking, frying, BBQ, Baking,Making salads.It will provide you best way to control oil.You can contact with us if any problem. ZEREOOY team will respond timely.  "
    ]
},
{
    "title": "Works very well!",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried various other oil spray bottles and this one by far has worked the best. It has a nice spray to it. It does not just produce a solid stream/squirt of oil like so many others. It holds a nice amount and looks great sitting out. It's so easing to pull a spray the spatula or griddle to keep eggs from sticking. If you are in need of something like this I would definitely purchase this one.",
    "post_time": "Reviewed in the United States on December 17, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Doesn't eject a even mist. Part of the spray pattern is more like a stream.",
    "post_time": "Reviewed in the United States on April 30, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Good looking, doesn't spray evenly.",
    "rating": "4.0 out of 5 stars",
    "content": "Won't buy again.",
    "post_time": "Reviewed in the United States on June 28, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "June 6, 2023 update:",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B0BDDPBQD3"
},
{
    "title": "What a shame-Updated",
    "rating": "5.0 out of 5 stars",
    "content": "Customer support contacted me about my 3 star review to offer me thier updated larger product because of the issue noted above. Excellent customer support.",
    "post_time": "Reviewed in the United States on March 28, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Edited to update: Great customer service, I was sent 2 replacement sprayers. Hopefully they last a long long time.",
    "post_time": "Reviewed in the United States on July 9, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "They don't clog with vegetable oil.",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased these in April this year. One just quit working, so far the second is still spraying. Wish I'd saved my money.",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They work well, don't clog, easy to fill, come with a tiny funnel and a bottle cleaner. I'd buy again.",
    "post_time": "Reviewed in the United States on August 15, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Great money saver and easy to use",
    "rating": "4.0 out of 5 stars",
    "content": "I bought these bottles for evoo and canola oil.  They are a great money saving hack!  Instead of buying cooking spray you put your oil in these bottles and spray your food or pan.  They were a little tricky filling but not a problem because they came with a funnel to pour.  You just have to pour slowly when filling them.  They haven’t clogged had any issues.  I won’t be buying any more cooking spray.  These are perfect!  Well worth the money and a few minutes to fill the bottles.",
    "post_time": "Reviewed in the United States on February 9, 2024",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Purchased for use with an air fryer-  bought two- one for olive oil, one for lighter vegetable oil-  4 months in-  olive oil bottle still spraying great, however the veg. Oil. Bottle has stopped spraying a nice wide mist and is just dribbling.  Conceptually, these are great-  when they work, they work great-  Wish there was a replacement sprayer attachment available.  Rating is due to the one which stopped working-  If they both were in operational order- I’d give 5 stars.",
    "post_time": "Reviewed in the United States on July 14, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "It’s fine",
    "rating": "3.0 out of 5 stars",
    "content": "Like could I do the same thing with any left over spray bottle? Probably… the nozzle moves down & up when depressing the spray button which is weird.",
    "post_time": "Reviewed in the United States on April 2, 2024",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The volume of the spray is lower than expected. I had hoped to be able to spray my cooking pans with a light coating of oil vs pouring it in but the volume put out with a spray is insufficient to justify using it in that way. I do, however, like it for when an extra light coating is desired, such as on bread, etc.",
    "post_time": "Reviewed in the United States on November 26, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "It's just ok",
    "rating": "4.0 out of 5 stars",
    "content": "It sprays a little harsher than the trigger models I’ve seen. Description says it’s glass but box says differently. Other than that it works fine and definitely cuts down on the oil I use especially for grilling",
    "post_time": "Reviewed in the United States on June 24, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a pretty handy little product. It is on the small size & spritzes instead of sprays but is very handy if you need a light coating of oil. The funnels that are included, on the other hand, are way too small & useless, in my opinion. My daughter asked for this after using mine. She liked them so much.",
    "post_time": "Reviewed in the United States on January 26, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Decent",
    "rating": "4.0 out of 5 stars",
    "content": "Pump worked well but if bottle had indentations to hold it while spritzing that would be better. If a fine oil mist is needed, this does the job.",
    "post_time": "Reviewed in the United States on April 17, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Came back to buy more, everyone love them!",
    "post_time": "Reviewed in the United States on January 19, 2024",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Handy",
    "rating": "2.0 out of 5 stars",
    "content": "Bought this product to have better disbursement control of oil and vinegar when prepping my salad. However, the spray works perhaps a little too well. The spray range is very wide my balsamic  vinegar sprayed over my plate and beyond. Suffice to say, I didn’t see myself having to clean up every time after dressing my salads so I returned it.",
    "post_time": "Reviewed in the United States on February 25, 2024",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These have saved me so much money! No more buying aerosol cans of oil!! I loved them so much I bought my mom some and my mother in law. I use it daily when cooking. Great purchase & saves money$",
    "post_time": "Reviewed in the United States on August 3, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "A fine oil mist",
    "rating": "2.0 out of 5 stars",
    "content": "It just shoots a single stream. It no longer sprays",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I discovered this sprayer after receiving an air fryer for Christmas. It works great and I have one for EVOO and one for Avocado oil. I use them when baking, sautéing, and pan frying. I’m able to get just the right amount to get the job done.",
    "post_time": "Reviewed in the United States on June 1, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Small In size",
    "rating": "5.0 out of 5 stars",
    "content": "They are small but they are very functional and they work very well..",
    "post_time": "Reviewed in the United States on September 12, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use, came with cleaning brush and funnel , that's a plus, even spray , doesn't leak, quality material.",
    "post_time": "Reviewed in the United States on July 23, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Durable",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use, fine mist, great coverage & duration of spray. Use for olive, coconut & avocado oils.",
    "post_time": "Reviewed in the United States on July 3, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Wanted to love this a bit more but was disappointed at how it sprays. It shoots a bit more of a line than expected. I wanted it to be more spread. Still like then and can get use of them.",
    "post_time": "Reviewed in the United States on January 13, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Love These!",
    "rating": "5.0 out of 5 stars",
    "content": "I love these. So much healthier than than store brand sprays.",
    "post_time": "Reviewed in the United States on July 19, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "These were bad right out of the box, noticeably dirty and needed thorough cleaning before use. The design doesn't allow it to dry properly so even after drying for several days there was still water stuck inside that found its way into the oil I filled the bottles with, making it go rancid. The spray nozzle would randomly stop working during use. They barely lasted a week before one bottle broke at the threads during washing, leaving the broken threads just recessed enough in the sprayer that I couldn't remove them. The second bottle ejected the actual spray nozzle from the sprayer rendering it useless too.",
    "post_time": "Reviewed in the United States on November 25, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Doesn’t spray evenly",
    "rating": "5.0 out of 5 stars",
    "content": "They are great but would like some a little bigger , taller bottle.",
    "post_time": "Reviewed in the United States on March 7, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works great, looks great! Very happy. Bought some more for friends & family as gifts too.",
    "post_time": "Reviewed in the United States on December 3, 2022",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Great product",
    "rating": "2.0 out of 5 stars",
    "content": "Product has a flaw where top breaks off easily. Glass neck breaks leaving product useless.  I ordered 2, so far I am only able to use 1 as 1 is broken after spraying 1 time where the neck broke away. How ever the seller sent out a replacement which I have had further problems with. Sprayer doesn't function after a week.",
    "post_time": "Reviewed in the United States on January 2, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Gave 2nd one to granddaughter for her birthday.",
    "post_time": "Reviewed in the United States on January 21, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Poor quality construction",
    "rating": "1.0 out of 5 stars",
    "content": "Worked beautifully for a couple of months, then top separated from glass body and stopped working, oil leaking out making a mess.  I bought 2 of these and have the same problem with both.  Loved how they worked, form factor, and how well they worked, until they fell apart.  Cannot recommend.",
    "post_time": "Reviewed in the United States on January 9, 2024",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love these!",
    "post_time": "Reviewed in the United States on January 25, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Good product",
    "rating": "1.0 out of 5 stars",
    "content": "I wanted to spray Avocado and Grapeseed oil for use in my air fryers... Every time I tried to use the sprayers I get a lot of oil ruining onto my fingers... I personally feel it is poor design...  I purchased another brand on Amazon a while back but my mistake is that I only ordered one and not three... I believe the WooHoo has been discontinued so I tried this brand and I wasted my money...  GL",
    "post_time": "Reviewed in the United States on March 1, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I bought a set for my husband, and both bottles are already broken. The neck snapped on one as I was tightening it closed after filling up, and the pump on the other broke.",
    "post_time": "Reviewed in the United States on March 22, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Extremely disappointed",
    "rating": "1.0 out of 5 stars",
    "content": "Will not spray, at all. Even once. And I was stupid enough to buy two of them.",
    "post_time": "Reviewed in the United States on September 21, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I bought this to use with my air fryer but found out it just shoots a solid stream of oil rather than a mist.  In other words…it sucks.",
    "post_time": "Reviewed in the United States on February 20, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Not durable",
    "rating": "1.0 out of 5 stars",
    "content": "I think the pressure was too much with oil. Got broken all over my food while using it. Quality of the glass is bad.",
    "post_time": "Reviewed in the United States on November 15, 2022",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "See the video it doesn't spray any more",
    "post_time": "Reviewed in the United States on June 7, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "They will not spray even after much cleaning and priming.",
    "rating": "5.0 out of 5 stars",
    "content": "They work great! Use almost every day.",
    "post_time": "Reviewed in the United States on January 25, 2023",
    "pid": "B0BDDPBQD3"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Best investment.",
    "post_time": "Reviewed in the United States on April 17, 2023",
    "pid": "B0BDDPBQD3"
},
]