[
{
    "name": " The Only One Left: A Novel ",
    "stars": [
        "58%",
        "30%",
        "10%",
        "2%",
        "1%"
    ],
    "pid": "B0BJ17G933",
    "ratings": "29,346 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "Couldn’t put it down!",
    "rating": "5.0 out of 5 stars",
    "content": "This was my first, and definitely not my last, Riley Sager novel. I’m hooked! Loved the twists and suspense! I can’t wait to read another one!",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Could not put this book down! The story was intriguing, the characters were deeply developed, the and twists kept coming. A must read for sure!",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Absolutely Amazing",
    "rating": "4.0 out of 5 stars",
    "content": "The book kept me hooked! The ending was full of twists, almost comically so, but I still really enjoyed it.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was the absolute best book yet, so many emotions that I’m holding on right now and I’m just filled with joy and laughter right now, shock and surprise, sadness and trying to find my thoughts lol. My heart races still even after finishing this book. I’m in awe 🫢 with these pages that I’ve read, what a beautifully written, most of all, page turner this book was. The thriller and twists of “The Only One Left” would leave behind, Riley Sager, such a great read friend. I’m looking forward to reading more books by you, thank you for forever leaving the imprints of this book in my soul, lurking through my shadows of the night. ❤️",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Wild",
    "rating": "4.0 out of 5 stars",
    "content": "At seventeen, Lenora Hope",
    "post_time": "Reviewed in the United States on June 30, 2023",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Hung her sister with a rope",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Wowwww",
    "rating": "5.0 out of 5 stars",
    "content": "Now reduced to a schoolyard chant, the Hope family murders shocked the Maine coast one bloody night in 1929. While most people assume seventeen-year-old Lenora was responsible, the police were never able to prove it. Other than her denial after the killings, she has never spoken publicly about that night, nor has she set foot outside Hope’s End, the cliffside mansion where the massacre occurred.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Stabbed her father with a knife",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "A TWISTY TALE...",
    "rating": "5.0 out of 5 stars",
    "content": "Took her mother’s happy life",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s now 1983, and home-health aide Kit McDeere arrives at a decaying Hope’s End to care for Lenora after her previous nurse fled in the middle of the night. In her seventies and confined to a wheelchair, Lenora was rendered mute by a series of strokes and can only communicate with Kit by tapping out sentences on an old typewriter. One night, Lenora uses it to make a tantalizing offer—I want to tell you everything.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Great psychological suspense novel with more twists than you can count",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed this book. The story involves the protagonist kit taking a job at the local bogeyman’s residence growing up in their community. Everyone knew what happened at the hope house. However, Kit doesn’t feel like she has a choice if she wants a job so she takes the job reluctantly.",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Almost immediately kit learns that there are many mysteries in the house and as she unravels those mysteries, a new mystery develops on top of it.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "absolutely LOVED IT",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed this psychological suspense novel. The only reason I did not give it five stars is I didn’t really like the ending. It seemed a little too far stretched (a little too convenient. Maybe that is just me. It still is an exciting read and I recommend to anyone who is a fan of thrillers, suspense or psych suspense…",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just read it. You won’t regret it. Superb narration and thrilling throughout the whole novel. I loved it so much.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Heart pounding.",
    "rating": "4.0 out of 5 stars",
    "content": "Wow, wowee, Wowzers!",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I thoroughly enjoyed this book. This is the first time I've read anything by this Author but it certainly won't be my last!",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Great read !",
    "rating": "5.0 out of 5 stars",
    "content": "I truely enjoyed his style of writing and what the story was about.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "So suspenseful, great twist, book quality is great.",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Great read!",
    "rating": "5.0 out of 5 stars",
    "content": "The characters were believable, and the plot twists were great. I loved this book with an unexpected ending. Riley Sager is an amazing author.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kept me in suspense until the end. I did not see the one twist coming. Loved it!",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Good with unexpected twists",
    "rating": "4.0 out of 5 stars",
    "content": "Easy read, kept my interest, several plot twists at the end; overall a good read",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm not going to spoil the reading of this book. Yes it's a thriller and take and unexpected turn at the end. Not everything is what it seems.  Interesting book, although, sometimes predictable.  I've enjoyed the reading, you should too.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Unexpected turn",
    "rating": "4.0 out of 5 stars",
    "content": "Tight plot with twists and turns, an excellent beach read. 4 vs 5 stars for me for literally the last line of the book which left me annoyed that “she” doesn’t live her own life.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was hard to put down so much mystery and details trying to figure out what really happened so many twist and turns I highly recommend you read this book .",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "well plotted",
    "rating": "4.0 out of 5 stars",
    "content": "3.5 stars",
    "post_time": "Reviewed in the United States on June 30, 2023",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "THE ONLY ONE LEFT, by Riley Sager started out strong, with the premise of a caregiver going to nurse an elderly woman--now partially paralyzed by strokes, and incapable of speech--who was thought to have killed her family in 1929. Although the woman was found innocent from lack of evidence, she was the only one left, and opinions remained firm that she committed the murders.",
    "post_time": "Reviewed in the United States on March 24, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Great read !",
    "rating": "5.0 out of 5 stars",
    "content": "The gothic atmosphere of the decaying mansion on an unstable cliffside were phenomenal. I loved the touches such as slanting floors, and cracks appearing in the walls from the movement of the water and land below. The pacing was good--shorter chapters that propelled me into wanting to read the next immediately. I did figure out one key twist earlier than I would have liked, but in the scheme of the book, it was only one of many, and on its own did not detract from my wanting to know more.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Where the book fell for me was mainly at the end. I felt that too much (and too many coincidences) were added in practically at the last moment. In this case, \"less would have been more\", in my opinion. Despite not really \"liking\" any of the characters, I was quite invested in what had happened to the family in the past. Things were progressing well until close to the last quarter or so, when some of the lines merging seemed too thin to be believable. If not for that, I believe this would have easily been a 4.5 star read for me.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Great gothic atmosphere!",
    "rating": "3.0 out of 5 stars",
    "content": "Overall, the book held my attention, and had some clever twists to it.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Recommended.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "A tad bit predictable",
    "rating": "4.0 out of 5 stars",
    "content": "This is all the things good drama gives us.  Lots of turns  and twists, with evil taking on some great faces. Mr Sager will not disappoint. I didn't care for the ending but thats  just me. Still a good read. Worth purchase!",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Riley Sager, just started reading her books and so far it hasn't disappoint me.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Great Book!",
    "rating": "5.0 out of 5 stars",
    "content": "The Only One Left. I waited and waited for this book. It was worth the wait. I loved all the little revelations and twists.",
    "post_time": "Reviewed in the United States on July 2, 2023",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "As kids, (I think it was more my parents generation but they told it to me when I was a kid) the little murderous rhyme was Lizzie Borden took an axe and gave her father forty whacks…  I thought it was really clever of the author to come up with his own about Lenora.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Awesome Book!",
    "rating": "5.0 out of 5 stars",
    "content": "Lenora Hope was accused of murdering her family in 1929 and due to polio and strokes she is bedridden and cannot speak. Kit, is a middle aged care giver who becomes her carer and what unfolds is really a tale. Lenora’s former nurse left unexpectedly and Kit who has her own sad past steps in.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved the setting: old mansion on a crumbling cliff; 80’s time frame. The characters: old Mrs. Baker, devoted house manager, Archie, devoted chef, Jessica, new young maid, Carter, new and young groundskeeper. Kit is the main character and she is kind of a sad, struggling 30’s year old. Her mother recently passed from cancer and Kit was her carer. Now her dad won’t really talk to her and blames Kit for her mothers death in a sense. Kit takes the role of Lenora’s carer for money to get away from that town and also to prove to herself she is good at her job.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Lots of twists!",
    "rating": "5.0 out of 5 stars",
    "content": "Another thing I really, really like is that you don’t know if there’s a ghost or haunted aspect to it. The whole book I am questioning if there is a freakin ghost.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "There was also a message I feel though this book in basically never underestimate someone who has disabilities. Through the book you see the characters treating Lenora well.  As though she matters, her communication is different but she is still a human being and communicates. I really liked that aspect. Because really, it seems most people in Lenora’s condition would be left in a nursing home. But there was definitely a care aspect in the book.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Loved it!",
    "rating": "5.0 out of 5 stars",
    "content": "I loved it. 5 stars easy.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I could say this was a little bit of a slow burn but I guarantee you will not have this book figured out till you’re done reading! Lots of twists at the end!",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Twists and Turns",
    "rating": "5.0 out of 5 stars",
    "content": "“At seventeen, Lenora Hope",
    "post_time": "Reviewed in the United States on August 25, 2023",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Hung her sister with a rope”",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Excellent twisting mystery!",
    "rating": "5.0 out of 5 stars",
    "content": "I went into this book blind, but based on the cover alone, I definitely knew I was heading into gothic territory, which I love!",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "“Stabbed her father with a knife",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Complex and mysterious",
    "rating": "5.0 out of 5 stars",
    "content": "Took her mother’s happy life”",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This story pulled me in, immediately! I had no idea where this story was going to take me, but I was ready for a suspenseful ride. This book gave me “Rebecca-Agatha Christie-Verity” vibes within the first few chapters.",
    "post_time": "Reviewed in the United States on June 27, 2023",
    "pid": "B0BJ17G933"
},
{
    "title": "Never saw it coming",
    "rating": "5.0 out of 5 stars",
    "content": "“‘It wasn’t me,’ Lenora said",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "But she’s the only one not dead”",
    "post_time": "Reviewed in the United States on February 16, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Loved loved loved this book",
    "rating": "3.0 out of 5 stars",
    "content": "When Kit McDeere is assigned to be the caregiver of her town’s very own Lizzy Borden, she’s not in a position to refuse the job. Having just spent six months suspended from her job and living at home with her father, she’s in desperate need to earn money and leave her family home.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fearful of what she might encounter at Hope’s End-a cliff side mansion in disrepair-she’s surprised to find the notorious subject of childhood rhymes to be nothing more than a frail old woman confined to a wheelchair who is unable to speak, and only has the use of her left hand.",
    "post_time": "Reviewed in the United States on August 28, 2023",
    "pid": "B0BJ17G933"
},
{
    "title": "this book was great !!",
    "rating": "5.0 out of 5 stars",
    "content": "From the twist and turns to the unexpected ending. It’s all intertwined but makes perfect sense as well. This book deserves two thumbs up !!",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Product new and arrived next day. A must read’",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Book lovers!",
    "rating": "5.0 out of 5 stars",
    "content": "I’m sorry what?! It started as a game of clue and ended as the lifetime move everyone loves to hate. It really makes you feel it all. This book held me captive to the point I was dragging out the ending for fear of the book hangover I could already feel coming on. It’s been about 15 minutes and I’m still reeling from the loops and turns. I’m happy I have a physical copy to read again a time or ten.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I really enjoyed this book. I read it in a few days, but the plot changed so many times it was very hard to keep up and there were things that didn't make logical sense to me. It's a great book to read on a beach or while on vacation because it is hard to put down!",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Worth the read and reread!",
    "rating": "5.0 out of 5 stars",
    "content": "I haven't read a book that kept me on edge in a while. I couldn't stop reading! You find out one thing, and another truth is formed! Highly reccomend.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was referred by a book club. I really liked it! Unexpected twist. I was hooked 30 pages into it. Read it in three days. I have read one other book by this author and I’m really enjoying the writing.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "What just happened?",
    "rating": "3.0 out of 5 stars",
    "content": "There are so many pages spent on repetition in the telling of the story. The plot twists were visible from miles away. The setting was maybe intended as gothic horror, but was really just not believable. I didn’t hate it so 3 stars. Recommend if stranded for weekend and nothing else on bookshelf.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So many plot twist, I loved it !!! You learn one plot twist and then another . Just when you think you’ve learned it all BOOM 🤯 something else . I was stuck to it from the beginning . First read from this author, will be buying more .",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "What a Fantastic Read",
    "rating": "5.0 out of 5 stars",
    "content": "This is the first book I have read by Riley Sager. I can assure you that it won't be the last.",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "B0BJ17G933"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book had a few twists in it, but the main ones were startling.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0BJ17G933"
},
]