[
{
    "name": "        VEWIOR 900W Blender for Shakes and Smoothies, Smoothie Blender with 6 Fins Blender Blade, Personal Blender for Kitchen, Smoothie Juice Mixer Include 2 * 22 oz To-Go Portable Cups       ",
    "stars": [
        "67%",
        "14%",
        "7%",
        "4%",
        "9%"
    ],
    "pid": "B0BL12H64Y",
    "ratings": "2,341 ratings",
    "other_info": {
        "Brand": "VEWIOR",
        "Color": "Sliver",
        "Special Feature": "Portable, Multiple Attachments, Removable Blade",
        "Capacity": "1.4 Pounds",
        "Product Dimensions": "12.51\"D x 4.85\"W x 11.41\"H"
    },
    "discount_price": "$ 49.99",
    "normal_price": "$66.99",
    "about_this_item": [
        " Upgraded 304 Stainless Smoothie Blender: Most blender for smoothies on the market only have a 4-leaf gearless blade, but Vewior smoothie blender has been comprehensively upgraded to 304 stainless steel 6-leaf gear blades. This design allows you to blend and extract nutrients easily. Turn the toughest whole foods into nutritious shakes, smoothies, and nut butter in 10 seconds.  ",
        " Capacity Upgrade & Non BPA: This blender for shakes and smoothies comes with 2*22 oz/650ml portable cups. Besides, includes 2 travel lids, which add portability for carrying. All parts are BPA-free to ensure healthy drinking. Enjoy tasty & healthy homemade beverages everywhere.  ",
        " Intermittent Press Operation: The blenders for kitchen adopts powerful pulse technology, which triggers the motor to rotate at high speed when pressed, with a max rotating speed of 25000 rpm, making the perfect drink within 10-20 seconds. Simply press and hold the smoothie blender's cup and immerse in the stirring process.  ",
        " Easy to Clean Smoothie Blender: Fill with 3/4 clear water, and a few liquid dish soaps, shake the personal blender cup, and press down for cleaning. The blade is partially removable and can be cleaned by just rinsing with tap water. The blender for shakes and smoothies cups and to-go lids is dishwasher safe (below 158℉).  ",
        " Multifunctional Blenders for Kitchen: With a 900W powerful motor, VEWIOR small blender for shakes and smoothies for fast mixing. The 6-leaf blade can be used for smoothies, juices, shakes, baby food, ice cream, and protein drinks.  "
    ]
},
]