[
{
    "name": "        VEWIOR 900W Blender for Shakes and Smoothies, Smoothie Blender with 6 Fins Blender Blade, Personal Blender for Kitchen, Smoothie Juice Mixer Include 2 * 22 oz To-Go Portable Cups       ",
    "stars": [
        "67%",
        "14%",
        "7%",
        "4%",
        "9%"
    ],
    "pid": "B0BL12H64Y",
    "ratings": "2,341 ratings",
    "other_info": {
        "Brand": "VEWIOR",
        "Color": "Sliver",
        "Special Feature": "Portable, Multiple Attachments, Removable Blade",
        "Capacity": "1.4 Pounds",
        "Product Dimensions": "12.51\"D x 4.85\"W x 11.41\"H"
    },
    "discount_price": "$ 49.99",
    "normal_price": "$66.99",
    "about_this_item": [
        " Upgraded 304 Stainless Smoothie Blender: Most blender for smoothies on the market only have a 4-leaf gearless blade, but Vewior smoothie blender has been comprehensively upgraded to 304 stainless steel 6-leaf gear blades. This design allows you to blend and extract nutrients easily. Turn the toughest whole foods into nutritious shakes, smoothies, and nut butter in 10 seconds.  ",
        " Capacity Upgrade & Non BPA: This blender for shakes and smoothies comes with 2*22 oz/650ml portable cups. Besides, includes 2 travel lids, which add portability for carrying. All parts are BPA-free to ensure healthy drinking. Enjoy tasty & healthy homemade beverages everywhere.  ",
        " Intermittent Press Operation: The blenders for kitchen adopts powerful pulse technology, which triggers the motor to rotate at high speed when pressed, with a max rotating speed of 25000 rpm, making the perfect drink within 10-20 seconds. Simply press and hold the smoothie blender's cup and immerse in the stirring process.  ",
        " Easy to Clean Smoothie Blender: Fill with 3/4 clear water, and a few liquid dish soaps, shake the personal blender cup, and press down for cleaning. The blade is partially removable and can be cleaned by just rinsing with tap water. The blender for shakes and smoothies cups and to-go lids is dishwasher safe (below 158℉).  ",
        " Multifunctional Blenders for Kitchen: With a 900W powerful motor, VEWIOR small blender for shakes and smoothies for fast mixing. The 6-leaf blade can be used for smoothies, juices, shakes, baby food, ice cream, and protein drinks.  "
    ]
},
{
    "title": "Great customer service",
    "rating": "4.0 out of 5 stars",
    "content": "I have really enjoyed this blender, but this morning a piece cracked, which made it not work at all anymore. I reached out to customer service and within a few hours back-and-forth they have agreed to replace it. They have been extremely easy to deal with and accommodating to my needs! Now, I will just await my replacement!",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I got this product a year back and had issues with the blender. when I called customer support team, they were so prompt in responding back with necessary details. They asked me to send photos of the product with issues to review and help me with replacement. Very supportive and clear in understanding customer needs. Highly recommended product.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Customer Support and assistance",
    "rating": "5.0 out of 5 stars",
    "content": "Great blender for it's size and price. After 10months of using it, the rotating piece in the base of the blender broke off unfortunately. But it was very easy to get in touch with the Vewior team on chat. Because I'm still covered under warranty they will be sending a replacement. I'm impressed with how easy and quick the process has been!",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I would give this 5 stars if the tabs sticking out that engage the motor weren't as sharp. I found this out when I tried to put some type of huger on the cups. They also make it uncomfortable to drink from the cups.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Wonderful product and great customer service",
    "rating": "4.0 out of 5 stars",
    "content": "I ordered this to make some protein smoothies for myself and family. It's a great blender for the price. I didn't want to spend a fortune on a Vitamix so this is a decent alternative since we only intended to use it so smoothies. It has to work hard when you add ice and one of the plastic tabs that presses down to make the blender, blend, broke off shortly after we got it. We're still able to make it work but with it was a tad studier. But for the price? It's still good.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have loved this smaller, but powerful smoothie blender to make smoothies every morning! It is so nice and cups can be washed out right after or placed in the dishwasher. I did have a slight issue with a part of the blender breaking but the support was able to quickly work with me and ensure a replacement would be sent out right away!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Great little blender.",
    "rating": "4.0 out of 5 stars",
    "content": "Bought in April and had an issue in September but the company gave me a refund even months later. Solid customer service. Will buy from again",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s a great blender and easy maker . We make strawberry banana smoothie everyday. Excellent performance",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Great blender for the price",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this for smoothies. I love it and the power is great. I would definitely recommend.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This blender works really well. It blends up into a fine crumbles.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Good blender to buy.",
    "rating": "5.0 out of 5 stars",
    "content": "We used the blender for two months and we love it. The noise level is low, and the blending quality is good.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this smoothie blender for my teenager as a birthday gift. She absolutely loves it! She uses this almost daily & says it does an amazing job blending the frozen fruit. I love the compact size and that it doesn’t take a ton of space to store. For the price it was a definite win!",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Awesome smoothie blender!",
    "rating": "5.0 out of 5 stars",
    "content": "This product not only is quick and effective, but makes delicious smoothies for on the run or just hanging around the house. The price was great and it has proven to be a wonderful addition to my gadgets at home in my kitchen.!",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This convenient easy to use addition to our kitchen has made it possible to enjoy smootihes everyday. We are very busy and thanks to our new smoothie blender we are enjoying healthy and tasty smoothies without a lot of fuss. Break down & clean up is simple and the to go cups are perfect. Now everyone gets their choice of flavors without waiting in line. Definitely recommend to anyone wanting to add smoothies and shakes to their busy lives.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Excellent product and great price",
    "rating": "5.0 out of 5 stars",
    "content": "I have had my share of personal blenders but this one is at the top of the chart. I love the fact that the blender cups are slightly taller than the ones I've used in the past and that it blends in half the time that I have been used to!! Blades are nice and sharp and really take care of business!!!!! Thank you!",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This blender is perfect for the price and size.  I use it every morning to make myself a smoothie.  The to go lid makes it very easy to go from mixing to out the door.  I only wish it came with more cups and lids.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Great for on the go!",
    "rating": "5.0 out of 5 stars",
    "content": "I made this purchase and love this blender.  It's fast and efficient and perfect for my smoothies and shakes.  It gets me my daily needed in take of protein and I could not be more pleased with this product.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a good blender. For great results all it takes is to hold it down to the count of 30. I prepare smoothies with frozen fruit and I love that you don’t get chunks of fruit or ice. Great value product.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "BEST BLENDER EVER!",
    "rating": "5.0 out of 5 stars",
    "content": "I've had the blender for 4-months and have used it at least once per day to make smoothies using frozen fruit and veggies and it has worked flawlessly during that time.  It didn't come with many attachments - just two containers and lids - which is enough for what I use it for.  I would buy this item again in the future.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's the best blender I've ever had",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Blending",
    "rating": "3.0 out of 5 stars",
    "content": "I got this to replace one I had for years. I was really hoping it was as good as it said. I wanted to see if it would blend butter and it just couldn't do it and after a few times trying, it over heated and wouldn't work for a few hours. I did use it for a smoothie buy I put crushed ice in it and it did okay with that. I will just stick with drinks.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use this blender every day for on the go smoothies. It does exactly what I need it to do! 5 stars",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "So easy to use daily",
    "rating": "5.0 out of 5 stars",
    "content": "I had a few blenders before almost always broke trying to shred ice , this blender does the job no problem",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This blender is great for one to two servings. It’s perfect to whip up with smoothie or shakes And comes with 2 cups. If you do use ice use crushed ice",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Easy and simple to blend very useful",
    "rating": "5.0 out of 5 stars",
    "content": "This is actually my second blender. I purchased one for my home & it works so well that I purchased one for my RV. Both are great! Love them so does my daughter & grandsons it very easy to use & blends fantastic, chops ice & frozen fruit great shakes.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the fact that it’s so easy to clean and small enough to make just one for myself and not needing to worry about the mess or space of a bigger blender. I love that it’s so easy to clean - in case you didn’t pick up on that yet lol",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Pretty Decent blender",
    "rating": "4.0 out of 5 stars",
    "content": "This is a great product for smoothies. Not that great with ice cubes.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It has great blending power, and I like how there is a lid for the cup afterwards. It doesn't lock in the on position like my previous blender",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Works excellent",
    "rating": "5.0 out of 5 stars",
    "content": "I recently had a blade brake on my small blender and it went through  a cup. I emailed customer support.  Within  less then 24 hrs they had responded  letting me know they where in the process  of taking  care of the issue.  It did take about 2 weeks,but I received  a new blade and an upgraded cup,which I really like. They were awesome.  I really  appreciate  what they did for me. I definitely  would  buy  another  one of there products. Thank you and especially  to Nath.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Work very good I take it to work and don't have any problem making my shakes in work Easy and fast",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "So much BANG for the buck!!",
    "rating": "5.0 out of 5 stars",
    "content": "I was told I needed to get a one of those super-expensive, high-dollar personal blenders (brand name starts with an \"N\" ends with an \"a\") but lemme tell ya this:  I LOVE THIS PRODUCT!! It's affordable, without sacrificing quality, power, or peace of mind - I know 100% without a doubt this lil powerhouse will blend my frozen berry, ginger, kale, & beet powder shake for my daily nourishment. WONDERFUL, easy to clean. I especially love that I can just unscrew the blender part and slap the cap with the pop-up thingy for my straw right on there. Thank you for this, I'm so pleased I decided to go with this one.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the perfect size for me.  I use for protein shakes mixed with fruit. And, I blend cottage cheese with other ingredients to make the perfect protein packed meals for myself.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "I love this blender",
    "rating": "3.0 out of 5 stars",
    "content": "I had my 1500watt pressure cooker turns on. Then used this from the same outlet and burned up my cooker. Careful. Throws a lot of magnetic variances. If you have a neutral ground wire to earth, then no problem. Definitely would not plug this into an outlet near a laptop or sensitive device",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Originally I bought it for a restaurant I work at, for making drinks! It’s not made for that kind of volume but it’s great on my counter!! It’s slim, stainless Steele, sleek look matches my kitchen perfectly!",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Careful",
    "rating": "5.0 out of 5 stars",
    "content": "The blender is perfect and the fact that it came with two portable cups is good. Easy to clean and worth it.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was looking for something that I could make my protein shakes and fruit smoothies quickly. I researched and found some that were cheaper and some that were more expensive. The cheaper ones don't work as well. This one is mid priced  and it is worth the extra couple dollars. This thing works great. I have blended all kinds of things in it. I always wait to use the product before I rate it but spend the money and get this one. It's exactly what I wanted.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Bought it for work!",
    "rating": "5.0 out of 5 stars",
    "content": "I use it every day for protein shakes and it’s wonderful and easy to use. It’s also easy to clean and it come with tops that you can drink from. I only with I had more cups!",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's one of the best smoothie blender use it everyday before work hasn't failed on me.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Great Blender",
    "rating": "4.0 out of 5 stars",
    "content": "No estoy segura de su potencia comparado con uno que tuve de otra marca. Pero te soluciona.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It works good but not with alot of ice",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Great fo portable blender.",
    "rating": "5.0 out of 5 stars",
    "content": "This blender has a lot of power and is corded. We take this with us when we travel in RV . Its a great size, comes with two cups that hold about 16oz. It does a really great job blending the frozen fruit.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Me gusto q es practica y pequeña..",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "La calidad del producto es exelente",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this 4 months back. Great accessories. It was working all fine. It had hard time handling continuous blending.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Suddenly started experiencing stalled motor and burning smell. Got in touch with customer support and they verified its under warranty and they gave me a free replacement. Excellent customer service.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Decent product for price, excellent customer service",
    "rating": "4.0 out of 5 stars",
    "content": "The size of the cups are perfect. The blender is powerful enough to easily blend frozen fruit and ice.",
    "post_time": "Reviewed in the United States on April 16, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve used this blender for the past year and it has been great. It is very compact. It has no problem blending my protein shakes with ice and frozen fruit. The suction cups hold it steady while it blends with a quick push down. However it recently wouldn’t turn on and I realized one of the tabs on the cup had broken off. I was able to make it work by using the tip of scissors to push where the tab had been. I contacted customer service and they were happy to send me a replacement cup promptly. I recommend this blender. Just wish it had come with an extra cup.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Great smoothie blender",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to use , I love to make 1 cup at a  time, and it is very fast I recommend trying this product",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Is the perfect size for my protein shakes, easy to clean 😎",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Love the blender, customer service rocks!",
    "rating": "5.0 out of 5 stars",
    "content": "Es un buen producto solo que hay una versión que trae más accesorios y pues en el momento del pedido pensé que ese también tenían los accesorios.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Me preocupa un poco que se rompa las partes que accionan la licuadora ya que es el único medio de activación.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Ease and powerful blender.",
    "rating": "5.0 out of 5 stars",
    "content": "Very powerful blender , ideal to make my frozen margaritas and piña coladas.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent product with fast shipping.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "VEWIOR 900W Blender",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and clean",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this blender it’s great for making smoothies  my daughter comes over and we watch tv and make smoothies",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Compact and works great!",
    "rating": "5.0 out of 5 stars",
    "content": "Solid blender does the job well for smoothies and small drinks",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Has great power for a mini blender and doesn’t leak!",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Making smoothies",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this to take up less space on my counter without compromising power of my standard blender. Have used it to make both nutrition shakes and smoothies and has passed the test.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It has suction cups on the bottom to hold it in place.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Solid blender does  the job",
    "rating": "5.0 out of 5 stars",
    "content": "Comes with two cups so I can make two items, perfect for our household.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Matches the rest of my kitchen appliances being stainless steel.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Su fácil uso",
    "rating": "5.0 out of 5 stars",
    "content": "Me encantó su diseño y potencia .. ademas es eficiente y rápida",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and clean. Doesn't take upa lot of space",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Mixes very well",
    "rating": "4.0 out of 5 stars",
    "content": "Does not handle ice well.  I have to be careful; it overheats to the point of smoking … need to give it a break between blending",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This blender comes in a neat box and the product is designed really well. I found it very easy to use the blender. It is perfect for a single-serving of smoothies. The blender comes with two jugs/glasses of equal sizes, so you can replace and use them interchangeably. It was also nice to see a lid for the single-serving jug/glass, so I could just use the same container for drinking the smoothie.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Love it, but …",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, I think this is a really good product, and gives you good value for money.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect size for my morning smoothie and it’s easy to clean.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Easy to use – Exactly what I was looking for!",
    "rating": "4.0 out of 5 stars",
    "content": "This smoothie blender works great.  We make smoothies multiple times a week with frozen fruit, ice, liquid, and the blender handles it all flawlessly.  You screw it on and then push down to activate the blade.  There's suction cups on the bottom to hold it in place, which I appreciate.  It comes with 2 cups & lids, and the blender itself is small enough to store easily and not be an eyesore on the counter.  The cups/lids/blades have held up well in the dishwasher.  So far, this has been a great blender and would definitely recommend it.",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works well for mixing ingredients but does not break up ice.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Love this gadget",
    "rating": "3.0 out of 5 stars",
    "content": "GREAT BLENDER AND EASY MAKER, EXCELLENT PERFORMANCE",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Loved this blender. Worked much better than our old magic bullet. Minimal use for just over a year, and then the motor suddenly just died.",
    "post_time": "Reviewed in the United States on April 26, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Worth the money",
    "rating": "5.0 out of 5 stars",
    "content": "This blender is a great value buy. You get a powerful base plus 2 large blending cups and 1 smaller cup for chopping nuts, along with 2 extra lids. Easy to use for smoothies and any small blending tasks when cooking. Highly recommended.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works flawlessly and is very fast.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Good blender",
    "rating": "5.0 out of 5 stars",
    "content": "Great little smoothie blender. It does the job very well.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great perfect size easy to use!",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Great Blender.",
    "rating": "5.0 out of 5 stars",
    "content": "I love my new Vewior blender! I grind seeds, nuts and dried berries almost every day and this blender does this beautifully. I make smoothies daily and this blender makes it super easy, fast and convenient. It comes with 3 cups in 2 sizes with lids! I can blend my nuts, seeds and berries in the smaller cup and then make my smoothie in one of the larger cups rather than getting out my grinder too. Counter space is extremely limited in my kitchen and now I don’t need the grinder! Woohoo! Summer smoothie making is going to be so easy now. 🥰 I highly recommend this blender, you’ll love it!",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've recently started making protein shakes and smoothies before work to take on my commute and this has made my life 1000 times easier. It's the perfect one serving size, it's so easy to use - just fill, flip, blend and exchange the lid to go. No extra dishes, no re-pouring, no wrong measurements and leftovers. The blade is super sharp and the power very strong, I've had no issues blending even ice cubes. 100% would recommend, great product.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Amazing blender",
    "rating": "5.0 out of 5 stars",
    "content": "I have owned this now for roughly 7 maybe 8 months now and wanted to give it a really good go before leaving a review. Overall I would say it has held up really well, I don’t use this every day but do use it frequently, it washes in the dishwasher just fine I have not found any rust spots on the blades and they haven’t become tighter from being washed in the dishwasher nor soaking in water over night. The plastic cups wash and rinse easy and leave no residue left behind, the 6 blade blender is perfect for bananas and seems to hold up well with flax seeds, if you don’t let the shakes settle between pulses though I have found that it misses chunks of bananas.",
    "post_time": "Reviewed in the United States on January 21, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The big thing I would have to say is I liked how quiet it seems to be compared to a few other brands I have used before. It fits great in my lazy Susan and doesn’t take up much room, all loose bits, cups and lids fit into a little basket perfectly. I would have to say I’m comfortable with the thought of buying a new one if this one ever happens to die on me.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "So good, It even replaces my grinder!",
    "rating": "4.0 out of 5 stars",
    "content": "Beautiful stainless steel finish goes great with our other appliances. Doesn’t take up much counter space with its compact design. Yet it still has a powerful motor that effortlessly blends fruit smoothies and shakes. It is easy to cleanup and is dishwasher safe. The second cup is a bonus as our grandkid loves the fruit smoothies and momma loves the iced coffees.",
    "post_time": "Reviewed in the United States on August 31, 2023",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It struggles w more than 4 frozen strawberries 🍓",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Easy to use",
    "rating": "4.0 out of 5 stars",
    "content": "Smoothies",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Both my wife and I love the blender and the size of the cups. We are using the blender on daily basis and it is strong enough to crush any ice cubs and frozen fruits we put in it. We highly recommend it!",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Really easy to use and amazing customer service",
    "rating": "5.0 out of 5 stars",
    "content": "Update - 7/17/2024 - The blender stopped working a couple of days ago. Upon contacting the customer service, I am amazed of how quick was able to identify the problem (providing also a short video clip). The customer service stated that they will replace it and will mail a new blender. I highly recommend the blender, not just because of the easy of use but also due to the high quality service you get, which is not so easy to find nowadays.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It’s  great! Best product for the money",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "That you don’t need to read an all day manual… it’s that easy!",
    "rating": "5.0 out of 5 stars",
    "content": "I had an issue and customer service made it right",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a compact and powerful blender. It comes with two plastic smoothie cups and lids. Bottom of blender has four suction cups which add to the stability. The blender is quite powerful. Works by pressing down on the cup so you can control the amount of blend to your liking. Good for making a quick smoothie on the go.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Good buy for the value",
    "rating": "3.0 out of 5 stars",
    "content": "I use it for my baby’s foods and it hasn’t failed us yet. Simple to clean and easy to handle. Not massive and perfect for space reservation. And it’s not all that Loud honestly",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was great but the piece that helps the blade from turning, broke 2 months after",
    "post_time": "Reviewed in the United States on February 24, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Great smoothie blender with accessories",
    "rating": "5.0 out of 5 stars",
    "content": "Great blender for the price. Blends well but definitely have to make sure you don’t go over the max fill because it will over heat and stop working. I made the mistake one time but after it cooled down I was able to finish making my smoothie.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0BL12H64Y"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love this blender for my morning smoothie. Perfect size, easy to use, powerful, easy clean, and reasonably priced.",
    "post_time": "Reviewed in the United States on January 15, 2024",
    "pid": "B0BL12H64Y"
},
]