[
{
    "name": "        Portable Handheld Steam Garment Steamer Foldable: Effortless Wrinkle Clothes Steam Iron Removal 20-Second Fast Heat-up, 1200W, 120ml Water Tank for Home & Travel (120V Only, Not for Europe)       ",
    "stars": [
        "66%",
        "10%",
        "5%",
        "3%",
        "16%"
    ],
    "pid": "B0BNTMRRSL",
    "ratings": "1,811 ratings",
    "other_info": {
        "Brand": "NTAYDZSW",
        "Color": "White",
        "Product Dimensions": "6\"L x 3.1\"W x 6.5\"H",
        "Style": "Handheld,Portable",
        "Wattage": "1200 watts"
    },
    "discount_price": "$ 28.79",
    "normal_price": "$39.99",
    "about_this_item": [
        " Quick and Powerful: The 1200-watt Travel Steamer heats up in just 20 seconds, delivering powerful steam that removes wrinkles from clothes in no time.  ",
        " Effortless Operation: This travel steamer is easy to use, suitable for novices and experienced users alike. Its quick heat-up and powerful steam output make ironing a breeze.  ",
        " Portable Design: Featuring a folding design that makes it compact and easy to carry, this travel steamer comes with a storage bag and is perfect for use in 110v-120V countries like the USA and Canada.  ",
        " Versatile and Safe: The travel steamer can be safely used on a wide variety of fabrics such as clothes, curtains, furniture, and toys, making it a versatile tool for all your steaming needs.  ",
        " Careful Maintenance Required: After using the steamer, remove the water tank and heat it for 10 seconds until there's no steam. Give the unit 10 minutes of rest for every 20 minutes of continuous heating to produce steam and fully protect the item. Please note that this travel steamer is only for US Voltage 110~120 volt.  "
    ]
},
{
    "title": "Effortless",
    "rating": "5.0 out of 5 stars",
    "content": "Wish I had taken a picture of my curtain before and then after: it really was effortless! Last time I moved, I IRONED the cotten drapes, and after an hour of pressing, they were still wrinkled! This time I tried this steamer, and I was done in about 15 minutes. Going on a trip next week, and this will definitely go along: the foldable makes it easy to tuck in a suitcase (actually, it will go into a shoe!) (A plus: it isn't really heavy, and I didn't have 'boil-over' like my old steamer did. No burns!)",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like the way it works & the convenience. It seems to do the job it was intended to do. I will say that because I specifically want to travel with it, the size was fine but it was a little heavier than I would have preferred, however it won’t prevent me from using it for travel.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Effective product",
    "rating": "4.0 out of 5 stars",
    "content": "Love the size and for a quick wrinkle remover this works great.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "As the price was excellent, I didn't expect it to work as well and as quickly as it does.  The only reason I didn't give it a five was because it doesn't have an auto shutoff and it takes a long time to cool down.  But it removed wrinkles very well, I did a large long tunic with one water tank and it heated up quickly.  Definitely worth it.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Great size for traveling",
    "rating": "5.0 out of 5 stars",
    "content": "I have a couple of portable steamers, mostly household use and quite heavy. Purchased this travel steamer for an out of state trip, and it worked perfect! I was attending a formal wedding, and this steamer helped me with two evening gowns(out of a carry on),and even helped with my husband’s suits. I have been using when at home (does most of the teaming jobs, not just for traveling!",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One of my best purchases with Amazon. Highly recommended.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "This is surprisingly very nice! Does a good job of removing wrinklers",
    "rating": "5.0 out of 5 stars",
    "content": "This was a great purchase, I got it on sale and used it several times already. It’s lightweight and it steams very well. This is a keeper for my family! The only thing is to make sure you use it with an extension chord because the original chord is very short which I understand because it’s advertised to be a travel product.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great compact travel steamer, it's easy to use and works well on getting out wrinkles during travel.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Works wonders! Light weight but strong steam!Great buy!",
    "rating": "5.0 out of 5 stars",
    "content": "I even let a family member use it on their travel and they were very pleased with it..",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The water  heats up great, follow the directions and allow the steam to empty out before you repack it and you should fine.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Excellent Handheld Steamer",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this steamer to take with us when we travel. It is absolutely perfect! It folds up and easily fits in carry-ons or a backpack for a quick trip. Steam comes out almost instantly and gets wrinkles and folds out of clothing. I would highly recommend this product.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Lo compré por la recomendación de Vanesa Amaro, en Instagram, práctico y fácil para llevar en la maleta",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Perfecto para viajar",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for a vacation and was so surprised of how great this work.  Heats up so fast and does the job.  Gave it to my daughter on the trip and bought another one as soon as I got home.  My other daughter loved it so I gave it to her and now buying another one for me.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This steamer is lightweight and does not leak regardless of which direction it is held.  Easily removes wrinkles!  I can do approximately 3 blouses on one tank of steam.  It heats up very fast & folds together for travel.  As for safety the steam gets very hot! Don’t think I’ll ever be ironing again! Very good value for the money!",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Best Steamer I have bought",
    "rating": "5.0 out of 5 stars",
    "content": "I just went to a wedding in Austin, Texas. We used the steamer for the suits, my dress, my sister’s outfit…it did a great job! It takes away the wrinkles pretty quickly and I didn’t have to go over them over and over. It warmed up quickly too. You need to refill the water few times but it worked well. It’s small, fitting neatly in my suitcase. Really love it!",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The small size is great for travel, but I’ll use it all of the time. The brush really helps smooth the wrinkles, a great addition to a steamer. My husband wasn’t happy I bought this, but once he used it, he fell in love with it!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Very good steamer!",
    "rating": "5.0 out of 5 stars",
    "content": "I bought a total of 3 of these steamers for my son’s wedding. 1 for me, 1 for my daughter, and 1 for my new daughter-in-law. This steamer worked perfectly  for our dresses, suits, and veil.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very happy with this product. This is the 2nd one I’ve bought ex",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Perfect little steamer",
    "rating": "5.0 out of 5 stars",
    "content": "Worked well and conveniently portable.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I really love this product! It is so compact for travel and heats up in less than 30 seconds. The steamer works on pretty much any fabric. I would recommend this product to anyone.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Finally found THE ONE!!!",
    "rating": "5.0 out of 5 stars",
    "content": "This streamer is an absolute game changer!  It really does the job on my tops and pants.  Heats up fast, easy to grip.  Can use on clothes that are hung up or laid on my iron board.  The absolute best!!  I've also taken it on a short trip and it was perfect.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great travel steamer. Bought it for my son's wedding and we used it on dresses, suits, handkerchiefs, etc. Works great and travels well!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Great Little Steamer!",
    "rating": "5.0 out of 5 stars",
    "content": "I love that this product is small/compact, and heats up super quickly. It allows me to steam my clothes in minutes.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This Steamer is very easy to use. It heats up fast and, as it was small, it took up very little luggage space. Light wrinkles came out in seconds and deep wrinkles came out in about 2 minutes. This is going to be part of every trip packing list from now on!",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Best compact/fast steamer!",
    "rating": "5.0 out of 5 stars",
    "content": "Just received it and used it right away. Lightweight and seems like a good amount of steam comes thru the nozel. The cord is a decent size. Won't take a lot of room in a suitcase. I think for the money, its a good product.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I need this steamer especially to reshape my dress hats. Yes this steamer gets hot, but it stays extremely hot once it is turned off, so please unplug it immediately after use. Also, it remain hot to the touch 1 hour after it was unplugged.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Simply Awesome!",
    "rating": "5.0 out of 5 stars",
    "content": "This little guy worked out so good I bought a second one to gift to a friend because I raved about it so much. Took it on a plane flight and it fit perfectly, went to my best friend’s wedding and we used it on 5 dresses.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This steamer is great for travel as well as at home use - small but mighty",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "great product",
    "rating": "5.0 out of 5 stars",
    "content": "really like how this product works.  steamer i had in the past would drip large drops of water on the clothes and just make a mess, this product doesn't do that. it's easy to use and super portable!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this to take on trips to get out wrinkles from traveling.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Travel friendly",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this steamer for a wedding we needed to fly for. It is super light, compact, and easy to travel with. We used the steamer for a tux & dress. Worked flawlessly. 10/10 would buy again!",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Nice and compact for travel. Great little item",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Compact little gem",
    "rating": "4.0 out of 5 stars",
    "content": "I loved the color and heat settings and steam when I first got it. Not sure this item is reliable. It stopped heating after pressing 11 linen cloths and 15 satin table scarfs??",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love that the product is portable it get the job done, but I don’t like is the brush attachment I used it once and the brush flattened, I think they need a stronger brush with that.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Unreliable",
    "rating": "5.0 out of 5 stars",
    "content": "Heats up in seconds. Suitable for what it was used for.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This handheld steamer is a game-changer for both travel and home use! I use it while traveling for work and on my linen sheets at home. It’s easy to use, heats up quickly, and delivers smooth, wrinkle-free results every time. Compact and efficient, it’s the perfect tool for keeping clothes and linens looking fresh!",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "The product get the job done.",
    "rating": "4.0 out of 5 stars",
    "content": "Very easy to use. I find it gets wrinkles out of most clothes. It didn’t do a great job on a linen shirt and if you like to have hard creases, this won’t do that. However for most items, it gets wrinkles out easily and without having to get out the iron and ironing board. Would definitely recommend!",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a great little steamer. I like the sleekness of the style and it gets the job done!!",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Very convenient design and operation.",
    "rating": "4.0 out of 5 stars",
    "content": "Worked as expected",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This little steamer does a fantastic job!!! Quick and simple. No need to pull out entire ironing board!",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Compact for travel",
    "rating": "4.0 out of 5 stars",
    "content": "Love the size for travel!  It’s a cool sleek design too",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this product for home and travel. I no longer use my iron at home. This so much easier to use, at home and travel.  Great product!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Compact and easy to use.",
    "rating": "5.0 out of 5 stars",
    "content": "Very convenient, quick and easy",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This steamer has too short of a cord on it making mobility of steaming clothing items a bit of a challenge at times. Also, leaves wet water spots on clothing and takes a bit for it to dry as well as your clothing in general is left feeling damp after use. Safety: vibrates too much and can fall off any counter top when it’s on and may possibly cause burns if I happens to fall on you, you touch it or the steam blows on you as it may fall.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Travel friendly",
    "rating": "5.0 out of 5 stars",
    "content": "This folds up small, doesn’t take up much room, and works well. Good product",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the ease of this product, how well it works and the quality. And the price point is spot on! I use it for everything-my travel clothes, my curtains and my bed sheets. Awesome product.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Too short of a cord",
    "rating": "5.0 out of 5 stars",
    "content": "This is the best little travel steamer I have ever used.  It is compact for packing, light weight and extremely effective - even on the most delicate of fabrics!  Highly recommend.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This steamer works great. I am thrilled that this product can take the wrinkles quickly. I recommend this steamer.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Lightweight, works great",
    "rating": "5.0 out of 5 stars",
    "content": "The size is perfect for travel.  It is actually strong for being so compact.  I love the size and ease of the steamer.  I would highly recommend.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was looking for something that was small and lightweight, which I have found with this product. It quickly heats up once you turn it on and remove wrinkles without damping the fabric too much. I will say the only downside is the brush that's attached. I notice the brush bristles gets bent after a few uses. Now, it could be a user error on my part and maybe I push down too hard as I'm using it. However, it doesn't change my opinion. Still a great product to have, especially for traveling.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Like it better than my full-size",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this steamer for when I travel, and was pleasantly surprised upon the first time I used it. I can honestly tell you that I like this better than the full-size steamer that I use from day to day. The output of the steam is not compromised, even though the steamer is smaller. I loved it so much that I bought one as a gift for my sister. The design is also beautiful You will not be disappointed in this,",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for traveling. It’s compact and easily stored. Heat up and wrinkle removal in awesome. Steam output and functionality is great!",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Perfect for travel",
    "rating": "5.0 out of 5 stars",
    "content": "I like this little steamer for quick jobs. I first tried it on a new linen dress out of a package and it worked great. Hung it up and moved down the dress easily. I did have to refill the little water reservoir several times. I then tried it on a new pair of linen pants out of the package. It mostly worked, but couldn’t remove all of the wrinkles. Shipping is hard on those folds! It does heat up really quickly and does not leak. I will be taking this on vacation and actually packed it in my suitcase.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recently purchased this travel steamer, and it has quickly become a great addition to my travel kit. It heats up fast, making it easy to freshen up clothes in minutes. The compact design is perfect for fitting into any luggage without taking up much space, yet it’s surprisingly powerful for its size.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Works like you want it to",
    "rating": "5.0 out of 5 stars",
    "content": "The steamer’s performance is effective. it removes wrinkles from various fabrics, from delicate silks to heavier cottons",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, this travel steamer is efficient, reliable, and worth every penny. It’s a game-changer for anyone who wants to keep their clothes looking crisp while on the go. Highly recommend!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Essential Travel Companion - A Must-Have!",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect to steam the wrinkles out. Works great. I ordered another one for a gift",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This project is light weight and easy to use.  It removes wrinkles quickly and easily!  It's an awesome asset to my laundry tools!",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Works Great!",
    "rating": "5.0 out of 5 stars",
    "content": "Love it",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I like the size of this !",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Reliable and packs easy!",
    "rating": "5.0 out of 5 stars",
    "content": "I love this steamer! I needed something small and portable to take with me on trips and this thing is it!",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recently purchased the \"Steamer for Travel,\" and it has exceeded all my expectations! This little gadget is incredibly easy to use and highly effective. Whether I'm dealing with flowy tops, pants, dresses, or any other fabric, this steamer gets the job done quickly and efficiently.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Perfect Travel Companion!",
    "rating": "5.0 out of 5 stars",
    "content": "Its compact size and lightweight design make it a breeze to carry on all my trips. I no longer have to worry about showing up with wrinkly clothes. It's such a relief to have a reliable tool that keeps my wardrobe looking fresh and polished, no matter where I am.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you're looking for a convenient and powerful steamer to take on your travels, this one is a must-have. Highly recommended!",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Great steamer",
    "rating": "5.0 out of 5 stars",
    "content": "We bought this steamer before our vacation and it works great!!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It heats really fast and steams those wrinkles out in no time. So much easier than ironing and having to get an ironing board out",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "The size is perfect for traveling and doesn’t take up space at home.",
    "rating": "5.0 out of 5 stars",
    "content": "Great value for its size. I plan to use this on all my travels.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This steamer is easy to manage when my clothes are wrinkle and practical at use. I like that it folds for easy storage. The only downside is that doesn't have an stand or something similar at the time to cool down after each use even though I still recommend it.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Works great",
    "rating": "4.0 out of 5 stars",
    "content": "Great travel size. Heats up fast.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I bought this steamer for my son to take to college. He wears Western shirts every day and always irons them. Not having a place to Iron in his room I thought a steamer might be what he'd need. We tried out several different brands.  I was very impressed with this one. it heated up fast, was lightweight, and didn't take up much room. It removed wrinkles quickly and steamed the collar quickly, as well as the button area.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Easy to use and works well",
    "rating": "5.0 out of 5 stars",
    "content": "This steamer is easy to use and works really well.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works great, easily portable, quiet while using",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Great",
    "rating": "4.0 out of 5 stars",
    "content": "I took it on vacation to steam clothes for a wedding. It did an adequate job. However it did take longer than a regular size steamer.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been wanting a light handheld steamer and this one checks off all the boxes!  It is lightweight to carry while steaming your clothing on a hanger and it gets the wrinkles out and the job done.  It is compact enough to fold and pack in my suitcase for travel as well.  I wish the cord was a bit longer for more reach, but it still works fine.  You will want to get one for yourself as this is great to have an use.  I have been using it for several weeks now before making this review.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "I like the compact size for traveling. It is easy to use and does a good job for what it is.",
    "rating": "5.0 out of 5 stars",
    "content": "I like it because it's small and does its job. Perfect for taking on trips.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've purchased more than three steamers in the past and none have worked as well as this one. At best, one did remove wrinkles, but only after going over the garment many times. It would have been quicker to just iron it. But this steamer is the real deal! It works so well that it took out all the wrinkles like an iron would have. But the best part is that it removed them almost immediately. I've told all my friends and family about this steamer. It's that good!",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Perfect Handheld Clothes Steamer!",
    "rating": "4.0 out of 5 stars",
    "content": "Very good product, great for travel. I am absolutely thrilled with I. No ironing 😂",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a light steamer that is a work horse.  My arm did not tire out, and was easy to use this in both right and left hands.  I did 5 shirts quickly and easily.  The water tank is the size that will handle 1 to 1.5 shirts- depending on how heavy the material, and how deep the wrinkles.  I think it will be great for a quick wrinkle remover when I don’t have time to get out an ironing board and iron when I’m running late.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "excellent",
    "rating": "5.0 out of 5 stars",
    "content": "We purchased this for a trip we were taking to Atlanta where we were going to have to stay in a hotel for several days. We’ve never liked the irons and the ironing boards in any of the motel rooms we stayed in so we thought we would give this a try. It worked wonderfully! it did a great job, was small, and held up very well! The bristles on the brushes were a little flimsy, but overall we love the product and my wife raved about it!",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Works remarkably well",
    "rating": "5.0 out of 5 stars",
    "content": "Having had several hand-held steamers, I’ve never seemed to be able to get them to work all that well.  My clothes still seem to be more wrinkled than I’m comfortable with, and I’m just looking for passable.  I haven’t touched an iron in years and try to pull my clothes out of the dryer quickly or the most part.  But I was traveling to Europe and felt like giving this thing a try.  I’m pretty amazed at how well it works.  The tank is a little small out of necessity for travel, and it folds up well.  Fingers crossed it continues to work for a long time!  It was definitely worth what I paid for it.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This very useful, very easy to travel with, and easy to use it!",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Very useful",
    "rating": "5.0 out of 5 stars",
    "content": "Amazing little steamer.  Folds up nicely for travel, doesn't take a lot of space and heats up SUPER quickly!",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I saw an influencer demonstrating this steamer which convinced me to give it a try. I’ve purchased more expensive steamers which didn’t do nearly the job this compact steamer does.  The brush attachment really is a plus. I don’t know why but using the brush attachment while steaming clothes makes all the difference in how well the wrinkles come out.  My daughter borrowed my steamer and agreed it’s the best steamer ever. It is very portable, heats up in 10 seconds and easy to use. I do use distilled water in mine to prevent lime buildup which comes from tap water. If I was traveling I would use tap water.  Don’t hesitate to buy this steamer. I think you will love it.",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Quick to heat, easy to use!",
    "rating": "5.0 out of 5 stars",
    "content": "This hand steamer saved my daughter’s wedding dress. It was extremely hot and her dress had to sit in the hot car for hours causing major creases. Luckily I had this with me and I was able to quickly meditate the problem. I loved it so much that I sent it with her on her honeymoon and bought another.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love it! I took every little crease out of a dress shipped that was stuffed in a plastic bag. The wrinkles came out fast without much effort. The tank doesn’t run out fast. I love i can take it with me on vacation as it does not take up much room since it folds. It also heats up fast . I also wanted to steam drapes instead of ironing them . Perfect for that !!!! Best buy and great price!",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Best steamer I’ve ever used",
    "rating": "3.0 out of 5 stars",
    "content": "To be fair, it did get some wrinkles out of some of my clothing. But it took almost an hour to cool down after I unplugged it.  It spit out some water, which wasn't that big of a deal.  I had to refill it twice to do 2 scarves and a T shirt.  I don't like that it has continuous stem so will be returning.  It was misleading to show that it originally was a very expensive item - but this is obviously not true.  It performs like a basic $30 item.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Removes Rinkles effortlessly",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Fast, easy and convenient",
    "rating": "5.0 out of 5 stars",
    "content": "Really easy to use! Easy to understand directions! Easy to store and Teavel with! Very lightweight!",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0BNTMRRSL"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I’m not sure if it was supposed to do it but I felt when I was steaming that water drops shot out too and made the fabric wet. I used other steamers and felt it didn’t do it however it has been a while.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0BNTMRRSL"
},
]