[
{
    "name": "        Magic Mill Pro Food Dehydrator Machine | 7 Stainless Steel Trays | Dryer for Jerky, Dog Treats, Herb, Meat, Beef, Fruit | Keep Warm Function, Digital Timer and Temperature Control, ETL Approved       ",
    "stars": [
        "81%",
        "13%",
        "4%",
        "1%",
        "2%"
    ],
    "pid": "B0BQM6JVDK",
    "ratings": "702 ratings",
    "other_info": {
        "Brand": "Magic Mill",
        "Material": "Stainless Steel",
        "Color": "Stainless Steel",
        "Wattage": "1000 watts",
        "Shape": "Round"
    },
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": [
        " REAR MOUNTED FAN FOR SUPERIOR HEAT DISTRIBUTION – Dries food evenly, This electric dehydration machine is equipped with a rear-mounted drying fan and air flow circulation technology to ensure even drying, there is no need to rotate the shelves as needed by other brands, monitor the dryer process easily with the transparent door window  ",
        " DIGITAL THERMOSTAT AND TIMER- AUTOMATIC SHUT OFF WHEN TIMER DONE -- An adjustable temperature and timer ensure you to have your delicious, dehydrated food done to perfect at optimal temperature and exact timing; the Countdown timer will show you when it will be done, once done it will automatically shut off, And you can set the Keep Warm Function to keep the Food warm.  ",
        " SPACIOUS ADJUSTABLE 7 STAINLESS STEEL TRAYS – INCLUDED FRUIT ROLL TRAYS! Use the trays for regular food and the mesh trays for smaller food such as nuts and herbs, for fruit roll ups use the fruit leather sheet which can also be used for drip trays! you can do a lot in one batch with the Magic Mill dehydration machine, the dehydrator comes with 7 premium stainless steel trays.  ",
        " EASY TO USE AND CLEAN - DISHWASHER SAFE TRAYS You want to dry Jerky, beef, herbs, vegetables, fruit, granola, fruit leathers, breadcrumbs, and for preserving herbs, flowers, and much more, cleaning is easy all trays and liners are dishwasher safe, and the housing can be easily wiped down with a damp cloth  ",
        " TOP OF THE LINE SAFETY FEATURES / BPA FREE The Magic Mill Premium Food Dehydrator is Equipped with intelligent Overheat protection, that will activate if the dehydrator overheats. the trays are built with top Quality food-grade Stainless Steel that is BPA Free  "
    ]
},
{
    "title": "Love it!",
    "rating": "5.0 out of 5 stars",
    "content": "Dried much better than my old one. Fast and uniform.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Banana chips and beef jerky so far. They came out fantastic. Very easy to use.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Perfect end product",
    "rating": "5.0 out of 5 stars",
    "content": "This is perfect. doesn't make any noise for my husband to complain about. I can do twice more foods and its easy to work with. I'm just tired of buying veggies and they go bad before I can use them. Dehydrating them helps to keep them fresh and I don't waste money because I had to through them out. now I can keep them in a jar until I'm ready to use them.",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve made jerky and dried mango, strawberries, and pineapple. Fruit takes about19 hours, jerky less. But it was tasty and great for snacking and hiking. I have the 7 shelf and wish I had gotten a bigger one. Much better machine than my old round dehydrator. Love this product!",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "works great",
    "rating": "5.0 out of 5 stars",
    "content": "Everything works good does it's job I really like it",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It holds about 2 lbs cut into jerky, relatively nonstick, and temperature control increases slightly higher than some others.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "If you're like me and you'll never stop being pissed about the price of jerky, this is great.",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this for my husbands birthday. He was so excited and it did not disappoint. It's fast, quiet, and easy to use.  He has dehydrated everything he can get his hands on.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Great",
    "rating": "5.0 out of 5 stars",
    "content": "I really like that it is space friendly as it doesn't take up too much real-estate on my counter.  I will be purchasing another one as a gift!",
    "post_time": "Reviewed in the United States on March 30, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great dehydrator",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B0BQM6JVDK"
},
]