[
{
    "name": "        Magic Mill Pro Food Dehydrator Machine | 7 Stainless Steel Trays | Dryer for Jerky, Dog Treats, Herb, Meat, Beef, Fruit | Keep Warm Function, Digital Timer and Temperature Control, ETL Approved       ",
    "stars": [
        "80%",
        "13%",
        "4%",
        "1%",
        "2%"
    ],
    "pid": "B0BQM6JVDK",
    "ratings": "705 ratings",
    "other_info": {
        "Brand": "Magic Mill",
        "Material": "Stainless Steel",
        "Color": "Stainless Steel",
        "Wattage": "1000 watts",
        "Shape": "Round"
    },
    "discount_price": "$ 139.99",
    "normal_price": "$199.99",
    "about_this_item": [
        " REAR MOUNTED FAN FOR SUPERIOR HEAT DISTRIBUTION – Dries food evenly, This electric dehydration machine is equipped with a rear-mounted drying fan and air flow circulation technology to ensure even drying, there is no need to rotate the shelves as needed by other brands, monitor the dryer process easily with the transparent door window  ",
        " DIGITAL THERMOSTAT AND TIMER- AUTOMATIC SHUT OFF WHEN TIMER DONE -- An adjustable temperature and timer ensure you to have your delicious, dehydrated food done to perfect at optimal temperature and exact timing; the Countdown timer will show you when it will be done, once done it will automatically shut off, And you can set the Keep Warm Function to keep the Food warm.  ",
        " SPACIOUS ADJUSTABLE 7 STAINLESS STEEL TRAYS – INCLUDED FRUIT ROLL TRAYS! Use the trays for regular food and the mesh trays for smaller food such as nuts and herbs, for fruit roll ups use the fruit leather sheet which can also be used for drip trays! you can do a lot in one batch with the Magic Mill dehydration machine, the dehydrator comes with 7 premium stainless steel trays.  ",
        " EASY TO USE AND CLEAN - DISHWASHER SAFE TRAYS You want to dry Jerky, beef, herbs, vegetables, fruit, granola, fruit leathers, breadcrumbs, and for preserving herbs, flowers, and much more, cleaning is easy all trays and liners are dishwasher safe, and the housing can be easily wiped down with a damp cloth  ",
        " TOP OF THE LINE SAFETY FEATURES / BPA FREE The Magic Mill Premium Food Dehydrator is Equipped with intelligent Overheat protection, that will activate if the dehydrator overheats. the trays are built with top Quality food-grade Stainless Steel that is BPA Free  "
    ]
},
{
    "title": "Exceptional Performance and Versatility!",
    "rating": "5.0 out of 5 stars",
    "content": "I recently purchased the Magic Mill Pro Food Dehydrator Machine, and it has quickly become an indispensable kitchen appliance. This dehydrator delivers outstanding performance and versatility, making it a top-notch choice for food preservation and preparation.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First and foremost, the build quality is impressive. The dehydrator is sturdy and well-constructed, with a sleek design that fits nicely on my countertop. The materials used are durable, and it feels like a high-quality, long-lasting appliance.",
    "post_time": "Reviewed in the United States on April 1, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "This is so amazing!!",
    "rating": "5.0 out of 5 stars",
    "content": "The performance of this machine is excellent. It features multiple trays that provide ample space for dehydrating a variety of foods. I’ve used it to make beef jerky, strawberries, pasta, blueberries, and various other goodies for backpacking. The adjustable temperature settings allow me to dry everything with precision, and the consistent heat distribution ensures even drying, which is crucial for achieving perfect results.",
    "post_time": "Reviewed in the United States on December 29, 2023",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Another great feature is the user-friendly control panel. It’s easy to set the temperature and time, and the digital display is clear and intuitive. The machine operates quietly and efficiently, and the results have been consistently impressive.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "LOVE IT! Great Capacity, Easy to Use, Excellent Results..now what else can I dehydrate?",
    "rating": "5.0 out of 5 stars",
    "content": "Cleaning the trays is a breeze, and the machine is easy to maintain. The dehydrator’s ability to retain flavor and nutrients in the food is a huge plus, making it perfect for creating healthy snacks and preserving seasonal produce.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In summary, the Magic Mill Pro Food Dehydrator Machine is an outstanding investment for anyone interested in food preservation. Its exceptional performance, versatile features, and user-friendly design make it a top choice. Highly recommended for anyone looking to elevate their dehydrating game!",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "I have wanted to have more nutrient dense \"raw foods\" as snacks. Most you find in the store are so expensive and processed. So, I decided to finally go for it and buy a dehydrator. I shopped in the stores and they were all very plastic and the ones that were stainless steel were huge! Just a massive foot print for something Id like to keep on my kitchen counter. But this was perfect. She is so cute and only about a foot wide. I got the 7 shelf so I knew it would not be taller than the cabinets above it and it is just the right height.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Shipping was great. It arrived just when it said it would.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "so easy, and works like a charm.  I should have bought one years ago.",
    "rating": "5.0 out of 5 stars",
    "content": "First thing we did was cut up pineapple and canteloupe. It dried in half the time I was expecting and it was perfect and delicious. The machine has a fan that works so well but is nearly silent. I love that it is metal racks and a stainless shell. Its quiet and small but still holds alot when you use all seven shelves.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I supplemented by getting some silicone trays to use when I am making something that starts off soggy. It came with a few of its own but I wanted to have enough for each tray. If you are concerned about using all seven racks and not having enough air flow...dont be. It fan works great! You just have to double check the size or that you can cut them to size yourself. I did that.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "I love it.",
    "rating": "5.0 out of 5 stars",
    "content": "What can I say.  It's awesome and affordable.  Marinated my first batch of beef for about 36 hours.  Let it run for 10 hours.  Came out delicious.  Most of it was for consumption within the week, so I wasn't super worried about leaving some pieces fatty.  And turns out those are my favorite pieces.  Who knew?  Would totally recommend.  Cleanup was a breeze.  This baby will get a whole lot of use in my house.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this dehydrator! I can make 2.5 lbs of perfect jerky in 5 hours. I only moved the trays once, at the half way mark. The dehydrator is so quiet & it doesn’t put off very much heat. It is also very easy to clean & store. ⭐️⭐️⭐️⭐️⭐️",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Very quiet dehydrator & perfect jerky",
    "rating": "5.0 out of 5 stars",
    "content": "This unit does a great job of dehydrating anything you want to try!  I have made fruit roll up strips, dehydrated just about everything you can imagine, and it does a great job!  It's nice and compact and won't take up too much room on your counter while in use!",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought a lot of apricots and lo & behold . . . after following the instructions and maybe checking out a couple of YouTube videos, I made 2 qts of delicious dried apricots -- no sulfur and delicious!",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Very nice Dehydrator!",
    "rating": "5.0 out of 5 stars",
    "content": "Yupp it worked.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A few weeks later, I purchased 25lbs or Roma tomatoes at the local Farmer's Market . . . and then 5 days later, I had 4qts of \"sun-dried\" tomatoes which, yepp, are wonderful.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "What do I know about Food Dehydrators, but this purchase turned out great!",
    "rating": "5.0 out of 5 stars",
    "content": "I got the slightly used machine for a good price and it works, it really does!",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to use and it's not to heavy and bulky.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Dehydrater",
    "rating": "5.0 out of 5 stars",
    "content": "Received in a few days. Compact size from the last one.  Plan to try it out soon",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like this dehydrator a lot. The one thing I would change is to space the racks farther apart. If you are drying rice or a pile of herbs they sometimes get pulled off by the rack above it. It's certainly not a deal breaker but it is annoying.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Very happy",
    "rating": "5.0 out of 5 stars",
    "content": "Was better than i thought it would be so far. I have used it everyday since receiving it.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I just thing to dehydrate fruits, peppers, and making jerky. Works super well and not over complicated. Clear and precise as needed.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Great for the coin",
    "rating": "5.0 out of 5 stars",
    "content": "We use it often and it yields great results. Holds a lot of food.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I dries evenly and quickly! I had a stacking dehydrator for several years and I am so glad I got this one to replace the old one.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Great Results!",
    "rating": "5.0 out of 5 stars",
    "content": "I wish I could find additional plastic trays and mesh for it. Also it resets the time and temperature if the door is open for more than a few seconds. I think that is a common feature in other brands.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "soy de colombia, para los que quieran comprar este articulo les puedo decir que cumplió con todas las expectativas.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Great product Highly Recommend",
    "rating": "5.0 out of 5 stars",
    "content": "Pretty quiet compared to other brand we had.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Had the old Ronco dehydrator, but this is soooo much better!  I bought it for dehydrating my garden tomatoes but my husband use it for making yummy beef jerky. Auto shut off, cooks evenly, and easy to clean.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "muy bueno",
    "rating": "5.0 out of 5 stars",
    "content": "Ordered this because I wanted to try making home made jerky. It's great! I have the 1 with 7racks I can fit 14 full pieces of asada in it. Has a timer so you can just leave it, easy to clean. Great price!",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Had this for a while now and..... I love love love it! Does everything! Will buy from again if it takes a crap on me",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Great dehydrater",
    "rating": "5.0 out of 5 stars",
    "content": "Made jerky so far. Haven't had the money to try anything else. But so far it's great.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm glad I bought this. I love it. I use it every other day.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "Works very well as intended.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Gave this as a gift to my husband and he is now making his own jerky like crazy! He is very excited and it was so worth it!",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "GOOD QUALITY",
    "rating": "5.0 out of 5 stars",
    "content": "This is the best dehydrator I have ever used . Very pleased with how it makes jerky",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Unit looked well made but had to send back do to being damaged during shipping",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Gift for Husband",
    "rating": "5.0 out of 5 stars",
    "content": "For years, I had been using an older dehydrator that didn't have controls of any kind and it would take the better part of a day to get done and all of the meat wouldn't be done at one time.  I would have to pick out the pieces that were done and leave the others in longer which was frustrating.  With this machine, I set it to 158 degrees for 5 hours and it was done.  Not only that but the meat came out chewier whereas before it was extremely tough to tear apart.  This machine is easy to use and easy to clean",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "so far so good. parents use it a lot now",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Very happy",
    "rating": "4.0 out of 5 stars",
    "content": "Make sure you get a big one",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Quite operation and well designed!",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Jerky",
    "rating": "5.0 out of 5 stars",
    "content": "Works like a charm",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Precise temperature, efficient fan, makes this my best dehydrator so far.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Work perfectly so far and look better than most competitor",
    "rating": "4.0 out of 5 stars",
    "content": "Much more consistent than the vertical ones.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The product has ample capacity and trays.  Like the location of the fan.  Noise level is bearable.  Well built.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": ".",
    "rating": "5.0 out of 5 stars",
    "content": "Serious misses - On-Off switch, a Pause button and a memory setting.  Tedious to set the time and temperature every time the door is open. On the whole good value.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This whole thing is stainless steel, and the trays, too. I had an all plastic model, and it just felt weird preparing foods in all plastic machine, but this is a game changer. I love that the fans are in the back, which creates even drying time, and if you remember the plastic models, there was a heating element and fan on the bottom, and you had to change the order of your trays. That’s bonkers!! I can never go back. It works well, it’s not silent, but it isn’t obnoxiously loud, it’s easy to clean, and the timer and such is digital. This is the one. Add it to your cart. Cheers!",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Steel, baby!",
    "rating": "5.0 out of 5 stars",
    "content": "Great product! Does exactly as it says it will! Temperature control is easy. Cleaning is easy. All the shelves are awesome.! Totally recommend!",
    "post_time": "Reviewed in the United States on January 4, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Making chicken jerky for the dogs,(.99 a pound chicken breasts) and beef jerky for me !!! Dried apple slices too 😋",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Best dehydrator!",
    "rating": "3.0 out of 5 stars",
    "content": "I wanted a dehydrator that I can run off-grid using a 600-watt solar generator. I have a Bluetti for my higher-wattage appliances like toaster and kettle but wanted to dedicate a 600-watt Allpowers generator to just dehydration. At 480 watts, the 7100 model runs great without tripping the generator, and on a sunny day I can get a good run without having to plug into the grid at all.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "At first I thought the size was going to be an issue, because it's much smaller (12 x 13 trays) than, say, an Excalibur (14 x 14 trays) or one of the larger dehydrators made by Magic Mill. But I love the size! It tucks neatly onto my countertop, back under the cabinets where it's out of the way, and it is very quiet. It really holds a LOT of food, and considering how evenly it dries, it works better than larger less-good dehydrators I've used do.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Works great.",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this as a gift for my daughter. She makes her own dehydrated chicken treats for her dogs and also uses it to set icing on her cookies. She said it saves her so much time and she loves it.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "No complaints does the job",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Love it",
    "rating": "4.0 out of 5 stars",
    "content": "I like that it has 9 metal trays, not too plastic it’s not too small or too big and fits under my cupboard easily.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is so easy to use, didn't even heat up the house. Does a great job in my opinion, I'm thoroughly enjoying using this",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "It works as it should",
    "rating": "5.0 out of 5 stars",
    "content": "Wow I've had other dehydrators but this one WOW it is so good. It's easy to use, clean up a breeze, quiet and really does the job! If I were rich, I'd buy one for everyone in my family.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I thoroughly researched dehydrators - looking for a good price, a small kitchen footprint, and a proven product.  Narrowed it down to Cosori, Magic Mill, and Excaliber.  So happy with my Magic Mill purchase.  It takes up little counter space, is super quiet, and has 7 tray slots.  I received 7 metal trays, 2 slotted plastic trays, and a lipped plastic tray for fruit leather that I'm using as a drip tray.  I've had great success with beef jerky, dried blueberries, and am drying apples, mangoes, and peaches as I write.  The instruction manual comes with recipes, but if you mistakenly throw it away with the sturdy boxing in which the machine arrives, you can pop on YouTube for time/temp guidance.  Yes, I DID that!  Highly recommend.  It's almost foolproof and all trays are dishwasher friendly.  BTW, I purchased the smallest model; however, Magic Mill has larger sizes to meet your specific needs.",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "I like this stinken thing",
    "rating": "5.0 out of 5 stars",
    "content": "I did not want to buy something cheap! Did my due diligence with research and checking out the reviews on many name brands and sizes. Thank you for a well made product!",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The information page states this machine would be 1000 watts. I thought I was getting a superb deal but instead ended up with a 500 watt machine. Feels like false advertising.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "LOVE IT",
    "rating": "3.0 out of 5 stars",
    "content": "Overall I like the dehydrator but while it is ok, it could be great with a few improvements.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "- The door gets hot, so when you go to open it, your fingers will get a bit scorched.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Rings do not fit",
    "rating": "3.0 out of 5 stars",
    "content": "Rings do not fit Ball wide mouth jars. Lids are okay. Only 4 lids so I am not returning them.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great machine had a small problem emailed the company within an hour they had it all straightened out. Magic mill was awesome to deal with they took care of the problem right away 5stars",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Customer service",
    "rating": "3.0 out of 5 stars",
    "content": "This thing is great for drying evenly, having a lot of room and being easy to clean. However, I can't believe it doesn't have a pause button. The default on it is also way too high for standard use, so if you want to check or shift your food around mid cycle you have to stop the program then redo the whole thing to get it down to a normal temperature. It's not a huge deal but I don't understand why they wouldn't include a pause or have the default be so far above what people will use it for most.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had a plastic machine before and was never able to get my jerky crispy to this level, I changed up my recipe so many times and wondered how it was even possible, I never thought it would be my dehydrator that was the problem since I bought it brand new back then! Since I lost that one, I purchased this one and I am so happy I did!! The jerky turns out crispy every single time and its so easy to clean too!!",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Works great, but no pause button??",
    "rating": "5.0 out of 5 stars",
    "content": "If you're on the fence, buy it, you wont regret it. And it looks super sleek and is so quiet!",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I got this for Mother's Day. I wasn't super excited at first as I have owned several dehydrators in the past and they were all just okay at their job -- constantly had to rotate the trays, sometimes things would burn etc.",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Bought for making crispy jerky, worth it 100%",
    "rating": "5.0 out of 5 stars",
    "content": "I love how fast everything dries. They dry evenly and clean up is super easy.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "So far I've done apples, cherries, blueberries, & I just did my first batch of beef jerky. Everything was easy, easy to clean, & this machine is attractive & doesn't take up a lot of counter space. It does produce some heat though, & it's summer, so I actually put it outside on my porch while it's running.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Love this!",
    "rating": "5.0 out of 5 stars",
    "content": "I would suggest using the mesh sheets when doing fruit rolls. Other than that it’s amazing and works great.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I haven’t used it yet but it works,runs quiet.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Practice makes perfect",
    "rating": "4.0 out of 5 stars",
    "content": "This is a great product. I did find that it takes a bit of practice to find what works best for different items, but once you get the hang of it, it's fantastic. A very fair price for a product that I will get a lot of use out of for dehydrating my garden herbs, fruits and veggies this year!",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This has been a great upgrade from what I was using before! It’s super quiet! Almost sounds like a refrigerator running instead of a leaf blower, like my last one lol. I bought it before Christmas to be able to make dog treats and it has since done multiple batches of chicken feet, running for 36 hours at 160 degrees each time. I’ve also tried sweet potatoes and currently have a batch of chicken livers going. I haven’t tested temperature consistency but, so far, every batch I’ve made has come out with no problems. A lot of heat does escape through the gaps around the door, but again, I’ve had no issues with my items not getting done. The bottom also puts off quite a bit of heat, so I’ve sat it on a cutting board for now, since I do run it in excess of a day at a high setting. I have no issues setting the temp and time and am overall quite happy with this purchase! Just need it to keep on keepin on lol",
    "post_time": "Reviewed in the United States on February 28, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Very quiet! And a great dehydrator so far!",
    "rating": "5.0 out of 5 stars",
    "content": "I never know what to expect buying counter appliances.  This this gives off a soft hum which is exponentially quieter than the vent for the range top cooking stove.  The exterior of the food dehydrator is not hot to the touch.  However, if you open the door early to shift the shelves around, they are hot to the touch, but not like burning yourself on the oven.",
    "post_time": "Reviewed in the United States on March 4, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We've used it to proof yeast for bread, fruits and candied ginger.  I'm a vegetarian, so not sure how it works with meats and haven't tried dog treats.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Better than expected",
    "rating": "5.0 out of 5 stars",
    "content": "I was looking for something with metal shelves and this meets my expectations.  The unit is pretty light, thus easy to move around.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I feel this was worth what I paid for it.  I'm happy and my mom wants one now :)",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Great for jerky",
    "rating": "5.0 out of 5 stars",
    "content": "Have made a few batches of jerky with good results.  The jerky comes off the mesh trays easily, with no sticking.  I use zero sugar though (that was the whole point in making my own jerky).  The fan noise is present, but is an acceptable volume and pitch.  No rattles, or noisy heater relays either, seems to be well designed.",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have dehydrated so many herbs and veggies in this little dehydrator. It may be small but it will hold a lot on those 7 trays. Just turn it on and walk away. Come back later or the next day and you have fresh dehydrated food. Very easy to clean and the temperature holds all the way through the cycle. Can’t say enough of good things about it. Very well made and sir worth the money.",
    "post_time": "Reviewed in the United States on April 29, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Love this dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "There was a strong chemical smell when I turned the dehydrator on. It may be some of the glue holding things together or some grease on the fan... I had to r",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": " air it out for several hours before I felt comfortable using for food.",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Lots of space",
    "rating": "5.0 out of 5 stars",
    "content": "Works really well. Made delicious homemade jerky with it. Took only a few hours. The setting are easy to use to set time and temperature. I also really enjoyed making fruit rolls with the included mat trays.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works great, super quiet. Lots of room with all the trays. I was able to do several pounds of Jerry at one time. Drip tray does great keeping the bottom clean. Easy to use controls.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Works great, good price",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator works like a champ. If you look online for any given recipes on how to dehydrate various items this will hit the mark as far as the timing goes once you figure out a good location to place it. Location is important as the ambient air temperature affects its performance. It's a little noisy as there is a fan that runs and you will hear it. But the stainless steel construction is easy to clean although it's a tad thin. I am a bit worried over the control panel as it's all electronic and it's longevity is questionable but it's working like a charm right now.",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This thing works great made great beef jerky banana chips very large capacity well built definitely buy it again and recommend it",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "This is the bees knees!",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent Product",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use often makes great jerky,",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "High-quality product",
    "rating": "4.0 out of 5 stars",
    "content": "Works really well but could use a higher temp!",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought for my sister. Tried it while I was with her. We had a blast. First honey crisp apples, then mangoes. I will likely get one for myself now. Very quiet, does not throw off heat. However, this is not for people who like instant gratification. 😆. It takes time to dehydrate.",
    "post_time": "Reviewed in the United States on June 8, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Dehydration",
    "rating": "5.0 out of 5 stars",
    "content": "This thing is fantastic! I have made several things in it so far. Jerkey is my favorite so that is what I make mostly. It works great. Easy to use and maintain.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Banana chips and beef jerky so far. They came out fantastic. Very easy to use.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "works great",
    "rating": "5.0 out of 5 stars",
    "content": "This is perfect. doesn't make any noise for my husband to complain about. I can do twice more foods and its easy to work with. I'm just tired of buying veggies and they go bad before I can use them. Dehydrating them helps to keep them fresh and I don't waste money because I had to through them out. now I can keep them in a jar until I'm ready to use them.",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve made jerky and dried mango, strawberries, and pineapple. Fruit takes about19 hours, jerky less. But it was tasty and great for snacking and hiking. I have the 7 shelf and wish I had gotten a bigger one. Much better machine than my old round dehydrator. Love this product!",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "Great dehydrator",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works great, not the biggest, but the idea of no plastic works for me. Dries fruit perfectly and evenly. Fairly quiet compared to our old plastic round one. Has some plastic trays for bananas and fruit rollups, but the rest are steel mesh trays. Should be priced lower, I might look around for a similar less expensive one.",
    "post_time": "Reviewed in the United States on March 30, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Clean",
    "rating": "5.0 out of 5 stars",
    "content": "We have used this dehydrator for dog treats and kitchen items.  It has worked great.  Silicone sheets purchased from Amazon work better than those included with machine.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this product to make beef jerky and was pleasantly surprised with the quality of the dehydrator; and the seven stainless steel racks were large enough to hold five pounds of beef and were easy to clean. The temperature  and time controls were easy to read and adjust.",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "A bit pricey, but metal construction and quiet.",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use.  I use this for making dog treats for my service dog - dehydrated beef liver.  Easy to use and clean up.  Just set the time/temp and walk away.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great product does it's job! I got this for my husband on his birthday, he was so excited to use it. We made beef jerky, came out delicious. Product is a bit bulky to keep on the counter at all times , the sound is minimal. I 100% recommend this dehydrater.",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Works great so Far",
    "rating": "4.0 out of 5 stars",
    "content": "Much better than my last dehydrator, this current one is super quiet. My air fryer is noisier. Nice and compact size fits under the cupboards on the counter with still room to a stack stuff on top of it.",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "B0BQM6JVDK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great value",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B0BQM6JVDK"
},
]