[
{
    "name": "        Nelko Label Maker Machine with Tape, P21 Bluetooth Label Printer, Wireless Mini Label Makers with Multiple Templates for Organizing Office Home, White       ",
    "stars": [
        "70%",
        "15%",
        "6%",
        "3%",
        "6%"
    ],
    "pid": "B0C3L93F2Q",
    "ratings": "5,901 ratings",
    "other_info": {
        "Brand": "Nelko",
        "Connectivity Technology": "Bluetooth",
        "Printing Technology": "Thermal",
        "Special Feature": " ",
        "Color": " ",
        "Model Name": " ",
        "Printer Output": " ",
        "Max Printspeed Monochrome": "White",
        "Item Weight": "P21",
        "Product Dimensions": "Monochrome"
    },
    "discount_price": "$ 20.98",
    "normal_price": "$39.99",
    "about_this_item": [
        " 2024 New Version: Compared with the traditional label makers, half weight and size of the traditional label maker, smaller, smarter and convenient for users to carry. Wireless bluetooth label maker can slip into your pocket, allow printing anytime, anywhere. We recommend using our NELKO thermal label paper for good printing quality. Attention: For P21 Nelko APP iOS Users, Nelko iOS V2.7.0 printing multiple copies abnormal, please update Nelko APP to the latest version V2.7.1  ",
        " High-quality Printing: Label Makers with BPA-Free Direct Thermal Technology. Equipped with high-speed chips and 203 DPI, you can enjoy high-definition without relying on ink or toner. Label maker built in durable rechargeable battery, it can work for a long time. This label maker is monochrome printout, which only prints black text. We can create color label and need to use color pattern label tapes for printing.（Note: Not including charging adapter, not suitable for fast charging adapter）  ",
        " Easy to Use: NELKO label printer compatible with IOS & Android Phone via bluetooth connection. Step 1: Download \"Nelko\" APP from Google Play or App Store. Step 2: Install the paper roll. Step 3: Connect the P21 bluetooth within APP. Step 4: Choose a quick template and start printing. It is not compatible with Google phones on Android 14. This label maker machine with tape APP included more than 90 +Fonts, 10+ Languages, 450+ Materials. (Note: This label maker doesn't work with computers)  ",
        " Multiple Creative Function&Templates: This app of the label maker provides various features and templates, easy to create various design label stickers from App with Text, QR code, Barcode, Materials, Images, Time and Borders, etc. The length of labels is fixed, including 12X40mm, 14X40mm, 14x50mm, 14x75mm, and more. Please do not tear or destruct the green sticker on the back of the label strip , otherwise it will affect the printing effect. (Note: Continuous label tapes are not supported)  ",
        " Design Your Own Labels: The label maker machine with tape is widely used in life and office. For Home, organizing your clothes, food storage, cosmetics items, and mailings. For Office, office organization includes notebook tags, price tags, reminder tags, and other office supplies. For School, label maker for classroom teacher and kids school items, personal item identification, name tags. Labeler makers bring you fun and convenience  "
    ]
},
{
    "title": "Handy and Quick",
    "rating": "5.0 out of 5 stars",
    "content": "We have a house full of foreign exchange students and we had to label their cabinets and drawers and such in the house. This label maker is the best! It’s quick, efficient, sticks well and doesn’t remove paint when taken off. I will continue to purchase refills for this.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love that it connects with the phone. Can customize labels in many ways including different fonts, images etc. The images don't print the best but overall I love the ease of use and convenience.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Great bluetooth label maker!",
    "rating": "5.0 out of 5 stars",
    "content": "This is great. I went on an international vacation. I put this in my backpack when I went out. When I met someone, I asked their name. I typed it in their native language and translation. The label could print both!. I did the same for me.  Fun times.  Battery power works well. I haven't refilled it yet, the stock roll it came with had a decent amount of labels.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is so easy to use and very small to store. I love it!",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Easy and fun",
    "rating": "5.0 out of 5 stars",
    "content": "App works flawlessly, printer works flawlessly everything about it works great as it should. Super easy to use no problems at all",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It was really easy to set it up .Great price and easy to use, have already printed out some labels.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "took just a little to get everything downloaded and figure out how it works, but makes great little labels.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Have you ever so many unlabeled, thereby unorganized, cables lying around, and can't find out which one is for which device; I often get mixed up from power cables fir my laptop to different charging cables for smart watches, so frustrating 😕😔😔",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Not one complaint",
    "rating": "5.0 out of 5 stars",
    "content": "With my discovery of this tiny  portable printer, OMG, I can't stop printing everything - vacuum cleaner power cords, to  laptop power cable, to all my spucd bottles, and more importantly, my tennis racquet stringing date for each of my 🎾🎾 racquet 🎾🎾",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Once again, I've got cable-phobia - so many cables and can't seem to know which goes with what; so when I learned this one operates using Bluetooth, it's THE best way! You simply scan the QR-code and download the Nelko app, using the app, you can type in anything you want, address labels, spice jar labels, cable labels, etc. It even comes with pre-designed templates that helps jumpstarting your label tasks. Once you're satisfied after seeing the preview, press PRINT & the desired label comes out of the little device, it's amazing & can be addictive, I can't stop printing, 😂😆 HaHa😆😂",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Excellent Label Printer.",
    "rating": "4.0 out of 5 stars",
    "content": "I like that this is a Bluetooth printer that I can use with my phone anywhere.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "However, I noticed that most of the built-in fonts are not printing as sharp as I would like.  Could be that this printer is not set for 300 DPI output as I am used to using.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Excellent little label maker",
    "rating": "5.0 out of 5 stars",
    "content": "Super easy to use and set up. Very sleek and cool looking. Labels look great.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "this little gadget is a game-changer for organization! 🎯 Super easy to use, and the labels come out crisp and clear. 🏷️ ‘A place for everything and everything in its place,’ as they say—this helps make it happen! 💼 Can't beat the price!",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "🏷️ Perfect Label Machine—Incredible Value for the Price! 💰",
    "rating": "5.0 out of 5 stars",
    "content": "Although the labels are small, the AP allows a variety of designs and are very creative. The printer works well and it's easy to carry",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love it!",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Functional",
    "rating": "4.0 out of 5 stars",
    "content": "Ok, so to start I have many different label makers, different sizes and different brands.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love this label maker, nice print quality, nice selection of labels available.  But I hate the fact that if you dont use the manufacturers lables, that have a microchip on them, the printer PURPOSELY prints poorly.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Label maker",
    "rating": "5.0 out of 5 stars",
    "content": "I know this because I put in non Nelko labels, and it printed poorly with lines showing in the text.  I then wrapped the same labels around a Nelko label core and miraculously they printed perfectly.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So other then the fact that the microchipped labels are a pain in the butt, they are way more expensive then the other brands and it limits your choice of labels, it is a good printer.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Label maker",
    "rating": "5.0 out of 5 stars",
    "content": "Good value works well",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love it, compact, and stickers are great quality",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Super easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "This thing popped up in one of my social media feeds and I checked it out and got one.  I also purchased an additional roll of clear label medium, more on that in a moment.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This Nelko product is convenient and easy to use, thanks to the app and Bluetooth interface, which is seamless, unlike some other Bluetooth products I own.  It has a plethora of label categories in the app, which I find to be somewhat redundant, and I wish the first offering in the template list was \"blank label\".  I don't need a pencil sketch of little apples on my grocery labels.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Every household needs one of these",
    "rating": "5.0 out of 5 stars",
    "content": "The operation is straight forward: load the tape/media, start the app and turn the label maker on, write what you need in the app and press the print button; out comes you little label and you move the cutting head up to cut the label off.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It comes with a roll of labels and additional rolls are ten bucks.  Nelko thoughtfully lets you choose from a white background with black print or a clear background with black print; I bought a roll of each.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Great Customer Service!",
    "rating": "4.0 out of 5 stars",
    "content": "A word of advice...try to avoid the temptation to run around the house labeling everything that doesn't move, it could get expensive, and would probably annoy people!",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I only used it one time, and it wouldn't turn on the second time, so I reached out to their customer service to see if I could either get a new one or return it, and I have passed the time for Amazon free return. Joey helped me promptly and guided me in the right direction, and now the machine is back running again! I love the machine so badly that I was so sad I might need to go back and get those old-fashioned label makers, lol. Thank you!",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "So many capabilities for such an inexpensive, small item",
    "rating": "4.0 out of 5 stars",
    "content": "This is awesome! In terms of simplicity and ease of use, you can’t go wrong. I figured out how to find simple images online and print them using the app onto labels. I had to play around with it and test it a few times, but I ended up making some labels for kids toys using images (black and white). This is one of the images I was able to import and print with a label. It was for a friends home so I don’t have pictures of the specific labels.",
    "post_time": "Reviewed in the United States on January 19, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use + makes great labels. FYI the labels are all one size , it’s not like you have a stream",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Bigger than expected",
    "rating": "4.0 out of 5 stars",
    "content": "Although it’s bigger than I expected, it works great and has lots of options for label designs",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Make certain to purchase the extra labels. Why? It’s perfect to make & creating labels, Bluetooth connectivity & saves your work to use again. I created label right from my mobile device",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Love it",
    "rating": "4.0 out of 5 stars",
    "content": "Update",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was having issues with the app crashing. I bought this back in September 2023 (and due to some ADHD tendencies( I didn't get it set up a d trying to work until a few months ago. The app would crash and I would give up. The seller contacted after the original review and for a few weeks (again my ADHD caused weeks they responded quickly everytime) we went back and forth troubleshooting. It came down to my android not being a system the newest app version could be used on. I have a galaxy 20FE. I'm not a tech person but just seems like my phone is out of date. They are giving me a full refund which I appreciate since I bought it so long ago. Customer service was fast and to the point. I recommend the seller just do your research first to make sure it is compatible with your device.  Gave a 4 because I didn't get to try the product.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Updated review/app issues",
    "rating": "5.0 out of 5 stars",
    "content": "Original review",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This label never worked for me. I spent a few months back and forth with customer support. The issue is the app would not worm on my android. It would open and then immediately close. Customer service was like try this try that, download our newest app version that just came out today. Nothing worked. Don't buy.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "works well",
    "rating": "3.0 out of 5 stars",
    "content": "worked well connecting with my phone",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I make alot of homemade items and this is a life saver. The size and ease of use is incredible. The ability to create the label you want from your phone app is fun.  5 star all the way.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Impressive",
    "rating": "5.0 out of 5 stars",
    "content": "I brought this because although I have a cricket I needed something for smaller projects. The app is easy to work, and the font comes out very clear. However, sometimes it can be a but difficult lining up the tape with the printing, and the wording may end up on the next piece of tape. But overall with practice it's a good product.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great little label printer, as far as form, and most function. It was easy to setup and use with an Apple phone. The label are a decent size, and the software, although a bit clusmy, allows for flexibility in output.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "I LOVE MY LABEL MAKER!! DEFINITELY RECOMMEND.",
    "rating": "5.0 out of 5 stars",
    "content": "Appearance is as seen in the picture, the price is great for the quality. I love the color options. Suoer easy to connect with my phone, and the size is just right.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this! It’s super easy to use.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Great label maker!",
    "rating": "5.0 out of 5 stars",
    "content": "Wanted a small label maker.  This fit the bill.  Once set-up, it's very easy to use.  Price is fair.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Tal cual como se muestra en las imágenes",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Love it!",
    "rating": "5.0 out of 5 stars",
    "content": "User friendly Great quality",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I had a hard time pairing to my phone.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Feliz",
    "rating": "5.0 out of 5 stars",
    "content": "I got this label maker to use for price tags for my craft shows. They adhere well to my display pieces, even the velvet ones, but are also easily removed when it's time to change out the display for a different product. Worth every penny, and the app is very easy to use!",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is money well spent.  Easy to use.  Perfect size.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Love it",
    "rating": "4.0 out of 5 stars",
    "content": "Bought to label wires.  Its easy to set up.  I did a couple of test prints, works pretty well.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This little machine is great in nearly every aspect. Small and compact, portable,  rechargeable, easy to load label tape, label tape self aligns, custom text and graphics, custom size print, custom fonts, custom size labels available, custom color labels available including clear, horizontal and vertical  printing, more. It won't replace my Dymo continuous tape Label Manager but is an overwhelming addition. There is a learning curve for the interface Nelko app. I recommend this machine.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Use this often;",
    "rating": "4.0 out of 5 stars",
    "content": "Use often but tape runs quick. So stock up!",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Absolutely love this label maker. Super practical to label switches and storage boxes in our rental units. Labels look very professional and do not smear.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Love this label maker for our rental places",
    "rating": "5.0 out of 5 stars",
    "content": "It's perfect for small labels. Very easy to use",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had to charge up my P21 before my Wifi could find it.  But other than that, I am well pleased.  I did forget to order an extra roll of stickers, so I will need to do that.  I love the choice of fonts and that you can add pictures.  And do it all from your phone!  Cool!",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Works great",
    "rating": "5.0 out of 5 stars",
    "content": "This is one of those purchases that I wouldn't have made except for a random conversation with my wife.  She wanted to label some of the light switches in our house, which after 11 years still has not remembered which switch turns on which lights.  As with everything that comes up as a random need/want, I looked on Amazon and found this one with a decent amount of positive reviews and an under $20 price tag.  I've never owned a label maker, never needed a label maker, but I'll be damned if it's something that will likely get used quite a bit.",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The unit itself is very simple with only a couple of buttons and a USB-C charging port.  The label designs are done through an application on your smartphone, and there are a LOT of customization options to select from.  I mean A LOT.  Font Style, font size, font placement, spacing, border, etc.  You can use different sized labels, or different colors.  As long as you pick the correct label size, the software manages the spacing and usable space for you.  The printer uses heat etching to create the labels (no ink involved), and the labels simply peel off and stick on whatever you want them to.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "It does just what it claims to do!",
    "rating": "5.0 out of 5 stars",
    "content": "I feel like I've finally graduated from poor college student to responsible adult.  I'll my previous labels of masking tape and sharpie have all been replaced with pleasing and respectable matching labels.  Lovely.  My tools have never looked so organized.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We all have had our issues with printers and bluetooth devices not connecting, but this printer always connects with no clicks and just works. I've used to for a couple rolls of paper and the App is easy and nicely configurable for electronics parts and QR code labeling.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Super handy and easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this label maker to help identify the original brands/names on my fragrance dupes from DUA/Oakcha/Zara and on my decanted travel atomizers. The labels are the perfect size for what I'm using them for and I love that I don't need to buy ink! Set up with the app was a little tricky at first but the app has great directions on problem solving when it comes to connecting with Bluetooth. So many font options with fun frames and emojis. Prints quickly and clearly. I love this little gadget!",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy and quick to use. Good quality with no issues and the labels stay on well.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Once connected, Easy and Simple to use",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this for my wedding, to print labels for favors, gift bags etc. Downloaded the app- has different fonts, images to add like flowers, bows, and hearts. Connecting the printer can be tedious but it hasn't failed me yet. I also love how portable it is.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I really enjoy using this label maker, but for whatever reason the \"ink\" fades on frequently touched labels. I use these on my keyboard to map macros, but as you can see in the attached image, the label I press maybe 5-6 times a day, faded within 3-4 days.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Great label maker; labels fade when touched frequently",
    "rating": "4.0 out of 5 stars",
    "content": "Aside from that it's great, it connects well, prints fast, and is really convenient overall.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Super easy to use.  Install paper, download app, done.  App is super easy to use.  Only downside is ink comes off easily with handling.  Labels on my cabinets are perfect, the one on my remote the words came off in 24 hours.  Would def recommend",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Great buy",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this because of a friend's recommendation. It's small and produces really cute labels easily. My only con is that the stock pictures on the app are mostly in color and the label maker only prints in black and white. This would not be an issue is it printed the outline is black but often things that are color are just not printed. I wish all their free emojis were in black and white so they'd print the way they are supposed to.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is very easy to use and can used for anything",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "So cute!",
    "rating": "4.0 out of 5 stars",
    "content": "Compact and so easy to use.  Love that you can download the app on your phone and instantly print out labels.  Charge last so long.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This product is about as simple as it gets, it provides so many font and design options as well.  Got 4 stars because the stickers are starting to fall off items so they are proving the not be a long term option.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Super easy",
    "rating": "5.0 out of 5 stars",
    "content": "The appearance is clean lines and compact It's easy to set up & use.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The print isn't as defined as I would like, although, \"you get what you pay for\", and this was a great price!",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "good",
    "rating": "5.0 out of 5 stars",
    "content": "good",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It’s perfect size and super easy to use - but I wish I had paid better attention bc it came w tape that only had two inch labels on it. I looked on the website and they don’t sell any other size. Unfortunate bc I really like it but I need something that has whatever size I need at that time. Yes you can cut it to whatever size you want, but that won’t matter w the label size",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "ONLY ONE SIZE TAPE",
    "rating": "5.0 out of 5 stars",
    "content": "So cool! I love making random labels! Hahaha! Easy to use.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am technically challenged and had no problem working this!!!!!",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "👍🏾👍🏾",
    "rating": "4.0 out of 5 stars",
    "content": "I have been looking for something exactly like this and this quality and ease of use simply blew me away. I shop a lot at one of those big-box-stores and the quantities are a lot for me and my wife so much of it goes into the freezer. Often labeling the baggies is a nightmare because sharpies simply wont write on wet plastic. This machine is the perfect answer. The labels are just the right size, not too big nor too small. They peal easy. They are nearly infinitely adjustable. You can include pictures (line art only)... And the best, for this price it is amazing. I got it yesterday and without reading the instructions, within 20 minutes my cordless phones were labeled, the meat I stored in the last 24 hours and all the coffee in the house. I even labeled my wife but she took it off (go figure). UPDATE, after labeling my portable cordless phones I noticed the labels are not that durable. After using 1 of the phones 5 or 6 times the letters began to fade considerably. It seems my hands were rubbing it off. I relabeled it and cover the label with transparent tape. If you have an item that will be handled it seems you may need to do the same.",
    "post_time": "Reviewed in the United States on September 6, 2023",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "UPDATE: I had to remove a star, the labels are just not all that permanent. I labeled my cordless house phones so they end up where they belong. My office phone which gets used daily, the label faded after 3 weeks. I reprinted it and replaced it covering it with a bit of transparent tape. It faded after 5 weeks. I guess it has something to do with the heat of my hand... It is disappointing.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Easy",
    "rating": "5.0 out of 5 stars",
    "content": "I Love Love love this label maker. It is perfect for what I needed. Easy to set up and use. 5 stars!!",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this! There are so many different emoji on this machine that you can make your own labels!!",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Perfect",
    "rating": "5.0 out of 5 stars",
    "content": "I love that it is easy to use. It is also cute and compact. This one is a keeper!",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0C3L93F2Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This unit just works. The app is shockingly easy to use and stable for something so affordable. If you’re looking for a label maker for small labels look no further.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0C3L93F2Q"
},
]