[
{
    "name": "        Best Seller [DVD]       ",
    "stars": [
        "63%",
        "19%",
        "10%",
        "4%",
        "5%"
    ],
    "pid": "B0C4HPW5QV",
    "ratings": "561 ratings",
    "other_info": {
        "Genre": "Thriller",
        "Format": "NTSC, DVD",
        "Contributor": "James Woods, John Flynn, Victoria Tennant, Brian Dennehy",
        "Language": "English",
        "Runtime": "95 minutes"
    },
    "discount_price": "$ 19.",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "It's a best smeller,",
    "rating": "4.0 out of 5 stars",
    "content": "Best Seller was a minor hit movie in 1988 with the odd pairing of James Woods as the criminal who wants his life of crime immortalized in a novel written by ex-cop and author played by Brian Denehey.",
    "post_time": "Reviewed in the United States on August 28, 2022",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "You get a buddy genre picture mixed with witty banter and moderate action.  It's neither excellent nor mediocre.  But it is truly a Best Seller.",
    "post_time": "Reviewed in the United States on January 23, 2011",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Surprisingly Good Movie",
    "rating": "4.0 out of 5 stars",
    "content": "I love James Woods and also like Brian Dennehy,  but despite there being two excellent actors in it,  the movie's description made  it sound kind of  dated, a 15+ year old cop drama that I had never heard of. But I thought, hey, for $2.99 for Vid on Demand, what do I have to lose!",
    "post_time": "Reviewed in the United States on January 1, 2019",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Wow, I was really surprised what a great film this was:  of course  two of my favorite actors were excellent as usual, but the film, direction, story line, dialogue and  cinematography was really good, to the point where it was hard to believe it had been made so long ago.  Excellent movie, fast-paced and unpredictable, with James Woods playing a character who was both oddly sympathetic and at the same time, a cold blooded killer--who else could have played this role but him!  The development of the bond between these two men--the author/cop and the killer--was fascinating to watch.",
    "post_time": "Reviewed in the United States on October 15, 2022",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Entertaining",
    "rating": "4.0 out of 5 stars",
    "content": "A pretty entertaining movie. I thought the cop's daughter was the dumbest character in this movie. You know there are bad guys out there and you don't have any skills or a gun to fight them. Why would you come out of the room and run into arms of the bad guys' boss and have the man who saved her get killed?? She is old enough to realize the situation even knowing her father was down there. What if the boss killed his father too? I guess they didn't want James Wood's character to live, because he killed too many people although they were mostly bad guys. But still wish they made the ending a little more believable...",
    "post_time": "Reviewed in the United States on May 3, 2015",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was the second time I have bought this DVD because in the first one the second last chapter of the film wouldn't play on my DVD player, so I bought this one. The same thing happened with this one. It appears that there is a manufacturing defect that Olive Films should correct as soon as possible. I wonder if anyone else has experienced this problem?",
    "post_time": "Reviewed in the United States on November 8, 2022",
    "pid": "B0C4HPW5QV"
},
{
    "title": "DVD was great but...",
    "rating": "3.0 out of 5 stars",
    "content": "Of the numerous films that Larry Cohen has written, but not directed, Best Seller is probably the best of the bunch.",
    "post_time": "Reviewed in the United States on May 21, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If Cohen had directed Best Seller, the satirical elements of a corporation engaging in a string of murders would probably have taken a more front-and-center role in the plot. I can imagine Michael Moriarty as a truly unhinged version of Cleve, chewing the scenery, and savoring some of the character’s more outrageous moments. That version of the film that only exists in my mind would have been great. The actual film, as directed by John Flynn, isn’t great, but it is very good.",
    "post_time": "Reviewed in the United States on September 20, 2022",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Best Seller is probably the best of the bunch",
    "rating": "4.0 out of 5 stars",
    "content": "The rest of my review is on my site: http://obsessivemovienerd.com/2014/02/20/the-cohen-case-files-best-seller-1987/",
    "post_time": "Reviewed in the United States on May 9, 2021",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good acting and writing. Easy to watch",
    "post_time": "Reviewed in the United States on August 30, 2022",
    "pid": "B0C4HPW5QV"
},
{
    "title": "A Superb Thriller",
    "rating": "5.0 out of 5 stars",
    "content": "Brian Dennehy and James Woods give spectacular performances as the good cop and the killer play off each other throughout this mystery.  Did Clive (Woods) do everything he said he did, or is he making things up.  Will Dennis (Dennehy) write a bestseller off the information he gathers?  I watch this one at least once a year.",
    "post_time": "Reviewed in the United States on September 7, 2020",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Worst movie I've seen Dennehy in. Woods was not believable in the role and their chemistry was nothing. Stupid, mundane story with guns and good actors that had their talents wasted. I will blame it on the script and the direction. It's to watch only if you have nothing else to watch or do. Two stars for production values, good sets and that's about it.",
    "post_time": "Reviewed in the United States on September 23, 2022",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Worse than predictable. Stupid situations and shallow relationships. Guns, if you like them.",
    "rating": "4.0 out of 5 stars",
    "content": "Good movie with great acting by both men.  James Woods gave a great performance of a true sociopath with a human side and odd bursts of a need to be liked and respected from time to time.  Sometimes he scared you to death and other times you liked -- or wanted to like -- him.",
    "post_time": "Reviewed in the United States on July 31, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is an excellent James Woods movie.  He is so cool in this one.  His character is so full of confidence.  This is another movie I loan out and fail to get back.  I need another one now.",
    "post_time": "Reviewed in the United States on May 31, 2021",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Good movie with great acting by both men",
    "rating": "5.0 out of 5 stars",
    "content": "I thought it was one of the best movies I have watched, even the second time around.",
    "post_time": "Reviewed in the United States on June 10, 2022",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "While the premise content is weak, these two sizzle together. Woods' ability to transform from a pleasant, persuasive, character to the menacing sociopath he is, is fun to watch.",
    "post_time": "Reviewed in the United States on June 10, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "One of my favorites.",
    "rating": "5.0 out of 5 stars",
    "content": "Brian Dennehy is his usual fine character acting self. He's enjoyable to watch, even with a somewhat limited range.",
    "post_time": "Reviewed in the United States on November 25, 2013",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The story line is weak and it's almost impossible to believe that this cop would allow this character to continue, once he discovers his past involvement in his personal life. That almost ruined it for me.",
    "post_time": "Reviewed in the United States on March 13, 2023",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Loved it",
    "rating": "4.0 out of 5 stars",
    "content": "Great Movie with Great Character Actors.  My favorite James Woods flick.  Simple action fare but fun and well told.  Woods makes for a great assassin with an agenda and Dennehy is believable as a cop turned writer.  Some great scenes of Woods plying his trade and he is a sympathetic character when he stands up to protect Dennehy's daughter toward the end.  One of those good movies I wanted for my personal favorites collection.",
    "post_time": "Reviewed in the United States on June 16, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "great movie",
    "post_time": "Reviewed in the United States on May 31, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "excellent movie",
    "rating": "4.0 out of 5 stars",
    "content": "not a very well known movie, but its taut and interesting. some of the exchanges between woods and dennehy are classic. good thriller that also develops the characters fairly well. one can see james woods being this guy. he plays it to a T.",
    "post_time": "Reviewed in the United States on January 16, 2014",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love this thriller.  James Woods sharp, concise with a controlled hint of rage/sanity. Brian Dennehy always",
    "post_time": "Reviewed in the United States on October 31, 2013",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Powerful Combo",
    "rating": "4.0 out of 5 stars",
    "content": "Delivers an understated but effective performance.  These two on the screen make,the plot sparkle, and by the way are Easy on the eye as well.",
    "post_time": "Reviewed in the United States on December 19, 2018",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Loved this movie until the end.",
    "post_time": "Reviewed in the United States on May 26, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Great acting, bummer ending",
    "rating": "4.0 out of 5 stars",
    "content": "That being said, great acting, great story, lots of suspense.",
    "post_time": "Reviewed in the United States on May 21, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Fine HD Blu-ray upgrade from the old DVD  still only has the theatrical trailer, but much underrated film starring James Woods and Brain Dennehy is well worth watching. Released by Olive Films,",
    "post_time": "Reviewed in the United States on May 18, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "HD Blu-ray Upgrade of Underrated Thriller.",
    "rating": "4.0 out of 5 stars",
    "content": "James Woods is always good.  He is an actor you love to hate.  Story was interesting and held ones interest, all in all a good movie.",
    "post_time": "Reviewed in the United States on July 16, 2014",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good movie!  This is a good old fashioned (80's style) movie.  Before special effects and high tech.  If you like crime and cops, watch it!",
    "post_time": "Reviewed in the United States on January 30, 2013",
    "pid": "B0C4HPW5QV"
},
{
    "title": "James is always good.",
    "rating": "4.0 out of 5 stars",
    "content": "James wood is perfect in the role. Brian as well . Though the storyline is a wee bit weak, the two actors make it watchable. The finale is very neat, and, stylish.",
    "post_time": "Reviewed in the United States on June 13, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this movie for my sister this past Christimas.  We watched it together and really enjoyed it! A bit more violent than what I remembered seeing, but terrific performances all around. Very enjoyable!",
    "post_time": "Reviewed in the United States on April 18, 2020",
    "pid": "B0C4HPW5QV"
},
{
    "title": "... a big fan of both these actors so really enjoyed seeing them together",
    "rating": "4.0 out of 5 stars",
    "content": "I'm a big fan of both these actors so really enjoyed seeing them together.  The story has twists and turns that keep you interested right to the end.",
    "post_time": "Reviewed in the United States on March 29, 2015",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A very interesting movie and I liked the overall concept. Even though you could guess how it was going to end you still watched it.",
    "post_time": "Reviewed in the United States on June 6, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Interesting movie",
    "rating": "4.0 out of 5 stars",
    "content": "Although the story line is somewhat predictable, the movie is very entertaining thanks to first rate performances by the two lead actors.",
    "post_time": "Reviewed in the United States on May 25, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The movie is  excellent. But stop in the middle of the movie. So I couldn't finish watching it. But good movie",
    "post_time": "Reviewed in the United States on April 25, 2015",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Entertaining",
    "rating": "4.0 out of 5 stars",
    "content": "I waited for over a year for netflix to mail out the dvd and gave up.  Very good movie that moves at a very good pace.",
    "post_time": "Reviewed in the United States on January 9, 2013",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I like both of these lead men. The plot was a good and believable one. I have a fetish regarding misspelled words, missing words and such in the books I read. If I am remembering right, this one needed a better proof reader!!",
    "post_time": "Reviewed in the United States on June 5, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "The movie is excellent. But stop in the middle of the movie",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed watching the movie. I had first watched it years ago and still enjoyed it",
    "post_time": "Reviewed in the United States on May 18, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Two excellent lead actors, nice script a couple of enjoyable twists. A fun night's entertainment.",
    "post_time": "Reviewed in the United States on June 19, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Just as good as I remembered",
    "rating": "4.0 out of 5 stars",
    "content": "Good old thriller.  Liked it!",
    "post_time": "Reviewed in the United States on June 11, 2018",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Poorly written, , over acted, poorly directed, low budget and totally predictable and equally unbelievable..  and also boring..  cliche and overused bad guy good guy story that doesn't even get developed in any way.  Waste of a movie that I'm sure the actors wish they never had a part in.",
    "post_time": "Reviewed in the United States on September 27, 2022",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Good thriller!!",
    "rating": "4.0 out of 5 stars",
    "content": "I like both these actors, James Woods and Brian Dennehy.  Story kept my interest and I recommend for those who like suspense.",
    "post_time": "Reviewed in the United States on June 20, 2013",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was one of the best movies I have watched in a long time.  Kept you interested the whole movie and intrigued.  I would highly recommend it to anyone.  I would not recommend this for children.  It is very violent.",
    "post_time": "Reviewed in the United States on June 12, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Best Seller Movie.",
    "rating": "4.0 out of 5 stars",
    "content": "Plot was OK, but I just like both the lead actors so I gave it 4*'s.",
    "post_time": "Reviewed in the United States on June 7, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I like James Woods at his nasty best, and this film provides that.  It has a decent plot & is worth an evening.",
    "post_time": "Reviewed in the United States on November 4, 2011",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Good to pass time.",
    "rating": "4.0 out of 5 stars",
    "content": "The writing is so bad, it's awesomely, cheesy 80's thriller kitsch!",
    "post_time": "Reviewed in the United States on February 9, 2017",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "When I started watching this movie I had high hopes for entertainment.....I was not disappointed. This is a great movie if you like a tough-guy detective film....this combined with the psycho-type of character that James Woods shines in....I really liked this movie",
    "post_time": "Reviewed in the United States on May 19, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "James Woods Being His Obnoxious Self",
    "rating": "4.0 out of 5 stars",
    "content": "Not a bad movie have some really good actors in it basic entertainment",
    "post_time": "Reviewed in the United States on May 14, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great movie, two top character actors at the top of their game.",
    "post_time": "Reviewed in the United States on July 6, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Impossible not to like this cheesy thriller...",
    "rating": "4.0 out of 5 stars",
    "content": "Great but a little violent. Woods is pure evil in a good way.",
    "post_time": "Reviewed in the United States on May 21, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was an interesting plot line with two good actor in the lead roles.",
    "post_time": "Reviewed in the United States on June 19, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Four Stars",
    "rating": "4.0 out of 5 stars",
    "content": "Pretty good for an older movie.  James Woods was spot-on as a psychopath",
    "post_time": "Reviewed in the United States on August 12, 2015",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good, exciting movie with two great stars.",
    "post_time": "Reviewed in the United States on November 3, 2017",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Four Stars",
    "rating": "4.0 out of 5 stars",
    "content": "Well done:  script, acting, production.  Ending a little too pat.",
    "post_time": "Reviewed in the United States on May 14, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Ending was abrupt and should have been given a bit more time.",
    "post_time": "Reviewed in the United States on May 26, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Well done: script, acting, production. Ending ...",
    "rating": "4.0 out of 5 stars",
    "content": "Great movie.  Good acting, good script.  Doesn't pull the punches.",
    "post_time": "Reviewed in the United States on May 18, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I thought Best Seller as far as the plot and story line was written and directed very well. I really liked the movie being that it is a drama but leans on the side of a crime/thriller. very well done.",
    "post_time": "Reviewed in the United States on June 3, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Four Stars",
    "rating": "4.0 out of 5 stars",
    "content": "Dated but still interesting especially with the 2 leading actors.",
    "post_time": "Reviewed in the United States on June 19, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Decent movie.  Both stars are 2 of my favorites",
    "post_time": "Reviewed in the United States on June 27, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Four Stars",
    "rating": "4.0 out of 5 stars",
    "content": "A good suspense film. The acting was very good.",
    "post_time": "Reviewed in the United States on June 15, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Entertaining movie. Lots of action with a different twist.",
    "post_time": "Reviewed in the United States on June 5, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Four Stars",
    "rating": "4.0 out of 5 stars",
    "content": "You can't lose with James Woods and Brian Dennehy.",
    "post_time": "Reviewed in the United States on May 19, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good story, great acting , really interesting movie.",
    "post_time": "Reviewed in the United States on June 13, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Holds your interest from the start to the finish.",
    "rating": "4.0 out of 5 stars",
    "content": "Well done considering it's about 30 years old",
    "post_time": "Reviewed in the United States on June 6, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love both stars.  Good movie",
    "post_time": "Reviewed in the United States on May 16, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Four Stars",
    "rating": "4.0 out of 5 stars",
    "content": "Storyline caught my attention. Some \"aha\" moments.",
    "post_time": "Reviewed in the United States on May 15, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First, I'm a huge James Woods fan.  If I hadn't been this would have been a 4-start rating.  This was a good movie but dated.  The ending was especially good, in my opinion.",
    "post_time": "Reviewed in the United States on June 1, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Four Stars",
    "rating": "4.0 out of 5 stars",
    "content": "James Wood is a great actor.",
    "post_time": "Reviewed in the United States on July 1, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I always like these two guys.",
    "post_time": "Reviewed in the United States on June 9, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Twists and turns",
    "rating": "3.0 out of 5 stars",
    "content": "Not a bad movie. The actors play their parts well, but the plot is predictable. The ending as a bit ham handed and takes away from the rest of the movie.",
    "post_time": "Reviewed in the United States on June 19, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Really good for an old movie.",
    "post_time": "Reviewed in the United States on May 21, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Four Stars",
    "rating": "4.0 out of 5 stars",
    "content": "Really old movie with great actors.",
    "post_time": "Reviewed in the United States on May 22, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Excellent movie. .. big James woods fan. ..",
    "post_time": "Reviewed in the United States on April 21, 2015",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Four Stars",
    "rating": "4.0 out of 5 stars",
    "content": "Well executed but ending could have been better.",
    "post_time": "Reviewed in the United States on March 26, 2015",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It was a good movie",
    "post_time": "Reviewed in the United States on June 20, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Four Stars",
    "rating": "4.0 out of 5 stars",
    "content": "Entertaining and held my interest.",
    "post_time": "Reviewed in the United States on June 15, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good old fashioned Wambaugh. Entertaining!",
    "post_time": "Reviewed in the United States on May 21, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Four Stars",
    "rating": "4.0 out of 5 stars",
    "content": "good movie worth a look",
    "post_time": "Reviewed in the United States on May 28, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Engaging actors with simple story",
    "post_time": "Reviewed in the United States on May 14, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Four Stars",
    "rating": "4.0 out of 5 stars",
    "content": "Contrived plot, but good acting.",
    "post_time": "Reviewed in the United States on May 25, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Well acted, good flow.",
    "post_time": "Reviewed in the United States on June 13, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Well worth watching",
    "rating": "4.0 out of 5 stars",
    "content": "A darn good movie",
    "post_time": "Reviewed in the United States on June 14, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very clever and entertaining",
    "post_time": "Reviewed in the United States on June 7, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Clever",
    "rating": "4.0 out of 5 stars",
    "content": "Enjoyable  and entertaining.",
    "post_time": "Reviewed in the United States on May 31, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I saw the previews of this movie on television several years ago.  I have been hunting it for several years because I couldn't remember the title.  After I saw the movie, I knew the previews did it justice.  This is a",
    "post_time": "Reviewed in the United States on December 16, 2009",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Enjoyable and entertaining.",
    "rating": "5.0 out of 5 stars",
    "content": "a great movie for anyone who likes drama.",
    "post_time": "Reviewed in the United States on June 3, 2017",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Awesome movie that I don't remember coming out back in the day -- but it turns out to be a really good, fast moving thriller. Recommend!",
    "post_time": "Reviewed in the United States on June 26, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Excellent Drama",
    "rating": "3.0 out of 5 stars",
    "content": "Very entertaining movie",
    "post_time": "Reviewed in the United States on June 8, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Not what I would call a great movie but entertaining. I'm a fan of both of the lead actors and would watch any movie either are featured.",
    "post_time": "Reviewed in the United States on June 15, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Get the popcorn ready!",
    "rating": "4.0 out of 5 stars",
    "content": "Good plot!",
    "post_time": "Reviewed in the United States on October 5, 2016",
    "pid": "B0C4HPW5QV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It was good.",
    "post_time": "Reviewed in the United States on June 25, 2016",
    "pid": "B0C4HPW5QV"
},
]