[
{
    "name": "        CAROTE 12pcs Pots and Pans Set, Nonstick Cookware Set Detachable Handle, Induction Kitchen Cookware Sets Non Stick with Removable Handle, RV Cookware Set, Dishwasher/Oven Safe Cream White       ",
    "stars": [
        "72%",
        "8%",
        "10%",
        "4%",
        "6%"
    ],
    "pid": "B0C9M47B71",
    "ratings": "433 ratings",
    "other_info": {
        "Color": "Cream White",
        "Brand": "CAROTE",
        "Size": "12 pcs Set",
        "Compatibility Options": "Induction",
        "Number of Pieces": "12"
    },
    "discount_price": "$ .",
    "normal_price": "$129.99",
    "about_this_item": []
},
{
    "title": "Must buy!",
    "rating": "5.0 out of 5 stars",
    "content": "I am someone that loves to have uniformity in my kitchen products, so getting this pot and pan set was exactly what I needed! They are so clean, functional, and aesthetically pleasing.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are great. Food doesn’t stick and they are super easy to clean. Storing them is great as well because they stack easily since the handle detaches. I wish it came with a few more lids since the two provided don’t fit all of the pans",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Doesn’t stick",
    "rating": "5.0 out of 5 stars",
    "content": "I had been looking at the Carote cookware for quite some time. They were so very interesting to me, but I didn’t feel I had a need for new cookware.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Then we moved into our new home that had a much smaller kitchen and found that the 12pc set of Carote was a perfect fit!  They stack easily, the removable handle is genius and the glass pan lids are perfect",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Absolutely the very best cookware",
    "rating": "3.0 out of 5 stars",
    "content": "This is absolutely the very best cookware we have ever owned. Nothing ever sticks to them and following the care directions makes clean-up a breeze.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This cookware is really easy to clean and is so easy to store.  I did have a problem with one pan that for some reason did discolor.  Even though it was 6 months after purchase, I reported the problem to the company and they immediately agreed to send me a new pan.  I consider that to be extraordinary customer service in this day and age.",
    "post_time": "Reviewed in the United States on January 31, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Excellent Customer Servicw",
    "rating": "5.0 out of 5 stars",
    "content": "These pots and pans were amazing, until they weren't. The big frying skillet burned and then the coating started to chip off so ai obviously had to throw it away. I would not recommend these. Save your money and order a better set of pots and pans.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I “love” when ppl post reviews of functional items on the day they receive the item. Are you reviewing successful delivery?? Have you USED the item in its full meant capacity?No? “It just looks cute you guys!!”….ok,no thanks. If it’s a static item such as candle holder or a vase which whole purpose is to stand there and “look cute” then sure,why not,but pots and pans? Common now :)",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "I loved these until...",
    "rating": "5.0 out of 5 stars",
    "content": "Let’s get back on track,I’ve purchased this set in August of 2023 and HAVE used it quite a bit. Durability, efficiency, reliability and quality. The set is very affordable for those who are looking to invest into “decent” pots and not break the bank. For those who care to match it to your kitchen,then yes,it IS very estatic and doesn’t make you hate your life every time you throw spaghetti in it. I can’t say that I’ve used it “properly” 100%,there’s been a few times where I’ve used a fork to turn a pancake over and OH MY GOSH of course I scratched the surface. Which is….okay. Because it’s not meant to be used with metal forks and spoons and  the packaging says so,so I am not taking any points off for that. The handles are very sturdy and even though,6 months later I am still feeling uneasy to pick it up just by the handle alone if it’s full of boiling water thinking it will somehow unclip and burn my so many times sunburnt legs again…it never happened and yes I have carried a full pot of boiling water ACROSS my kitchen and waltzed back with it to the stove. Bottom line-the handles are GOOD and reliable. They are extremely easy to clean,by hand or dishwasher,so why 4 stars you might wonder…Ahhhhh,well…they ARE easy to clean INSIDE…BUT,the bottom of the pans for some weird reason have this black grease on it that wouldn’t come off for the life of me and oh I tried to get it off! BELIEVE me I’ve tried! For those who made it this far,pictures would perfectly relay to you what exactly I mean by black grease,or whatever that stuff is..scrub it,wash it,nothing gets rid of it. Is it a dealbreaker??No,not for me,but it’s nice to let y'all know in case you’ve experienced that before with other cookware and have this in your cart already :) Overall,decent set and quality matches the price.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Carote has redesigned the cookware and I love it !",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Good but not perfect",
    "rating": "4.0 out of 5 stars",
    "content": "These are great! It's so easy to have lots of pans at the same time and being able to move them qith the same handle! The only thing I see is that they stain a lot and it's hard to clean them! I chose the white ones and they do stain! I wish I would have chosen the dark ones!",
    "post_time": "Reviewed in the United States on June 8, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I was really excited to get these pots and pans to save some space in our very tiny farmhouse kitchen. I admit that when they first arrived, I was a bit disappointed because the pans felt light and flimsy, but I was excited because they stacked so well and the handles were an amazing feature both for putting them in the cupboard and saving space in the dishwasher.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Great idea ... Horrible execution",
    "rating": "4.0 out of 5 stars",
    "content": "Because they are lightweight feel and appearance instead of getting rid of my old pots and pans, I tucked them away in storage because I didn’t have a great feeling about them. I have been using them for the past six months or so and I’m incredibly disappointed and I’m also concerned that maybe the materials are not safe to cook with.",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Set aside the fact that they don’t seem to cook very evenly. (I have a gas range and it tends to heat pans up pretty evenly.) Using them to sauté anything, even if you use an oil to lubricate, leads to permanent discoloration of the pan. For some reason, the underside keep emitting black substance that gets on the top of the other pans if you stack them. you can keep scrubbing them, I even took a magic eraser to them, but the black stuff will keep on coming.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Beautiful and space saving but…",
    "rating": "5.0 out of 5 stars",
    "content": "Lastly, you would think that the handles, which are very innovative in their design, would have some sort of heatproof cover on them. Unfortunately, they don’t. I learned this firsthand when I was smelling a burning smell while cooking and knew the food was doing just fine and realized that the handle had caught fire and was slowly smoking. It was mostly the rubber pad that squishes up against the pan, but also it affected the faux metal material, that was nearby. The pan was resting evenly on the burner and I don't feel like the flame was too high. One of the handles also no longer closes firmly enough, and sometimes if the pan is too heavy, the handle will disengage when you lift it. I almost lost a pot of boiling water that way. I don’t know if I’m just really hard on my pans, I mostly use a cast-iron as my tried and true and I’ve had it for over 20 years. But I would never buy these again, and if they offered me replacements, I would say no thank you. I wish I could get a refund to put toward a new set of pots and pans that are space saving but I know too much time has passed. Definitely a financial loss here, I would stay away.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I do love my new pots and pan set. They are a beautiful set and I love that you can stack them upon each other to save space. I agree with the durability of the coating from some of the other reviews. I have a few chips in my set already. And some discoloration on one of the pans I use more often. (Just some background info, I cook everyday and have had my set since Nov, using them since Dec). Also, I may have received some defective handles because after a month or so they became super loose and wobbly- see my video clip- and made it very unsafe for even a short transfer from my stove to sink and back. The customer service at Carote was so helpful and responsive. I sent them the info they requested and they ended up sending me 2 new handles that are snug and secure now. Overall happy with my purchase! May want to try their set with the attached handles next time I need a new set.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Excelente material",
    "rating": "4.0 out of 5 stars",
    "content": "Me gustaron mucho y te libera espacio de tu cocina",
    "post_time": "Reviewed in the United States on March 19, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Very stylish and fancy",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Oh my !",
    "rating": "3.0 out of 5 stars",
    "content": "Muy útil",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve had this set for 4 months.  I love the look, the ease to stack them, the weight, the list is endless.  Now I’m noticing when stacking them, some type of black soot gets on my hand and the pan under the others.  I’m unsure what this is.  Like another reviewer, I do have a gas stove, so I don’t know if that is creating the problem.  They wash up so well, so I don’t know why I’m seeing this issue.  Any ideas?",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Esy and safe to be used",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to manipulate and cook",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love these pots and pans. They are non stick and so easy to clean.  I love the performance of these pans. My food has been coming out great!  I also had a wonderful experience with customer support. They were prompt and very helpful with any questions I had. I strongly recommend this company.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Superb quality through and through",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first set of good pots and pans! I love the brand. They are non stick. I love the removable handle. I wish I had at least two more lids in stead of one coming with my set. These are great and are as described. I’m so happy with the purchase. I also purchased their knife set! The best I’ve used so far",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "These are nice for cooking and they handwashing well. Food doesn’t stick too much and they are aesthetically pleasing. Downside is the handles, where they clip onto the pot/pan turned brown after one use; I don’t think the handles withstand the heat of the stove very well. Disappointed with the burnt/discolored handles since we got the cream color pots, for it looks like they are old handles and they are not.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Make the purchase!",
    "rating": "5.0 out of 5 stars",
    "content": "I am so glad I bought this 12 piece set. I have a what I consider a small kitchen, with limited storage. I can separate out the set into bowl shaped and flat shaped. I can use each pot with pot holders only, or use both handles on one pot. There are only two lids that fit all the sizes. I can remove a handle for better moisture and heat retention with the lid on. The handles can be put on hooks. I have magnetic hooks on the hood above the stove and store my cooking utensils on the hooks. And the pots and pans can be cleaned in a dishwasher! My previous set of standards pots and pans will be donated. Yahoo!",
    "post_time": "Reviewed in the United States on January 3, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely love these pots! My  kitchen is tiny with very little cabinet space. I bought these because they ALL stack together, taking up less space. They cook great too! Nothing has stuck or burned.",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Nice to use but handles get discolored",
    "rating": "5.0 out of 5 stars",
    "content": "I saw this on TikTok a few months ago and immediately wanted the set!",
    "post_time": "Reviewed in the United States on January 2, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They are fantastic! Smooth to the touch and easy to use! The non stick on them is great!",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Space saving, easy to clean, multiple sizes for multiple uses.",
    "rating": "5.0 out of 5 stars",
    "content": "The only thing I would have liked is if a kid were provided for the smaller ones. You can use the kids given for the small ones but they look very strange and they fall off.",
    "post_time": "Reviewed in the United States on April 15, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Also just be mindful when cooking too big of portions, since the handle clicks halfway inside the length of the pots/pans you’re definitely going to get food on the handle. It comes off easily cause it’s also a slick material BUT you will have to be washing your handles too.",
    "post_time": "Reviewed in the United States on April 15, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Excellent quality.",
    "rating": "5.0 out of 5 stars",
    "content": "The best set I ever had.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Haven’t used yet- set looks beautiful, but disappointed that the storing lids don’t fit the pots or pans.. they just sit on top, not air tight at all! And would not work good for storing food!",
    "post_time": "Reviewed in the United States on December 10, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Storing lids- disappointed!",
    "rating": "2.0 out of 5 stars",
    "content": "I got these February 2024, it’s now August 2024 (7months). The rim is starting to peel from the handle, handle is scratching inside of pan, and the non stick coating is getting in food. I hand wash and use silicone utensils only. I don’t even cook everyday, maybe 3 times a week average. Also, I don’t use the same size pot.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I really like the look of these and I feel like they are extremely convenient in safe space however, the quality could definitely be better. They will scratch easily, especially if you use metal on them which they do disclaim not to use metal utensils on these, but just in general, the lining is very susceptible to scratches or peeling. Additionally, the metal bottom has a black substance that comes off of it when wet and gets all over everything. Definitely not the longest lasting pans. However, I do feel like they cook food pretty well.",
    "post_time": "Reviewed in the United States on February 1, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Did NOT last! They were good for 4 months",
    "rating": "3.0 out of 5 stars",
    "content": "I want to start off by saying the attachable handles on these pots and pans are amazing! I love the concept and it’s been very handy when cooking multiple dishes at a time.",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The downside: the non-stick coating is already starting to chip after one month of use. We don’t cook anything too crazy, and haven’t been harsh on them in regards to use, so it sucks they’re deteriorating so quickly. They also stain very easily if you get the white/cream colored set.",
    "post_time": "Reviewed in the United States on February 21, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Convenient and anesthetic",
    "rating": "5.0 out of 5 stars",
    "content": "If they could figure out the quality issue, this would be a 5 star purchase.",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I bought these after reading SO many good reviews. I mean people are raving about these pots and pans. And let me just say they absolutely live up to the hype. I’ve purchased these for my mother, mother in law, sisters and grandmother since. Buy the pans 👏",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Love the concept, but quality is lacking.",
    "rating": "3.0 out of 5 stars",
    "content": "They’re unbelievably easy to clean, they cook evenly, they are beautiful & take up virtually ZERO space!",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love that they take up less space on the stove as well as in the cupboard. I have a gas stove and these do tend to get a hot quickly",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Diseño y limpieza",
    "rating": "5.0 out of 5 stars",
    "content": "Excelentes ollas para cocinar, y al momento de lavarlas son  super facil de limpiar 5/5. Incluso mi comida se cocina mas rapido.",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "They are nonstick which is great but the instructions don’t say to take off the handle I have a gas stove and basically burned both my handles and now they’re yellow bumpy and I’ve tried pink stuff vinegar with baking soda bleach even just soap and the stains around my put won’t come off if I could I would want a refund I don’t think it’s worth the money",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Stain",
    "rating": "5.0 out of 5 stars",
    "content": "These pans are light and easy to use.  They seem to conduct heat easily, providing even and quick cooking of meats and veggies. They stack neatly taking up far less space in my cupboards than other pan sets-attributed primarily to the fact that the handles are removable.  Clean up is even easier than I expected-a simple wipe or two with a soft soapy rag is all that is needed.  I cannot comment on durability as I have had this set for less than 1 week.  I’m hopeful that they will last for years if I follow the care and use instructions.",
    "post_time": "Reviewed in the United States on September 2, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So aesthetically pleasing! I love the white so much. They are 100% nonstick and heat up quickly. I love that they take up no room in the cabinets and come with the lids! The work very well. I have seen some people complain about staining but I have not experienced that even with leaving stuff in there for a day. The only negative thing I would say is the lids tend to make a mess on the stove. I would overall recommend.",
    "post_time": "Reviewed in the United States on October 18, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Heats quickly and easy to clean",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this set because I kept seeing them all over TikTok and let me tell you! I would 100% make the purchase again! They are SO easy to clean and I love that they stack, so they are taking up a bunch of space in the cabinet.",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excelente",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Love these",
    "rating": "5.0 out of 5 stars",
    "content": "Great product super easy to clean and they look great. Had received couple dented pots and they gave me credit right away and I bought them again and glad I did they work great 👍🏻",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "We were boiling water and the pot spontaneously dented. Unsure as to why but could be potentially dangerous. Not worth the money we spent.",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Thank you TikTok!",
    "rating": "5.0 out of 5 stars",
    "content": "I love them so much this is our second set so we have them on the boat as well as at the house.",
    "post_time": "Reviewed in the United States on March 19, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Estoy lista para cocinar con un producto el cual catalogo de calidad.",
    "post_time": "Reviewed in the United States on April 16, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Love this",
    "rating": "5.0 out of 5 stars",
    "content": "The pans look so cute and they are easy to clean. Would definitely buy again",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The truth  the quality of the pans is good.  I don't recommend buying the ones with removable handles because I just bought them.  I have only used them twice and washed them and they rusted only after two washes can you believe that....",
    "post_time": "Reviewed in the United States on January 15, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "I don't recommend buying the ones with removable handles",
    "rating": "3.0 out of 5 stars",
    "content": "These pots are convenient but they scratch easily and require high maintenance. They are cute, but the bottom burns easily.",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These pans are great!!! Easy to use, clean and store!!!",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "I'm not sure",
    "rating": "5.0 out of 5 stars",
    "content": "These pots and pans are exactly what I was hoping for! Sleek, nonstick, and soo cute! Definitely recommend these!",
    "post_time": "Reviewed in the United States on March 10, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love these pots and pans! I love that the handle is removable. I would recommend practicing with how to take the handles off and on before using it while cooking.",
    "post_time": "Reviewed in the United States on December 29, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Love these!!!",
    "rating": "5.0 out of 5 stars",
    "content": "Great buy!",
    "post_time": "Reviewed in the United States on January 19, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wow very nice , don’t stick in pot wat u cook , they good for a small family ,easy to but away , the handle are great",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Great quality cookware",
    "rating": "5.0 out of 5 stars",
    "content": "The Carote cookwear performed better than anticipated. Pleased with purchase",
    "post_time": "Reviewed in the United States on December 28, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My granddaughter loved these she said best pots an pans she has ever had I got her them for Xmas she gave me a show on how to use them",
    "post_time": "Reviewed in the United States on March 30, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Perfect!",
    "rating": "5.0 out of 5 stars",
    "content": "I bought a smaller set of these pots and pans, loved them so much I ordered 12 piece set so I could have them all! Absolutely love the larges sauce pan and the fact I can put in oven is wonderful! I cook a lot and I absolutely love these pots & pans!!!",
    "post_time": "Reviewed in the United States on September 8, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Started with a Carote Egg pan 4-months ago and love love it! Purchased a full set with removable handles to  all of my super expensive, super heavy, constantly peeing Pampered Chef set.  Customer service is amazing.  Thank you!",
    "post_time": "Reviewed in the United States on October 22, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Lightweight, easy to clean, easy to store!",
    "rating": "3.0 out of 5 stars",
    "content": "Nice set, but the 9\" pot came with scratches that may effect the longevity of it. Inspect before you use it.",
    "post_time": "Reviewed in the United States on January 14, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My cousin purchased these for me as a housewarming gift and I have no complaints whatsoever. I love this cookware set!",
    "post_time": "Reviewed in the United States on January 21, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Scratches on one pot",
    "rating": "5.0 out of 5 stars",
    "content": "Great quality Nice aesthetic",
    "post_time": "Reviewed in the United States on March 31, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use, great for cooking and very easy to clean. Stackable for taking up minimal cabinet space. Highly recommended.",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Absolutely Love This Cookware Set!",
    "rating": "5.0 out of 5 stars",
    "content": "I really like detachable handles and ghey heat up quickly and cool down as well then on clean up is a breeze",
    "post_time": "Reviewed in the United States on December 21, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Removable handle gets extremely hot I have a gas range and the heat stained the handle.",
    "post_time": "Reviewed in the United States on November 21, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Great quality",
    "rating": "5.0 out of 5 stars",
    "content": "Really disappointed they are very beautiful, also they a very light.",
    "post_time": "Reviewed in the United States on March 1, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Me encantó muy buena calidad",
    "post_time": "Reviewed in the United States on January 29, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Amazing",
    "rating": "5.0 out of 5 stars",
    "content": "I waited to order these but I wish I had done it sooner. These are amazing in the way they stack and take up less space. The non stick quality is superb! I am incredibly happy with them",
    "post_time": "Reviewed in the United States on September 20, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Made my life easier, love this product!",
    "post_time": "Reviewed in the United States on February 21, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Incredible product",
    "rating": "5.0 out of 5 stars",
    "content": "I’m obsessed with these pans! They cook very evenly, warm up quickly and store like a dream. The removable handles are an absolute game changer! Definitely a five star buy that I’m recommending to all of my people 🙌🏼🙌🏼",
    "post_time": "Reviewed in the United States on September 7, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Not what I wanted for the price.",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "The perfect set of cookware",
    "rating": "5.0 out of 5 stars",
    "content": "These are remarkably great the set comes well packed and is easy to use and clean. READ THE DIRECTIONS FOR USE.",
    "post_time": "Reviewed in the United States on November 26, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "An excellent product I definitely recommend!",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Not enough lids",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this pots and pans set, nothing sticks to it, stains come out very easy with Dawn dish detergent and scotch brite sponge.",
    "post_time": "Reviewed in the United States on January 26, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excelente gracias",
    "post_time": "Reviewed in the United States on November 7, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Love these",
    "rating": "5.0 out of 5 stars",
    "content": "I like this product however I wish it had arrived with two operational handles.  Instead, only one handle works and the other doesn't clip onto the pots/pan correctly.  I would appreciate the company sending a replacement handle in place of the damaged one.",
    "post_time": "Reviewed in the United States on February 6, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Stain, will not clean regardless of what you use to try and clean, uneven cooking",
    "rating": "1.0 out of 5 stars",
    "content": "I do not often write reviews on the products I buy on Amazon, but this purchase has taught me the importance of doing so….These pots and pans are probably the worst purchase (believe me, Amazon and I are best friends) I have ever made.  They stain horribly, I cannot get the stains out regardless of the products I have tried, and I have tried several.  They cook unevenly (it’s not my stove, my previous pans did not tilt the liquids to one side), these pots and pans perform horribly in every way.  I love the detachable handles, but i’m not cooking a chicken thigh on the handles.  Very disappointing.",
    "post_time": "Reviewed in the United States on May 31, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So compact and looks chic. Great addition to my kitchen!",
    "post_time": "Reviewed in the United States on December 21, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Amazing space saver!!",
    "rating": "5.0 out of 5 stars",
    "content": "The set arrived exactly on time and in perfect condition. They were just what we were looking for, and we couldn't be happier!",
    "post_time": "Reviewed in the United States on August 26, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "First time using the pots and plans and they have chipping and cracks.  Some of these I didn’t even use and they have missing coating.",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Everything was perfect!",
    "rating": "1.0 out of 5 stars",
    "content": "Plan to return it all.",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I'm so disappointed with these pans. First of all I've only had them six months and they're already all scratched up... and we made sure to only use wooden or plastic utensils. Also the bottoms constantly get all black... which you need to scrub off every time and it gets all over the white. I was excited at the idea of these for my small kitchen... now I'm just disappointed and doing extra work to make them work. Bummer.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Don’t buy",
    "rating": "1.0 out of 5 stars",
    "content": "There supposed to be nonstick plus a easy to burn at the bottom",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I have to say, the pots and pans everyone was raving about turned out to be a major disappointment. Within just a couple of weeks, they started peeling off, and cleaning them became an absolute nightmare due to how easily they got stained. While they initially worked like a charm without needing any oil, now everything sticks, and the slightest cooking turns into a smoky mess. It's frustrating to see something promising go downhill so quickly. I regret investing in them.",
    "post_time": "Reviewed in the United States on February 11, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Disappointed",
    "rating": "1.0 out of 5 stars",
    "content": "Pots and pans are great besides the fact the bottom is rubbing off onto literally everything! Sucha huge mess to clean up!",
    "post_time": "Reviewed in the United States on March 25, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I love the idea of them being stackable with removable handles. But the top one with no more black on the bottom wash hand washed and all the black came off on my hands. The bottom left is from the dishwasher and now there’s rust all over multiple things that were washed in that load. The right has yet to be used or washed, what it is supposed to look like. Wish I would have tried the same idea, different brand. Disappointed for sure.",
    "post_time": "Reviewed in the United States on December 21, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Fire hazard do not buy",
    "rating": "1.0 out of 5 stars",
    "content": "Absolutely a fire hazard. I have contacted the company multiple time with no response. The plastic / rubber on the handle MELTS while cooking causing it to drip on the burner and cause an awful plastic smoky smell.",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "The lid deformed in less than 30 days of buying. Handles got stained which wont go",
    "post_time": "Reviewed in the United States on December 6, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Lid deformed",
    "rating": "2.0 out of 5 stars",
    "content": "First use and we used plastic spoons and the enamel already started to chip off!",
    "post_time": "Reviewed in the United States on November 27, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "This got stained after one use. They arrived chipped and are not worth the cute look.",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Disappointed",
    "rating": "1.0 out of 5 stars",
    "content": "Do NOT recommend",
    "post_time": "Reviewed in the United States on January 7, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I loved these the moment we opened the box - thet looked beautiful! But take a look after using maybe less than 10 times on a Gas stove! We can’t even bare to see these pots and pans - and the handles are changing colors/melting. Bottom of our pots looks like they have been used and abused for years! Spend your money elsewhere.",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Not worth the cute look!",
    "rating": "1.0 out of 5 stars",
    "content": "After couple of wash all pans bottom rusted. As you can see all rusted and I can’t use it.",
    "post_time": "Reviewed in the United States on December 3, 2023",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I sent an email to manufacture and after one month don’t have any response.",
    "post_time": "Reviewed in the United States on February 5, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Quick to tarnish! Handles Melting!!",
    "rating": "1.0 out of 5 stars",
    "content": "A grilled cheese sandwich permanently burnt into the smallest pan during the very first use. I wanted to contact customer service. However, the Amazon link to support goes to a 404 error website. One of the handles also discolored from the heat I wouldn’t suggest buying these, no matter how cute they are. I will most likely be buying a better set in the next few months.",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "B0C9M47B71"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "The handle isn't that resistive to heat. And I already have scratches in most pans. With a reddish dicolorings in the pan with one warped. Just don't use on gas stoves or high temps I guess.",
    "post_time": "Reviewed in the United States on January 6, 2024",
    "pid": "B0C9M47B71"
},
]