[
{
    "name": "        Vertical Lever Corkscrew with Non-Stick Worm, Compact Rabbit Wine Opener Wine Bottle Opener with built-in Foil Cutter (Red)       ",
    "stars": [
        "76%",
        "17%",
        "0%",
        "0%",
        "6%"
    ],
    "pid": "B0C9JK5BK2",
    "ratings": "33 ratings",
    "other_info": {
        "Material": "Zinc",
        "Color": "Red",
        "Finish Type": "matte",
        "Brand": "Drincarier",
        "Is Customizable": "No",
        "UPC": "710329418447",
        "Number of Items": "1"
    },
    "discount_price": "$ 25.",
    "normal_price": "",
    "about_this_item": [
        " Compact But Efficient-Open any wine bottle in just 3 seconds with a quick up-and-down motion  ",
        " Built-in Foil Cutter- removing foil caps before uncorking.  ",
        " High Quality- lever corkscrew is constructed of premium zinc alloy with understating matte black finish, the durable screw is compatible with corks of all construction, including natural and synthetic  ",
        " Go Easy On Your Hand - The ergonomic and heavy duty lever was a standout feature. Extra-long handle design saves effort. This made pulling on the handle much more comfortable and gave a wine enthusiast confidence that the hand wouldn't slip  ",
        " Gift Box-Drincarier Wine Opener packaged in a sleek, durable box that's perfect for gifting, an excellent gift for the home chef and wine enthusiast  "
    ]
},
{
    "title": "Outstanding",
    "rating": "5.0 out of 5 stars",
    "content": "I've used several corkscrews of this type before, many of them double or triple the price of this unit. This one is much heavier and much sturdier, and it works really well.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I highly recommend it.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Super awesome, easy to use.",
    "rating": "4.0 out of 5 stars",
    "content": "Buy if you are on the fence.  Super easy to use at a great price.",
    "post_time": "Reviewed in the United States on January 23, 2024",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Foil cutter is annoying and not implemented well but it will take the cork out of a bottle of wine. I would look at different tools unless this is the absolute best price you can find.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Foil cutter is not good, overall better wine openers out there for similar price but not bad.",
    "rating": "5.0 out of 5 stars",
    "content": "It works as advertised and easy to use!",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B0C9JK5BK2"
},
{
    "title": "It works!",
    "rating": "5.0 out of 5 stars",
    "content": "I thought I had found the greatest cork puller in the world until I replaced it with this one. The key is the LOND and large diameter round lifting handle. Even with arthritis in my hands, it’s a quick and easy job opening a bottle. So glad I stumbled across this because it’s a 10-star tool.",
    "post_time": "Reviewed in the United States on December 24, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "better than the more expensive Rabbit, and so far has lasted longer",
    "post_time": "Reviewed in the United States on October 20, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Easier cork puller than any other",
    "rating": "4.0 out of 5 stars",
    "content": "I've had a few electric wine bottle openers that tend to lose their charge or strength over time, so I'm happy to have this as a backup manual corkscrew opener.  Made by Drincarier, this matte black steel opener is solid, sturdy, handsome, and works like a charm.  They aren't kidding when they state that a bottle of wine can be opened in 3 seconds.  With little to almost no effort at all, the wine bottle opener delivered (i.e., uncorked) with a single down and up pull from the lever.",
    "post_time": "Reviewed in the United States on September 26, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I would have a preferred a separate foil cutter, rather than the built-in (which takes a little skill), but its design and use is clever.  I've had a few rabbit-ears style bottle openers over the years, and this unit stands at as being among the best I've ever used. Packaged in a retail box that is ideal for gifting, with instructions for usage, this Drincarier wine bottle opener is ideally and expertly crafted.  Per the box, the unit has a 10-year guarantee.",
    "post_time": "Reviewed in the United States on October 21, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "good",
    "rating": "5.0 out of 5 stars",
    "content": "Recommended.  Made in China.",
    "post_time": "Reviewed in the United States on December 28, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "So easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "I have used this product for about a month and half now. It is extremely easy to open a wine bottle with this. Pull the lever up, place on the bottle neck, squeeze at the neck, pull the lever down, pull the lever up again, the corkscrew is out. To remove the corkscrew from the opener, pull the lever down, squeeze and pull the lever up.",
    "post_time": "Reviewed in the United States on November 18, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Extremely Well Made!",
    "rating": "5.0 out of 5 stars",
    "content": "This Drincarier Vertical Lever Corkscrew with Non-Stick Worm is truly amazing. The corkscrew comes well packaged and gift-ready if looking for a well-made item for the wine lover in your life you have found the one.",
    "post_time": "Reviewed in the United States on October 10, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Quite classy looking and works great!",
    "rating": "5.0 out of 5 stars",
    "content": "The corkscrew is well constructed and extremely durable making it easy to use without fear of it breaking. Opens bottles like a charm with little to no effort on your part. The sleek black design gives off a modern design but would look good paired with any bareware.",
    "post_time": "Reviewed in the United States on September 25, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Good size, easy to hold",
    "rating": "5.0 out of 5 stars",
    "content": "I'm extremely happy with this product. Trust me your hands will thank you!",
    "post_time": "Reviewed in the United States on October 8, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Sturdy Product",
    "rating": "5.0 out of 5 stars",
    "content": "It is quite the treat to open wine bottles with this corkscrew - and you can look good doing it :) This makes opening a wine bottle look cool once you get the hang of it. Learning how to use it only takes 30 seconds - but once you got it, you got it! The handle/grip part that you cut the foil with and pull the cork out is easy to use. The unit itself is compact but it is very solid and has a good weight to it. This will be great for the holidays when more wine gets opened around here -  but I know this will be up for the task!",
    "post_time": "Reviewed in the United States on October 26, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "High quality wine opener",
    "rating": "5.0 out of 5 stars",
    "content": "This wine opener is smaller and easier for me to use than the name brand that I have.  It has a nice feel enough weight so it still feels substantial.  It pulls corks very well.  I wish it came with additional screws.  The foil cutter takes a little dexterity and practice.  You have to get the wine bottle snugly up in the unit, hold the opener tightly on the wine bottle, and then I turn the bottle while squeezing the opener on the bottle.  I really like this wine opener especially because it is smaller and a little lighter than my old opener.",
    "post_time": "Reviewed in the United States on October 12, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "So far so good",
    "rating": "5.0 out of 5 stars",
    "content": "The Drincarier corkscrew wine opener is heavy-duty, and won't bend and break like my previous one.  It effortlessly removes the cork! This would make an excellent gift for wine lovers.",
    "post_time": "Reviewed in the United States on October 6, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Nice quality!",
    "rating": "5.0 out of 5 stars",
    "content": "This wine opener has some heft to it - it feels like a quality product out of the box. I have never been able to open wine bottles with a traditional corkscrew - I just end up making a mess. With this wine opener - 5 seconds and I've got the cork out with no mess.",
    "post_time": "Reviewed in the United States on October 5, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Super high quality.  Works great and is heavy duty!",
    "rating": "5.0 out of 5 stars",
    "content": "Just got this and used it to open a couple bottles of wine tonight. So far so good. It has a nice weight to it and feels sturdy. All the mechanisms work very smoothly. It also has a 10 year guarantee. Would definitely recommend!",
    "post_time": "Reviewed in the United States on October 18, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "A high-quality wine opener",
    "rating": "5.0 out of 5 stars",
    "content": "I was pleasantly surprised when I received this.  It's really heavy and great quality, and comes in a nice, sturdy box so would make a wonderful gift.  It works great, as you would expect, and is satisfying to use.  Very nice item!",
    "post_time": "Reviewed in the United States on September 26, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Works like a charm!!",
    "rating": "5.0 out of 5 stars",
    "content": "High quality wine opener.  Very sturdy piece and opens wine with no problem!  Great replacement for my current one.",
    "post_time": "Reviewed in the United States on September 27, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Super sturdy",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful and sturdy",
    "post_time": "Reviewed in the United States on October 12, 2023",
    "pid": "B0C9JK5BK2"
},
{
    "title": "Terrific design, I like it better than similar type corkscrew",
    "rating": "5.0 out of 5 stars",
    "content": "This is it amazing corkscrew, with a nice ergonomic design that I like better than the better known brand name version. The lever that grips the bottle as you remove the cork with the other lever is very easy to use, and I was able to uncork a bottle the first time using it with virtually no issues or hesitation. It has a very nice presentation in its box, with die cut hard foam firmly holding the device. The only unusual thing I noticed is that the illustration on the box shows chrome handles, but the actual corkscrew is completely matte black including the handles. I personally prefer it as all matte black.",
    "post_time": "Reviewed in the United States on October 9, 2023",
    "pid": "B0C9JK5BK2"
},
]