[
{
    "name": "        ANRABESS Women Summer Mini Romper Dress Workout Tennis Active Sports Athleisure Outfits Built in Shorts Trendy Vacation       ",
    "stars": [
        "61%",
        "18%",
        "11%",
        "4%",
        "5%"
    ],
    "pid": "B0CGRK6XT8",
    "ratings": "2,095 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "The perfect casual cute closet staple!",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely love this romper dress!! It is so incredibly comfortable and cute! I have gotten so many compliments when I wear it out! It is great quality material and is so universal that it can be worn for a variety of events! You can dress it up or wear it casually and be active in it! It has large/deep pockets that are great for keys/small wallets. I bought a cropped white tank to go underneath of it which completed the look! There is a full-body romper with shorts that is fitted, but not too tight or restricting. It is the perfect length and it's straps are not uncomfortable at all! The color is so perfect and looks exactly like the picture! I would buy this again and again!!",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Super cute and comfy and makes the perfect casual fit! I’m usually a small and got a small. It fits great but looks a bit big/oversized. If I buy another I probably would go a size down",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Cute and comfy but big",
    "rating": "4.0 out of 5 stars",
    "content": "This is the perfect summer dress for running errands or travel. Very comfortable, good material but runs big. I would recommend sizing down if you are between sizes.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So easy to throw on and run errands, brunch, walk around town. Can easily be dressed up a bit with a jean jacket for brunch with friends. The color is beautiful and the dress is excellent quality. This brand makes good quality clothes!! I like to wear an undershirt with build in bra, so I don’t have to mess with a strapless. The built in romper provides amazing coverage at the arms, so a bra would be totally hidden. So much better than having to pay for the brand name, and honestly, I like this one more! Such an amazing value. The length is great and not mini at all. The under romper is stretchy, so it’s bump friendly too!",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Cute and comfortable.",
    "rating": "3.0 out of 5 stars",
    "content": "The fabric of this feels good on the body, very soft and stretchy. The color (I chose brown) was perfect. However, this does not fit the same as the brand that it’s similar too. It fits much longer and wider. I took an XS, which is my normal size. Because I’m on the shorter side, this didn’t look as good and sort of like a bag. Good comfort though and it has built in shorts and a bra which is great for running errands or with my kids! I didn’t end up keeping though because of the fit.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very cute and fashionable romper. This is my second purchase with this company and I am very happy with their products. Love the color, feel of the fabric and the way it washes.  The only con I have is that the shorts are too short and can tend to ride up. I am 5’4, size 16-20. I ordered the xxl and returned it for the xl. I ordered the teal and look forward to being able to order more colors. Worth the buy!",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Perfect casual dress",
    "rating": "5.0 out of 5 stars",
    "content": "I’m really glad I decided last minute to size down. I’m 5’3 and weigh 180 lbs and I’m typically a size large on most items. I went for a size medium in this dress because I was worried about my short torso. I’m glad I did because it fits perfect. It’s a good material and very comfortable. I would definitely buy another one in another color",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "liked the fit, comfortable, fun!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Not a great dupe",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this dress for the DisneyUniversal parks. This dress was perfect. Even though it’s not too light weight, It kept me cool while also making me feel pretty and less worried about how I looked. The straps come with adjustable straps so you can get your size without having to worry about the top being too loose. Probably going to get this in other colors.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I am 5'7, about 180 lbs. This dress is perfect for all-day events; I went golfing. It's a t-shirt material with pockets and an under-spandex layer. The straps are super long and even tightened all the way they were still to long - only downside though",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Simple and cute.",
    "rating": "4.0 out of 5 stars",
    "content": "I would have given it 5 stars but the straps could be a little softer/wider and it's a bit of work if you have to use the restroom...",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "However... I am planning on buying 1 more in another color :) Fit wise - I am a formerly athletic/active woman wearing a 38/ F. Most my weight is muscle and chest but I have some age weight on me now as well.  Knowing these things hopefully helps visualize the fit. The XL fits me snug but comfy - other than the straps that dig a bit into my shoulders. It probably wasn't made for carrying these overgrown monsters.. so I wouldn't judge it by that 🤣",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Short in torso",
    "rating": "4.0 out of 5 stars",
    "content": "I’m 5’7” and it’s a little short for my torso. The top dips and the bottom is a touch tight. Cute though.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Wore this around Disney World in August and it was perfect. I wore the 2xl and I needed to wear my sports bra or a tank for chest coverage, otherwise it wouldn't have been enough for me. Super comfy. The shorts inside the jumper were just a little bit shorter than I would pick on my own, but it worked out.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Great",
    "rating": "4.0 out of 5 stars",
    "content": "I was really happy with the skirt length. And the pockets!",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I saw so many of these on people walking around the park. They are really easy to wear.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Fun, but arm holes are big",
    "rating": "4.0 out of 5 stars",
    "content": "My teenage daughter got a matching one and she loves hers too.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm 5'4\" 125lbs and ordered the small in Coffee.  The color is true to the picture. Love this for a stay at home/run errands outfit.  I like the loose, drapey fit, but the arm holes are just a bit too loose for me. Wish it came in an XS.  The other thing is, once you take it off, its like a puzzle to get it back in the right configuration to put it away!  It gets all tangled up because of the insdie body suit versus the outside dress that are attached!  Love it though and would buy it again, maybe with another vendor that sells the XS so the arm holes aren't super loose.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Not as cute as FP",
    "rating": "4.0 out of 5 stars",
    "content": "Definitely not as cute as free people but it’s longer and does the job",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I LOVE this dress, it's easy to layer and something I can wear to work. I definitely could've gone one size up because I don't like the way it fits around my belly",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Too big, but fabric is nice.",
    "rating": "4.0 out of 5 stars",
    "content": "The fabric to this is really nice and thick, I tend to get 1-2 sizes larger since I like the baggy fit, this is not one to do this with. I was so self conscious and constantly pulling at the straps and it was just not good. Buy your actual size with this one. The quality of the fabric is great though. I would recommend.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very cute and comfortable but a little disappointed on the feel of the material. It’s thick but some may have to wear a bra, which is difficult with the cut.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Cute and comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "Love this jumper!!! Just like Freepeople but a fraction of the cost!!! I want one in every color!",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "True to size, great fabric and comfortable.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "A wardrobe staple",
    "rating": "5.0 out of 5 stars",
    "content": "I’m 5’3”, 180 lbs, I ordered the Large. I think the material feels nice, but my only complaint is that I wish the length was shorter bc I’m short. I think it’s about 1-2 inches too long for me. I may have it altered. The underneath bodysuit has zero compression to it so it won’t help if you have an apron belly like I do. However the overlaying dress doesn’t seem the cling to my belly thank goodness. Also if you have a big bottom it will make it stand out. Either way, I think I will keep it regardless. I always have a hard time with rompers because of my bigger backside and I think this dress I can make work, as if I sized up to an XL, I think it would be too big up top. Definitely needs a longer sports bra or tank top underneath. Also I was hoping the material would be a little thinner for summer, bc it feels like a thick cotton.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is by far one of the cuterst romper dresses I have ordered.  I am 5'7 135-140 lbs and ordered a small.  It fits great!  I can wear it as is or stick a white tank under it!  Cant wait to wear this!",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Comfy and cute",
    "rating": "4.0 out of 5 stars",
    "content": "this romper fit perfectly and it’s so cute with a pair of sneakers for a nice day out!",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "True to size, comfortable and easy to wash",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Mini Romper Dress",
    "rating": "5.0 out of 5 stars",
    "content": "Great outfit. Got it immediately tried it on and fell in love. The only reason it has 4 stars instead of 5 is they didn’t think of having to pee when designing the outfit. The built it shorts are great. It can’t be that hard to put in some snaps though. It is a little shorted then I’m used to wearing out but I can get over that with a good tan. Also had to put on a bra underneath because there was no support for the big boob ladies.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "So cute and comfortable. My sisters loved it so much they got it for themselves in different colors.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Did not recommend on a hot humid day or 90 temps",
    "rating": "4.0 out of 5 stars",
    "content": "I first got a xtra small from reviews saying it runs large. Maybe they are not sewn all the same. I returned for a small. I am 5’2 , 36A, 27 waist , 38 hips. The small fit but I would rather the inside be loose because there is not much airflow. The liner is the same material as the outside of it. It’s very soft I have the strap",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Mid way . Great length for myself. It would be more comfortable with wearing a cami or bathing suit underneath since it does have a little bit of a gap . The mint green is a very pale soft color . Just like it’s shown just the right amount of paleness. This is great for a cooler summer day or night. I can’t imagine playing tennis in this on a hot day. 🥵",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Great summer dress!!",
    "rating": "4.0 out of 5 stars",
    "content": "Stretchy and comfortable. Great fabric and fits true to size.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This large was a little bit loose on me. If I was to buy another in the same style, I would get a medium. It also hit much lower on my leg than the picture. I am short at 5'2 but it looked a little too long on me.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Runs large, 5'2 1603lbs",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this for an upcoming cruise since I hoped it’d be easy to throw on for walking around the ship and it’s perfect. Has a built in bra and shorts and the material is nice and stretchy but great quality. I’d definitely order another. I bought one large and another extra large but think the extra large fits my bust better - 38D for reference. Love it!",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was very cute and I really wanted it to fit. I have a 36E chest and it caused the back to be a bit too tight. If I had gotten a size bigger it would have too long and large everywhere else.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Just what I’d hoped for!",
    "rating": "5.0 out of 5 stars",
    "content": "Very cute but Size down!!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I own these rompers in 4 different colors now and have been wearing them all summer long. I get compliments all the time and have sent the link to multiple friends. You can easily dress them up or down and also layer for seasons.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Cute, but not the Right Fit",
    "rating": "4.0 out of 5 stars",
    "content": "I anticipated a lighter material this is very heavy material like t-shirt and then of course it's double layered so it's very hot in the summertime however it's nicely made and quality item",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great color (I got rust) and I love the adjustable straps! The “rust” color is more of a pinkish orange and it goes with everything. If I buy another color I’ll probably size down.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Cute!",
    "rating": "4.0 out of 5 stars",
    "content": "Loved this! I got tons of compliments on it. Was super easy to throw on and was great for walking in all day. The dress does go down quite a bit lower on the chest and armpits so be prepared to wear a tank top or a sports bra (like I'm wearing) under",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Soft material. Bra and pants with full dress over. Very comfortable. I wish it was material that I could dry in the dryer but otherwise, fabulous.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "Love this little outfit! I would recommend sizing down though. I’m 5’4” about 115lbs and I got a size small. It was a bit big and since I have a smaller chest I had to tighten the straps all the way for full coverage. Very comfortable and the material is soft. Love that there are attached shorts",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect for a full day at Disney Land. Extremely comfortable, true to size, and has convenient pockets.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Cute!",
    "rating": "4.0 out of 5 stars",
    "content": "So perfect for running errands, house work, lunch dates, etc.! I enjoy the adjustable straps and built in onesie.  I feel like I could do anything in this stylish but super comfortable lil thingggg",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are so cute and comfy, and flattering even for thicker and bigger chest ladies. I ended up going back and buying more! Good fabric that’s not too thin and better quality. Excited to wear them!",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "Most comfortable outfit I’ve found/ wore in a long time. I am curvy but it fit me very well and was true to size. And the pockets are a big plus.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great quality. Runs a little big.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Comfy and Casual",
    "rating": "5.0 out of 5 stars",
    "content": "I love this dress/romper. It fits so comfortably and is a little longer than some other ones I have which I like. So cute.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Definitely like this dress - fits true to size, maybe a lil on the bigger size but I like to be comfy and do not want my clothes too tight. It can be dressed up with a jeans jacket or great to even throw on to run errands. I’m going to wear it to a backyard BBQ today with a white tank and white tennis shoes. It looks cute with a sports bra under it too. Smaller busted ladies could get away with no bra but there’s no shelf bra built in so that’s not comfortable for me. I recommended this dress to a good friend of mine and she’s already ordered it.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Shorts too short",
    "rating": "4.0 out of 5 stars",
    "content": "The dress is great- comfortable and flattering but the shorts underneath are way too short for me and keep riding up.  It would be perfect if they were a little longer",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The material has a great stretch to it. The length is great and easy to wear. Looks way more expensive than it is. Wish I would of purchased i. The beginning of summer.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Great simple look!",
    "rating": "5.0 out of 5 stars",
    "content": "This romper is true to size and super comfortable. I love the built in shorts. I wear a tank or sports bra under it to help with coverage.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great find! Good quality, washes well, so comfortable! I’ve already ordered it in several colors!",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "So comfy and soft!",
    "rating": "3.0 out of 5 stars",
    "content": "This is such a cute dress and such a good idea but poorly executed?  You have to take the entire dress combo off to go to the bathroom, which I knew before I bought it so I really can't complain.  It is not very forgiving unless you have a flat tummy, no curves and some acrobatic skills to get the dress off.  Maybe I was doing it wrong but to take the dress off there was not much \"give\" around neck line/straps to get it down and then you sat there naked because the whole point is you don't have to wear a bra with it.  I kept the dress but would never wear it in public because 1. no bra support 2. the nakedness in the restroom 3. did not hide my flaws.  I wasn't expecting a miracle but you always hope you will find that one amazing piece that makes you feel good about yourself.  This was not it.  Not the dresses fault.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This dress is great! It comes with the romper attached so its definitely mom approved!!",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Love this!",
    "rating": "5.0 out of 5 stars",
    "content": "Just as comfy as sweat pants and pullover but cute looking.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been wanting one of these dresses for awhile and had looked at several other vendors before settling on this one. I went with Anrabess based on the size chart, adjustable straps, and reviews. I got a large and am glad. It fits rather well and is quite comfortable. I have a smaller bust with big ribs, so I have to tighten the straps all the way. I have to undo them when I need to use the bathroom.",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Not for plus size (insert sad face)",
    "rating": "5.0 out of 5 stars",
    "content": "I am 5’0 and the dress hits mid-kneecap. I wear roughly a 12/14 in womens and 13/15 in juniors pants with a flat butt.  Tops are anywhere from Large to 1x depending on brand. I have a C-section belly with a mind of its own. The last time I was measured for a bra (VS about 2018) I was a 40C.  The large fits me really well. It doesn’t cling to my midsection. The bodysuit underneath is fitted but far from “too tight”. It doesn’t dig, the shorts don’t ride up. Don’t expect it to fit like shapewear. I’m not super fond of the design of the pockets, it reminds me of Pippi Longstocking. However I am thankful to have pockets.  This one did not have the bra inserts in the top like other dresses I viewed. It’s fine with a sports bra underneath.  I have never been a dress person but wanted something fun and different but still comfy for summer. It’s 97F as of about 15 minutes ago and I don’t feel overheated. I did worry about that given it’s two layers technically but it feels nice. I have worn it for a few hours today while running errands and the sweat marks are minimal. I got this as a Mother’s Day gift and will be getting more for summer. I could sleep in this if I wanted because it’s that comfy.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "*excuse the yucky mirror in my pics. I was in the bathroom in the storage building.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "So comfy!",
    "rating": "4.0 out of 5 stars",
    "content": "Those jumper is so comfortable! I love that it is a little baggy, so it’s more of a casual/sporty fit. The downsides are that the shorts tend to ride up and there is no built-in bra, so I found myself having to wear a sports bra. I got the black one… It does attract quite a bit of lint, but it’s easy to wipe off.",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "However, I will probably purchase another one bc it’s perfect for chasing toddlers!",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Runs a bit big",
    "rating": "5.0 out of 5 stars",
    "content": "It feels like it runs a bit big. And I don’t know if it’s just me but the seam inside the V on the neckline rubs me weird. But it is super cute on and very comfortable. Worth a try. I have the Free People. Reason and I like it better but this is a good alternative and looks just like it, just a bit bigger so size down.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "5'9\" 160lbs.  Ordered a large.  Fit perfect.  I love this brand.  Never fails.  Color is as pictured and very pretty.  Comfortable and flattering, and the under shorts are crucial.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "adorable",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this romper dress because it looked super comfy. The fabric is soft and stretchy, and it is a perfect piece to lounge in or wear to work from home. The color is also bright and vibrant, and I am actually going to buy a couple more in different colors. There are romper shorts built into the dress, and I LOVE the pockets on the front. I would give five starts if there was a built in shelf bra to give support, so I wear a sports bra or tank with a bra underneath. Overall, I would recommend this piece.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Super comfy & easy to wear! I love the pockets & the underneath shorts!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Super comfy and perfect for lounging",
    "rating": "4.0 out of 5 stars",
    "content": "I’d say true to size. Comfy and nice fit. Great for lounging at home or running quick errands. I’m a sucker for a dress with pockets!",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nice woven material, but size down if you’re not busty. The inner lining part was not snug in the least, I bought this dress from a different vendor, size S, and was perfect, however this one runs larger.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "So comfy!",
    "rating": "4.0 out of 5 stars",
    "content": "Super cute! Just make sure to pay attention to size guide as it runs large",
    "post_time": "Reviewed in the United States on April 16, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a great casual dress for warm weather. It’s comfy and easy to throw on. The fabric is very similar to T-shirt material, not super high quality. I ordered black and it attracted a lot of lint and also showed deodorant stains. However, I don’t think that would be an issue with any of the lighter colors. I am 5’6 130lb and ordered a small. The length was perfect in the front, a tad short in the back. This one does have ADJUSTABLE STRAPS!!! Which I think is very important to have with the cut of this neckline. I added a black sports bra underneath due to it not having a built-in bra. The pockets are roomy and awesome. I have already added another color of this dress in my cart. For the simplicity, comfort, and price I definitely think it will be a great summer staple!",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Love!! Got lots of compliments",
    "rating": "5.0 out of 5 stars",
    "content": "Super comfy and cute dress. I use it for walks or just going out for a casual day. I am 5’8 and 180 lbs and bought a size large. It fits great, love it!!",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The fit is perfect!!! Perfect to go outfit for the hot sun!! Shorts underneath is great Front Pockets love it!!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "So comfy!!",
    "rating": "5.0 out of 5 stars",
    "content": "The athletic dress is a nice outfit that you can throw on quickly to run errands or lounge in the house in. I love that it comes in a variety of colors and that there are two pockets on the front. The adjustable straps make it friendly for a variety of sizes. The lining underneath is comfortable and the fabric is thicker than expected. The material feels like a higher quality, but not a typical athletic material. I do recommend sizing down if you want a more fitted look. I am a true size small and will be returning for an XS.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The color is exactly as pictured. The material is thick, and seems well made. I maybe would like something a little thinner for the summer heat. 5'6\" 160ish pounds, ordered large I could have went with a medium",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Size down",
    "rating": "4.0 out of 5 stars",
    "content": "It’s very casual and very comfortable, I would hardly call the attached bodysuit shape wear. It is cute although, I feel I probably should have sized down, it’s a bit large for me personally.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Cute for the summer, great material, very smooth and soft. Dark grey color looks just like the picture.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Cute Romper",
    "rating": "5.0 out of 5 stars",
    "content": "Im a 12/14. 5'9\" 215lbs. A large fits perfect. Xl works as well just a little roomier. Its the most comfy thing ive ever owned. I have it in white and pink. The only thing that would make it better is if the arm pits were higher and it had a built in bra. I have to wear a shirt and bra under it.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I actually bought this to wear to work with a cardigan (teacher) and it’s perfect",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Super comfy!",
    "rating": "5.0 out of 5 stars",
    "content": "So I’m here to buy another",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Soooo comfy, good quality, and flattering",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Very good basic",
    "rating": "4.0 out of 5 stars",
    "content": "Would size down! I got the navy and love it.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is for all my big arm girls. Wear the dang thing! This is so freaking cute & it’s so comfy! I shy away from spaghetti strapped clothing my entire life & decided to take a chance on this & im so glad I did! It’s the perfect length, doesn’t suck you in too much & the straps are super easy to adjust. I’m in love!",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Perfect/comfy!",
    "rating": "4.0 out of 5 stars",
    "content": "I absolutely love this dress! It has been so comfy and cute for summer, as well as a simple maternity outfit! The only reason I didn’t give 5 stars is the body suit seemed to be a bit baggy and bigger than expected. However, since I bought this as I was pregnant, I eventually grew into it. The length is also not too short, and hit me mid thigh. I am 5’6 for reference.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Just Meh. Cute to lounge in. Wouldnt wear out. Looks more like loungewear. Material kind of thick",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Love for maternity wear",
    "rating": "5.0 out of 5 stars",
    "content": "Soft and comfortable. I am 142lbs and I got a med for a loose fit.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Like the dress especially in this hot weather. Was hoping it would be a bit more spandex material and less cotton but thts probably on me for not checking. Also a bit more stiff than the picture makes it seem",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Not impressed with the material",
    "rating": "4.0 out of 5 stars",
    "content": "Super cute, but really long, and it can't be altered because of the pockets.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’m usually a medium but wish I would’ve ordered a small.  It is very baggy on me and I was hoping it would fit a little tighter, especially the biker shorts underneath.  Overall, very comfy and cute!",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Good buy",
    "rating": "5.0 out of 5 stars",
    "content": "Not too short, not too long...love the double layer, ordered white and it's not see through...5'7\", 150lbs, ordered a medium and it's perfect",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this romper dress after seeing it highlighted on a blog. It's super cute and comfy, but runs a little big so I recommend downsizing. I'm 5'7\" 135lbs and ended up with a small after first ordering a medium. The material is good quality and still looks great after multiple washes.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "adorable and comfy.",
    "rating": "5.0 out of 5 stars",
    "content": "got lots of compliments. very comfy to wear. RUNS LARGE!! i sized down one size, and bought 2nd color",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’m 36, hate being hot, and have four kids under age 7 I’m chasing all day. This dress is cute to run out of the house in with a sports bra and a baseball hat. I love the built in tank/shorts. Practical, comfortable, nursing friendly. I ordered three colors! Xxl is what I ordered, which is what I order from target/other Amazon sellers and it fits true to size. It is a bit revealing in the bust for my comfort, but I am a 38DDD and used to that so I just wear a sports bra and I feel more covered..",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Perfect summer outfit!",
    "rating": "5.0 out of 5 stars",
    "content": "So comfy, hides fat/ stomach, is cool for summer!",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Really cute dress, great quality for fabric. Wish I bought I bigger size but that was my fault. I think the sizing is pretty accurate.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "LOVE!",
    "rating": "5.0 out of 5 stars",
    "content": "I really like this jumper. It can be dressed up or down.  Nice outfit on those hot days.  Only thing would make it better is a little bit more support in the chest area.  Really love this!!",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was my first romper! I have been hesitant to order one because I wasn't sure if I would like the one piece, but I'm now tempted to order more. This is super flattering and a great length.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Really cute",
    "rating": "5.0 out of 5 stars",
    "content": "My friend had this and i thought it was co cute i bought the dark gray.  Easy to through on on a hot day.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great fit, color & fabric! Good for playing sports or just to wear to do errands or casual days at home",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Very comfortable and cute.",
    "rating": "4.0 out of 5 stars",
    "content": "Description says built in shapewear, but make no mistake, it’s not shapewear, it’s just lined.  But I like it anyways and it’s great to throw on after a long day of work to relax.  But it by no means offers any support.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0CGRK6XT8"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "When I opened the package the outfit was crumpled up like it was shoved inside. Then when I opened it up out of the package there was dog hair all over it, along with some persons hair. I'm pretty sure someone either used it once and returned it or tried it on and left it out, as the straps had been messed with and the inner lining was the wrong way. The outfit itself is cute and comfortable but I am highly disappointed in the quality assurance of returns. Isn't this why they have a used but in good/great condition option? Keeping as I don't want to deal with the hasel of returning and repurchasing, just going to wash it.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0CGRK6XT8"
},
]