[
{
    "name": "        Stanley Quencher H2.0 FlowState Stainless Steel Vacuum Insulated Tumbler with Lid and Straw for Water, Iced Tea or Coffee, Smoothie and More, Frost, 30oz       ",
    "stars": [
        "84%",
        "7%",
        "3%",
        "2%",
        "4%"
    ],
    "pid": "B0CK9PT53B",
    "ratings": "43,139 ratings",
    "other_info": {
        "Brand": "STANLEY",
        "Color": "Frost",
        "Special Feature": "Vacuum Insulated",
        "Style": "30 oz",
        "Recommended Uses For Product": "Travel"
    },
    "discount_price": "$ 35.",
    "normal_price": "",
    "about_this_item": [
        " YOUR DREAM TUMBLER: Whichever way your day flows, the H2.0 FlowState tumbler keeps you refreshed with fewer refills. Double wall vacuum insulation means drinks stay cold, iced or hot for hours. Choose between our 14oz, 20oz, 30oz,40oz and 64oz options depending on your hydration needs. The narrow base on all sizes (except 64oz) fits just about any car cup holder, keeping it right by your side.  ",
        " ADVANCED LID CONSTRUCTION: Whether you prefer small sips or maximum thirst quenching, Stanley has developed an advanced FlowState lid, featuring a rotating cover with three positions: a straw opening designed to resist splashes with a seal that holds the reusable straw in place, a drink opening, and a full-cover top for added leak resistance. We’ve also included an ergonomic, comfort-grip handle, so you can easily carry your ice-cold water to work, meetings, the gym or trips out of town.  ",
        " EARTH-FRIENDLY DURABILITY: Constructed of 90% recycled BPA free stainless steel for sustainable sipping, the Stanley Quencher H2.0 has the durability to stand up to a lifetime of use. Eliminate the use of single-use plastic bottles and straws with a travel tumbler built with sustainability in mind.  ",
        " DISHWASHER SAFE: Spend less time hunched over the sink and more time doing the things you love. Cleaning your tumbler and lid couldn't be easier, just pop them into the dishwasher. Unlike plastic bottles that retain stains & smells, this metallic beauty comes out pristine  ",
        " LIFETIME WARRANTY: Since 1913 we’ve promised to provide rugged, capable gear for food and drink - accessories built to last a lifetime. It’s a promise we still keep. Stanley products purchased from Stanley Resellers come with a lifetime warranty. Rest easy knowing we’ve got your back through it all.  "
    ]
},
{
    "title": "it keeps liquids hot for a long period of time.",
    "rating": "5.0 out of 5 stars",
    "content": "I love this cup because it keeps coffee hot.  I also love the easy screw on cap which keeps the item from spilling when you are walking around.  It is important to take the cap off if you are drinking right away as it will burn your mouth.  I have purchased two of these 14 oz quenchers.  Also it is not heavy to carry.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this to replace my #Yeti, which did NOT keep my cold drinks cold - ice melted easily in my tea and did not remain overnight, even in the fridge. PLUS, it sweated water horribly. THIS Stanley kept my ice and tea overnight on the counter just as I left it the night before (a test). There was a bit of watery tea on top, but very minimal. IT DOES NOT SWEAT. And I love this color, too!",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Goodbye #Yeti, HELLO #Stanley!",
    "rating": "5.0 out of 5 stars",
    "content": "Bought as a gift for a friend and she will not put down. She went camping with it and said the ice was still cooling her drink for hours. Color is beautiful and can take anywhere",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First off it’s my favorite color.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Can’t go wrong with Stanley",
    "rating": "5.0 out of 5 stars",
    "content": "So happy I went with the 30oz one.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s the best purchase I’ve purchased in a very long time. Leek proof, value for money, appealing.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Boujee purchased basic Stanley.",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this for my daughter at college and she absolutely loves it. Only bummer is it does leak out of the top?",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a gift for my 10 year old grandson & he was so excited to get it. He loves it & it keeps his stuff cold all day, the features it has works exceptionally well. It is very kid & boy proof. The seal is great & had no problems.We are very happy with this product.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Gift",
    "rating": "5.0 out of 5 stars",
    "content": "This Stanley Quencher works great! It is definitely much, much better than other Cups I have had. This absolutely keeps things cold for many hours. I can fill it with water and ice late evening, and it well still have ice in it the next evening. You can’t get much better than that. Stanley makes a great product!",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "it fits so much water which is helpful as i’m a dancer and need a lot of water, i’m always hydrated and it always keeps my drinks at a cold temp. although please be aware that it’s a bit too good at its job as it only makes my water colder if i put ice in, not if i put it in the fridge. i always get compliments on the colour though, it’s very sturdy and fits in my UK cup holder just fine 😄",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Not too big or too small",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this for my daughter. She didn't want the huge 40 oz for obvious reasons, to us. They seem so big too carry around. I know they work for a lot of people. She LOVES this and has actually drank water every single day since it arrived. When she came home from a 2 week international trip the first thing she wanted was her Stanley, filled with ice water. She wasn't a huge water drinker and if this helps her drink more, it is well worth the cost!! Looks good, too. The only thing she dislikes is that it leaks when tipped but it's not advertised as leak free (I don't think anyway). She wants to order something to make it leak free.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My brother likes to get a coffee to go while driving his car. He had a birthday recently and I wanted to surprise him by sending a gift. I sent this cup to him and he was happy. He says it is a good quality and fits well in the cup holder in his car.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Stanley travel cup.",
    "rating": "5.0 out of 5 stars",
    "content": "This is the second one I have!  It keeps my drink cold all day!  I love the color, it fits in my car console and the size and seal is perfect!  I added a few accessories to make it really stand out!  I love the quality of Stanley, always have!!❤️",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "From one water hater to another- this thing makes me drink.  The whole bottle, plus straw is convenient to leave on my desk and make sure I get enough water in for the day. Lid and leaking, doesn't happen with our model. ( We also have a larger model that can hold a gallon which is for car rides.)",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Love my Stanley",
    "rating": "5.0 out of 5 stars",
    "content": "This color works well to always have a line of sight at the desk or anywhere around the office.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great cup! I drink a lot more water every day because my Stanley keeps the water very cold all day!!! The handle works well and is comfortable to carry. Mine is 40 oz. Perfect for a gift!",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Everyone knows my pink cup",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely love it! Came fast and perfect condition and very high quality aswell as the colors go nicely together! I like how you can switch from right handed to left handed based on how you put the lid on, aswell and use it as a sip lid. I definitely recommend this Stanley!!",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Stays cold for so long. Sometimes I would have to leave my cup in the car for events that don’t allow outside drinks and after 4+ hours in the burning car, my water is still so cold with ice still inside !!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Love my Stanley",
    "rating": "5.0 out of 5 stars",
    "content": "This cup is a win. The 14oz is perfect for my three year-old for school and his beverage stays cold all day long. I also bought the handles for this size so it would be easier for him to hold. Overall satisfied with the purchase and the Mist color is just so stinkin adorable!",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am in love with this color!!! My drinks will hold ice and water throughout the day and night. Will buy more.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Perfect",
    "rating": "5.0 out of 5 stars",
    "content": "My daughter wanted to jump on the Stanley trend. She had researched other brands, but in the end went with Stanley. She also searched on box store website and found this exact one in stock. When we went to pick it up, they didn't have it this color actually in stock. She was extremely disappointed. After looking online for this color, we finally checked amazon, ordered it, and had it the next day! Shipping was fast and she loves how her ice stays cold now rather than melting quickly. We should have saved ourselves the hassle and just looked on amazon first.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is hands down my favorite purchase made this year.  I have found it does not quite keep ice as long as they claim but it does keep it a long time and the drink stays cold even after ice has melted.  It is very durable and handle makes ease of use and portability a plus.  I added a straw topper on mine to keep germs, dust and bugs out of my water which works exceptionally well",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Love my Stanley Cup",
    "rating": "5.0 out of 5 stars",
    "content": "i got it for my mama, and truth be told, i drink from it too! its very strong so A for durability, i have no idea what versatity is im just in middle school but ok...performance very well. my thirst was fixed. straw???? uhh yes A. handle.... PERFECT! what is portability.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have wanted a Stanley for a while but thought it was just more of a trend than anything else so I have hesitated spending the money on it. I finally decided to treat myself and see what all the hype was about. Oh wow, I get it now! This tumbler is amazing! I love it so much! I did a test where I put crushed ice, not cubed, filled it only halfway with ice and then the water. I timed how long the ice lasted and it was almost 40 hours later and the ice was finally gone! I swear this tumbler is the only way I can drink plain water, as it just tastes better in my Stanley. Maybe it’s a psychological thing but it’s worth it to me. I haven’t had issues with leaking, I use the straw through the straw holder part. The handle is perfect for my small hands, and it has the nice smooth grip. It’s easy to hold and it fits perfectly in my cup holders! I’m so glad I got this tumbler! Trust me, it’s worth the price! I also was pleased to see it was delivered wrapped in plastic and paper and arrived in perfect condition. If you’re on the fence about getting a Stanley tumbler like I was, just get it! It’s 100% worth it!",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "yippee!",
    "rating": "5.0 out of 5 stars",
    "content": "I have purchased a few different name brands other than Stanley(Stanley is an expensive brand) so with that being said I caught my Stanley on sale and I bought it for $35 on Amazon. FYI I am an Amazon Prime member so that may affect other pricing through Amazon whom are not Amazon Prime members. My Meoky cup I purchased (Feb 24’) the handle broke and couldn’t reattach, tighten or fix. I paid the same price for my Meoky cup as I did My Stanley and I first noticed if My Stanley cup handle breaks I can tighten it up with a screw that’s placed right below the handle. I have no issues or complaints with My Stanley. It’s worth the price but some people can’t afford ^$80-^$100 for a cup but for me catching Stanley’s on sale and buying one I have no issues this far. I will be buying My mom, my sister, my S.I.L, my M.I.L and myself one for Bdays/ Christmas etc!!!",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I used this Stanley in a basket raffle for my church. Everyone loves getting a Stanley and I knew that this would be the be a great way to get people to put their tickets in. It was a huge success and looked great too! While I didn’t use personally the Stanley, I know that it is very durable and has a nice feel with the handle and the straw!",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Yes, it’s worth it!",
    "rating": "5.0 out of 5 stars",
    "content": "i was scared to buy it becuase some people said it comes broke or not even the right cup but mine came perfect with no dents or scratches and it even ended up coming a day early im happy with my purchase",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Got this as a bday gift for my little sister and she adores it! Very sturdy and good for use.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Got it on sale!!!",
    "rating": "5.0 out of 5 stars",
    "content": "This is currently one of my favorite 16 oz cups I'm drinking out of daily, its easy to wash, and the performance and insulation of this cup is top knotch quality. On a scorching hot day with heatwaves on a summer day. Luckily my water stayed cold for hours. Unfortunately I did not have the luxury of  air conditioning  so this cup helped keep me cool and hydrated after I thawed it from the freezer. I most recently saw an advertising from Stanley cup on Instagram seeking to find scouts to help promote their Stanley cup and I would absolutely love to team up with Amazon and or Stanley to help promote some of thier things. I would love even some freebies to promote. Although there are plenty of knock off Stanley cups  everywhere, in my personal opinion I have to say the Stanley brand name cup was worth the price!",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My wife loves this, honestly I was a bit hesitant to buy it at first, thinking it would be the same thing as all the other tumblers out there but I have to say that it is really well insulated. My wife left her Stanley in the car while is was 105 outside for about 8 hours with ice water in it and surprisingly enough the ice didn’t seem to melt at all. I hate to say it but it might just be worth it if you like to have cold drinks all day long. As far as holding heat, I can’t attest to that since she hasn’t put any hot liquids in it yet.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "She puuurrttyy",
    "rating": "5.0 out of 5 stars",
    "content": "I drink so much more water now that I have this bad boy. Everything works pretty well, beside the little spill that happens when you overfill which is normal. I said I was never going to buy a Stanley but I joined the dark side 😈 and here we are.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I just received my Stanley cup, and I’m really happy with it! The pastel color is gorgeous and adds such a nice touch. It keeps my drinks cold for hours, which is perfect for long days out. The handle makes it easy to carry, and the straw feature is super convenient. It’s durable and practical—exactly what I was looking for. Highly recommend for anyone looking for a stylish and functional water bottle!",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "So cute",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased the Azure in 30 Oz size as a gift for someone, so I can't tell you how it works. I honestly don't understand the obsession with cups, but it is a really nice one & such a pretty color, I can see how people fall in love with them. I have to say that it came packaged very nice, wrapped in tissue & then in bubble wrap. I almost wanted to not open it, but I wanted to make sure the correct item came before I gifted it. I may or may not consider getting one for myself now lol.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Ordered from the UK and it arrived in less than a week, like seriously?  The colour is a beautiful mid beige with rose pink branding.  So happy with this Stanley, have heard a lot of complaints about leaking but this hasn't leaked at all and seems water tight.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Pretty",
    "rating": "5.0 out of 5 stars",
    "content": "The quality of this cup is good. I bought it for my nine-year-old and it’s proven to be durable as many time as she’s dropped it. It also has proven to be leakproof. We fill it up with ice in the Morning and the ice will last all day long.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought for my daughter, perfect size for her. Fits in cupholders. Not too bulky to fit on side of backpack. Good quality, keeps drinks cold.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "LOVE this!!",
    "rating": "5.0 out of 5 stars",
    "content": "I bought two Stanleys (this one and another color) for my boyfriend and I a few weeks ago. Not a day has passed where we haven't drank out of them! It has become my new favorite way to drink water, as it keeps it ice cold all day! This color is also quite cute and I'm a big fan of the handle and straw. Its super easy to clean too! I just put the individual compartments in the dishwasher :)",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this little Stanley for my 8 year old — she doesn’t need a huge one, and this is the perfect size for her needs. At an affordable price. Gorgeous lilac color. Only problem was that it didn’t come with the straw, so I had to buy them separately.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Love it!",
    "rating": "5.0 out of 5 stars",
    "content": "I didn’t even know how to leave an Amazon review and I’ve been shopping on Amazon for like 5 years !!! But I have to say this cup is worth the hype!!! & I have to share.. Last all day… sometimes more than a day! Deff worth it !!!",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My beautiful new White Frost Stanley! I love it! I tried hard to resist the trend but having kidney stones, it is important for me to drink enough good fresh water. Filling it with two trays of ice and a 40 ounce splash of my zero water from the refridge and I am ready to go for the day.  It spends the night inside the refridge and holds the cold and ice like crazy! It can be a bit heavy for people with wrist issues or arthritis, so if you have those problems, you may want to down size to a 30 or 20 ounce cup. I do wish that Stanley would make more 20 ounce cups with handles. I hand wash my Stanley every couple days and refill changing out my straw topper and silicone base sleeve for a clean set while the freshly washed ones dry. Now I want more colors!",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Such a pretty color",
    "rating": "5.0 out of 5 stars",
    "content": "I love this tumbler. I've had other brands but they don't compare. The soft yellow is so pretty. Ice stays in this for a long time and I can keep refilling it with water all day. I think I need to get the bigger one to have also.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Este es uno de los mejores termos que he tenido.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Excelente producto y servicio al Cliente",
    "rating": "5.0 out of 5 stars",
    "content": "Aunque no sea a prueba de derrames, puedes conseguir aca mismo varios accesorios para evitarlos y ademas cuidarlo.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excelente tamaño, fácil agarre y no tan pesado.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "PERFECT IN EVERY WAY!  THANK YOU!",
    "rating": "5.0 out of 5 stars",
    "content": "Tuve problemas con un envio anterior pero nada que amazon no solucionara!!",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Got this for my Girlfriend who is a teacher!  Her favorite color is yellow and she never had a Stanley cup before, though all her staff at work had them.  I just had to get her one!  She uses it DAILY!  and loves everything about it!  Cleans up nice, fits in her bag when needed and keeps drinks ice cold for a long time!  I definitely made the right choice here!  Excellent gift for someone on the go or office staff.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Keeps drinks cold all day",
    "rating": "5.0 out of 5 stars",
    "content": "My granddaughter loves this cup. She uses it everyday. Keeps her drinks cold all day.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I thought these cups worked better unless it’s a dupe . Filled it up all the way with ice then cold water got ready for bed hour and a half later I’m headed to bed and I have no ice !!! It’s 74 degrees in my house what the heck ! UPDATE I ACTUALLY DRANK ALL MY WATER AND THE ICE MADE NO SOUND CAUSE I HAD NO WATER LEFT GREAT CUP I USUALLY HAVE A HARD TIME GETTING ENOUGH WATER IN I LOVE THIS CUP SILLY ME",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Helps me finish my water ! Almost left a one star review ooops oops",
    "rating": "5.0 out of 5 stars",
    "content": "The cup is mostly made with excellent materials. I just wish the cover wasn't plastic, but at least it looks durable and safe for food/water contact. The lid doesn't leak when properly screwed and retains the liquid's temperature very well, to the point that ice cubes will last for a whole 24h. It's easy to clean and fits well in all cup holders we have around and the handle makes it easy to carry when it's filled up and heavy.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this color. Sometimes it can be difficult to determine if it’s the right shade depicted in the listing but after much searching online, the shade seemed consistent enough to purchase. I was going to get matcha cream but this most color was calling me. I ordered a cup prior in melon, which costed more but cancelled it and purchased this one. Love that the opening rotates. Never had a Stanley cup before. And my only concern is that Amazon should include better protective packaging. Luckily the worker was conscious enough to not throw it down roughly or it would have been dented up.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Go Stanley",
    "rating": "5.0 out of 5 stars",
    "content": "This Stanley cup is awesome.  Truly it keeps your beverage cold .  I put Cold water in the morning it stayed Like That all day.  Its worth dvery dollar .  Plus i love the color everyone seks me where i got it.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve been very hesitant but finally caved. The color is soooooo cute in person. I’ve heard good thing about how cold it keeps drinks. While I love the cups i currently have. I needed something larger. Starting with a 30oz and may work my way up",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Excited!!",
    "rating": "5.0 out of 5 stars",
    "content": "are you actually kidding me? this thing is not only super cute but it’s sturdy asf and keeps my water really cold. it does not come in a box when you order it but in wrapping paper and bubble wrap, it’s definitely real so you don’t have to worry about paying the real price for a fake cup. i don’t know how i lived my life without this cup. i have taken it everywhere with me and it keeps me hydrated. the handle is really soft and it’s my favorite.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Filled with ice and water and then left it in my car with the straw in it during a couple of hot days.  After 2 days it still had some ice in it and after 3 days while the ice was melted the water was still quite chilled.  Still working on seeing how well the heat retention might be with something like coffee or tea, but have not had any really cold days yet to completely verify it's abilities.  With the results of the cold tests versus my closed up car on quite hot days I have no reason to expect the retention of hot drinks to be anything except the same high level of ability.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "love",
    "rating": "5.0 out of 5 stars",
    "content": "I was pleasantly surprised with the color on this. It’s the perfect shade of blush pink. The water stays really cold and for a very long time! I have always bought Yeti cups and while I still love them, I see the hype for Stanleys.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the 20oz cups better. They fit in my car cup holder without falling over. They’re not so heavy to carry and it  Fits perfect in my tote bag for work.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Outstanding Job in Maintaining the COLD or HEAT of Beverages",
    "rating": "5.0 out of 5 stars",
    "content": "My cold beverages stay colds for hours I wake up in moving and still have ice in my cup. Hot beverages stay hot for several hours also.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My granddaughter use hers for school and she loves how it keeps  her beverage cold for lunch",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Beautiful color",
    "rating": "5.0 out of 5 stars",
    "content": "Also my daughter, granddaughter and I had fun decorating with stickers so cool and pretty💛💚💜",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CK9PT53B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I got the beige and it goes with anything I wear. It keeps my sodas cold for 24 hours. There is often still ice inside in the morning if I don’t finish my drink the day before. My only complaint is it’s hard to unscrew the lid. It seems to have a vacuum effect. I’ve found running cold water along the rim will help loosen the lid.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CK9PT53B"
},
]