[
{
    "name": "        Compact Food Dehydrator, 4 Stainless Steel Trays Fresh Dryer Machine for Jerky Herbs Fruit Veggies Snacks, with Digital Timer | 190F Temperature Control, Great Size for Small Family       ",
    "stars": [
        "70%",
        "15%",
        "6%",
        "3%",
        "6%"
    ],
    "pid": "B0CLXXSY21",
    "ratings": "1,216 ratings",
    "other_info": {
        "Brand": "Septree",
        "Material": "BPA-free PC",
        "Color": "4 Trays Dehydrator",
        "Wattage": "400 watts",
        "Product Dimensions": "11.4\"D x 11.53\"W x 7.87\"H"
    },
    "discount_price": "$ 97.",
    "normal_price": "",
    "about_this_item": [
        " 【EASY TO STORE & CLEAN】With compact size, this small food dehydrator is lightweight to move and store easily. 4 stainless steel shelves (10.2*8.1in) with adequate space between their placement, easy to clean stainless steel interior. Just soak for a little while and like magic it’s ready to do more dehydrating.  ",
        " 【NICE EFFICIENT DEHYDRATOR】With excellent temperature range 70℉ to 190℉, this small unit has a higher heat range than many. It may look small but it can dehydrate 2 lbs of blueberries in one batch. This unit is able to do the same amount of blueberries twice as efficient as the the larger competitive unit,because of its size is less expensive to run (less space to disperse the heat). The fan is very big and provides even airflow across all the food on the trays so there's no need to change trays around.  ",
        " 【EASY TO USE DIGITAL DISPLAY】Large display on top is easy to read and controls are simple to adjust, and remembers previous settings so it is a one-touch to start another batch. Thanks to the flexibility to tweak drying times to suit your family's tastes.  ",
        " 【PATENTED WRAP-AROUND MESH】The mesh used in our dryer machine is fully 304 tainless Steel material. Smooth and Flat, and use safe without scratching the hands. And the mesh is thick, high density, Excellent using experience.  ",
        " 【SAFE MATERIALS & WIDE APPLICATION】Made with 304 food-grade stainless steel and premium BPA-Free material, Septree food dehydrator lasts long and works with great durability. Perfect for making healthy beef jerky, snacks, nuts, dehydrated vegetables, fruit leather, pet treats, and for preserving herbs, flowers, and much more at home. If you encounter any problems, please send us message at any time first!  "
    ]
},
{
    "title": "Easy to set up, works great",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator is amazing! Super easy to use: The controls are simple, no confusing buttons or settings Quiet: This dehydrator is very quiet when it runs, so you can use it all day without disturbing anyone. Looks well made: The stainless steel parts look very sturdy, and the trays are dishwasher safe for easy cleaning. Dry everything evenly: This dehydrator has this fancy 360-degree airflow thingy that dries all my fruits and veggies evenly. No more mushy spots! Plus, it comes with lots of extras like silicone sheets and a recipe guide, etc. Overall, I'm very happy with this dehydrator - definitely worth the money.",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works great. Very easy to use. The recipe that comes with it is probably translated from Chinese to English, so be prepared because there are some sentences in there that almost make sense but are poorly worded, but it's okay.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "This is 100% PERFECT! I am so happy I bought it.",
    "rating": "4.0 out of 5 stars",
    "content": "I'm really impressed with this dehydrator. It's steel, sturdy, and quiet. I loved my old \"top-of-the-line\" (back then) plastic dehydrator, but I had to sell it a few years ago when times got tough. Things are getting a little better, so I treated myself. This is not tiny, like I feared. That's a full sized, 24 oz, water bottle in front of it. Everything is good quality, from the machine, to the trays, to the silicone sheets and silicone fruit roll tray. Seriously, that fruit roll tray has the BEST hand feel to it, you should buy it just for that. It's making chicken jerky for our dog right now, and is so quiet I can't even hear it. The electronic panel flashes between the temperature and the time left. I had no idea how long to tell it to dry the meat before it automatically shut off, so I just put it on 6 hours. It has a light that lets you see inside really clearly, so you don't have to keep opening it and introducing outside air and dust and germs. You can watch it through the window. Mine was missing a screw for the door handle that you have to attach. I would really like to have that screw because I didn't have any like it, but I have no other complaints at all. Who knew it would be THIS nice??",
    "post_time": "Reviewed in the United States on April 23, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered this to dehydrate some eggs as I am overflowing currently since it’s laying season for my hens! I had researched ways to preserve eggs so that come winter time when I’m not getting many eggs, I won’t have to then purchase them from grocery stores and dehydrating the eggs seemed like the best way to preserve them for our situation.",
    "post_time": "Reviewed in the United States on October 23, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Works great!",
    "rating": "5.0 out of 5 stars",
    "content": "The item arrived on time, and everything was in there, although when I went to purchase there was a code I had hit that had an offer of a free tray, and I did not get that (not a huge deal honestly)",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I unboxed it, ran it for the 30 min per the instructions, and rinsed all the trays etc to prep to dehydrate. I got the eggs blended up and into the silicone trays (I bought the ones for the 4 tray on this link, I wish they had bigger ones that fit these trays fully though)",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Great Compact Size - Dries Quick!",
    "rating": "5.0 out of 5 stars",
    "content": "It runs super quietly, has a super bright LED light for you to check in on what you are dehydrating, this morning I came out and was tidying up the kitchen when it completed. It did a great job dehydrating the eggs and I was able to get them out and everything done and another batch started.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The only reason I gave 4 stars instead of 5 is that I wish it at least came with 2 properly sized silicone trays, personally I’ll be mainly using this for fruit leather and eggs, so I had to buy trays and the 2 non stick mats that come with it are not useful for liquid honestly. Otherwise this is a great little homesteader piece of equipment and will definitely get a lot of use at our little homestead!",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "My new favorite in the kitchen !!!",
    "rating": "5.0 out of 5 stars",
    "content": "I've used those round stackable plastic dehydrators for the last couple of decades; they do the job. However, I was blown away that it took 6 hours to make Beef Jerky in this dehydrator, when the old plastix towers took a minimum of 12 hours. Apple slices and bananas took 6 hours as well. Fruit leather was done in 4. What a game changer!",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Let me break down this machine:",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "So compact so powerful!",
    "rating": "5.0 out of 5 stars",
    "content": "This food dehydrator is incredibly compact and great for studio apartments. I will mostly be using it to dry filament for 3D printing and it does a great job at that because not only can it reach temperatures like 190F but it also has a fan.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have checked the temperature and it does reach and hold the temperatures it claims to.",
    "post_time": "Reviewed in the United States on April 27, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "A+ dual filament dryer.",
    "rating": "5.0 out of 5 stars",
    "content": "I wanted a better filament dryer than what was out there but I didn’t want something huge. The problem with actual “filament driers” is they use passive heat and that doesn’t circulate hot, dry, air well around the spool. Thus it doesn’t do a good job dehydrating the filament.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "And even with “better” filament dryers such as the sunlu s4, the PTC heater blows hot air directly at a small area of the filament, which creates a hot zone on the filament.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Efficiency and timing",
    "rating": "5.0 out of 5 stars",
    "content": "A food dehydrator has better circulation. It has a low speed fan that puts heat evenly around the spool.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This unit can fit 1 spool or two spools. In my tests (set at 60c) the very back was right around 60-61c while the front was around 57c. A delta of 3c is pretty good when you cram two 1kg sized spools in there. With 1 spool, the delta was only 2c (61c rear and 58c front). Keeping mine I was using cheap $10 hydrometer to do this tests so there may be some slight variations in actual temps. Luckily, temps were consistent and filament isn’t super picky (my PETG won’t care if it’s 58c or 61c).",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Useful",
    "rating": "5.0 out of 5 stars",
    "content": "It also goes from ambient 23.8C to 60C in about 7mins. By the end of the 7 mins, the humidity in the dryer has dropped from 58% to sub 10% (my hydrometer isn’t good enough to read sub 10%).",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This will go up to 87c which is good for ABS and ASA.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Great digital display",
    "rating": "4.0 out of 5 stars",
    "content": "I have the small 5 tray one. It’s small, compact and fits 2 spools. I mostly dry 1 spool at a time to replace whatever is in there. If you need a larger size, consider a larger version.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Product was sent back.  Pictures were misleading about the size intended",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Great little dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "Great little dehydrator,  quiet, easy to use.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Great purchase and works great but the paint that is over some of the buttons have worn off after only a few uses.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Great purchase but.",
    "rating": "4.0 out of 5 stars",
    "content": "Dimensions don't include the cord which is a standard IEC 60320 C13, as found on ATX power supplies.",
    "post_time": "Reviewed in the United States on January 6, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As stated in other reviews the selves don't work the best; The sides are spread further in spots and the selves will fall down if too much wait is put on it.  Some spots are fine, others barely even hold the weight of the self.",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Selves need work and a few minor gripes.",
    "rating": "5.0 out of 5 stars",
    "content": "Relay clicks on and off a lot, sometime many times within seconds; Not sure if there is no delay or the relay is dying already.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Would prefer an solid state relay.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Best dehydrator for beginners",
    "rating": "5.0 out of 5 stars",
    "content": "Minor gripe, but you can't turn the light on when it is not running.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wish it had a hard power switch in the back so I can leave it plugged in.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "GREAT LITTLE DEHYDRATOR!!",
    "rating": "5.0 out of 5 stars",
    "content": "After watching countless videos about people making and prepping their food with the dehydrator, I finally pulled the string and bought one for myself. I received it in the evening so I unpacked and used it after the kids fell asleep. It was not noisy at all. Tbh it’s even quieter than my ice maker machine. The size is a little too big for my kitchen island so I’ll probably use it 2-3 times a week and will store it away if I don’t need it since our kitchen space is limited. But overall, I’m very happy with how the food came out. The drying time didn’t take too long as expected and it did a great job. I can’t be more satisfied for this purchase.",
    "post_time": "Reviewed in the United States on January 12, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I basically use this to dehydrate apples, but it works good on everything. I have a bigger one of a different brand for my jerky, but just because I can do more at once.",
    "post_time": "Reviewed in the United States on November 25, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Nice product",
    "rating": "5.0 out of 5 stars",
    "content": "Works very well",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Smaller than I wanted but works well! Simple to use and because it’s small it doesn’t take up much room. Good product",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "I love the ease of cleaning up. Not very portable due to size, but I typically do all my dehydrating during the summer to prep for non harvesting months. This worked really well and I was able to dehydrate so much at one time. This is my first real dehydrator and I'm so happy with it.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There were some issues with unboxing, I think due to delivery driver. Box arrived completely open and I thought it was actually damaged at first but wasn't.",
    "post_time": "Reviewed in the United States on March 27, 2022",
    "pid": "B0CLXXSY21"
},
{
    "title": "Nice",
    "rating": "4.0 out of 5 stars",
    "content": "Always wanted a dehydrator machine so I finally got one after comparing several other models. The machine received is very well made, sleek and not super heavy which is good. The size is about roughly the same as a microwave.",
    "post_time": "Reviewed in the United States on November 24, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I followed a recipe online to make a three times steamed and dehydrated apple slices that was popular on the internet. I chopped my apples into slices then rotated between dehydrating and steaming them for about 30 mins each for three rounds. The result was quite devious, it was slightly juicy while still retaining all the apples own flavors. Was sad that I didn’t more. I’m planning to use the machine to make dried orange slices dipped in white chocolate which has also been very popular for a long time but haven’t gotten to try. I wasn’t able to buy fresh oranges so I was planning to wait til summer to make them. I like how the box came with a small full colored recipe book that has really good instructions and ideas on how to use the machine such as watermelon, kiwis, blueberries, fruit rolls and meat jerkies.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Easy to use and very useful",
    "rating": "5.0 out of 5 stars",
    "content": "It came with 6 trays which is really nice as you can make a larger quantity at once. Also came with 2 mats, 2 containers and  2 set of silicone glove.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The machine is very quiet when running and you can set up the temperature and time to run. The maximum temperature goes only to 190F. Even running at the highest temperature, the outside stays cool and I feel safe and not worried that it’ll catch on fire. There is also a light function so you can see the inside when running which is so cool.",
    "post_time": "Reviewed in the United States on December 5, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Dehydrates evenly",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, I think this is a good buy. I’m hoping to make more stuff with this machine and share it with my family and friends",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Third dehydrator and this has been the best. I use to make jerky dog treats and sometimes run two-three batches at a time, running this continuously.  Easy clean up, better than plastic trays in old units. Removable drip tray is a bonus.",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Works perfectly!",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator is amazing. It is very easy to use and is perfect for beginners. You can control the time and the temperature! It's very quiet, and it looks nice enough to keep out on the counter. I didn't want a cheesy, cheap looking Styrofoam dehydrator that made a bunch of noise, and I didn't want to spend an arm and a leg on a nice stainless steel dehydrator. This is economically efficient and looks great. I've made fruit leathers, dried plums, banana and apple chips, and raisins in this so far. It's perfect. I would definitely buy this again, and I highly recommend it.",
    "post_time": "Reviewed in the United States on March 15, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Dehydrator did not last more than 8 months.  Used once a week and sometimes twice.  That means this machine was used less then 75 times before it stopped.  Early on this appliance was great compared to the round plastic models I had been using.  A few month after using, the control graphics begin to wipe off.  The power symbol is completely gone at this point.  An overnight drying session left me with soggy, room temperature chicken breast, strips, this morning..  I make chicken jerky dog treats.  No, I will not purchase again.  Yes, I will look for some of the same features - interior light & the capacity are good.  The rectangular shape fits better in kitchen than the round version.  May be that I wound up with the bum one from the manufacturer but I'm not willing to waste my time with another Septree to find out.  Besides my customer has expectations & I can't keep her waiting.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Disposable Product",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator is amazing for the price. I make a lot of beef jerky and this makes it so easy to make it quick. It so so easy to clean. It heats up quick and the light makes it easy to check on your stuff you are dehydrating. Great quality product.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I was using a recipe that called for dehydrating for 24 hours at 100 degrees. I eventually realized it was not heating at all, and basically just blowing room temp air over my cheese. I have to set it to a much higher temperature to get it to heat up at all, so I really have no idea what temperature it is.",
    "post_time": "Reviewed in the United States on October 17, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Fantastic dehydrator",
    "rating": "4.0 out of 5 stars",
    "content": "Edited: It does a good job at higher temps. Can't give it five stars, because it just isn't precise and doesn't work at lower temps. But it is a good price and can get the job done.",
    "post_time": "Reviewed in the United States on February 9, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's a really decent dehydrator for the price and how small it is I bought it like a year ago. It's lasted this long. It works pretty good. The only problem is that the paint on the front door has started to fade And wipe off",
    "post_time": "Reviewed in the United States on February 7, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Does NOT actually get warm on lower settings",
    "rating": "3.0 out of 5 stars",
    "content": "This is so much better than my round dehydrator! It blows from the back not the bottom so I didn’t have to twiddle racks. And there’s so much space! But it does have a larger footprint than I thought so pay attention to the measurements. The metal racks are so much easier to clean than the plastic ones in my other dehydrators! I can wait for the garden this year!",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I also want to comment on the packaging, boring right? I couldn’t figure out how to get it out of the box until I found out there are finger hoods on the longer side so you can just pull it out! Really well thought out",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Good on sale",
    "rating": "5.0 out of 5 stars",
    "content": "it turned on but i didn’t like it it took too long to dehydrate stuff and it had missing items money was returned but in a amazon gift card online and had to pay to send back",
    "post_time": "Reviewed in the United States on May 31, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love everything about this oven. I use it at least once every day. Some days several times. I choose it many times over my microwave..",
    "post_time": "Reviewed in the United States on December 17, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Nice Compact Size",
    "rating": "4.0 out of 5 stars",
    "content": "Nice compact size not much bigger than a 4slice toaster. Comes with 4 wire racks. 2 silicone mats. Wish it had 4 silicone mats , seems silly not to give enough mats for each rack. We have used this unit since the beginning  on June 2023 and have really liked it. We have had to look up recipes online to for several different types  of fruit . Would be nice if the booklet had a list on the index for temperature and times for common fruit and jerky that you could just flip to or cut out to keep with unit. Over all we really like it for our small family.",
    "post_time": "Reviewed in the United States on August 22, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Got this model for use in drying mushrooms for supplements.  Tested against oven clock - heater settings accurate from 75 to 190 degrees.  Unit is quiet, although it clicks softly when the fan starts and stops.  Heating/fan design is gentle on the materials that you're dehydrating.  Four trays provides enough space for small grows easily.  No real cons after a week of testing - nice design!",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Quiet, easy-to-use dehydrator with accurate heat settings",
    "rating": "5.0 out of 5 stars",
    "content": "This was the best purchase of the holiday season. We dry orange, lime, lemon, grapefruit and pumelo slices during the holiday season for garlands and decorations. I had previously been using the oven, but it takes forever to do them in the oven. It also makes the slices darker and occupies my oven for long periods of time. This was perfect. It's the size of a small microwave and the noise is minimal. It had the capacity to handle several pieces of fruit at once. I only had to do one day of drying for each kind of fruit. We also love apples done in this dehydrator. Comes with a recipe book and accessories.",
    "post_time": "Reviewed in the United States on January 3, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really like it! It dries the fruits very easily. Delicious food that my children like. The shelves are easy to clean and maintain. The controls are easy to operate and adjust depending on your needs. High recommend to everyone",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Perfect For Holiday Preparations!",
    "rating": "5.0 out of 5 stars",
    "content": "This food dehydrator is easy to use, easy to clean, looks like a stylish tiny microwave, and just all around works really well.  I've dried fruits, veg, leftover sourdough bread starter, and some flowers and leaves for art projects.",
    "post_time": "Reviewed in the United States on August 7, 2022",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It runs quietly and (so far) quite consistently.  The interior is similar to an oven with lips in the side walls onto which you can move the removable shelves to accommodate thicker or thinner foods or flora.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Good product!",
    "rating": "5.0 out of 5 stars",
    "content": "The booklet has cooking temps and times, and it's really easy to find info about that online for all kinds of foods.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It also included 2 pieces of mesh to lay onto 2 shelves so you can make fruit leather, but I have not yet tried making that yet.  Kind of waiting on my fruit trees to bloom.",
    "post_time": "Reviewed in the United States on July 11, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "My first dehydrator and I hope it lasts forever",
    "rating": "3.0 out of 5 stars",
    "content": "In another year or two, who knows, I may change my mind.  But as for now, I am very pleased with it. We're getting a fruit and veg garden started so I'll be using it a lot more next year, but I just had the itch to go ahead and get it when I did.  Corn is very cheap at the moment and I really love dried corn in salads.",
    "post_time": "Reviewed in the United States on April 1, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It took 8,5 hours to dry herb leaves at 110. That seems really excessive since my dehydrator  book states herbs should take no more than 3 hours to fully dry at 105. So how do I calibrate this?",
    "post_time": "Reviewed in the United States on September 6, 2022",
    "pid": "B0CLXXSY21"
},
{
    "title": "Excelente producto",
    "rating": "5.0 out of 5 stars",
    "content": "Me encantó mi deshidratador, estoy iniciando en el mundo de las galletas decoradas y fue la mejor inversión.  compacto y justo para iniciar un negocio.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just as described",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Works as well",
    "rating": "4.0 out of 5 stars",
    "content": "This is an amendment to the review below. The company contacted me and we were able to reach an amicable solution to my problem. I would not hesitate to purchase from this company again. They respond quickly and follow up very well. Good customer service is so important and highly appreciated, as it is often lacking. Hope this helps in making the decision to purchase one of their products.",
    "post_time": "Reviewed in the United States on June 18, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "(It is compact and fits well in my space but it has taken well over the time and temperature suggested in the book to dry some herbs. I will",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Update on previous review",
    "rating": "5.0 out of 5 stars",
    "content": "keep trying to master this until close to the time limit to return it.)",
    "post_time": "Reviewed in the United States on May 31, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a very nice dehydrator.  I appreciate the set it and forget it approach and I love that it is stylish and it’s really compact.",
    "post_time": "Reviewed in the United States on January 1, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Amazing dehydrator!  Compact!  Home run",
    "rating": "3.0 out of 5 stars",
    "content": "This have been perfect for my family of 2. We actually just made a beef jerky batch with this and it was phenomenal.",
    "post_time": "Reviewed in the United States on November 13, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This food dehydrator was given to me as a Christmas gift so I could dehydrate my own fruits, vegetables, and meats.",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Amazing",
    "rating": "5.0 out of 5 stars",
    "content": "So far I have used it only for apples, but it worked very well and was easy to use. I ordered extra silicone tray liners to make cleanup easier and they worked very well. It is fairly small and compact so it doesn’t take up too much countertop space, which I like. It is quiet when it runs and does not heat up the room. It is a great food dehydrator for a beginner like me. Five stars!",
    "post_time": "Reviewed in the United States on October 20, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Seems to dry food just fine, as far as I can tell after a few uses. The food takes a long long time to dry, which I’m not sure is typical of all dehydrators. This one recommends 13-15 hours for orange slices, for example. The thing is very quiet for the most part, but makes a pretty annoying little “twinge” of a sound every so often, especially as it heats up more. You can hear the sound it the video I shared. Also I tried to use the gloves that come with it to take something out of the oven at 350F and they melted, so maybe don’t use them for anything but the dehydrator. Overall it’s fine, probably worth the lowish price, but I might try to run it when I’m not in the house because of the little random noise it makes. After 14 hours it gets pretty annoying.",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Nice efficient dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "This small unit has a higher heat range than many competitive products. It may look small but it can dehydrate 2 lbs of blueberries in one batch. That is all I need. It is a workhorse for its size. I bought a competitive larger product from a different vendor and returned it for this one. That was a great decision.  This unit  is able to do the same amount of blueberries more efficiently than the the larger competitive unit. The fan in this unit is twice as efficient as the other unit. It because of its size is less expensive to run (less space to disperse the heat). The controls are much easier to use and more intuitive. This vendor offers a larger 6 shelf unit but the view oval window is smaller than the square viewglass on this unit. And the other units controls are not as nice and easy to use as this one. i recommend purchasing this unit.",
    "post_time": "Reviewed in the United States on November 4, 2022",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I Love this little machine. the only thing the top of unit has a couple deep scratches. I was going to send it back. But I decided to see if it worked . It does work well. I made beef jerky 190 degrees for about 2 hours. Very thin lean beef. . Tasted awesome. I wish  it had more detail recipes. I guess with this one. Turn out delicious 😋I decided to keep it with the scratches. Also I thought the two containers were supposed to be glass . They were cheap looking plastic. Not even sure if it's bpa free. Probably not because it would have said.",
    "post_time": "Reviewed in the United States on November 10, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Small dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this to dry royalnicing cookies between colors and it works perfectly!",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We like the dehydrator to make ground beef jerky and it's compact design",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Fantastic!",
    "rating": "4.0 out of 5 stars",
    "content": "Was smaller than what I thought it would be. I had an Excalibur and it just wore out. This one doesn't dry as well as the excaliber. Because of the fan.  I think a fan in back would be better. I dehydrate a lot for my pantry and after using for awhile it is ok. The companY got back with me pretty quick on my review and offered a 50.00 credit  for this which I thought was very nice.  I think I will probably exchange it for the bigger one. One plus is that it is very quiet and would be very  good for the occasional dehydrating. During garden season, I use mine every day.",
    "post_time": "Reviewed in the United States on February 23, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I can’t say how much I live this product it’s amazing worth the money 1000%",
    "post_time": "Reviewed in the United States on November 27, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "We are enjoying the dehydrator.",
    "rating": "5.0 out of 5 stars",
    "content": "I love munchies and I decided to be healthier food and planned to buy this product I use it daily now and for most of my food I love the beef jerky and I don’t have to reset the machine again only 5-6 hours are enough",
    "post_time": "Reviewed in the United States on February 17, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "And I used it inside the room and no smoke nothing came out even has no sound just only the air flow inside",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "This wasn't what I expected.",
    "rating": "5.0 out of 5 stars",
    "content": "I love it thanks",
    "post_time": "Reviewed in the United States on December 1, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I wanted a smaller one because I wasn’t going to make large batches of anything. It doesn’t take up much space on the counter and it’s small enough I can put it up when I’m not using it. It’s dehydrated everything I put in there and it feels pretty solid. I’m happy with it.",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Nice!",
    "rating": "5.0 out of 5 stars",
    "content": "I like this dehydrator. I did have to make my own silicone mats, since these do not come with them, and if you try to dehydrate liquids they will drip through the mats. Otherwise, I really like it.",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This little dehydrator is a plus for a not too big kitchen. I’ve always had a huge commercial dehydrator but it was plastic like shelves which would warp and too big to wash in the kitchen sink.",
    "post_time": "Reviewed in the United States on July 20, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Septree My Baby Dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "This Septree Dehydrator is a perfect counter companion with my other electrical appliances, because of its size.",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m so happy with Septree Dehydrator also because of the stainless steel trays it’s easy to clean…just soak for a little while and like magic it’s ready to do more dehydrating.",
    "post_time": "Reviewed in the United States on July 24, 2022",
    "pid": "B0CLXXSY21"
},
{
    "title": "Great little food dryer.",
    "rating": "5.0 out of 5 stars",
    "content": "This is one appliance that is here to stay on my counter.",
    "post_time": "Reviewed in the United States on October 16, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It’s summer time… all the fruits to dehydrate.",
    "post_time": "Reviewed in the United States on June 1, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Very Small and Convenient Dehydrator!",
    "rating": "5.0 out of 5 stars",
    "content": "Bake dog cookies then dehydrate them for your furry babies to enjoy.",
    "post_time": "Reviewed in the United States on April 26, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Sending tons of stars to Septree company.",
    "post_time": "Reviewed in the United States on November 2, 2022",
    "pid": "B0CLXXSY21"
},
{
    "title": "Appears well built.",
    "rating": "5.0 out of 5 stars",
    "content": "Aloha,",
    "post_time": "Reviewed in the United States on March 25, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Donna Yogi",
    "post_time": "Reviewed in the United States on November 28, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Cute",
    "rating": "5.0 out of 5 stars",
    "content": "I originally bought the slightly larger model with 6 racks.  A friend & I split the cost.  We were new at dehydrating, so we didn’t want to spend a lot of money.  We both loved it, especially for the price.",
    "post_time": "Reviewed in the United States on January 5, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this one, because of the smaller size of 4 racks.  And I like it just as much.  It fits in my cabinet.",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Works great",
    "rating": "5.0 out of 5 stars",
    "content": "My disappointment was that it is not made in USA.  I pulled up that category when searching on Amazon.",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I do not appreciate that Amazon mixes up stuff in the search.  When I look up made in the USA, I expect that only those items to show up.",
    "post_time": "Reviewed in the United States on September 11, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Works great",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this with a holiday gift card love that it's compact, digital & has a metal interior. It even comes with a little recipe booklet. Happy with my purchase.",
    "post_time": "Reviewed in the United States on August 8, 2022",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My husband wanted to do jerky and this dehydrator worked great dried evenly and in a timely fashion",
    "post_time": "Reviewed in the United States on September 5, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Must have for parents",
    "rating": "5.0 out of 5 stars",
    "content": "This has been a lifesaver for a busy parent like me! I use it mainly for drying snacks and ingredients, and it's a real champ. The instructions make it a breeze to preserve a variety of foods, but I love the flexibility to tweak drying times to suit my family's tastes. It's compact, which means it can hang out on my counter and then magically disappear into my kitchen cabinet. While it would've been awesome if it came with more containers (because we always need more!), I easily found extras online. Recommend!!",
    "post_time": "Reviewed in the United States on December 7, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have a wonderful, very expensive, BIG dehydrator that I love. But it is cumbersome and has to be stored when not in use for large amounts of food. This little Septree dehydrator is small enough that I can keep it out all of the time. It works a charm! I use it mainly for dehydrating small amounts of herbs and vegetables. It works quietly and efficiently. I am very pleased that I can adjust the temperature low enough to preserve the color in my herbs. It even came with two silicon screens. Very handy. I am very pleased with this purchase. PROS: four stainless steel shelves with adequate space between their placement, easy to clean stainless steel interior, very quiet, adjustable temperature and timer, actually works efficiently! I can say that I recommend this little dehydrator.",
    "post_time": "Reviewed in the United States on October 12, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "This is a great little dehydrator!",
    "rating": "5.0 out of 5 stars",
    "content": "This item works great. It was my first dehydrator ever so I wasn't sure what to expect.  It's smaller than I thought. I can do small amounts at a time.",
    "post_time": "Reviewed in the United States on August 31, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a nice unit for the money. The size isn't to large it doesn't make a lot of noise. I used to dry stuff for my birds. I have run it days on end drying all kinds of fruits and veggies and as of, yet I have not had any problems.",
    "post_time": "Reviewed in the United States on October 27, 2023",
    "pid": "B0CLXXSY21"
},
]