[
{
    "name": "        2024 Upgraded RIC Hearing Aids for Seniors Rechargeable Receiver-in-Canal OTC Hearing Aid with Noise Cancelling-Nearly Invisible Digital Hearing Aid Adapts to Mild to Severe Hearing Loss       ",
    "stars": [
        "82%",
        "18%",
        "0%",
        "0%",
        "0%"
    ],
    "pid": "B0CL3YDXW3",
    "ratings": "55 ratings",
    "other_info": {
        "Brand": "Aimsumy",
        "Color": "Beige",
        "Battery Weight": "0.2 Grams",
        "Fit Type": "In-Ear",
        "Number of Batteries": "1 Lithium Ion batteries required. (included)"
    },
    "discount_price": "$ 199.",
    "normal_price": "$1,195.00",
    "about_this_item": [
        " ✅【Sleek and Comfortable】Weighing only 0.01 lb, our hearing aids reduce the burden of long-term wear. With an ergonomic design to fit the ear canal, they come with six pairs of ear tips for different sizes. Our RIC hearing aids are discreet and stylish, barely noticeable from the front, and small enough not to interfere with wearing glasses.  ",
        " ✅【Efficient Charging, Extended Usage】Fully charged within 2 hours, our hearing aids offer over 30 hours of usage. The charging case provides an additional 180 hours of backup power, allowing approximately 6 extra charges for two hearing aids. With overcharge protection circuitry, you can charge worry-free.  ",
        " ✅【Enhanced Design】Our improved hearing aids feature a separate microphone and receiver, effectively reducing feedback and whistling. Placing the receiver deep in the ear canal enhances speech clarity and eliminates tunnel-like sensations. Metal conduits ensure durability and provide faster, stable sound transmission, combining ITE's stylish concealment with BTE's power advantage.  ",
        " ✅【Adaptive Technology】Featuring built-in DSP chip, our hearing aids analyze the user's environment in real-time. They seamlessly transition between different modes, adjusting automatically to various scenarios such as TV, conversations, gatherings, flights, or outdoor settings. No manual adjustment needed, perfect for those sensitive to noise.  ",
        " ✅【7x24 Hours Customer Service】: Enjoy a hassle-free experience with our hearing aides. A 90-day trial policy to lower your cost of ownership. Our customer care specialists work around the clock to help you with setup, maintenance, and troubleshooting. Invest in your hearing health with our superior quality hearing aid and try it out risk-free today!  "
    ]
},
]