[
{
    "name": "        Food Dehydrator 10 Trays, 800 Watt Stainless Steel Fresh Drying Machine Dehydrated Dryer with Adjustable 190°F Temperature Control/ 24H Timer, for Jerky Herbs Meat Fruit Yogurt       ",
    "stars": [
        "70%",
        "15%",
        "6%",
        "3%",
        "6%"
    ],
    "pid": "B0CLXXSY21",
    "ratings": "1,216 ratings",
    "other_info": {
        "Brand": "Septree",
        "Material": "Stainless Steel",
        "Color": "10 Trays Dehydrator",
        "Wattage": "800 watts",
        "Product Dimensions": "17.4\"D x 13.9\"W x 17.17\"H"
    },
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": [
        " 【Large Capacity 10 Trays】Made with 304 food-grade stainless steel. Safe & Durable. Large feet of drying space, with 10-trays, each tray is 12.5*12.5 inch, allow you to dehydrate different types of food simultaneously. All the trays are dishwasher-safe, there’s no need to worry about potential trouble of using plastic drying trays or become brittle or warped if overheated during washing  ",
        " 【Digital Touch Setting】This fruit dehydrator build-in precise LED digital control panel, digital temperatures preset settings range from 70º F to 190º F (20-90℃), with a countdown timer up to 24 hours, provides accurate drying times and temperatures to make it super easy for you to start creating delicious dried fruit, jerky, herbs, meat or yogurt! The internal light works to light up the drying area  ",
        " 【Easy to use Digital Display】The touch menu on front of the unit is easy to use and remembers previous settings, it keeps the last time and heat for turn on, so it is a one-touch to start another batch. Don’t have to reset the machine again  ",
        " 【Quiet & Safe Operation】With noise levels 45dB to 50 dB, our dehydrator for food and jerky won’t add unwanted noise to your kitchen, or disturb you if you’re dehydrating food overnight. Equipped with automatic shutoff and overheat protection. Bonus silicone gloves are supplied to open the food dehydrator to prevent burns  ",
        " 【Satisfaction Service】Comes with abundant accessories:10 stainless steel drying trays, 10 non-stick silicone sheets, 2 Fruit Roll Sheet, 1 drip tray, a pair of silicone gloves, 2 storage containers, 1 user manual and 1 recipe book. If there any problem within 3 year, send message to our customer service freely , we will offer you a best solution  "
    ]
},
{
    "title": "Nice efficient dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "This small unit has a higher heat range than many competitive products. It may look small but it can dehydrate 2 lbs of blueberries in one batch. That is all I need. It is a workhorse for its size. I bought a competitive larger product from a different vendor and returned it for this one. That was a great decision.  This unit  is able to do the same amount of blueberries more efficiently than the the larger competitive unit. The fan in this unit is twice as efficient as the other unit. It because of its size is less expensive to run (less space to disperse the heat). The controls are much easier to use and more intuitive. This vendor offers a larger 6 shelf unit but the view oval window is smaller than the square viewglass on this unit. And the other units controls are not as nice and easy to use as this one. i recommend purchasing this unit.",
    "post_time": "Reviewed in the United States on November 4, 2022",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I Love this little machine. the only thing the top of unit has a couple deep scratches. I was going to send it back. But I decided to see if it worked . It does work well. I made beef jerky 190 degrees for about 2 hours. Very thin lean beef. . Tasted awesome. I wish  it had more detail recipes. I guess with this one. Turn out delicious 😋I decided to keep it with the scratches. Also I thought the two containers were supposed to be glass . They were cheap looking plastic. Not even sure if it's bpa free. Probably not because it would have said.",
    "post_time": "Reviewed in the United States on November 10, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Small dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this to dry royalnicing cookies between colors and it works perfectly!",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We like the dehydrator to make ground beef jerky and it's compact design",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Fantastic!",
    "rating": "4.0 out of 5 stars",
    "content": "Was smaller than what I thought it would be. I had an Excalibur and it just wore out. This one doesn't dry as well as the excaliber. Because of the fan.  I think a fan in back would be better. I dehydrate a lot for my pantry and after using for awhile it is ok. The companY got back with me pretty quick on my review and offered a 50.00 credit  for this which I thought was very nice.  I think I will probably exchange it for the bigger one. One plus is that it is very quiet and would be very  good for the occasional dehydrating. During garden season, I use mine every day.",
    "post_time": "Reviewed in the United States on February 23, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like this dehydrator. I did have to make my own silicone mats, since these do not come with them, and if you try to dehydrate liquids they will drip through the mats. Otherwise, I really like it.",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "We are enjoying the dehydrator.",
    "rating": "5.0 out of 5 stars",
    "content": "I can’t say how much I live this product it’s amazing worth the money 1000%",
    "post_time": "Reviewed in the United States on November 27, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love munchies and I decided to be healthier food and planned to buy this product I use it daily now and for most of my food I love the beef jerky and I don’t have to reset the machine again only 5-6 hours are enough",
    "post_time": "Reviewed in the United States on February 17, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "This wasn't what I expected.",
    "rating": "5.0 out of 5 stars",
    "content": "And I used it inside the room and no smoke nothing came out even has no sound just only the air flow inside",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love it thanks",
    "post_time": "Reviewed in the United States on December 1, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Does what it should",
    "rating": "4.0 out of 5 stars",
    "content": "Works well",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This little dehydrator is a plus for a not too big kitchen. I’ve always had a huge commercial dehydrator but it was plastic like shelves which would warp and too big to wash in the kitchen sink.",
    "post_time": "Reviewed in the United States on July 20, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Septree My Baby Dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "This Septree Dehydrator is a perfect counter companion with my other electrical appliances, because of its size.",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m so happy with Septree Dehydrator also because of the stainless steel trays it’s easy to clean…just soak for a little while and like magic it’s ready to do more dehydrating.",
    "post_time": "Reviewed in the United States on July 24, 2022",
    "pid": "B0CLXXSY21"
},
{
    "title": "Great little food dryer.",
    "rating": "5.0 out of 5 stars",
    "content": "This is one appliance that is here to stay on my counter.",
    "post_time": "Reviewed in the United States on October 16, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It’s summer time… all the fruits to dehydrate.",
    "post_time": "Reviewed in the United States on June 1, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Very Small and Convenient Dehydrator!",
    "rating": "5.0 out of 5 stars",
    "content": "Bake dog cookies then dehydrate them for your furry babies to enjoy.",
    "post_time": "Reviewed in the United States on April 26, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Sending tons of stars to Septree company.",
    "post_time": "Reviewed in the United States on November 2, 2022",
    "pid": "B0CLXXSY21"
},
{
    "title": "Appears well built.",
    "rating": "5.0 out of 5 stars",
    "content": "Aloha,",
    "post_time": "Reviewed in the United States on March 25, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Donna Yogi",
    "post_time": "Reviewed in the United States on November 28, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Best I've ever owned",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this to make dog treats out of sweet potatoes and have ended up dehydrating all kinds of fruits.  The dehydrator itself is compact and can be stored away easily.  This is awesome for those of us that have small counter space.  I love this dehydrator it's super easy to use and the bananas I did turned out delicious.  Oh and the dogs absolutely love the sweet potatoes.",
    "post_time": "Reviewed in the United States on October 27, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I originally bought the slightly larger model with 6 racks.  A friend & I split the cost.  We were new at dehydrating, so we didn’t want to spend a lot of money.  We both loved it, especially for the price.",
    "post_time": "Reviewed in the United States on January 5, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Cute",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this one, because of the smaller size of 4 racks.  And I like it just as much.  It fits in my cabinet.",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My disappointment was that it is not made in USA.  I pulled up that category when searching on Amazon.",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "B0CLXXSY21"
},
{
    "title": "Works great",
    "rating": "5.0 out of 5 stars",
    "content": "I do not appreciate that Amazon mixes up stuff in the search.  When I look up made in the USA, I expect that only those items to show up.",
    "post_time": "Reviewed in the United States on September 11, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this with a holiday gift card love that it's compact, digital & has a metal interior. It even comes with a little recipe booklet. Happy with my purchase.",
    "post_time": "Reviewed in the United States on August 8, 2022",
    "pid": "B0CLXXSY21"
},
{
    "title": "Works great",
    "rating": "4.0 out of 5 stars",
    "content": "My husband wanted to do jerky and this dehydrator worked great dried evenly and in a timely fashion",
    "post_time": "Reviewed in the United States on September 5, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This has been a lifesaver for a busy parent like me! I use it mainly for drying snacks and ingredients, and it's a real champ. The instructions make it a breeze to preserve a variety of foods, but I love the flexibility to tweak drying times to suit my family's tastes. It's compact, which means it can hang out on my counter and then magically disappear into my kitchen cabinet. While it would've been awesome if it came with more containers (because we always need more!), I easily found extras online. Recommend!!",
    "post_time": "Reviewed in the United States on December 7, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Must have for parents",
    "rating": "5.0 out of 5 stars",
    "content": "I have a wonderful, very expensive, BIG dehydrator that I love. But it is cumbersome and has to be stored when not in use for large amounts of food. This little Septree dehydrator is small enough that I can keep it out all of the time. It works a charm! I use it mainly for dehydrating small amounts of herbs and vegetables. It works quietly and efficiently. I am very pleased that I can adjust the temperature low enough to preserve the color in my herbs. It even came with two silicon screens. Very handy. I am very pleased with this purchase. PROS: four stainless steel shelves with adequate space between their placement, easy to clean stainless steel interior, very quiet, adjustable temperature and timer, actually works efficiently! I can say that I recommend this little dehydrator.",
    "post_time": "Reviewed in the United States on October 12, 2023",
    "pid": "B0CLXXSY21"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This item works great. It was my first dehydrator ever so I wasn't sure what to expect.  It's smaller than I thought. I can do small amounts at a time.",
    "post_time": "Reviewed in the United States on August 31, 2023",
    "pid": "B0CLXXSY21"
},
]