[
{
    "name": "        Commercial Large 12 Trays Food Dehydrator, Usable Area up to 22.67ft², 1200W Full Stainless Steel Dryer Machine, up to 190℉ Temperature, for Meat, Fruit, Beef, Herbs, and Pet Food       ",
    "stars": [
        "80%",
        "6%",
        "3%",
        "0%",
        "11%"
    ],
    "pid": "B0CNPVHKX9",
    "ratings": "69 ratings",
    "other_info": {
        "Brand": "Ausegia",
        "Material": "Stainless Steel, Glass",
        "Color": "Silver",
        "Wattage": "1200 watts",
        "Voltage": "120 Volts"
    },
    "discount_price": "$ 220.99",
    "normal_price": "$259.99",
    "about_this_item": [
        " [Commercial Design Large Capacity]:Commercial design is especially suitable for businesses or households with a large amount of food to be made.Includes large size 12 drying trays,each tray is 15.75* 15.75 inches. 1 drip tray, 6 silicone pads, 1 non-stick sheet, 1 hanger, 12 hooks, and a pair of silicone gloves for creating various recipes.Dehydrator Machine can dehydrate a variety of vegetables, fruits, meats, flowers and other foods, and easily lock the minerals and vitamins in the food.  ",
        " [Digital Control & 24H Timer]:Use the digital control panel to adjust the time from 30 minutes to 24 hours, with precise control in 30-minute increments. And the temperature can be precisely adjusted from 70℉ to 190℉.  ",
        " [Safe to Use]:One minute before the timer is up, the automatic shutdown function will start immediately, and the cold air will be automatically blown to cool the machine. If the inside of the dehydrator is overheated, the overheat protection function will be activated. Note: the voltage is 120V 60Hz and the power is 1200W, only applicable to USA and Canada.  ",
        " [Food Grade Stainless Steel]:Our jerky dehydrator is made of food-grade stainless steel and glass front door. Our meat dehydrator for jerky upgrade double row vents, greatly accelerate the water vapor discharge, food dehydrator efficiency improved greatly. Equipped with a rear-mounted drying fan and air flow circulation technology to promote even drying, monitor the dryer process easily with the transparent door window.  ",
        " [Noiseless＜50dB]:Wait for food to dehydrate after setting time and temperature. The integrated horizontal airflow system drying evenly heats all the trays to ensure more even drying and noiseless operation.  ",
        " [Easy to Clean]: Made with 304 food-grade stainless steel, the trays are safer, more durable, and dishwasher-safe. The removable trays and drip tray make cleaning a breeze, saving you time and effort.  ",
        " [Satisfaction Service]: We offer a long warranty period for 1 years (from the date of purchase), if you encounter any problems, please feel free to contact our customer service.  "
    ]
},
]