[
{
    "name": "        Commercial Large 12 Trays Food Dehydrator, Usable Area up to 22.67ft², 1200W Full Stainless Steel Dryer Machine, up to 190℉ Temperature, for Meat, Fruit, Beef, Herbs, and Pet Food       ",
    "stars": [
        "80%",
        "6%",
        "3%",
        "0%",
        "11%"
    ],
    "pid": "B0CNPVHKX9",
    "ratings": "69 ratings",
    "other_info": {
        "Brand": "Ausegia",
        "Material": "Stainless Steel, Glass",
        "Color": "Silver",
        "Wattage": "1200 watts",
        "Voltage": "120 Volts"
    },
    "discount_price": "$ 220.99",
    "normal_price": "$259.99",
    "about_this_item": [
        " [Commercial Design Large Capacity]:Commercial design is especially suitable for businesses or households with a large amount of food to be made.Includes large size 12 drying trays,each tray is 15.75* 15.75 inches. 1 drip tray, 6 silicone pads, 1 non-stick sheet, 1 hanger, 12 hooks, and a pair of silicone gloves for creating various recipes.Dehydrator Machine can dehydrate a variety of vegetables, fruits, meats, flowers and other foods, and easily lock the minerals and vitamins in the food.  ",
        " [Digital Control & 24H Timer]:Use the digital control panel to adjust the time from 30 minutes to 24 hours, with precise control in 30-minute increments. And the temperature can be precisely adjusted from 70℉ to 190℉.  ",
        " [Safe to Use]:One minute before the timer is up, the automatic shutdown function will start immediately, and the cold air will be automatically blown to cool the machine. If the inside of the dehydrator is overheated, the overheat protection function will be activated. Note: the voltage is 120V 60Hz and the power is 1200W, only applicable to USA and Canada.  ",
        " [Food Grade Stainless Steel]:Our jerky dehydrator is made of food-grade stainless steel and glass front door. Our meat dehydrator for jerky upgrade double row vents, greatly accelerate the water vapor discharge, food dehydrator efficiency improved greatly. Equipped with a rear-mounted drying fan and air flow circulation technology to promote even drying, monitor the dryer process easily with the transparent door window.  ",
        " [Noiseless＜50dB]:Wait for food to dehydrate after setting time and temperature. The integrated horizontal airflow system drying evenly heats all the trays to ensure more even drying and noiseless operation.  ",
        " [Easy to Clean]: Made with 304 food-grade stainless steel, the trays are safer, more durable, and dishwasher-safe. The removable trays and drip tray make cleaning a breeze, saving you time and effort.  ",
        " [Satisfaction Service]: We offer a long warranty period for 1 years (from the date of purchase), if you encounter any problems, please feel free to contact our customer service.  "
    ]
},
{
    "title": "Game Changer - why did I wait so long",
    "rating": "5.0 out of 5 stars",
    "content": "If you're looking for a reliable and efficient way to dehydrate food, this dehydrator is a fantastic choice. As someone who loves cooking and preserving food, I can confidently say this machine is a game-changer.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What I Love!!!",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Quiet and Capable Dehydrator for Home Use",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator is super user-friendly. You don't need to be a tech expert to operate it. Just load the trays, set the temperature and timer, and you're good to go. The controls are intuitive and straightforward.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "With 12 trays and all the accessories you could want, you can dehydrate a large quantity of food at once. This is perfect for big batches of fruits, vegetables, jerky, and even herbs. I recently started making mushroom jerky so having so many trays is SUPER helpful.  No more waiting for small batches to finish; you can get it all done in one go.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "The best dehydrator I've ever had !",
    "rating": "1.0 out of 5 stars",
    "content": "This dehydrator ensures even drying thanks to its powerful fan and heating system. You don't have to worry about rotating trays or unevenly dried food. Everything comes out perfectly dehydrated every time.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Unlike some other dehydrator's that I have owned, this dehydrator operates quietly. You can leave it running overnight or while you're busy with other things, and it won't disturb you.",
    "post_time": "Reviewed in the United States on May 31, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Amazing!",
    "rating": "5.0 out of 5 stars",
    "content": "It's built to last with durable materials. It feels solid and well-constructed, so you can count on it for heavy use without worrying about wear and tear.  The door is easy to open and opens wide making it easy to load and unload the trays.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The trays, accessories and interior are easy to clean. The trays are dishwasher safe, which is a huge plus. After a long dehydrating session, the last thing you want is a complicated cleanup process.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Damaged package",
    "rating": "5.0 out of 5 stars",
    "content": "It also comes with a 1-year warranty which is amazing!  There is nothing worse than making a big purchase only for the appliance to die on you after a few months.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator is an excellent appliance for anyone serious about food preservation. Its ease of use, large capacity, and consistent performance make it a standout choice. While it's a big and a little more expensive than some of the smaller dehydrator's out there, the benefits far outweigh these minor drawbacks. If you want high-quality, homemade dehydrated snacks and ingredients, this dehydrator won't disappoint.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Great Product",
    "rating": "5.0 out of 5 stars",
    "content": "Great product and easy to use",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really like this looks great so quiet",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "so quiet looks great",
    "rating": "5.0 out of 5 stars",
    "content": "I have already dehydrated 5 dehydrators of plums. This unit is spacious and works great. I waited until my old unit finally quit and parts were very difficult to find. My old unit was over 40 years old but if l had realized how much better this unit was, l would have bought it years ago",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We have dehydrated peppers, onions, tomatoes and blueberries so far in it. You get get so much on these shelves! Very efficient. So glad we purchased this! It is very easy to operate also.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Great unit",
    "rating": "4.0 out of 5 stars",
    "content": "We just made our first batch of beef sticks.  The dehydrator worked great and did a good job of maintaining temperature +/- 1 degree.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had an old dehydrator from The Galloping Gourmet (Yes, it still works) and it was time to get something that handled more product (volume/types) and had better temperature control.  I did my research and this is the one I chose.  I could not have been more than please with the decision.  It is big (love the square trays), comes with silicon mats, hooks and a rack to hold the hooks (thinking Biltong), holds its heat and is very quiet.  Big emphasis on how quiet it is because I was expecting this to make a lot more noise based on the size of the unit.  The one drawback is that the timer can only be set for 24 hours, and I have had to extend that a couple of times while using it.  Not a problem unless you forget - I still gave it a five-star rating but dinged the temperature control.",
    "post_time": "Reviewed in the United States on April 10, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Works awesome!",
    "rating": "5.0 out of 5 stars",
    "content": "It seems to heat evenly and I sliced up 8 bananas and a thing of strawberries which only took up 3 trays. If you are looking for a large capacity dehydrator this is for you. Haven't gotten to do jerky or anything else that might fill it up to give a more indepth review.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a large size dehydrator, it is literally a commercial size dehydrator. This dehydrator is easy to setup and install. The operation of this dehydrator is pretty straight forward. The Dehydrator is made of solid materials, mainly stainless steel. This dehydrator is built to last. Dehydrating is easy to clean, I didn’t have any issues with cleaning it with soap water. Dehydrator has a robust dryer, it dehydrators food faster than your typical kitchen dehydrator. Try a small batch before committing to large portion. I used it to make beef jerky, and it come good. I will be trying fruits, and possibly be updating this review.",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Great for meat sticks and jerky",
    "rating": "5.0 out of 5 stars",
    "content": "works great does alot will for sure buy again",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "ease of use",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Best dehydrator I ever had!",
    "rating": "5.0 out of 5 stars",
    "content": "This machine is amazing! I love being able to set exact temps and time and find all my plants evenly dried. I've been harvesting herbs like crazy since getting it and have been running it nearly daily and am so impressed with the results that I gave all 3 of my older dehydrators away! I also hope I can afford to buy one of these as a gift for my sister. She really would love it too!",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This food dehydrator is the one for anyone serious about food preservation! It has 12 trays which is lots of space for drying a large quantity of food at once. It's powerful enough for meats, fruits, herbs, and even pet food. It's also super easy to clean. I’ve been able to make large batches of beef jerky, dried fruits, and herbs sooo fast and easily. This dehydrator is perfect for both home use and at my job in a high end restaurant. I make pretty dehydrated fruits for specialty drinks! Love it!",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Huge dehydrator.",
    "rating": "5.0 out of 5 stars",
    "content": "You would not go wrong with this. Works great",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Cheaply made",
    "post_time": "Reviewed in the United States on May 12, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "As advertised",
    "rating": "5.0 out of 5 stars",
    "content": "This machine came packaged very well to ensure no damages at all. The setup was so easy, just open the box plug in the machine, fill however many trays you want to use, then start and leave it be.",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Couldn't ask for a better dehydrator.  There is so much room in this one and so many different types of trays, you can't go wrong.  I can't wait to try out more and more things in here, Fruit Roll-Ups are next on the list!",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Works fine",
    "rating": "5.0 out of 5 stars",
    "content": "I have a company and I’ve used several different dehydrators from Excalibur to Cabela . This is the best value for your money and efficiency. It comes with silicon mats, gloves, scissors. I love the functionality. Also, customer service is great, I had questions and they responded quickly. 10/10",
    "post_time": "Reviewed in the United States on March 14, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good quality works for me A+ Love the metal racks and with the fan blowing from the back, you get an even air flow.Highly recommend getting this unit.I love this dehydrator. Very easy to use and the recipe book has great ideas and I have already been making lots of delicious foods and snacks.So far I have dehydrated citrus slices and produce from the garden, also bagged coleslaw and frozen veggies (easy, no prep involved). I then keep the dried ingredients, as is or pulverized to a powder, within reach to incorporate into my cooking or drinks.",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Easy set up!",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely love my Dehydrator. I use it all the time Works great.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "The controls are located on the top, which makes it hard to see if you don’t have it on a low table stand ,no big deal.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Is to difficult to see the screen on the top.",
    "rating": "1.0 out of 5 stars",
    "content": "This dehydrator is way too big.  It’s seats to high on counter.  Not able to see the digital screen with the settings on top.  I’m 5,3 and need a step to see the screen.  I will be returning it.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Anyone else have a problem with the trays falling off the track? Seems like the trays are sitting on the smallest edge, sometimes an 8th of an inch is all that is hold the trays in place. These metal trays needed to be 15 and 1/8 inch instead of 15 inches.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Trays are a bit too small.",
    "rating": "5.0 out of 5 stars",
    "content": "I chose this because it is stainless steel.Love it. All stainless steel construction.  There are handles on the top.I made several jars of banana chips, no banana's you wish to dehydrate, and I bumped the heat up 5 points and about 6-8 hrs longer on top of what the recipe says. My goal was 1\\18\" per slice and I didn't want to see another banana for awhile, so I get my banana slicer in 3 days, I'm so excited. Oh and my banana taste crisp, so it WAS worth it especially as they have a 2-3 years shelf life. Yum.My first time trying this was dehydrating pink pineapple and making fruit leathers with strawberries, raspberries, blackberries, rambutan, and dragon fruit. I mixed some sugar and let them marinate overnight. In the morning I added some applesauce. Then I blitzed them in my high powered blender for a few minutes. I started on 135° for 6 hours. It needed a few more. So I checked it in 3 more hours and it was perfect. When I do it again I’ll add a bit more sugar.",
    "post_time": "Reviewed in the United States on October 25, 2023",
    "pid": "B0CNPVHKX9"
},
{
    "title": "stainless steel dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "These trays are a nice size and hold a lot of whatever i want to dry.heat retains all the flavor and healthy components of the plan.I did beef jerky, apples,bananas, pears. Good snack. Work great, easy to clean.Friends and family love my dehydrated fruit chips. I do love that I can dehydrate all kinds of fruits. I’m looking forward to dehydrating other things.So easy to use. Clean up was really easy. The wire racks are designed so the jerky doesn’t stick and makes removal and clean up a breeze. I love this dehydrator so much I fine myself dehydrating everything I can. I wish I had gotten one of these years ago. I've been using it to preserve fresh produce which includes, tomatoes, summer squash, strawberries, apples, celery, watermelon, and even oranges. Soon I'll be making fruit leathers and drying some cantaloupe.",
    "post_time": "Reviewed in the United States on October 24, 2023",
    "pid": "B0CNPVHKX9"
},
{
    "title": "These trays are a nice",
    "rating": "5.0 out of 5 stars",
    "content": "Love the metal racks and with the fan blowing from the back, you get an even air flow.Highly recommend getting this unit.I love this dehydrator. Very easy to use and the recipe book has great ideas and I have already been making lots of delicious foods and snacks.So far I have dehydrated citrus slices and produce from the garden, also bagged coleslaw and frozen veggies (easy, no prep involved). I then keep the dried ingredients, as is or pulverized to a powder, within reach to incorporate into my cooking or drinks. This dehydrator has made nutritional foods easier to achieve in my own kitchen.",
    "post_time": "Reviewed in the United States on October 26, 2023",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Easy to use and works great",
    "rating": "5.0 out of 5 stars",
    "content": "Quiet.  Sturdy, and dehydrates uniformy, especially the very juciy fruits. I love that it has a timer.  I can set it to turn off during the night so my fruit doesn't over dry.  Love the stainless steel racks and body.Easy clean and can cook 2 to 2 1/2 rump roasts evenly.  The finer mesh screens are needed when drying smaller cut items; peppers, etc.The metal trays are easy to wash. The temperature and timer are easy to use to get the end result you anticipate. I have dried fruit, made leather and made jerky. Everything has turned out well.",
    "post_time": "Reviewed in the United States on October 18, 2023",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Works great",
    "rating": "5.0 out of 5 stars",
    "content": "It is great for making dried fruits for snacking on this dehydrator espeasially for health improvement and body toning. we eat a lot of fruit in our house and dehydrating is a great way to take it with us on hikes or dry canning when it goes on sale and we buy a bunch.I love the crunch of it and it’s a perfect snack for a road trip.Easy to use, dehydrates evenly, cleans and stores neatly, and was a good value.It’s fun and healthy to make my own dried fruits.",
    "post_time": "Reviewed in the United States on October 16, 2023",
    "pid": "B0CNPVHKX9"
},
{
    "title": "It is great way for health improvement",
    "rating": "5.0 out of 5 stars",
    "content": "Keep Food Fresh Longer ; dehydrate food removes water that allows food to go bad quickly. As a result, fruits, vegetables and meat last longer after dehydration.We've kept dried veggies like that for years and they stay fresh in the jars.I am really impressed with this unit, I am making dehydrated chicken breast strips and its taste good. Tried apples sprinkled with cinnamon and sugar and the whole house smelled wonderful all day.",
    "post_time": "Reviewed in the United States on October 25, 2023",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Keep Food Fresh Longer",
    "rating": "5.0 out of 5 stars",
    "content": "I love the adjustable temperature and that I can set the amount of time for the dehydrator to run. I'm not certain yet just how long to dry some items, but I'm very happy with this unit. It looks very nice on the counter. This one is more efficient due to the fan placement. It also has a timer, and a better shelf arrangement. The best feature is that it is really quiet. I can be in the next room and forget it's on. Great buy.",
    "post_time": "Reviewed in the United States on October 16, 2023",
    "pid": "B0CNPVHKX9"
},
{
    "title": "worth each penny.",
    "rating": "5.0 out of 5 stars",
    "content": "First off, this dehydrator is silent. I prepped a small batch of fruit first to see how long I should leave them in the dryer. I did 8 hours with just one shelf of apple slices. I love the design of the machine, and it comes with SO MANY shelves. After 8 hours, they are delicious, but I would prefer them a little more crispy. I will do another batch and leave for closer to 11 hours. The large fan in the back along with the space between the shelves positions the consistent air flow to enter the entire space. I plugged it in, wiped out the inside and the shelves, let it preheat for 10 minutes like it says, and we started. Machine is very easy to use and looks very professional. I’m happy with this purchase and looking forward to drying my peppers and herbs.",
    "post_time": "Reviewed in the United States on May 31, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Great quality and easy to use!",
    "rating": "5.0 out of 5 stars",
    "content": "I am very much impressed with this dehydrator. It looks commercial but can be used in any household as the size is small and portable. It is very spacious and comes with 12 trays you can use to dehydrate good amount of meat or fruits. The trays are very easy to clean and dishwasher safe. Comes with a cook book guide that will help you to dehydrate a lot of receipe. I made some fruit jerky for myself and chicken jerky for my dog. Both turned out to be absolutely delicious. Good quality product foe the price! A must have in any household!",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator is large and came without damage.  It has sturdy controls and is easy to use .",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Large and good quality!  I just made the best natural mango fruit roll up",
    "rating": "5.0 out of 5 stars",
    "content": "UPDATE:  I finally got a chance to use this dehydrator and it is AMAZING!!!  I made a mango puree using frozen mango chunks and a tiny amount of sugar.  I didn't add any water because the mango chunks had enough water.  Once the mango was cooked through and soft, I squished it with a bean squisher (no blending needed), then smoothed the puree thinly on parchment paper and placed into the dehydrator.  using the manual for guidance, I set the temp for 140 deg F for 5 hours.  I left home and when I returned the next day, the dehydrator was turned off and the mango puree was dried into a PREFECT natural fruit roll up!  No preservatives or other nasty additives.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I can't wait to try out other foods.  In particular dehydrated food for camping.  Why pay exorbitant prices and expose yourself to excessive sodium?  YUCK!!!  I plan on making my own dehydrated camping food from now on",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Really nice dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "And Jerky.  Lots and lots of jerky!",
    "post_time": "Reviewed in the United States on October 22, 2023",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this dehydrator and highly recommend it!  I'm so glad I bought it.",
    "post_time": "Reviewed in the United States on October 31, 2023",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Perfect for large batches of jerky",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator is enormous on the inside but doesn't take up a lot of counter space. There are 12 shelves so you can dry a lot of food at once. There's a digital timer that sets in 30 minute increments. The temperature range is 70 to 190 so you can dry not only meats and veggies but delicate items such as herbs and flowers. Clean up is simple, remove the shelves and drip pan for washing and wipe out the inner cabinet. It comes with a lot of accessories like hooks and gloves, and recipes to get you started. I was surprised at how quiet it is, you don't hear anything. It has a safety feature that prevents overheating and a cool down function at the end of the drying cycle. It's heavy stainless steel and looks nice. I'm really glad I bought it.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This commercial food Dehydrator is so amazing! I got this dehydrator because I needed one with more room, this one is huge compared to the last one I had. The heat is very even across all layers which is nice, the recipes needed some adjustments because of this, my last one had very uneven heating. This machine is also very quiet, i could barely hear it from the other side of the room, which is a huge plus!! I was able to put a lot of meat into this thing, I don't remember how many lbs I used but it was a lot! The packaging it came in was also very nice and secure, they really made sure it wont come damaged.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Excellent quality",
    "rating": "5.0 out of 5 stars",
    "content": "Not only does my dog go crazy for all of his home made treats but the whole family enjoys this. You can make jerky, fruit leather even and it’s perfect. It’s a big one, does take up some space but great because it holds a lot at once.I set at 165 degrees for jerky for 6 hours, and I store it in the fridge since it has no preservatives.My dog love the jerky very much.It's quiet as well.Going on the gift list for my family for sure",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "Easy to clean",
    "rating": "5.0 out of 5 stars",
    "content": "I'm really happy with it. I've made jerky, fruit leather, and dried vegetables all with great results. The dehydrator is easy to use and clean, and it has a lot of space to dry food. The temperature controls are adjustable, so I can set it to the perfect temperature for whatever I'm drying. The rear-mounted fan helps circulate the air evenly, so my food dries evenly and quickly.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0CNPVHKX9"
},
{
    "title": "High quality commercial food dehydrator!!",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this for my husband, who is an avid outdoorsman and loves to dehydrate various meats and some fruits. The variable temperature is awesome and performance is outstanding! Latch is sturdy and strong to keep door sealed well while dehydrating. Love that the noise level is extremely low, and the racks are easy to clean in between dehydrations. Racks are also easily removable if you do not want to use all 12 at one time. This is a well made product and came packaged professionally for protection. Very happy and impressed with this dehydrator!!",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0CNPVHKX9"
},
]