[
{
    "name": " All the Colors of the Dark ",
    "stars": [
        "72%",
        "19%",
        "6%",
        "2%",
        "1%"
    ],
    "pid": "B0CPKXGL6Q",
    "ratings": "23,744 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "Amazing",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book so much.  It got a little long at points but the story is so good you don't mind.  Absolutely beautifully told. So sad at times you cry but then there is hope. Well done Mr. Whitaker.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Interesting read says it all I think. The characters hide their secrets well throughout. Facts are revealed in off handed remarks that you might miss until another reveal makes you stop and think and speculate. I really liked this book but the short chapters made me crazy but it was still worth it. Just read it!",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Interesting read",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book so much. An impossibly painful journey of a pirate and a beekeeper. Patch and Saint an incredible life and story. A must read.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Friend told me about how it was one of those books you can’t put down. Story line is a bit weird .",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "A must read book!",
    "rating": "4.0 out of 5 stars",
    "content": "Poor, recluse boy interrupts a kidnapping , saving the town’s pretty daughter. then he himself is kidnapped.  He escapes but things are different when he returns and haven’t quite figured out what is going on with him.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I think the overall story is very nice, but the delivery was very choppy. I was lost most of the time. It really didn't come together until the end. For me, that is too long to suffer reading a story. I'm not sure that the end justified the means.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Good read",
    "rating": "5.0 out of 5 stars",
    "content": "This book was so beautifully written, from beginning to end. I am sad it's over. In-depth characters and a hell of a twist!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Though hard to follow in the beginning, the reader soon gets sucked in and can’t stop reading. I finished in 2 short days.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Too long-winded and Choppy",
    "rating": "5.0 out of 5 stars",
    "content": "What a story - the characters were so real & the story heartbreaking!  So many twists & turns but a happy ending!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wow. This was an amazing story. So full of life as it is, whether we like or not. And a lot of quessing wrong about several of the events. The end was surprising and well put together.  I’d like to see if someone could make this into a movie.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "simply delicious",
    "rating": "5.0 out of 5 stars",
    "content": "Such a unique story of love, loss and realigning. I loved it all. Unpredictably and so entertaining from the very beginning.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved everything about this book. The characters are developed so deeply and the twists and turns of story are amazing. It is truly a saga in the most profound meaning of the word. A book that, once read, calls the reader to begin again to reread the story to fully understand the journeys portrayed.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Fabulous saga",
    "rating": "5.0 out of 5 stars",
    "content": "Hooked me at page 1. This is one of the most engrossing books I have read in years. With every page turn I slipped deeper and deeper into these memorable characters. Can’t wait to see it as a series.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If someone asked me what I thought of this book, my only answer would be WOW!!! When I reached the middle of the book, it became a little drawn out for me and I contemplated not finishing it. If this happens to you, don’t give up. I am anxious to read Mr. Whittaker’s other books but I need time to get over this one as it will be with me awhile!!!",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Spellbinder of immense scope",
    "rating": "4.0 out of 5 stars",
    "content": "Wow.  A beautiful read.  Patch, Saint, Sammy, Charlotte. You knew each character after reading this book. A great story with a few twists—it dragged a bit for me at one point, but I don’t think I would say delete or hurry up, the words were worth reading.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What a memorable experience to live in the world of the pirate and the beekeeper, and the people who touched their lives and whose lives they blessed.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "THIS BOOK!!!",
    "rating": "5.0 out of 5 stars",
    "content": "EXCELLENT! Grabbed me on the first few paragraphs, and never let go! Had to keep reading to see how this story of twists,and turns ended for the characters you love throughout.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One of the most beautiful books I have ever read! It is now one of my favorites!",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "4.5 for sure",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed this book tremendously! Sorrowful, nuanced, intricately crafted, angst, resilience, solemn, beautiful, thought-provoking! Not only well worth reading once, but rereading as well as reflecting upon it at length.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Such a great story .. exciting all the way to the end!  It keeps you on pins and needles.  Patch!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "A Heartbreakingly Timeless Masterpiece",
    "rating": "5.0 out of 5 stars",
    "content": "This story will forever hold a place in my imagination and its characters dear to my heart! This story brings you deep into the depths of characters you’ll end up feeling like you know personally. It starts out with a tragic unfolding of the monstrous side of humanity, brings you through a decades-long search for truth and justice, ultimately putting integral pieces of a much larger puzzle together for the reader in a way that leaves you breathless and tugging on your heartstrings.  The characters all develop over these decades as a result of what they cope with and hold onto, and the result is a timeless story that brings you to question - What truly makes a person? If you’re a reader who’s in it for the long haul for a story that unfolds in great details of life and the enormity of it… if stories like Stephen King’s The Green Mile and Delia Owen’s Where The Crawdads Sing open your heart and mind to essence of human imperfection simultaneously existing with the desire for redemption and justice…you MUST read this book!",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Elegant prose telling a story of love, loss, and incredible horror. A book with a story and characters I'll long remember.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Beautiful and hauntingly sad",
    "rating": "5.0 out of 5 stars",
    "content": "The imagery so real, the story original. Absolutely one of the best I've read. Will read again and for me that says a lot.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I just finished so am at a loss for words. This was a beautiful, conflicted, twisting journey. I think I may just read it again.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "5 stars. Truly beautiful",
    "rating": "5.0 out of 5 stars",
    "content": "All The Colors of The Dark hits every single note of fantastic writing and storytelling. This is one to reread.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The characters were wonderful.  By the end of the book,they were people you felt  you truly knew well and would miss.  Sometimes the coincidences seemed a bit far fetched but reading is for enjoyment so I suspended logic.  Love, love, loved it.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "wow. just such beautiful writing",
    "rating": "4.0 out of 5 stars",
    "content": "This is the first book by Chris Whitaker that I have read. The audiobook is narrated by Edoardo Ballerini and I would highly recommend! The story became a little convoluted for me at times with all the different girls but it needed to be that way, I understand. The author does a great job of tying it all together, though. I just had trouble remembering some of the girls and theirfull names, which becomes important, especially at the end. I would definitely recommend this book to friends who are mystery thriller fans.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Was a little of a slow burn to start, but once it picked up it didn't stop. Really enjoyed this book.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Everything you want a great story to be.",
    "rating": "5.0 out of 5 stars",
    "content": "I really liked the book. The short chapters were helpful; they allowed one to mull over plot twists, ponder characters, and try to guess what would happen next. Well worth the read.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I liked this book and the story line - but I felt like it was really drawn out. There were so many details and parts dragged on. I found myself just skimming over paragraphs in the middle to get through - but the ending was a nice twist.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "read read read",
    "rating": "5.0 out of 5 stars",
    "content": "A very good book!! The story is a journey like no other!! You will laugh & cry, so many twist & turns!!",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I never write formal reviews, but this book definitely lives up to the hype! It's so beautifully written and thrilling to say the least. So many twists that I read this 600+ page book in only 4 days, thinking it'd take at least 2 weeks when I started. The short chapters really did the trick because of course I kept saying \"Just one more chapter...\"",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "PHENOMENAL!",
    "rating": "5.0 out of 5 stars",
    "content": "Also being so close to the age of the characters made it even more rewarding. So many memories brought to mind.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I can't recommend this book enough.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "This is a book that will stay with you",
    "rating": "5.0 out of 5 stars",
    "content": "I finished the book 3 weeks ago and still think about it almost everyday. There are so many twists that you will not see coming, even though you think you have it figured out. Settle in for an incredible ride.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Story was good, but had to many swear words.  Story would have been better with out the inappropriate words.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "To many swear words in book",
    "rating": "5.0 out of 5 stars",
    "content": "I think Saint was the true heroine here. She never wavered or compromised her principles. She loved one man for life and that love was never truly returned in quite the same way. But yet she stayed in Patch’s life through it all. A heart wrenching, complicated and beautiful story.  It is very long, but easy to read, as the chapters are short.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Such a good read. I love how it was not a snippet of time but a story of a life lived.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Emotionally packed Story",
    "rating": "5.0 out of 5 stars",
    "content": "The story weaves and turns and paints a picture of loss and love and friendship and loyalty and betrayal and hope and survival so profound I couldn’t put it down!",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Not enough words to express how great this book is.  I hope to one day see it on the big screen and can already see it come to life!",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Beautiful",
    "rating": "5.0 out of 5 stars",
    "content": "Although a little little long, this book is completely enthralling.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A compelling serial killer story, complex and interesting characters, and beautiful layers of texture and scenery.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Book",
    "rating": "5.0 out of 5 stars",
    "content": "It's been a long time since a book kept me reading late into the night.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Can’t wait to read it. Love the author.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Could not stop reading this unique book!",
    "rating": "5.0 out of 5 stars",
    "content": "Incredible and inciteful description re: the affects of trauma on the human mind and spirit and the uniquely human quality of Hope",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Liked how the story was so intertwined with characters that kept surprising. It's a lengthy book but needed to be to tell the life stories of so many. Definitely recommend.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Captivating story from beginning to end",
    "rating": "5.0 out of 5 stars",
    "content": "The characters here are a!l memorable for very different reasons. As Patch lives his life, I wanted only one thing. It did not happen.  But through the story, some of the people were  just funny, some very caring, and some just cruel.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The ending left me with a calm, sad, but peaceful, feeling. This is the longest book I've ever read!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Mysterious, heartwarming and sad",
    "rating": "5.0 out of 5 stars",
    "content": "I’m a bit of a snob when it comes to books. I download many samples, and of those, I usually purchase one, maybe two. Chris Whitiker’s book is one of the best I’ve ever read. The book is long but taut and absent of cliches and over-describing/explaining. It's darkly beautiful. I greatly appreciated his distinctive (often idiosyncratic) writing style. It had me in awe and a bit envious of his ability to manipulate language in a way that consistently surprised and delighted me, so refreshing from the usual fare. I’ve already downloaded another of his books. I highly recommend this talented author!",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This story had everything! Love, mystery, psychological thriller, hope...it was a long book that I wanted to end so I could find out what happened, but there were so many continuous twists and turns that it had to keep going.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "A likeable read...",
    "rating": "4.0 out of 5 stars",
    "content": "but, a bit too ambitious! So many characters, farms, and plotlines. Nonetheless, a heart-filled cast, with so many twists and turns. As a professional artist,  myself, I can tell you that the brilliant artist concept is cliche and unworthy of exploring. And, there are just too many trite twists, such as a filthy mouth child getting away with nonsense abandoned. I really dislike criticizing anything about this heroic effort of a novel. Shades of \"Demon Copperhead?\"",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Started out a little slow, but then really got my attention.  I could not put it down.  Loved all of the characters and the unexpected twists and turns.  We'll definitely be reading more from this author!",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Loved this book",
    "rating": "5.0 out of 5 stars",
    "content": "I couldn’t put this book down!",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I read this book recently for my book club. The story is incredible, the characters were so vividly written and so enjoyable to follow throughout the story.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Great read!",
    "rating": "5.0 out of 5 stars",
    "content": "This book starts off slowly, but then hooks you and it becomes difficult to put down. It’s the kind of book where you really get to know the characters and feel a little sad when it’s finished.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One of the best books I’ve read this year",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "This book is a must read",
    "rating": "4.0 out of 5 stars",
    "content": "Started with a bang, dragged through the middle, wrapped up beautifully in the end. I’m glad I stayed with it. Many moments of DIF.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I couldn’t put it down…",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "My fav book of the year",
    "rating": "5.0 out of 5 stars",
    "content": "This was a great book filled with detail and unexpected turns. The book was a bit long, but the picture it paints is worth it.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved the author’s writing style. He kept my attention through a richly woven plot and several generations of interesting, ordinary people. I read this for bookclub, but highly recommend it to all readers.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "One of the best books ever!!",
    "rating": "5.0 out of 5 stars",
    "content": "This is one of the best books I have read… Ever! I don’t say this lightly as I have been reading for most of my 62 years and I read several books a week.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "When I finished this book as I had tears streaming down my face, I told my husband “this book is life-changing “and while  that might sound dramatic, that’s how I felt at the time. It is one of those rare pieces of literature that brings you to the depth of yourself ,through the sheer poetry of his words, the connections of the characters, the insights into the humanity and glory of life, the tenderness, the profane and the profound. Chris Whitaker masterfully  weaves all of this and more into a story that is mind blowing and life altering. It is really that good!!",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Best Book I’ve Read AllYear",
    "rating": "5.0 out of 5 stars",
    "content": "Part mystery, part love story , part exploration of life and connection …. it’s a pilgrimage and an Odyssey!",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Thank you, Chris Whittaker… I am at your feet🙏🏽 I look forward to another one of your stories, and I will wait as long as it takes!",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Worth more than 5 stars!",
    "rating": "4.0 out of 5 stars",
    "content": "All the Colors of the Dark by Chris Whitaker is easily the best book I’ve read all year.  It is a book about endless love, tragedy, and hope; both a coming of age novel as well as a years-long mystery. Chris Whitaker’s writing is like music, with one note leading to the next, pulling the reader along with crescendos and interludes as he skillfully reveals the decades-long relationship between Patch and Saint with all its complexities. The last 30 or so pages are so beautiful, it was almost unbearable.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Absolutely stunning!  This one will stay with me for a long time.  I don’t usually reread books but I will with this one!",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "a stunning g collection of characters come to life…",
    "rating": "5.0 out of 5 stars",
    "content": "This book did not catch me at the start. The style of writing seems to skip rather than flow!  Then the nature of the book took hold and these were my people.  A starling story that makes you shiver for no reason and then slowly warms to the satisfying end.  This will be in my top ten favorites!!",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed this book as it was unpredictable. It’s an entertaining story with many interesting characters. It’s not often that I can’t figure out what is going on but this book has me surprised. It kind of made me irritated though because I don’t personally agree with the messaging. Still a great story but to read such a long book and then be mad about how it turned out was annoying. However, the author attempted to placate his more conservative readers and it did soften my feelings somewhat but not all the way.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Unpredictable",
    "rating": "5.0 out of 5 stars",
    "content": "ALL THE COLORS OF THE DARK by Chris Whitaker",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0CPKXGL6Q"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I read this and listened to the audiobook narrated by, Edoardo Ballerini, who always does an outstanding narration.  He is a favorite narrator of mine and I highly recommend the audiobook.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0CPKXGL6Q"
},
]