[
{
    "name": "        Mini Bag Sealer, USB-C rechargeable Bag Sealer, 2 in 1 Bag Sealer Heat Seal with Cutter and Magnet, Mini Bag Resealer Machine for Plastic Bags Snack Bags. Authorized Seller: Luke X       ",
    "stars": [
        "37%",
        "13%",
        "15%",
        "11%",
        "26%"
    ],
    "pid": "B0CQT52K18",
    "ratings": "272 ratings",
    "other_info": {
        "Brand": "LX IntMfr.",
        "Material": "Acrylonitrile Butadiene Styrene (ABS)",
        "Product Dimensions": "3.74\"L x 1.38\"W x 1.57\"H",
        "Item Weight": "0.08 Pounds",
        "Power Source": "Battery Powered"
    },
    "discount_price": "$ 6.",
    "normal_price": "",
    "about_this_item": [
        " 【Our Core Advantage】This mini bag sealer is the only one on the market that charges via USB-C port. This unique feature eliminates the hassle of searching for cords, as opposed to other similar products that use Micro-USB or batteries. With the USB-C interface, all your devices can share the same charging cable, making charging much more convenient.  ",
        " 【2-in-1 Sealer and Cutter】This sealer is an indispensable kitchen accessory, capable of cutting and resealing plastic bags and food storage pouches, providing a more efficient solution than bag clips. It is compact and easy to carry, making it convenient for use on-the-go.  ",
        " 【Seal Various Bags】The heat sealer is suitable for various types of bags. It can quickly reseal food storage bags, chip bags, fruit bags, and candy bags in seconds, keeping them airtight. Please NOTE that SUPER THIN PLASTICS, such as cling film, are NOT SUITABLE as they will melt directly.  ",
        " 【Instant Heating】Much better than bag sealers powered by AA batteries, this lithium battery-powered sealer features a powerful and efficient heating element unit that can rapidly heat up within 1 second and seal the bags immediately upon reaching operating temperature, saving time effectively.  ",
        " 【Keep Food Fresh】Resealing food bags helps to keep vegetables, fruits, and grains fresher for longer periods. Reducing food waste is environmentally beneficial and can help save on grocery costs.  ",
        " 【Compact and Portable】The high-quality mini 2-in-1 sealer and cutter are perfect for carrying on-the-go, handheld, and portable, making it ideal for travel, camping, and hiking trips.  "
    ]
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "Lovely",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "It just rips the bag, doesn’t seal it",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Doesn’t seal",
    "rating": "1.0 out of 5 stars",
    "content": "Absolute POS.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "cancel this order",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Garbage",
    "rating": "1.0 out of 5 stars",
    "content": "No seal",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "It never worked, never got hot  I charged it still nothing",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "never buy",
    "rating": "1.0 out of 5 stars",
    "content": "Waste of money years to many bags",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Complete JUNK!",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Doesn’t work",
    "rating": "1.0 out of 5 stars",
    "content": "Cheap and very flimsy and barely worked",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "This was horrible. This would not even slide and my back go ripped spots.  Do not recommend",
    "post_time": "Reviewed in the United States on May 2, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Piece of junk",
    "rating": "1.0 out of 5 stars",
    "content": "Not worth the money!",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a point sealer rather than a line sealer.  Therefore to seal the line across the top of your bag, so that the bag is sealed, you have to drag the tool across a line from one side to the other, and there should be no gaps in that line.",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "It works, but it takes some effort",
    "rating": "5.0 out of 5 stars",
    "content": "This is not too hard if you have a single thickness bag (so total of 2 thicknesses in the sealer, to be sealed together.  If you miss an area, you have to go back and retrace through it.  As the instructions say, make sure the new line intersects the old ones.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Better than competitors",
    "rating": "3.0 out of 5 stars",
    "content": "I had difficulty because my bag has accordion folds on the sides.  It's a bag that's designed to be heat sealed.  You open it, pour in the contents, and seal across the top.  Then there's a ziplock on the side that you can open to get at the contents, and seal that back every time you open it.  To open wide to accept the initial filling, it has accordion folds on the sides.  Unfortunately, this puts four thicknesses rather than two in the heater, and I had to go very slowly, and it seems like maybe I sealed it, or at least nearly sealed it so that if I fold the bag over, it will leak air very slowly.",
    "post_time": "Reviewed in the United States on April 3, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Efficient Cutter, Mixed Sealing Performance",
    "rating": "4.0 out of 5 stars",
    "content": "I've never tried the sealer that does a whole line at once, but I am imagining that that type can seal these bags more easily.  But they take more space, they're not battery powered, and they don't attach magnetically to your refrigerator door.  This heat sealer also has a cutter, in case you want to seal, then cut off the seal.",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "It seals and cuts",
    "rating": "3.0 out of 5 stars",
    "content": "The instructions are almost microscopic.  Bring good eyesight or a magnifying glass.  But it's pretty self explanatory, and I just told you most of what it says.",
    "post_time": "Reviewed in the United States on March 13, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Works...Kinda",
    "rating": "4.0 out of 5 stars",
    "content": "Works great. Better features than others, includes charging cable",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "3.5 stars",
    "rating": "4.0 out of 5 stars",
    "content": "I had a bit of a mixed experience with this bag sealer. While its cutter performs admirably with clean, precise cuts, the sealing function falls short of consistency.",
    "post_time": "Reviewed in the United States on March 13, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "works ok",
    "rating": "5.0 out of 5 stars",
    "content": "Sealing Functionality:",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Small but works great",
    "rating": "5.0 out of 5 stars",
    "content": "The bag sealer struggles to achieve a 100% seal every time, leading to occasional leakage of my chip bags freshness. This inconsistency can be a little frustrating.",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "B0CQT52K18"
},
]