[
{
    "name": "        Juicer Machines, ECOSELF Cold Press Juicer with 4.35\" Large Feed Chute Fit Whole Fruits and Vegetables, Easy to Clean, Masticating Juicer Self Feeding Effortless for Batch Juicing, High Juice Yield       ",
    "stars": [
        "70%",
        "11%",
        "5%",
        "3%",
        "11%"
    ],
    "pid": "B0CSFY1MLV",
    "ratings": "268 ratings",
    "other_info": {
        "Brand": "ECOSELF",
        "Color": "Black",
        "Special Feature": " ",
        "Product Dimensions": " ",
        "Finish Type": " "
    },
    "discount_price": "$ 99.99",
    "normal_price": "$189.99",
    "about_this_item": [
        " Large Feed Chute & Compact Design：Our juicer machines upgraded 4.35\" inch large feed chute and 40oz capacity is larger than normal, while the size is smaller. You can juice whole fruits and vegetables without chopping. Moreover, the slow juicer doesn't take up too much space on a kitchen counter, which fits for a small kitchen, and can be carried to any part of the kitchen easily.  ",
        " Powerful Motor & Efficient High Yield：With a High-power motor, our cold press juicer separates the pulp from the juice well, providing you with better-tasting, purer juice. Cold press technology maximizes the retention of nutrients and reduces oxidation, extracting a high yield of vitamins for your satisfying juicing experience. Enjoy fruit and vegetable juices such as apple, carrot, orange, watermelon, ginger, celery, tomato and more!  ",
        " Easy to Assemble & Clean：Our ECOSELF masticating juicier features a hopper & screen integrated design, which can be easily assembled and disassembled in minutes, and is also easy to clean. Except for the motor base, other parts can be quickly cleaned with water, with an included brush for a hassle-free cleanse.  ",
        " One-button Operation & Safety Design：It is easy to operate with a simply rotating button. You can enjoy fresh juice with ease. And the reverse function helps prevent clogging. The juice maker will automatically stop working if the cover is open accidentally while juicing, which is safer for children.  ",
        " Protection Service & Brand Story：We provide 24 months of Repair and Replacement Service. Get in touch with us whenever you need. We will reply to you within 24 hours. ECOSELF is committed to providing customers with better service and shopping experience.  ",
        " Troubleshooting Steps：The juicer can only be powered on and work normally after it is fully assembled. Rotate hopper clockwise to align Guidemark with Lock symbol, then close the hopper cover, and ensure full assembly before powering up the juicer.  "
    ]
},
{
    "title": "Please do not purchase this item IT'S CRAP",
    "rating": "1.0 out of 5 stars",
    "content": "the item is defective and does not offer UPS shipment for pickup. They know that this item did not work before they packaged it to me. This is crap do not waste your money.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "This machine really let me down. I thought I had taken advantage of such a big discount, but in fact, I just found more trouble for myself, because I not only need to spend time studying this machine that doesn't work. I also have to return it, which is really an unpleasant shopping experience.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "It doesn't work",
    "rating": "1.0 out of 5 stars",
    "content": "No tritura bien los vegetales",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I used like 5 times and today it stopped working.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "No hace bien los jugos",
    "rating": "4.0 out of 5 stars",
    "content": "This is not a bad little juicer. I was a little bit concerned about how well this juicer would work since it's so small and I was honestly quite overwhelmed by all of the many parts, but once you read and reread the manual and put it together, it was fairly easy to operate.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Pros:",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "It lasted 3 months",
    "rating": "1.0 out of 5 stars",
    "content": "1)Small size takes up less counter space",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "2)Surprisingly easy to clean, despite having a lot of parts that have to come apart for cleaning",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Small yet functional juicer",
    "rating": "5.0 out of 5 stars",
    "content": "3)The best thing about this juicer is the dry pulp it leaves behind and that it juices all parts of your fruit and veg (it doesn't leave big chunks in the discard)--the last juicer we had left big chunks behind and the pulp was so wet that we had to run it back through again--well, not this one! When you're left with very dry pulp, that means you've extracted the maximum amount of juice",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Cheap products",
    "rating": "5.0 out of 5 stars",
    "content": "Cons:",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0CSFY1MLV"
},
]