[
{
    "name": "        OJA Red Wine Glasses Set of 4- Hand Blown Premium Crystal Wine Glasses-17 oz, Long Stem,Thin Rim, Perfect for Red or White, Daily Use, Unique Wedding Anniversary or Birthday Gift       ",
    "stars": [
        "78%",
        "10%",
        "5%",
        "2%",
        "5%"
    ],
    "pid": "B0CTQMQ11T",
    "ratings": "2,228 ratings",
    "other_info": {
        "Brand": "OJA",
        "Color": "17 Oz",
        "Special Feature": "Lead-free Crystal",
        "Style": "Modern",
        "Theme": "Wine & Celebration"
    },
    "discount_price": "$ 38.",
    "normal_price": "$9.75",
    "about_this_item": [
        " PURE CRYSTAL: LUNA&MANTHA comes from the OJA brand,it's red wine glasses have passed the European certification, using premium titanium crystal, making the wine glasses ultra-thin (as thin as 0.8mm), brilliant and light enough. Its sparkling appearance, resonant sound and pleasant hold are indeed a gift you can cherish for years  ",
        " 100% HAND BLOWN: Inheriting traditional hand-blown craftsmanship, LUNA&MANTHA red wine glasses are carefully blown through 27 processes by sophisticated craftsmen with over 12 years experience. Unique glasses with its unique pulled stem, there is no seam between stem and bowl  ",
        " ENHANCE WINE TASTING: Tulip glassware is the best shape for wine glasses. The bowl is not only aesthetically pleasing, but it allows wine to breathe without over-oxygenating. The rim of the glass feels ultra-thin and inconspicuous in your mouth, like floating in the air and drinking. These make to better experience the wine itself while tasting it  ",
        " LONG STEM: The slender 4 3/4in stem allows to easily hold, and the decanent feeling in your hand makes it easier to swirl wine. Long crystal stem adds an elegant and refined visual feel to the wine glass. Not only exquisite artwork placed at home, but also a must-have for serving the most important guests  ",
        " GIFT BOX: Its modern packaging style is best for your friends and families as birthday or wedding gift. The intimately designed handle allows you to take crystal wine glass to anywhere safely. We also provide the perfect customer service, any problem after receiving the wine glasses, please contact us, we will solve the problem for you soon  "
    ]
},
]