[
{
    "name": "        (2024) Premium High Arch Insoles for Ultimate Support - Plantar Fasciitis - Comfort for Foot Pain Relief - Anti-Fatigue - Orthotic Shoe Sole Inserts Men Women Standing All Day (Flame, XL)       ",
    "stars": [
        "60%",
        "21%",
        "11%",
        "5%",
        "3%"
    ],
    "pid": "B0CTKRC4LL",
    "ratings": "443 ratings",
    "other_info": {
        "Brand": "CRUVHEAL",
        "Color": "Flames",
        "Product Benefits": "Plantar Fasciitis",
        "Use for": "Foot",
        "Material": "Plastic"
    },
    "discount_price": "$ 19.",
    "normal_price": "$19.99",
    "about_this_item": [
        " Customize your fit: Ensure accurate shoe size verification and select the appropriate arch type that matches your foot's natural arch  ",
        " Superior foot alignment: Orthotic inserts provide the necessary support for high arches, promoting proper foot alignment and alleviating plantar fasciitis pain  ",
        " Improved balance and stability: Enhance your balance and stability during various activities such as running, walking, sports, or extended periods of standing with high arch insoles  ",
        " Excellent shock absorption: Reduce impact on feet, knees, and joints with insoles designed for effective shock absorption. The deep heel cradle ensures stability and maintains correct foot alignment for greater comfort.  ",
        " Compatible with multiple shoe type: Our orthotics for flat feet seamlessly integrate with different shoe styles, from athletic to formal, offering balance improvement for any occasion  ",
        " Breaking-in Period: Pressure on the feet may be felt during the first 3-7 days. Start with 2-5 hours of wear daily, gradually increasing the duration  ",
        " Shop with confidence: Enjoy a year of protection on your insoles, and reach out to us if you encounter any issues, even after trimming them  "
    ]
},
{
    "title": "Great fit very comfortable",
    "rating": "4.0 out of 5 stars",
    "content": "N/a",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wear 12 EEE shoes and have a high arch! These are the best inserts I’ve found to date! They slipped right in my shoe without having to trim! I bought a second pair for my Ski Boots as well!",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Good Quality!",
    "rating": "5.0 out of 5 stars",
    "content": "Flat shoes give me pain because my foot naturally has an arch. I cut these to size and slide them in any shoe and it’s instantly better. Good quality.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Made my knees hurt for just a little bit while I was breaking them & new shoes in but now they’re amazing!",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Helped with my foot pain.",
    "rating": "4.0 out of 5 stars",
    "content": "I got this product on 5/20/2024, and it is good, and I already feel relieved. I'll reduce the stars later if I don't see any improvement. Don't assume it is too early to revivew (on the first day). I have experience with other insoles, so I know how it works.",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Use them almost every day when I walk. They give excellent arch support.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Good product",
    "rating": "5.0 out of 5 stars",
    "content": "I replaced the stock inserts in my Jordan 3s with these. I am size 13m, did not need to trim the inserts.",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Before this, my feet would feel uncomfortable just sitting around with my J3s on after several hours.  I preferred to just wear them for short periods of time when going out.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "On first day it is good",
    "rating": "5.0 out of 5 stars",
    "content": "With this insert, the shoes fit fine. It took my body less than an hour to adjust and I forgot about the inserts. About 5 hours later, I realized I was not experiencing the previous discomfort and had left my J3s on.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I will still use deep stack running shoes for long walks. I am glad I can wear my various Nike Jordan and Dunks casually now, in comfort, for long periods of time.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "They are okay",
    "rating": "3.0 out of 5 stars",
    "content": "Not enough support for me, if I still had the box I'd send them back.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like how comfortable the product feels on my feet, however one thing to note, the arch on the sole is not an extreme bump. In fact, it is quite subtle, so if you want a more aggressive arch you may want to look for another product.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Comfortable subtle arch inserts",
    "rating": "3.0 out of 5 stars",
    "content": "They are smaller than the size chart says. If you buy these get them bigger than you would think by about 2 sizes. I bought high arch support and they aren't much different than the ones that came in my boots when I bout them. I wouldn't buy them again for my feet, but they aren't bad.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Arch support seems ok, comfortable",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "They are smaller than the size chart says.",
    "rating": "5.0 out of 5 stars",
    "content": "I've tried many inserts and this is the best so far. I have a high arch and these support and comfort my heels perfectly. Lessened my pain greatly.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great item.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Seems ok",
    "rating": "5.0 out of 5 stars",
    "content": "It was a comfortable insert unfortunately my soul of the shoe is broken down so it doesn't help.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The fit was right on great seller!",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Perfect",
    "rating": "5.0 out of 5 stars",
    "content": "I was extremely upset after purchasing some new balance shoes because they claimed to have excellent arch support and the reviews very much supported that claim, but when I put them on my ankles folded inward immediately. Most modern shoes seem to have this weird inward slant to them and it hurts my feet, ankles, knees, and hips. I'm really glad that these insoles fixed the problem. I have so many shoe options now that I know I can use these insoles to fix poorly designed shoes. I am using these in combination with the super squishy insole that comes with the newbalances and I think if I didn't have that extra cushion these might be a bit too hard for my taste. Pretty minor flaw, all things considered.",
    "post_time": "Reviewed in the United States on January 7, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Pic is the product (size M) next to the insole of a size 9.5 wide new balance. Near perfect fit.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "Due to severe foot pain I recently learned I need high arch support. These inserts fit perfectly in my sneakers. They are easy to adjust too and the foot pain is gone. Glad to be walking again.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I didn't realize there were insoles for 230+ . They might have worked better for me.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "I should have tried the bigger version.",
    "rating": "3.0 out of 5 stars",
    "content": "The company is decent.",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "that accurate on the Amazon website.",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "The product description is not",
    "rating": "5.0 out of 5 stars",
    "content": " I ordered the medium support arch because my arch is within normal range.  I didn't find these insoles very supportive for my feet.  I think they are a bit too thick in the heel area and the medium support arch does not offer enough support.  I felt that my feet were too close to the ground with the insoles in my shoes.  I contacted the seller because the insoles are not returnable through the Amazon website.  They reimbursed me the full price minus (-$2.00) , so in essence I lost only $2.00.",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Very economical. I use the insoles combined with texture and a thin sole to allow me to feel where my foot is in space along with brain stimulation from the texture to be much more sure-footed than in the past. I have a high arch and love how the insole supports my foot.",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "I wear them daily.",
    "rating": "5.0 out of 5 stars",
    "content": "I was wearing crocs to work, could barely stand on my feel for long periods of time. By the time I’d get home, my feet were aching when I went to bed, and when I’d wake up it’ll feel like I’m learning how to walk again. But these insoles are amazing! I don’t have major foot pain at work anymore, I can stay on my feet longer, I don't come home with aching feet, and getting up to walknom them isnt an issue anymore. I would buy again",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm still looking for high enough arch supports, and these aren't it. They do prevent traumatically over-stretching the plantar fascia, which can help you get over an injury, but they aren't for prolonged use in my case; they are extremely hard, don't fully support the arch, and provide no padding for the heel.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Love them",
    "rating": "5.0 out of 5 stars",
    "content": "Edited to add: the seller reached out after reading the above and offered a refund, which I accepted. It's clear that they care about their customers, and I know most reviews on this item are better than mine. It could be that my arches are not just high, but abnormally high, and so these might work better for you than they did for me.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I bought 1 pair about 8 months ago. They are so comfortable, with great support. No pain when wearing them. Since I only ordered 1 pair to start off with. I have now ordered 4 more so I don't have to keep changing to different shoes. Highly recommend",
    "post_time": "Reviewed in the United States on February 3, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "A lot like shoe store brands",
    "rating": "5.0 out of 5 stars",
    "content": "The construction is tough and durable, but the arch just did not work for my particular foot and in fact caused me pain.. I was going to send them back, but coincidentally my husband and I wear the same size jeans and the same size shoes. So he tried them and LOVES them. It all depends on your foot. You can return them for up to a year, no questions asked, so that is awesome.",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have high arches and plantar fasciitis and have always bought another brand of arch support and these are so much better and less expensive.  just ordered another pair to replace my old arch support.",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "seriously good",
    "rating": "5.0 out of 5 stars",
    "content": "They fit my shoes without trimming and feel great all day",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "A step above something like Dr Schools but not near as good as the NB ir Sole or 10 second with carbon fiber. I'll have to use these in something I don't wear much.",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Fit",
    "rating": "5.0 out of 5 stars",
    "content": "I really like them. I goofed and ordered the ones without the work orthotic but I will be fixing that soon! They are great!",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They fit and are comfortable.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Better than nothing",
    "rating": "2.0 out of 5 stars",
    "content": "The arch and padding was ok but the arch was too far forward for wife's foot",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I bought this hoping it would have an arch as high as the Walk Hero orange insert (which is no longer available).  It doesn’t.  The arch is about as high as the Walk Hero blue.  I will keep them, but they are not as advertised.  Disappointed.",
    "post_time": "Reviewed in the United States on January 28, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Order these",
    "rating": "5.0 out of 5 stars",
    "content": "Great quality for the price.",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A step above the more expensive competitors",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Narrow foot with high arches",
    "rating": "5.0 out of 5 stars",
    "content": "These insoles have been great! I’ve tried many Dr Sholls insoles before and never got relief, but these really work!  I removed the insole that came in my sneaker and replaced it with these.",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They work wonderfully in walking for my flat feet",
    "post_time": "Reviewed in the United States on April 30, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Arch support",
    "rating": "3.0 out of 5 stars",
    "content": "Arch is great but little to no padding on sole.",
    "post_time": "Reviewed in the United States on March 14, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried many different insoles all disappointing.  These are the first insoles that my feet have loved!!!",
    "post_time": "Reviewed in the United States on March 23, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Good",
    "rating": "5.0 out of 5 stars",
    "content": "Me encantaron. Son cómodas",
    "post_time": "Reviewed in the United States on May 2, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried so many different brands, and this is by far the BEST. I was so used to foot pain and these have really changed my life for the better.",
    "post_time": "Reviewed in the United States on January 19, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Awesome",
    "rating": "5.0 out of 5 stars",
    "content": "I have very high arches and these work great, made my boots feel new again and no pain",
    "post_time": "Reviewed in the United States on March 4, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I needed a new insole pair to replace my worn ones on my work boots and told the wife to find me some with a high arch so she ordered this set. They do everything great but the most important thing I need, even more than arch support, and that is support for the toes; there is none. I’m sure if you are feet flat on the floor all day they are fine but as a person who is climbing and crawling day in and day out for a predominantly physical labor job these will not work for me. I have used them a couple months to really try and see but I’m ready to throw them out now.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Excelente",
    "rating": "5.0 out of 5 stars",
    "content": "So far they are comfortable. They fit my 10 1/2 shoes with no cutting.",
    "post_time": "Reviewed in the United States on March 24, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These arch supports are great as they're easy to insert into shoes and provide excellent support.  They're not uncomfortable.  They actually provide more foot comfort than before using them.",
    "post_time": "Reviewed in the United States on December 13, 2023",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Happy Feet!",
    "rating": "5.0 out of 5 stars",
    "content": "Very pleased with these insoles in my motorcycle boots and in my work boots. Thanks!",
    "post_time": "Reviewed in the United States on February 1, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They're comfortable,  provide adequate support and keep my feet from hurting after walking all day. I'm happy with them",
    "post_time": "Reviewed in the United States on December 20, 2023",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Like them, good inserts",
    "rating": "5.0 out of 5 stars",
    "content": "Very comfortable",
    "post_time": "Reviewed in the United States on April 2, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Ordered \"L\" for a US Men size 11.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Awesome",
    "rating": "5.0 out of 5 stars",
    "content": "What showed up?  A box that said L, soles that said L.",
    "post_time": "Reviewed in the United States on February 13, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "But is a 10 not a 11 or 11.5.",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Size on Men's Shoes not Real - much shorter",
    "rating": "5.0 out of 5 stars",
    "content": "in the shoe, my toes lean over the edge of the foam.",
    "post_time": "Reviewed in the United States on January 2, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Premium?  Unless that word means \"inflexible\" and \"hard as a rock\" it isnt applicable.",
    "post_time": "Reviewed in the United States on February 6, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Comfortable",
    "rating": "2.0 out of 5 stars",
    "content": "Move on to a more professional and organized company.",
    "post_time": "Reviewed in the United States on March 1, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Made work boots more comfortable to wear",
    "post_time": "Reviewed in the United States on January 9, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Obviously they were not for me, but….",
    "rating": "1.0 out of 5 stars",
    "content": "……but they did trim very well to fit shoe size. Definitely not to be used with sandals, even the type of sandals that strap behind your heels",
    "post_time": "Reviewed in the United States on February 28, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I'm reviewing Cruvheal High Arch Supportive Insoles / Orthotic Inserts for Plantar Fasciitis & Foot Pain Relief",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Pronounced support - Great for me but may be \"too much\" for some people",
    "rating": "4.0 out of 5 stars",
    "content": "For my particular foot and gait issues, having proper arch support makes a big difference in terms of how much pain I am in at the end of the day.  These insoles provide a pronounced level of support, and I find them very helpful.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Great arch support & stability for overpronators!",
    "rating": "4.0 out of 5 stars",
    "content": "If you are unaccustomed to having this much support, you should follow their advice as to how to go about getting used to using these.  Also be aware that these insoles do take up more room in your shoes than flat ones do.  That means they may not work in certain footwear that fits closely and cannot be adjusted (or adjusted \"enough\") by loosening the laces.  In addition, I think that they may raise your heels up (inside the shoe) ever so slightly, which may alter the fit of some of your shoes so that the top edge of them is touching the backs of your heels in a different (and less comfortable) place.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Not what I needed",
    "rating": "4.0 out of 5 stars",
    "content": "For me, these insoles are working just fine in my lace-up walking shoes, but they made a pair of \"heritage\" style boots feel too tight across the tops of my insteps.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Wonderful!",
    "rating": "4.0 out of 5 stars",
    "content": "So far I have zero complaints or issues with these.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Provide excellent support",
    "rating": "5.0 out of 5 stars",
    "content": "These arch support inserts from CRUVHEAL arrived just as pictured & described. I ordered these for my daughter who suffers with overpronation. I was a bit hesitant to order this set due to the “high arch” description which can be misinterpreted. They are indeed orthotic inserts which are meant to support high arched & flat feet individuals along w/overpronators who need extra stability. I’m not sure they would work for supination bcuz the arch measures 1 3/8” at its highest point. I ordered her the Lg. due to her wearing a size 11 womens shoe. They were a tad big however, they come w/a double sided template which you’re able to cut & test fit inside your shoes b4 trimming the actual inserts. Although the insoles are easy to cut, I highly suggest using a sharp scissors so you don’t end up w/jagged edges.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Great customer service",
    "rating": "4.0 out of 5 stars",
    "content": "My daughter has been amazed the last 10 days of wearing due to their comfortability & support. Although, she’s worn orthotics the last 3 years these have become her new “favorites”. She shared that her ankles, feet, & arches are no longer aching & sore after being on her feet for hours at a time. The deeper gel heel cup (measuring close to 1”) provides excellent shock absorption w/every single step. They also provide stability & cushioning which helps keep her feet better aligned. *NOTE* if you’re new to orthotic’s they can be uncomfortable in the beginning bcuz your feet aren’t accustomed to the extra support they provide. It’s best to wear for 1-2 hours then gradually increase in order to feel the optimal benefits they provide.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Great Support",
    "rating": "4.0 out of 5 stars",
    "content": "I deducted 1-star because the insoles are on the thinner side when compared to her old orthotics.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "May change the shape of your shoes",
    "rating": "5.0 out of 5 stars",
    "content": "At this price point, I question their durability & how long they’ll provide her support before needing new ones. As of today, she’s seeing & feeling the benefits because they’re new. I guess time will tell if they’ll last & deliver the stated 6+ months. If not, then I’ll update this review!",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Comfortable insoles and easy to use",
    "rating": "4.0 out of 5 stars",
    "content": "I have these in my daily shoes and can ear them comfortably the whole day. They were easy to put in and do offer the right support for me. I use different ones for when I walk and run of course.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Nice and comfortable. Size M is large for Men 8. Need to trim.",
    "rating": "4.0 out of 5 stars",
    "content": "I ordered size M for my size 8 (Men) Skechers GO WALK shoes, but the insoles were big. Fortunately, I can just cut them down using my original insole as a template. They come with a trim test template and marked lines.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Decent Support - Could Be A Little More Rigid",
    "rating": "4.0 out of 5 stars",
    "content": "Pros:",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Love them",
    "rating": "5.0 out of 5 stars",
    "content": "1.The pattern on the insoles is nice.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Comfortable sole",
    "rating": "4.0 out of 5 stars",
    "content": "2.They are made of a soft black material, have a brown plastic support, and a bit of red rubber to prevent slipping inside the shoes.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Fix as expected",
    "rating": "4.0 out of 5 stars",
    "content": "3.They're soft and supportive because of the plastic support, which gives good arch support, kind of like the lumbar support in a chair.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Fun colors",
    "rating": "4.0 out of 5 stars",
    "content": "Cons:",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Good Stability and Support",
    "rating": "4.0 out of 5 stars",
    "content": "1. One downside is that they were a little too big, but it’s not a big deal since they are designed to fit sizes 8-9.5 for men.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Well Made & Strong Support.  Ran Large For Me, But CS Took Care Of It!",
    "rating": "4.0 out of 5 stars",
    "content": "2. It could be better if the soft part of insole is thicker.",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "I felt these were ok",
    "rating": "4.0 out of 5 stars",
    "content": "2. Although these insoles are good, considering their features and the current price of $30, I don’t think they offer the best value for money.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Good quality, but some sizing issues",
    "rating": "4.0 out of 5 stars",
    "content": "I generally wear an 11.5 with a couple pairs at 12. I ordered the large size hoping these would be about a perfect fit. However, I compared them to some existing insoles that I already had, with size markings on the back, and as far as I can tell, these are only about 10.5. So a bit smaller than I needed. The arch support was a little further back than I would’ve liked, and I think this might be partially due to the sizing issue. They do seem quite well-made. The foam is soft and provides good cushioning, and they are topped with a nice felt-like layer.",
    "post_time": "Reviewed in the United States on June 8, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Good quality",
    "rating": "4.0 out of 5 stars",
    "content": "These are pretry good quality, i  am a size 8 but i still have to cut a small part of it to fit.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Provides good support, but requires some changes",
    "rating": "4.0 out of 5 stars",
    "content": "My wife has high arches and so we wanted to try these out to see if they fit the bill. She says they actually feel really nice and provide a lot of support. The only downsides she said were, firstly, that as she walks, she feels like her foot is going to slide out of her shoe because it raised her whole foot a little to the point where it feels like her shoe could fall off. Secondly, she said that it pushed up her foot enough to where it was pushing it into the top of her shoe, so she needs to adjust her shoes to be looser on the top of her foot. If you can work around these two things, these are a pretty good value and do the job you are looking for.",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Good but",
    "rating": "4.0 out of 5 stars",
    "content": "My only dislike is the break-in period. once you get them broken in they feel great but until then it hurts the feet!",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Firm support",
    "rating": "4.0 out of 5 stars",
    "content": "Wear in work steel toes everyday. Game changer. I walk and am on my feet a lot and these have been great. Not as tired and feet don’t hurt after a long day as much.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Too supportive for me",
    "rating": "4.0 out of 5 stars",
    "content": "What I liked:",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "If you need to offload an ankle - these are perfect",
    "rating": "5.0 out of 5 stars",
    "content": "I guess I liked that these \"High Arch Supportive Insoles - Plantar Fasciitis & Foot Pain Relief - Orthotic Inserts for Men & Women - Compatible with Work & Casual Footwear (Red, XL)\" really did offer some nice support when and wherever I used them.  They are easy to adjust sizing on if needed and do look and feel like they are of a decent quality.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Game changer",
    "rating": "5.0 out of 5 stars",
    "content": "What I did not like:",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Decent arch support, helps lock in heel when sizing up in shoes",
    "rating": "5.0 out of 5 stars",
    "content": "They seemed to be lacking in the comfort department.  SUPER supportive yes, but almost in a painful kind of way - they could be a tad softer and I would prefer them better.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0CTKRC4LL"
},
{
    "title": "Great arch support insole",
    "rating": "4.0 out of 5 stars",
    "content": "Overall:",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B0CTKRC4LL"
},
]