[
{
    "name": "  The Mother: The BRAND NEW addictive, pulse-pounding thriller from Valerie Keogh, author of NUMBER ONE BESTSELLER The Nurse for 2024 ",
    "stars": [
        "54%",
        "31%",
        "10%",
        "3%",
        "2%"
    ],
    "pid": "B0CW963Y31",
    "ratings": "1,879 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$15.79",
    "about_this_item": []
},
{
    "title": "WOW!!! JUST WOW!!!!! READ. THIS. BOOK.",
    "rating": "5.0 out of 5 stars",
    "content": "WOW!! Totally not what I was expecting right up till the last pages!! This is a great book!! I highly recommend this one!!",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is Keogh's best book yet!! Just really an unexpected twisty turny thriller that has you racing to get to the end!! I've read quite a few books that I would consider books that I couldn't put down & most of those would be from really hugely well known popular very established authors, and well they just need to move over cause Valerie Keogh is here to stay y'all!! Make Room at the Top!!! This lady has it in spades & this book proves she deserves to be included!!! I'm a Valerie Keogh Fan & Proud Of It!!! Amazing, just Amazing!!!",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Lots of twists and turns in this story",
    "rating": "5.0 out of 5 stars",
    "content": "Good read keeps you guessing till the end Will leave you guessing and a lot of moments that you think you have figured it out you would have been wrong.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is such a good psychological thriller! I literally read it within a 24hr period because of the twists & turns. Sometimes I disliked the main character so much yet I sympathized with her. What's the thin line between love and obsession? Read The Mother to find out. You'll be surprised there may be more than one answer.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Wow! Twists & turns til the end",
    "rating": "5.0 out of 5 stars",
    "content": "Good read. Many twist and turns. The ending was not expected. I enjoyed this book. It kept me guessing the entire time.",
    "post_time": "Reviewed in the United States on October 16, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book had me going every which way on what really happened!  Very well-written!  I read it in 3 days!",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Good book",
    "rating": "3.0 out of 5 stars",
    "content": "This book had me in suspense.  I knew those two people were behind all the events but could not figure out the connections regardless of how hard I tried. Job well done!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Plot twist was a little far fetched and disappointing. I need more of and intense mystery. I would possibly try another of her books.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Not what I expected",
    "rating": "4.0 out of 5 stars",
    "content": "I loved this book kept you interested until the end. Kept my interest through out the whole time. Great book a Must Read!!",
    "post_time": "Reviewed in the United States on October 15, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "nothing is what it seems in this book! Overall a good, easy read. Some parts felt drawn out but the plot twists made up for it.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "very well written.",
    "rating": "5.0 out of 5 stars",
    "content": "This book held my attention from beginning to end. It was very cleverly written. I love her style of writing. I will definitely be reading more of her books!",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Didn’t know what was coming ! Completely wrong when I thought I had it figured out .",
    "post_time": "Reviewed in the United States on October 15, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "edge of your seat",
    "rating": "4.0 out of 5 stars",
    "content": "Worth the read.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "interesting story",
    "rating": "4.0 out of 5 stars",
    "content": "The plot was good even though I wasn’t crazy about any of the characters. They all had flaws. There are several twists and turns to keep the pages turning.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Thrilling",
    "rating": "4.0 out of 5 stars",
    "content": "In the end it all came together. For awhile I felt it was dragging but in the end it was worth it.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "This was a hard to put down book with a surprise ending.  I would recommend this book to others..",
    "rating": "4.0 out of 5 stars",
    "content": "This was a very hard to put down book with a surprise ending.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "A wonderfully twisting tale about obsessive love.",
    "rating": "4.0 out of 5 stars",
    "content": "I would recommend to others. I enjoyed the writing style of the author.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "The question of Who is Guilty",
    "rating": "4.0 out of 5 stars",
    "content": "The Mother is about Sarah, who is unhappily married to Nick. She then reluctantly becomes a mother. That is where the story really takes off. I was pleasantly surprised at all of the twists and turns; never seeing them coming. Kudos to the author for a book that was interesting and surprising throughout.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Twisted Tale!",
    "rating": "4.0 out of 5 stars",
    "content": "This book is a great Whodunnit  mystery. Although I enjoyed the story,I didn't give it a five stars, as I was able to figure out what was going to happen next all throughout the book. Still, I was unable to lay the book down. It was a great story about a lady who was unable to love her husband and baby and the consecquences were great!",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Lots of suspense",
    "rating": "4.0 out of 5 stars",
    "content": "A truly twisted tale! Just when you think you know what is happening, the story takes you in a completely new direction. Very well done!",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "meh",
    "rating": "3.0 out of 5 stars",
    "content": "This book could have been better if half the length bc of repetition & long winded descriptions of the characters’ thought processes. The protagonist was hard to like. There were good plot twists however so not a total bust. Author has books out that are much better…",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "too much filler",
    "rating": "3.0 out of 5 stars",
    "content": "It was an ok read except for all",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Obsessions",
    "rating": "4.0 out of 5 stars",
    "content": "The filler. I swiped page after page of useless text. It was easy to figure out, not the best of thrillers.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Great book!",
    "rating": "4.0 out of 5 stars",
    "content": "Don't know what to say about this story.  There so many different conflicting sets of feelings.  I didn't know whose side to be on.  But when it all came together it made all the sense in the world.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "The mother, the husband, the friend, or...?",
    "rating": "5.0 out of 5 stars",
    "content": "I had previously read The Mistress and The Mother by this author, so I was ecstatic to get this one! I only hoped I would like it as much as the other two, and it did not disappoint!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Surprise!",
    "rating": "5.0 out of 5 stars",
    "content": "Sarah should be thrilled to be married to her perfect, handsome, kind husband Nick. But she knows she made a mistake and wants out. Nick wants something else – a baby; so Sarah agrees. When the baby arrives and Sarah can’t bond with her, she resents Nick even more. When baby Kaya goes missing, Sarah’s world comes crashing down. Will they find Kaya and save her marriage?",
    "post_time": "Reviewed in the United States on October 15, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Enjoyable read with some well played twists",
    "rating": "5.0 out of 5 stars",
    "content": "WOW – that about sums up everything that happens in this book. First you think one person is responsible, then another, then another until you are shocked to find out who is responsible for all that happens. I could not wait to keep reading and see what happened and the twists and surprises just kept coming. I will definitely recommend this book to everyone!",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Excellent Story",
    "rating": "5.0 out of 5 stars",
    "content": "The Mother is a story that will keep you guessing! Thoroughly enjoyable and well written, it is a story to keep you reading all through the night! This is my first read of Valerie Keogh's work, but it definitely won't be the last!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Kept me guessing",
    "rating": "5.0 out of 5 stars",
    "content": "Great  thriller with many  twist and turns. Very interesting! I'll  read more  of  work. Different  and entertaining  book. Thanks",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Twisty thriller",
    "rating": "4.0 out of 5 stars",
    "content": "Valerie!!",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Never Play with Love",
    "rating": "5.0 out of 5 stars",
    "content": "Liked the fast pace of the book.  It kept you trying to figure out who done it.  Good read for sure.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Good read",
    "rating": "5.0 out of 5 stars",
    "content": "Good twist and turns.  Couldn't put it down and read it in a day.  Recommended to my fellow suspense readers.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Absolutely sucks you in!",
    "rating": "5.0 out of 5 stars",
    "content": "Loved the twists and turns right up until the last pages. Just when you think you have the answer, your mistaken.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "2 days",
    "rating": "5.0 out of 5 stars",
    "content": "I read this book in two days. It held my attention and was great! I highly recommend!!! It started and ended strong! There were multiple surprises!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Gobsmacked!",
    "rating": "5.0 out of 5 stars",
    "content": "Oh holy cow! Valerie Keogh knocks this one totally out of the park! Fantastic characters that kept me flipping pages long past my bedtime. Crazy great plot line that left me gobsmacked. Packed with action, secrets and lies. Another perfect storm! Totally loved it.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Great read",
    "rating": "5.0 out of 5 stars",
    "content": "Thank you NetGalley, Valerie Keogh and Boldwood Books for the opportunity to read and review this cracker of a book.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Incredible",
    "rating": "5.0 out of 5 stars",
    "content": "Easy read that kept me guessing what would happen next. Definitely didn’t see the end coming!  Definitely a great read that I couldn’t put down.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "A Guessing Game",
    "rating": "5.0 out of 5 stars",
    "content": "Again a great plot and so many surprises... A jaw dropping novel. Once you start reading you will continue to the end..",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "The Mother - A good read",
    "rating": "5.0 out of 5 stars",
    "content": "This a great story about a search for baby Kaya and once facts are revealed you'll be guessing about where she is and how she got there. It's twisted and intense and a wonderful thriller by Valerie Keogh. I really enjoyed the book and happily recommend it.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Don't confuse love with obsession",
    "rating": "5.0 out of 5 stars",
    "content": "Good read, nice plot twists. Maybe not the most believable, but a page turner none the less. Suspenseful and intriguing storyline.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Secrets, lies and deceit",
    "rating": "4.0 out of 5 stars",
    "content": "A great thriller filled with secrets, lies and deceit. Though Valerie Keogh really cannot disappoint her readers, this one was exceptionally good.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "All I can say is WOW!",
    "rating": "5.0 out of 5 stars",
    "content": "When baby Kaya is abducted, the police suspect the mother, the mother suspects her best friend, the best friend suspects the mother, and Kaya’s father is completely shattered after the abduction. The bombshells just keep coming in this one.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Can't put down",
    "rating": "5.0 out of 5 stars",
    "content": "I was kept entertained for a solid day and couldn’t put it down until I was done. I can easily recommend this book to thriller readers and give it a solid 4 stars.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "WOW",
    "rating": "5.0 out of 5 stars",
    "content": "This was a gripping novel. Twisting and turning at every corner. I thought the story was excellent, characters were described perfectly so the image of them I had led me to enjoy every turn. The best part? There are so many best parts, but thinking I had it all figured so many times only to be led to another twist, that was suspense at it's finest",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Mother May I.",
    "rating": "5.0 out of 5 stars",
    "content": "6 stars if I could",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "You think you know who the bad guy is but you don't",
    "rating": "5.0 out of 5 stars",
    "content": "This is a definite must read. Lots of twists and turns. A  real nail biter.  I couldn't put it down.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "another not what you expected as the story twists and turns as much as a pinwheel in a hurricane …..",
    "rating": "5.0 out of 5 stars",
    "content": "Literally had my heart on edge the whole time! A MUST READ! Will not want to put the book down",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "twisty!",
    "rating": "5.0 out of 5 stars",
    "content": "Omg very dark and twisted tale of love and the g things twisted lovfe does to people and makes some do to those they love",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "GOOD READ",
    "rating": "5.0 out of 5 stars",
    "content": "Keeps you guessing until the very last page!  Every time I thought the storyline was wrapped up there was another twist.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Page Turner",
    "rating": "5.0 out of 5 stars",
    "content": "No spoilers because you just have to read it to believe —— the ending coming at you like a rogue hit an run leaving you speechless as you pick up the pieces  Found this one after another one of Valerie Keogh’s books ….. it all started with The  Nurse which was available on Amazon. I think I’m going to bing read everything I can get my hands on by this author. There’s never a dull moment as I stay up way past my bedtime reading late into the night. These are the kind of books that leave you wanting more of the character’s lives and relationships. It’s almost like the end of a serious crush when you have the page for ratings suddenly pop up. I nearly groaned when this one plunged into an ending.  Off to Amazon to another Keogh masterpiece. It’s gonna be a long time before it’s lights out for me ……",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "This is a good read",
    "rating": "5.0 out of 5 stars",
    "content": "He author did a wonderful job enthralling this story.  The characters were believable and interesting, and this was a very interesting story with enough twists and turns to keep you interested all the way through.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Didn't expect all the trist and turns",
    "rating": "5.0 out of 5 stars",
    "content": "At first I was not impressed with the book but as I kept at it, I was glad I did. Had no idea about the outcome but glad I continued",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Wow, Wow,Wow!!!",
    "rating": "5.0 out of 5 stars",
    "content": "Bravo! This book was an amazing read.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "The Mother- A Must Read!!",
    "rating": "5.0 out of 5 stars",
    "content": "Just when you think you have it, you don’t. The ending was great!",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Holy twists!!!",
    "rating": "5.0 out of 5 stars",
    "content": "This is another fast paced thriller from Valerie Keogh. It is impossible to put down! At first I was so aggravated at some of the characters but soon realized  I had most of them pegged wrong. Plenty of twists and turns.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Good Storyline",
    "rating": "2.0 out of 5 stars",
    "content": "Holy Moly!! I’m so glad I had off of work today because I was able to read this in one sitting. There was nothing, not even a bathroom break that stopped me from carrying my kindle around all day today to read this. I recently read and reviewed The Mistress and loved it so I thought I would read another by the author and this one was even twistier. I’m not going to go into the synopsis because you can read that on your own and saying anything at all will take away the pure reading pleasure of this book. My mouth is still on the floor as the twists didn’t stop until the end and then still didn’t stop. Do not miss this one. Valerie Keogh is my new favorite author. A million thank you’s to Netgalley and Boldwood Books for the advanced copy and to Valerie Keogh for giving me the biggest book hangover ever!!",
    "post_time": "Reviewed in the United States on October 15, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "the mother",
    "rating": "2.0 out of 5 stars",
    "content": "I liked the storyline. Sometimes, it was difficult to follow. The ending was a surprise, so that was a plus.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "twisted",
    "rating": "2.0 out of 5 stars",
    "content": "Was very unexpected ending.Two many twist at the end. It would have been better if I figured out things faster",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Ridiculous story",
    "rating": "2.0 out of 5 stars",
    "content": "The plot was hidden throughout in details of happening.  Ending was unsuspected.  Plot was twisted at every incident.  Not sure I liked it.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "terrible book",
    "rating": "1.0 out of 5 stars",
    "content": "This book was not what I expected.  The main character is very unlikable as is every other character in the book.  The plot has many twist and turns but not in a good way.  The story started out good but got  more and more ridiculous as it went on.  Ugh, I'm very disappointed because if this book had gone in the direction that it started with in the beginning it might have been good.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "I don't write a lot of book reviews because - *** Major Spoilers****",
    "rating": "1.0 out of 5 stars",
    "content": "I don't write a lot of book reviews - and certainly not a lot of 1 star book reviews because I understand that for writers & authors, novels and books are like their babies. And just like I wouldn't criticize a baby, it feels wrong to criticize a book.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Obviously designed with twists in mind",
    "rating": "1.0 out of 5 stars",
    "content": "But for this novel, I'll make an exception -",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Very Good Read",
    "rating": "5.0 out of 5 stars",
    "content": "I love a LONG book. I'm a 'fast' reader, even when I try to slow down and savor a good story, I tend to read like I have a pending deadline. In fact, the better the story, the faster I gobble it up. So I truly adore a longer story. I was excited to see that this book was very lengthy compared to many of the prime reads I'd partaken of recently.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Fast",
    "rating": "5.0 out of 5 stars",
    "content": "This book made me feel as though I'd either lost my mind or inadvertently skipped over major parts.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Great story",
    "rating": "5.0 out of 5 stars",
    "content": "It jumped POV's without announcing the jump. Most authors will indicate when the POV changes, but I understand that this was probably deliberate here.",
    "post_time": "Reviewed in the United States on October 16, 2024",
    "pid": "B0CW963Y31"
},
{
    "title": "Wow!",
    "rating": "5.0 out of 5 stars",
    "content": "But the part that I couldn't and can't understand -",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0CW963Y31"
},
]