[
{
    "name": "        Cold Press Juicer, 6.1\" Extra Large Feed Chute Fit Whole Fruits & Vegetables, 350W Professional Slow Masticating Juicer Machines, Easy to Clean       ",
    "stars": [
        "64%",
        "7%",
        "6%",
        "7%",
        "16%"
    ],
    "pid": "B0CYB7NS67",
    "ratings": "835 ratings",
    "other_info": {
        "Brand": "Canoly",
        "Color": "Classic",
        "Special Feature": "Whole Fruit Processing",
        "Product Dimensions": "13.3\"D x 17.59\"W x 7.59\"H",
        "Finish Type": "Frosted"
    },
    "discount_price": "$ 139.",
    "normal_price": "",
    "about_this_item": [
        " 【6.1inch Reversible Feed Chute】You can directly add whole apples and vegetables to the feed chute, saving your time and increasing juice efficiency.  ",
        " 【50rpm Slow Cold Press Tech】Our juicer machine rotates at 50rpm, reducing clogging and producing less sediment. It locks in freshness and nutrition, maintaining the natural state of the juice.  ",
        " 【3.1x5.5in Auto-cutting Auger】The food-grade spiral auger is more durable and corrosion-resistant. It can extract every drop of deep nutrition from fruits and vegetables, reducing clogging and providing you with health and vitality.  ",
        " 【99% High Juice Yield】This 350W masticating juicer machine can efficiently extract juice with a high juice yield of 99%, resulting in less pulp and a smooth taste.  ",
        " 【Easy to Assemble & Disassemble】The cold press juicer has a simple one-piece design with only 3 components, allowing it to be assembled in just 5 seconds. You can simply press a button to remove the body of the juicer and quickly remove stains.  ",
        " 【Automatic Safety Sensor】 When you open the lid of the feed chute, the juicer machine will automatically stop working, ensuring safety for children and the elderly.  "
    ]
},
{
    "title": "Great juicer.",
    "rating": "5.0 out of 5 stars",
    "content": "This machine does a great job of really getting every drop of juice out of the fruit and separating the pulp from the juice. The machine is not too noisy, easy to clean and makes great juice! It's a great tool to help improve your health!",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Definitely  less pulp than I've seen with any other juicers so it's worth the money! Put apple halves in And it juiced with no problem. No leaking either so far. Not super noisy but not quiet.... Try this out!",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Honest review",
    "rating": "5.0 out of 5 stars",
    "content": "The juicer is easy to assemble and use! It’s definitely good quality as well. Ever since I got it I’ve been making my own veggie juice daily, much better and healthier than store bought ones. Recommend if you also like drinking juice",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It works well us expected. Extraction of juice is perfect.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Good juicer！",
    "rating": "5.0 out of 5 stars",
    "content": "Received the package, immediately open to use, recently every day to drink celery and cucumber juice, the original juicer knife is not sharp, it is not so easy to use, and then saw this juicer, attracted by its appearance, immediately decisive order! As soon as you receive the goods to use, really is my favorite, it has no noise, do not need to press the button all the time, very convenient, cut well so things put in all at once, the key he is particularly good to clean, a wash clean. Push it. That's really great",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": ". Compact and easy to use. This is a great juicer for those who need a powerful cold press. Cleanup is a breeze, easy to disassemble, and highly recommended.I’m really trying to have a healthier lifestyle.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Nice juicer",
    "rating": "5.0 out of 5 stars",
    "content": "Read many juicer reviews and decided to buy this one, great thing to own. Separates peels and juices extremely well. Good quality, soft greens like spinach and kale are easily pulverized and juiced, powerful and durable. Sturdy construction and quality materials ensure stability and reliability during operation for a smooth and quiet juicing experience. Cleanup is a breeze.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is exactly what I was looking for. It makes fresh delicious juices and my daughter loves to be apart of the process. It’s an easy clean! I’m very happy with it!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "High level of appearance and practical",
    "rating": "5.0 out of 5 stars",
    "content": "I love how easy it is for this thing to be assembled and disassembled, since that was the reason that I got this one.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I would highly recommend this.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0CYB7NS67"
},
]