[
{
    "name": "        Cold Press Juicer, 6.1\" Extra Large Feed Chute Fit Whole Fruits & Vegetables, 350W Professional Slow Masticating Juicer Machines, Easy to Clean       ",
    "stars": [
        "64%",
        "7%",
        "6%",
        "7%",
        "16%"
    ],
    "pid": "B0CYB7NS67",
    "ratings": "845 ratings",
    "other_info": {
        "Brand": "Canoly",
        "Color": "Classic",
        "Special Feature": "Whole Fruit Processing",
        "Product Dimensions": "13.3\"D x 17.59\"W x 7.59\"H",
        "Finish Type": "Frosted"
    },
    "discount_price": "$ 139.",
    "normal_price": "$599.00",
    "about_this_item": [
        " 【6.1inch Reversible Feed Chute】You can directly add whole apples and vegetables to the feed chute, saving your time and increasing juice efficiency.  ",
        " 【50rpm Slow Cold Press Tech】Our juicer machine rotates at 50rpm, reducing clogging and producing less sediment. It locks in freshness and nutrition, maintaining the natural state of the juice.  ",
        " 【3.1x5.5in Auto-cutting Auger】The food-grade spiral auger is more durable and corrosion-resistant. It can extract every drop of deep nutrition from fruits and vegetables, reducing clogging and providing you with health and vitality.  ",
        " 【99% High Juice Yield】This 350W masticating juicer machine can efficiently extract juice with a high juice yield of 99%, resulting in less pulp and a smooth taste.  ",
        " 【Easy to Assemble & Disassemble】The cold press juicer has a simple one-piece design with only 3 components, allowing it to be assembled in just 5 seconds. You can simply press a button to remove the body of the juicer and quickly remove stains.  ",
        " 【Automatic Safety Sensor】 When you open the lid of the feed chute, the juicer machine will automatically stop working, ensuring safety for children and the elderly.  "
    ]
},
{
    "title": "Great Product!",
    "rating": "5.0 out of 5 stars",
    "content": "I have been wanting to get a juicer for the longest time. I check Amazon a few weeks ago and saw this product on sale and bought it right away. The day it arrived, I made beet and orange juice. Tasted awesome. I have been making juice almost everyday and I can't imagine going back and buying juice from store with all the additives and preservatives. It takes every bit of juice from fruits and vegetables and its very easy to clean. Very good product. I would recommend it to who ever is thinking of buying.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to set up and clean up. As a mom of three small kids I’m always looking for easy kitchen gadgets that make healthy foods for kids. This juicer has all of that in one nifty gadget. It’s so easy to setup, it juices well and it’s an easy clean up too. I just rinse it out as soon as I am done. I absolutely love it. It’s much better because it’s not big and bulky and can be easily and conveniently stored.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "I really like this little machine",
    "rating": "4.0 out of 5 stars",
    "content": "The machine works great for juicing fruits and vegetables and puts out a lot of juice. You have to cut fibrous vegetables semi small, but it’s not too bad. The main drawback is the chute is hard to clean, even with the brush, and it can be hard to line everything up to start the machine.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So I initially purchased this item for my daughter as a birthday present. But after opening up the box and seeing the packaging, I was tempted to use it for myself. So I did. Holy cow! What an incredible machine! I quite literally put in a beet, two kiwis, a banana, a couple celery stocks in a little bit of monk fruit. Within seconds, I had an amazing purple delicious drink. Sadly, my daughter's not going to be getting this for her birthday! Happy birthday to me, I guess it's mine now! 🙂 I would definitely recommend this product.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Great juicer, slight pain to clean",
    "rating": "5.0 out of 5 stars",
    "content": "This is my second cold press juicer. I previously had a small one from the Dash brand, but it always clogged and took a long time to extract juice. To use the old juicer, I had to cut the fruits into small pieces, and even then, it clogged. I'm really happy with my new purchase because the juicer has a wide mouth, allowing me to add whole fruits without cutting them, and it doesn't clog. I'm very satisfied with this purchase,less time spent cleaning clogs and more time enjoying the juice.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve been using this cold press juicer for a while now, and overall, it works great. The juice quality is excellent, smooth, and rich in flavor. However, one downside is that despite the images online, it doesn’t take full apples—you have to cut them into smaller pieces first. Also, closing the juicer can be a bit tricky at times, but once you get the hang of it, it’s not too much of an issue. If you’re looking for high-quality juice, it’s a solid choice with a couple of minor inconveniences.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "I was dubious but....",
    "rating": "5.0 out of 5 stars",
    "content": "This was recommended to me by my friend. She praised how good of a juicer it was and she was not wrong. I love how the spiral has no blades at all and still juiced so good. Love the ease of cleaning and how well it juices. Perfect for my family of four. I’ve put in carrots, beets, celery’s, oranges, it works on any fruits and vegetables.",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I found this amazing juicer that I was looking for. It separates all the trash and juice in 2 different bowls which makes it so much easier for use. I had to strain my juices with my previous juicer and also didn’t get a fine juice. But with this juicer, the juice comes out very fine and will not require any straining. Perfect juicer and very compact on size as it doesn’t take too much space to store. Absolutely an amazing juicer.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Clogged free",
    "rating": "4.0 out of 5 stars",
    "content": "This item is one of the best I Purchased but for me, unfortunately cleaning it was just too much. I understand the pug clogs it I get that but the little hard to reach spaces is what did it for me but it’s a great product.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have never used a cold press juicer before so I didn't want to spend a lot of money on something I wasn't sure that I'd use. I have a regular juicer and understand that it \"kills\" some of the healthy benefits of the juice by warming it up. The cold press juicer goes much slower when juicing and the pulp is actually very, very dry unlike the normal juicer's pulp.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Juice is ok...",
    "rating": "4.0 out of 5 stars",
    "content": "Very easy to clean..  But I was expecting the pulp to be dryer than it came out.  It dosen't process the fruits and vegetales when it remaches the bottom.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought a juicer and make juice every day. My favorite juice is carrot juice. A couple of times, I tried making mango juice, and it’s really delicious. I recommend trying it. Just make sure to remove the pit from the fruit. The machine works well. My husband and I love drinking juice, and when guests come over, we always treat them to a tasty drink.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "My favorite juice is carrot",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer has exceeded my expectations! It’s incredibly easy to use and extracts juice quickly with minimal effort. The juice yield is impressive, leaving very dry pulp behind, which means it’s efficient at getting the most out of fruits and vegetables. It’s also easy to clean, with detachable parts that rinse off easily. The motor is powerful but runs quietly, making it a great addition to my kitchen. Overall, it’s a high-quality product that I highly recommend for anyone looking to make fresh, healthy juices at home.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is a game-changer! It quickly extracts juice while leaving the pulp dry, so you know you’re getting the most out of your fruits and veggies. Cleanup is easy, and the machine is surprisingly quiet for how powerful it is. Overall, it’s a must-have for anyone serious about fresh juice at home.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Highly recommend this juicer",
    "rating": "5.0 out of 5 stars",
    "content": "This Cold Press Juicer is a fantastic buy!  large feed chute allows me to juice most of fruits and veggies without the need for chopping too much, saving tons of time. It's powerful, easy to clean, and preserves the nutrients well with its slow masticating process.  Highly recommended for anyone serious about juicing!",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The machine is very easy to use. It is easy to install when assembled. It is easy to use and powerful enough to make delicious juice from fresh fruits and even vegetables. Works great and is very easy to use and clean!!!! Definitely recommend.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Good juicer 👍🏼",
    "rating": "5.0 out of 5 stars",
    "content": "I’m in absolutely love with this product since the time I have got it. It’s definitely value for money and speed it also good not super slow. It feels durable. Cleaning can be mess if not done properly but I’m using my dishwasher to clean it and it’s getting the job done. So far so good.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Nice product... juice extraction is great... kinda noisy. All in all I like this juicer.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "**5-Star Review: Excellent Juicer for Quick, Nutritious Juice**",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is efficient, easy to clean, and versatile, handling everything from hard veggies to leafy greens. Its compact, durable design makes it a great kitchen addition, and the quiet operation is a bonus. Perfect for anyone serious about fresh, nutrient-rich juices. This is the 4th juicer I've had, but my favorite so far.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is very quiet, and it is easy to use to drinks with fruits with a lot of juice. You can also make some cooked vegetables into juice. It is small and easy to carry, which makes it convenient.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Convenient and Efficient Juicer for Daily Use",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is incredibly easy to use! The wide feed chute saves a lot of time since you can put in whole fruits and vegetables without the need for pre-cutting. The operation is simple and doesn’t require much effort, and cleaning is quick and easy—just 2-3 minutes, and you're done. It doesn’t take up much counter space and delivers fresh, healthy juice every day without any hassle.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My wife and I as first time juicers we did not know what to expect but this juicer has exceeded our expectations. It’s super easy to use and very affordable, making it perfect for beginners like us. The set up was very straightforward. It took just a few minutes we put it together and we were ready to juice right away, it handled the fruits and vegetables very well and as you can see in the video we were able to make a fresh healthy glass of juice with barely any hassle. Cleanup is also very quick. You simply take it apart rinse and wash it just like you do with your regular dishes. I consider this a budget-friendly beginner juicer in my opinion when compared to some of the other very expensive juicers that I’ve seen. This juicer simply gets the job done. We are small family trying to be a bit more health conscious and so this was a no brainer addition to our kitchen. Easily a 5 out of 5 stars from us for price and quality performance and ease of using without prior experience.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Very nice juicer, we are super impressed",
    "rating": "5.0 out of 5 stars",
    "content": "Decider to upgrade from old type Cold Press Juicer (horizontal one) . I compared juice amount , which almost the same , but one thing improved a lot - is less hassle, no need to cut fruits anymore , it’s bit faster too . Also I like vertical design better, takes less space, easy to clean.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm really happy with this cold press juicer.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "New Juicer",
    "rating": "3.0 out of 5 stars",
    "content": "It's amazing how it can handle whole fruits and vegetables so easily. There's no need to cut them into small pieces first, which saves a lot of time and effort.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Cleaning it is also a breeze. After juicing, I can quickly clean it up without much hassle.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Convenient for Home Juicing",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer has made making fresh, healthy juices at home so much more convenient.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was really excited to receive this juicer.  I did quite a bit of research and found that this one appeared to suit me best.  However, upon its use, I found the following potentially disqualifying elements:",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "STILL TORN",
    "rating": "5.0 out of 5 stars",
    "content": "1.  Very slow juice straining",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "2.  The grinding section has an arrow that suggests it can lock to the feeder.  Repeated attempts to lock the two  parts proved impossible.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Fohere Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "Set up was quick and very easy. My husband was amused that there are suction cups on the bottom of the unit. When he turned it on and saw how powerful it is, he understood that they were necessary to keep it in place! I am impressed with the quality and speed of this juicer, and was happy with how much juice it extracted from the fruit. I think it will be very useful on our journey to a healthier life.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have had juicer before from Hamilton beach but the quality was not that great plus it was making very loud noise. This juicer is easy to assembly and very less noise. It is easy to clean as well. The juice extracted from this juicer tastes very well.  I have been using this for more than a week now and me and my family really loved it.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Excellent cold press juicer",
    "rating": "5.0 out of 5 stars",
    "content": "It properly juices however it is a bit slower than my previous one. It looks sleek on my countertop which i like. The juice came out very smooth with minimal pulp, tasted amazing.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this juicer! It's super easy to use and clean, making fresh juice a part of my daily routine. The juice comes out smooth, with no pulp clogging the machine. Perfect for anyone who wants a hassle-free juicing experience!",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Good juicer!",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is very good. It can squeeze out all the juice from the fruit. I now squeeze a glass of fresh juice every day. My children also like it very much. It is also very easy to install and clean.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My wife wanted this so bad and we decided to buy it few weeks ago and it became our new favorite and we’re are having a good time with it.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Easy to Use",
    "rating": "5.0 out of 5 stars",
    "content": "We have made pineapple, melon, apple, watermelon, mango and strawberry juice and it’s amazing, very simple to use and clean.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The functionality of it is very simple but the efficiency Is something that cannot be doubted and the juices taste so good!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "CANOLY Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "I'm glad I bought this. This is my first time buying a juicer, and this product did not disappoint me. This actually exceeded my expectations. I tried various fruits and was very satisfied with the results. It squeezes most fruits very well, and the flesh feels almost dry to the touch. Some fruits usually do not juice well, such as cucumbers, mangoes, kiwis, etc. Due to the nature of fruits, they will juice, but the flesh is still very mushy. I have read this article online, but I still tried it. I still get juice from them, but not as much as I get from things like apples. It's great to be able to drink so much natural fruit juice.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This juicer is easy to use, efficient and produces a good amount of juice. Minimal waste. It's also surprisingly quiet which is a huge plus. Very easy to use and clean and easy to dip into my work lifestyle. Highly recommended for anyone looking to upgrade their juicing skills. I have no problem juicing even fiber content veggies, and the resulting juices are always smooth and delicious. It's worth every penny and I have my daily dose of health and flavor to thank me for it.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "This is Awesome!!!",
    "rating": "5.0 out of 5 stars",
    "content": "As a fan of fresh pressed juice, I was excited to try out this cold press juicer. It's been a game changer for making my own carrot juice. The juicer is easy to assemble and clean, and it produces a high yield of pulp free juice. I appreciate the durable build quality. It's definitely a worthwhile investment for anyone looking to lead a healthier lifestyle.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I found this juicer to be very easy to use, which is a big plus for someone like me who doesn't know much about electronics. Setup was easy and within minutes of opening the package I was able to start juicing. The juicing is fast, which is great for busy mornings where every second counts. I was impressed with how efficiently it juiced from fruits and vegetables, giving me a fresh, nutrient-dense drink in no time at all.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Awesome!",
    "rating": "5.0 out of 5 stars",
    "content": "My son loves this juicer! He uses it every morning! He hasn't complained of and clogging, or high pulp content. He loves that it's easy to use and that it is easy to store.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very good juicer, very simple to install, easy to clean, slag and juice are separated into two mouths, and fruits and vegetables are automatically squeezed in. You only need to wait for a moment next to it, and the fruit and vegetable juice will be fine.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "My son loves it!",
    "rating": "5.0 out of 5 stars",
    "content": "I have a very old juicer that I bought a long time ago. It was time to upgrade so I bought these. I really like this juicer. It is easy to use, quiet and looks great on the counter! Cleanup is also very easy. There is almost no juice in the pulp. I love it! It's the best. For the price, I can't believe how well it works. Seriously. So far so good. Juicing with my kids. Super easy. Really enjoying using it!",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered this one because of the high sales ranking and good reviews from customers, and used it few times. It’s very easy to assemble, less than two minutes the machine is ready for processing the juice. Also, with the  larger container capacity , I can add most if whole fruits directly, saving time to cut them. The quality of the juice it processed is amazing , tasty and less pulp. The machine rotates strong and looks very durable. Will keep using it for our daily nutrition intake!",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Easy to use",
    "rating": "4.0 out of 5 stars",
    "content": "Works really well! Ultimately happy with the purchase.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Only reason I’m giving it four stars is because cleaning it is a beast. Lots of produce debris gets stuck in very tiny holes and crevices. I have to use a toothpick in areas and squeeze my fingers through gaps to scrape off some sections. I’d probably use it a lot more if it was easier to clean.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Use it!",
    "rating": "5.0 out of 5 stars",
    "content": "I like this juicer because of its size and power. It is compact enough to be placed on the counter, but powerful enough to handle hard vegetables such as beets, carrots, and radishes. I have tried another more expensive juicer, but I don't like the amount of pulp in the juice, and there is still a lot of juice left in the machine. This juicer is well made and relatively easy to clean. Cleaning the screen takes a few minutes, but the rest is easy to rinse. Very good",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "works very well, I tried to make juice and I am really satisfied because the result is very soft besides this juicer is very easy to use I really recommend it",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Great cup size",
    "rating": "4.0 out of 5 stars",
    "content": "I like that it doesn't waste juice like one I had previously bought.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There was quite a bit of pulp in my apple/carrot juice. But I can live with that.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Very efficient",
    "rating": "5.0 out of 5 stars",
    "content": "The juice is very mild, retains the essence of fruits and vegetables, and is rich in nutrition. It is much better than before! Very satisfied! The material is very good and easy to clean. I hope it can be used for a longer time!",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Getting a new juicer as the old one stops working, this one is pretty good, tried apple and banana. It works great and is convenience. I like it.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Good",
    "rating": "5.0 out of 5 stars",
    "content": "By far, this juicer is the best juicer I have ever owned. The juice is smooth and thick, and looking at the pulp, I feel like I've made all the juice I can. It is very simple to use and surprisingly easy to clean. Great value for money. Customer service is great too, second to none. I am a very satisfied customer.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I was looking for a way to make our mornings easier, and this Cold Press Juicer did the trick. The 5.4\" chute lets me juice whole produce without fuss, and the 350W motor works quietly in the background. The slow masticating design produces flavorful juice, and it’s easy to clean up. My family loves it!",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Staying healthy",
    "rating": "5.0 out of 5 stars",
    "content": "I have mix feelings about this juicer,",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The pulp dryness is good, the power is also decent, it is very loud to the point that I can't use it too early in the morning.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Quick, Delicious, and Easy",
    "rating": "5.0 out of 5 stars",
    "content": "It claims that's easy to clean but it is not, the pulp tend to clog the filtering unit and it is really hard to get the pulp out of it because the area is very small.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The two cups to hold the juice and the pulp are way too tiny.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Ideal for Busy Families",
    "rating": "5.0 out of 5 stars",
    "content": "I got this Cold Press Juicer to simplify my juice routine, and it’s been amazing. The large chute means less prep time, and the 350W motor handles everything effortlessly. The slow masticating feature ensures I get the most out of my fruits and veggies. Plus, it’s a breeze to clean—perfect for a busy lifestyle!",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This cold press juicer is fantastic! It’s super easy to use and extracts a high amount of juice from fruits and veggies with minimal pulp. The juice tastes fresh and stays good for a couple of days in the fridge. Cleaning is a breeze, and the compact design fits nicely on my counter. Highly recommend for anyone looking to make fresh juice at home!",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Great Cold Press Juicer!",
    "rating": "5.0 out of 5 stars",
    "content": "It works better than expected. It extracts “hard” vegetables and separates the juice from the pulp. Cleanup is easy and quick. It looks great and blends in with our kitchen appliances. I am very happy with it. Great product at a good price and it works very well! The product is well made, super easy to clean, and super cute!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this gift for my family, with more fruits than they know what to do. This device runs quite quietly, has enough power, won't make a mess, and is easy to clean afterwards, not to mention the delicious taste of fresh juice. In summary, if you have your own fruit tree, it is definitely an interesting appliance and a must-have",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Great value purchase!",
    "rating": "5.0 out of 5 stars",
    "content": "The wide chute makes it so much easier to juice fruits and vegetables without having to spend time cutting them up. The large capacity is also perfect for making enough juice for the whole family in one go. What I really appreciate is how easy it is to assemble and clean. The design is straightforward, and it doesn’t take long to get everything washed and ready for the next use. Overall, I’m very happy with this juicer and would definitely recommend it to others.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a high quality device that is built to last. It is very easy to use and clean up is a breeze. This juicer is excellent in every way. It has revolutionized my health habits! It's a great value for money value buy and I love it!",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Happy shopping experience",
    "rating": "5.0 out of 5 stars",
    "content": "We just received this today, we went in our yard and collected apples and pears to try it out. It's really fun! Two smallish apples made about half a cup of juice, it taste like cider, really good. Overall, seems great... Time will tell on it's longevity.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Product leaves very little to the need to rejuice after the initial juicing process. Juicing process is slow which lends itself to the overall juicing process which allows the juicing pulp to be dry once process is complete. Very efficient! Love it! Bought one for myself and a friend!",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Easy to use and powerful too.",
    "rating": "3.0 out of 5 stars",
    "content": "I like the look and size of the machine and how easy it is to clean, but not sure if the basket container is supposed to move while it is juicing the produce.  I have checked and doubled check that all the parts are attached correctly.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Not sure if the white tab where the handle slides over is supposed to come up or stay down.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Great juicer!",
    "rating": "5.0 out of 5 stars",
    "content": "Great juicer that has the ability to open the top to load more contents in i stead of the small hole! Easy to clean and works great. Happy i upgraded.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It was a pleasant surprise to receive the goods ，Good machine, small noise, large capacity, easy to clean, good juicing effect。",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "It was a pleasant surprise to receive the goods",
    "rating": "5.0 out of 5 stars",
    "content": "Over the weekend, I made some juice in my juicer and stored it in the fridge for the first time. This is a big advantage for someone like me who doesn't know much about electronics. It juices quickly and cleans up quickly. The best part is the price I paid for the juicer and the amount of juice I get out of it. I love it! I would recommend it.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's not bulky, easy to use, easy to clean, and the juice tastes excellent and rich Great juicer! Definitely gets all the liquid out. Love how I can just drop chunks in and let the machine do all the work. So easy to assemble, disassemb",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Advantage.",
    "rating": "5.0 out of 5 stars",
    "content": "and fast.I found it easy to clean, the cleaning tool included helped in the clean up process.I love the size, it fits perfectly on my counter, not taking up too much space.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What a pleasure to make juiced vegetables & fruits. It's easy to assemble, take apart, and clean. Food quickly goes through the crushing & straining. Juice is fresh with little foam & fiber.Honestly, this is one of the best juicers so far I’ve tried",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Works well, but a lot of inaccuracies in the listing",
    "rating": "5.0 out of 5 stars",
    "content": "We are very glad for this purchase. Very efficient to use it make fresh apple juice and corn juice we just love it.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This machine is easy to use and produces fresh juice. Cleaning is also easy! Good to have it in the kitchen",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Nice juicer",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is fantastic. It's very easy to use, comes with all the instructions, and it doesn't make the noise that juicers usually make. And it produces tons of clear juice. The pulp is almost dry! No waste here.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Rave reviews! The delivery speed is very fast, the packaging is also very careful, and the customer service is also fast and the attitude is good. The most important thing is that the quality of the goods is very good, 100% genuine, can withstand inspection, is a good business, worth buying! Good reviews! !",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Super bueno les recomiendo",
    "rating": "5.0 out of 5 stars",
    "content": "I like a lot this machineWe started make kale + carrot juice with this juicer.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Produced very delicious healthy green juice that our family enjoy everyday.This is a wonderful juicer.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Great juicer.",
    "rating": "5.0 out of 5 stars",
    "content": "This machine does a great job of really getting every drop of juice out of the fruit and separating the pulp from the juice. The machine is not too noisy, easy to clean and makes great juice! It's a great tool to help improve your health!",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Definitely  less pulp than I've seen with any other juicers so it's worth the money! Put apple halves in And it juiced with no problem. No leaking either so far. Not super noisy but not quiet.... Try this out!",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Honest review",
    "rating": "5.0 out of 5 stars",
    "content": "The juicer is easy to assemble and use! It’s definitely good quality as well. Ever since I got it I’ve been making my own veggie juice daily, much better and healthier than store bought ones. Recommend if you also like drinking juice",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It works well us expected. Extraction of juice is perfect.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Good juicer！",
    "rating": "5.0 out of 5 stars",
    "content": "Received the package, immediately open to use, recently every day to drink celery and cucumber juice, the original juicer knife is not sharp, it is not so easy to use, and then saw this juicer, attracted by its appearance, immediately decisive order! As soon as you receive the goods to use, really is my favorite, it has no noise, do not need to press the button all the time, very convenient, cut well so things put in all at once, the key he is particularly good to clean, a wash clean. Push it. That's really great",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": ". Compact and easy to use. This is a great juicer for those who need a powerful cold press. Cleanup is a breeze, easy to disassemble, and highly recommended.I’m really trying to have a healthier lifestyle.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Nice juicer",
    "rating": "5.0 out of 5 stars",
    "content": "Read many juicer reviews and decided to buy this one, great thing to own. Separates peels and juices extremely well. Good quality, soft greens like spinach and kale are easily pulverized and juiced, powerful and durable. Sturdy construction and quality materials ensure stability and reliability during operation for a smooth and quiet juicing experience. Cleanup is a breeze.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0CYB7NS67"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is exactly what I was looking for. It makes fresh delicious juices and my daughter loves to be apart of the process. It’s an easy clean! I’m very happy with it!",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0CYB7NS67"
},
]