[
{
    "name": "        iDPRT Label Maker, Thermal Barcode Printer with No Bound Consumables, Bluetooth & USB Connection, 140pcs/min Speed, Customizable App, Supports Various Sized 1\"-3.15\", Label Printer for Small Business       ",
    "stars": [
        "59%",
        "13%",
        "9%",
        "7%",
        "11%"
    ],
    "pid": "B0CYKWH4Q4",
    "ratings": "130 ratings",
    "other_info": {
        "Brand": "iDPRT",
        "Connectivity Technology": "Bluetooth, USB",
        "Printing Technology": "Thermal",
        "Special Feature": "Portable, Bluetooth",
        "Color": "Black",
        "Model Name": "SP320 Black",
        "Printer Output": "Monochrome",
        "Max Printspeed Monochrome": "140 ppm",
        "Product Dimensions": "8.11\"D x 6.1\"W x 5.28\"H",
        "Controller Type": "Android"
    },
    "discount_price": "$ 75.",
    "normal_price": "$179.99",
    "about_this_item": [
        " [300% Cost-Saving Freedom: No Bound Consumables] Experience the cost-saving freedom of our label maker, which eliminates the need for bound consumables. This label maker allows you to use printer paper from any brand available on the website (for thermal paper of suitable size only). Say goodbye to expensive proprietary label paper and embrace the flexibility of choosing affordable options. With this label maker, you can save up to 300% compared to others.  ",
        " [Two Connection Options & Seamless Connectivity] Experience unparalleled convenience with our barcode printer's versatile connectivity options. Seamlessly connect via Bluetooth or USB and unleash the power of printing from any device. Effortlessly print directly from your phone using our intuitive app, designed for easy operation and maximum flexibility. Whether you're on the go or at your desk, our barcode printer enables you to complete your personal tasks with ease and efficiency.  ",
        " [Unmatched Speed & Efficiency] Experience unparalleled speed and efficiency with our address label printer, surpassing competitors in the race for fast label printing. With a fast printing speed of 140pcs/min, our address label printer excels in handling large-scale printing tasks with ease. Whether you're printing a batch of address labels or embarking on a mass labeling project, our address label printer delivers unmatched performance, ensuring you achieve your goals quickly and effortlessly.  ",
        " [Versatile Labeling] From address labels to barcodes, this barcode label printer supports various sized labels, enabling you to label file folders, storage boxes, and more. Provide a polished look to your packages with address labels, streamline your inventory management with barcode labels, or add a personal touch to gift tags and party favors. Whether you're in the workplace or home, our barcode label maker ensures professional labeling in every scenario.  ",
        " [Customizable Labels] Unleash your creativity and make your labels unique with our label printer for small business's complimentary editing tools(\"Herelabel\" for macOS and Android, and \"Label Designer\" for PC). Customize your labels with different fonts, graphics, and layouts, all tailored to your preferences. Whether you're adding a personal touch or aligning with your brand, you can use our label printer for small business to print customized labels to stand out from the crowd and leave a lasting impression.  ",
        " [Perfect Gifts & Customer Service] The perfect gifts for Christmas' Day, New Year, Birthdays, Father's Day and more. Shop with confidence as we have excellent customer service team for you. Please feel free to contact us via Amazon if you have any problems before and after sales. We are ready to serve you at any time.  "
    ]
},
{
    "title": "Label Genius",
    "rating": "5.0 out of 5 stars",
    "content": "This Bluetooth thermal label printer has been a game-changer in my home office, offering seamless connectivity and the ability to print various sized labels with ease; it's compact yet powerful, fitting perfectly on my desk without taking up much space. The setup was straightforward, and I was printing labels from my smartphone in minutes. What I appreciate most is its versatility – whether I need small address labels or large shipping labels, the quality and clarity are consistently excellent, saving me time and ensuring my packages look professional every time. The thermal printing means no more messy ink cartridges, making it an eco-friendly choice too.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Great printer once you get it set up",
    "rating": "3.0 out of 5 stars",
    "content": "Reviewing iDPRT Label Maker - 3 inch I have a few thermal printers, for different purposes. One thing the others don’t do is print barcode sized labels. That’s the purpose of this printer, for me. I need to print barcodes for inventory labels. The printer is perfectly suited to this purpose. It prints fast, has adequate quality and is easy to use once it’s set up.",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Versatile and Easy to Use!",
    "rating": "5.0 out of 5 stars",
    "content": "The printer is a bit of a paradox though. I got it to work on my Windows PC with no issues, and was able to download the software for it also, however, that’s because I’m in the tech industry. The instructions are not helpful and this is not suitable for someone who doesn’t have tech skills.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Fast printer, but font can't be small",
    "rating": "4.0 out of 5 stars",
    "content": "I need a versatile yet simple-to-use receipt printer for my business. This model from iDPRT is perfect as it works for me now, and is scaleable enough to expand as my business grows. It can connect to either WINDOWS, MAC, or LINUX systems, and has dual output capabilities with both USB and LAN cabling. While Bluetooth is easy and convenient, it lacks the security and reliability that cabling devices bring.",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Great thermal printer for home use",
    "rating": "5.0 out of 5 stars",
    "content": "What I really found special about this printer is that it will work with paper sizes from 1\"-3.15\", and is not proprietary. I can find the best price, and buy in bulk, and when I need more, I can just go to AMAZON and search for the best bargain.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Label printer for windows",
    "rating": "5.0 out of 5 stars",
    "content": "I use labels on my products in my mini-warehouse, and now instead of writing them out by hand, I can print all of the labels at once from my PC. Included with the printer is the free Label Designer software that can even be used to design circle labels.",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Great",
    "rating": "5.0 out of 5 stars",
    "content": "With the dual connect capability I can have both USB direct from my PC and LAN connectivity so that any device in my network can connect and use the printer. This affords me the scalability to keep using this printer as my business grows.",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "High maintenance, app is difficult to work with...",
    "rating": "3.0 out of 5 stars",
    "content": "OVERALL - Simple to use, versatile, and scaleable. Keeper!",
    "post_time": "Reviewed in the United States on April 3, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "an easy to use small printer, makes clear labels",
    "rating": "4.0 out of 5 stars",
    "content": "The printer comes with everything you need except the labels it comes with 1\"x3\" is a VERY small roll.  Next it comes with a CD, but majority of the PCs now do not have CDrom drives, but you can go to their website and download all the software.  The two you need is the driver (if using a PC) and the \"Label Designer\".  The printer was easy to setup and the software is very easy to use.  I tested both PC and Bluetooth.  Printing from my iPhone seemed to produce clearer prints.  Small fonts weren't that clear, but it seems to work fine with generic thermal labels!  Decent FAST thermal printer",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "perfect for warehouses",
    "rating": "5.0 out of 5 stars",
    "content": "It truly is a great little printer for home/home office use.  It may be good for smaller offices too, but I have no way of gauging that.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Looks great",
    "rating": "5.0 out of 5 stars",
    "content": "Good looking thermal printer. Large enough to get almost any job done. It was really easy to setup. The print quality is good and the text legible.",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Nice Label Maker",
    "rating": "5.0 out of 5 stars",
    "content": "This is a nice label maker. It seems like it should function fine for light use, and comes well packaged. It prints a variety of label types, and considering the quality and price, I think this is a good product.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Very Efficient Organization.",
    "rating": "5.0 out of 5 stars",
    "content": "This is a standout choice in terms of label makers. One of the most significant advantages of this label maker is its ability to use thermal paper from any brand, which is a huge cost-saver. I cannot overstate the convenience and cost effectiveness of this feature alone! Also, the dual connection options, including Bluetooth and USB, provide flexibility to print from virtually any device. I can use my smartphone or my office printer, and setting it up is straightforward and hassle-free no matter where I am. The intuitive app enhances this process, making it quick and easy to print labels. The ability to support various label sizes adds to its versatility. I’ve used it for everything from labeling file folders and storage boxes to creating custom barcodes for my small business backstock inventory. It's been a great help, highly recommend!",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Nice printer",
    "rating": "5.0 out of 5 stars",
    "content": "I have a coupe printers that are similar to this. From them, this one actually comes out on top. The fact that it takes most any thermal paper out there is awesome. Hooks up and installs very easily, you don’t have to do much. Just install the app on your phone or pad and away you go. It’s also fast, that 140pcs a min is insane when you look at it. It takes on any label job i throw at it. Highly recommended",
    "post_time": "Reviewed in the United States on May 2, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Very neat, solid printer for labels",
    "rating": "5.0 out of 5 stars",
    "content": "This is a very solid, well made printer, it's a bit bigger than many thermal printer models so you'll need to make more desk space. But you can tell it's a hefty frame that will last a lot of work. It came with a CD, so you don't need to download a driver online, though the instructions did say where you can if you want to. Once the software was setup, this began to print very cleanly and quickly. You can even adjust the printing speeds, though it's pretty fast that I don't know if you'd need it faster. Maybe for very big businesses. This should have no problem keeping up with those, and for small businesses, more than sufficient. It came with a roll of labels so you can test it out, but as it's a small sample, you'll need to have your own on hand. Luckily I did, and was pleased to be able to use them finally. The print quality is good, and you'll have professional looking labels.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Perfect label maker for small businesses and personal use!!",
    "rating": "5.0 out of 5 stars",
    "content": "I wanted a small label maker for my business but didn't want to spend a ton of money nor get something that was to large for my home office. This label maker was the perfect find for me!! It is compact, easy to use, sets up simply and fits on my computer stand to stay out of the way until I need it.",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Very fast",
    "rating": "5.0 out of 5 stars",
    "content": "It took me a minute to get this set up on my Mac.  What I learned is that even though it automatically detects the lights will flash when sending. a print job with the detected driver, nothing will come out.  This was very confusing because everyone on the Mac side looked fine.  After installing the driver and then adding the printer again using the new print driver I was able to print immediately.  The printing was incredibly fast ass it spits out my small labels in less than a second.  The paper loading and aligning was very straightforward, but I ran into an issue with how the printer detected my label position.  It would print off-center every time, and there was no way to calibrate the starting point.  I was able to make a template to adjust for the offset, but I wish I could specify this somewhere else.  Other than this issue, the printer is very nice.  I used the USB cable, which was USB 2.0 A to B.  The included USB-C adapter is a nice addition.  Overall, a very nice a quick printer with good print quality.",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Nice Little Printer",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this so I could have a nice thermal printer for my packages when I am on the road. This unit is well made and prints perfectly.",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Very nice label maker",
    "rating": "5.0 out of 5 stars",
    "content": "The labels are self sticking and work really well and it prints barcodes perfectly so they are easily scannable by UPS, FedEx, or USPS.",
    "post_time": "Reviewed in the United States on May 5, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Fast setup.",
    "rating": "5.0 out of 5 stars",
    "content": "This label maker is very easy to use. It has great quality prints. I like that everything it prints comes out great and readable. The machine it self is a good size that makes it portable. I like how the machine looks as well very slick and made perfectly.",
    "post_time": "Reviewed in the United States on April 29, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Nice label maker",
    "rating": "5.0 out of 5 stars",
    "content": "I like the ease of use for this machine, but I wish I could make 4x6 shipping labels for how large this machine is. Works great, easy to use if you are familiar with PCs and tech software etc...",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Cannot Get it to Work - S/W Sucks",
    "rating": "2.0 out of 5 stars",
    "content": "This is perfect for product labeling, organizing, logistics, that kind of stuff. If youre wanting shipping labels, this probably isnt the best choice.",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Solid high speed label printer with near-commercial quality",
    "rating": "5.0 out of 5 stars",
    "content": "Otherwise, its a great quality label maker!",
    "post_time": "Reviewed in the United States on April 26, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "iDPRT SP320E Label Maker: Cost-Saving, Versatile Thermal Printer for Businesses and Homes",
    "rating": "5.0 out of 5 stars",
    "content": "The people who designed the hardware appear to have done a good job.  The people who created the software to use with printer did a horrible job - does not work with my mac - that the software absolutely sucks.  I could not get it to work.  I have seen someone reference online that Bluetooth does not work for Mac - only through a USB cable.  When I have some free time I may try again to connect to it my mac but it's so frustrating to have to figure all of this out.",
    "post_time": "Reviewed in the United States on March 31, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Great printer for labels",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great label printer at a good price. It works really well and has fast output.",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Very fast and easy phone app to use",
    "rating": "5.0 out of 5 stars",
    "content": "Since it uses conventional thermal labels, you don't need ink or other refills - just the thermal labels, which are easy to obtain.",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Thermal Label Printer! I'm All In!!!",
    "rating": "5.0 out of 5 stars",
    "content": "Setting this up is pretty easy if you have reasonable patience. You can use a direct cable for a USB connection, or bluetooth if you prefer.",
    "post_time": "Reviewed in the United States on April 17, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "3 in. Thermal printer",
    "rating": "5.0 out of 5 stars",
    "content": "Print quality is great. It is clear and crisp. You can use this with various label sizes, as long as they are within the range that the printer supports (1\"-3.15\").",
    "post_time": "Reviewed in the United States on April 17, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Good quality, love not messing with inks",
    "rating": "5.0 out of 5 stars",
    "content": "This printer is a real workhorse, and if you find yourself needing to print a bunch of good quality labels fast, this is up to the task.",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Very easy to setup, auto align, capable of small font print.",
    "rating": "5.0 out of 5 stars",
    "content": "Definitely recommended!",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "On a Mac it's a pain",
    "rating": "2.0 out of 5 stars",
    "content": "At first it seemed very promising what I took out of the box. Then it started with no software (besides a driver) for Mac. You can only use an online version for which you have to create an account etc. The worst part was the try and error of getting something properly printed out ... and it didn't work no matter what I tried. And then a whole lot of fonts with names in Chinese Han characters. And the various label formats more confusing than simple and clear. Disappointed with this thing. Perhaps great on Windows?",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "versatile, and pretty quick thermal printer",
    "rating": "5.0 out of 5 stars",
    "content": "we print a lot of labels at work for files and other things, and really needed a thermal label printer that could handle our volume. This unit is well-built, accepts a variety of sizes of labels, and is pretty quick in getting them printed. It runs quiet and so far has printed two full rolls of labels with no problems.",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Setup was quick",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to setup and start printing from the phone.",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Networkable!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I have another similar (but not comparable) thermal printer that connects via bluetooth to my phone, which is fine if you doing one label, however, this thermal printer can be connected to your laptop via a usb and works for both my Mac and Windows PC, but better than that you can connect to your router and print from any of your connected machines. Does barcodes and QR codes, very versatile. A quality device, a must have for every office or warehouse, but also great for the home too to help you organize.Thrilled with this device. Fast shipping",
    "post_time": "Reviewed in the United States on March 30, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Efficient Printing Solution for Any Business",
    "rating": "5.0 out of 5 stars",
    "content": "In the world of business, efficiency is key, and the Thermal Barcode Printer with No Bound Consumables delivers just that. This printer has been a game-changer for my small business, streamlining our labeling process without the hassle of constantly replenishing consumables.",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Works Great1",
    "rating": "5.0 out of 5 stars",
    "content": "First off, setup was a breeze. Within minutes, I had the printer up and running, ready to tackle our labeling needs. The print quality is impressive, producing clear and crisp barcodes every time. Plus, the thermal printing technology means we don't have to deal with messy ink cartridges or toner replacements.",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "printer",
    "rating": "5.0 out of 5 stars",
    "content": "One of the standout features is the lack of consumables. No more worrying about running out of ink or labels at the worst possible moment. This not only saves us time but also eliminates the frustration of interruptions during busy periods.",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "easy and works well",
    "rating": "5.0 out of 5 stars",
    "content": "The printer's compact design is another bonus, taking up minimal space in our office while still delivering professional-grade results. It's reliable too – we've been using it for months without a single issue.",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, the Thermal Barcode Printer with No Bound Consumables has exceeded our expectations. It's reliable, efficient, and has become an indispensable tool in our daily operations. Whether you're a small business or a larger enterprise, I highly recommend this printer for all your labeling needs.",
    "post_time": "Reviewed in the United States on February 10, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "The app takes this over the top",
    "rating": "5.0 out of 5 stars",
    "content": "Works great.",
    "post_time": "Reviewed in the United States on February 10, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Works Well - Lots of Customization Options - App/PC functionality",
    "rating": "5.0 out of 5 stars",
    "content": "Works Well - Pretty intuitive to set up and insert the label roll. The only issue may be installing what is needed for use on PC. Got the driver and label designer from the manufacturer website. After this everything functioned smoothly and the printing was quick, easy, and reliable.",
    "post_time": "Reviewed in the United States on January 2, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Seamless integration",
    "rating": "5.0 out of 5 stars",
    "content": "Lots of customization options - Can change about anything you can think of, add in images, font adjustments, positioning, margins, spacing, etc.",
    "post_time": "Reviewed in the United States on January 26, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Super Fast, Great Quality",
    "rating": "5.0 out of 5 stars",
    "content": "App/PC functionality - Both the app and PC allow the same amount of vast customization. Can also run both at the same time if one wanted to switch back and forth.",
    "post_time": "Reviewed in the United States on December 22, 2023",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Doesn't Have Proper Instructions & Technical Support Contact Information is Invalid",
    "rating": "1.0 out of 5 stars",
    "content": "Good Label Support - Supports many label sizes, however watch the minimum and maximum width and length as stated in the product description. Labels peel off easily and stick on nicely.",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Takes getting used to",
    "rating": "3.0 out of 5 stars",
    "content": "Thermal Printer vs Dedicated Label Maker - They are both good, thermal printers will excel at customization and mass printing, it is also more cost effective in terms of cost per label. However, label makers will do better in terms of quick and easy for fewer labels and portability. So it depends on your use cases.",
    "post_time": "Reviewed in the United States on September 25, 2023",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "A great label printer",
    "rating": "5.0 out of 5 stars",
    "content": "Quick setup with easy phone app. Prints clear labels and quickly!",
    "post_time": "Reviewed in the United States on December 22, 2023",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Includes Ethernet",
    "rating": "5.0 out of 5 stars",
    "content": "I acquired the iDPRT Label Maker and I am absolutely thrilled with its performance. This thermal printer has become an essential tool for me, and here's why it has exceeded my expectations:",
    "post_time": "Reviewed in the United States on April 30, 2023",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Very versatile label printer.",
    "rating": "5.0 out of 5 stars",
    "content": "The fact that the iDPRT Label Maker has no bound consumables is a real plus for us. No more hassles with changing cartridges or dealing with messy ink just to print small labels. It's a cost-effective and environmentally friendly solution. The speed is remarkable speed. It can print 140pcs/min.",
    "post_time": "Reviewed in the United States on April 18, 2023",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Very Useful.",
    "rating": "5.0 out of 5 stars",
    "content": "The inclusion of both Bluetooth and USB connectivity options offers flexibility in how we connect and print, which for me is a nonnegotiable. The customizable app that comes with the iDPRT Label Maker is a standout feature. It allows us creativity when it comes to labels; not just printing text.",
    "post_time": "Reviewed in the United States on March 29, 2023",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "There is a lot to like.",
    "rating": "5.0 out of 5 stars",
    "content": "This label maker has been an invaluable to me. Its speed, connectivity options, and customizable features make it a standout choice for anyone serious about crafts, labeling around the house, or even a small business. I highly recommend the iDPRT Label Maker for anyone seeking efficiency and quality in their labeling tasks.",
    "post_time": "Reviewed in the United States on March 14, 2023",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Worth buying.",
    "rating": "5.0 out of 5 stars",
    "content": "The printer is incredibly easy to set up and use. It supports multi-systems, including Windows, Mac, and Linux, so I was able to get it up and running quickly and easily. Once it was set up, I was able to start printing high-quality labels right away, thanks to its thermal printing technology.",
    "post_time": "Reviewed in the United States on March 30, 2023",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Finally, a thermal printer that works!",
    "rating": "5.0 out of 5 stars",
    "content": "Another great feature of this label maker is its Ethernet and USB connectivity options. I love that I can connect it to my computer using either option, depending on my preferences and needs. This makes it incredibly versatile and convenient to use. Nice product!",
    "post_time": "Reviewed in the United States on April 20, 2023",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "printing is fast,  quality is great.",
    "rating": "5.0 out of 5 stars",
    "content": "I work from my phone, a lot. I like that this thermal printer can work from an app. I am not the most tech savvy person in the world, but I’m not a novice either. I always have difficulty getting the labels to do what I want, and I end up wasting so much time. I mostly need to print sequential barcodes for my products, but it’s so hard to make that happen on other thermal, or regular label printers. It took me less than 5 minutes on this one and I was in business. They have a lot of templates already made for you based on what you want to do, you just edit it to your specifications and off you go. I was really happy with how easy the app was to use. Also, there were no crazy data collections when using the app, making it more secure. I call that a big win!",
    "post_time": "Reviewed in the United States on March 30, 2023",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Awesome!",
    "rating": "5.0 out of 5 stars",
    "content": "We use it to label the items we produced in our lab. It prints fast and the printing quality is great. The software is easy to learn and use.  We are a startup company. We want to save our every penny. This one great choice for us.",
    "post_time": "Reviewed in the United States on April 23, 2023",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Great for small business",
    "rating": "5.0 out of 5 stars",
    "content": "I like this thermal label printer. It is easy to use and works great. High-quality and a great value for the price.",
    "post_time": "Reviewed in the United States on March 18, 2023",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "AWSOME product",
    "rating": "5.0 out of 5 stars",
    "content": "Great for starting a small business",
    "post_time": "Reviewed in the United States on September 13, 2023",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "AWSOME product",
    "post_time": "Reviewed in the United States on April 24, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Thank you for the wonderful product with fast delivery",
    "rating": "5.0 out of 5 stars",
    "content": "Thank you for the wonderful product with fast delivery",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Justo lo que necesitamos para los productos que manejamos.",
    "post_time": "Reviewed in the United States on August 15, 2023",
    "pid": "B0CYKWH4Q4"
},
{
    "title": "Ajustada a nuestra necesidades",
    "rating": "5.0 out of 5 stars",
    "content": "After almost a week or so we’re trying to get it to stay connected. It will not stay connected to my laptop and while I was boxing it back up completely unplugged. The green light on the plug is still on the black plug. I have pictures an I sent one to your technical support team and they wrote back question if I watch the video yes I watch the video. It didn’t show anything. I knew how to put it together and I knew how to get it connected but it doesn’t stay connected to the Wi-Fi or Bluetooth.",
    "post_time": "Reviewed in the United States on April 3, 2023",
    "pid": "B0CYKWH4Q4"
},
]