[
{
    "name": "        VIVOHOME Food Dehydrator Machine, Dehydrator for Food and Jerky, Fruits, Meat, 5 Trays Electric Dryer Dehydrator with 72H Digital Timer and Temperature Control for Veggies, Herbs, Mushroom, Dog Treats       ",
    "stars": [
        "67%",
        "18%",
        "6%",
        "2%",
        "6%"
    ],
    "pid": "B0D1V7L52V",
    "ratings": "1,194 ratings",
    "other_info": {
        "Brand": "VIVOHOME",
        "Material": "Stainless Steel, Acrylonitrile Butadiene Styrene (ABS)",
        "Color": "Silver",
        "Wattage": "240 watts",
        "Product Dimensions": "9.5\"D x 10.3\"W x 7.9\"H"
    },
    "discount_price": "$ 54.",
    "normal_price": "",
    "about_this_item": [
        " HIGH PERFORMANCE: The VIVOHOME Food Dehydrator operates with a powerful motor that ensures efficient drying; With a built-in hot air fan, the dehydrator features a 360° air circulation system, promoting even drying without the need for rotating trays; The adjustable temperature ranges from 95 ℉ to 158 ℉, allowing you to dry a variety of foods perfectly; The transparent design allows you to monitor the drying process without opening the unit  ",
        " LARGE CAPACITY: Equipped with 5 removable and stackable trays, this dehydrator provides ample space for drying large quantities of food at once; Each tray is designed with a spacious 10.3 x 9.5 in surface, accommodating a wide range of foods; The two stacking options allow you to customize different pallet spacing (0.83 in & 1.2 in) based on the food being dehydrated  ",
        " USER-FRIENDLY DESIGN: The VIVOHOME Food Dehydrator features a digital control panel with an easy-to-read LED screen, simplifying the process of setting time and temperature; The timer can be set up to 72 hours, providing flexibility for various drying tasks; The trays are dishwasher safe, making cleanup quick and hassle-free  ",
        " SAFETY AND RELIABILITY: The food dehydrator is designed with an overheat protection system, which will automatically switch on and off to prevent overheating; The non-slip feet keep the dehydrator stable during operation, preventing any accidents; The trays are BPA-free, ensuring the safety of your dried foods; The stainless steel construction and ABS materials allows for long-lasting performance  ",
        " MULTIFUNCTIONAL USES: This dehydrator is perfect for creating healthy snacks such as dried fruits, jerky, and vegetable chips, preserving herbs and flowers, and even making pet treats; The adjustable trays can accommodate different food thicknesses, offering versatility in food preparation; The consistent drying performance helps retain the natural flavors and nutrients of the food; The quiet operation ensures it won't disturb your household activities  "
    ]
},
{
    "title": "Best Beef Jerky Machine",
    "rating": "4.0 out of 5 stars",
    "content": "This thing is great and does exactly what I got it for: Making awesome beef jerky at home for a fraction of what the store bought stuff costs.",
    "post_time": "Reviewed in the United States on April 9, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I was warned away from these types of dehydrators because they often don't have temperature settings but this little guy does, and while it's not a huge range, it has the more important temps for dehydrating foods from \"slow and low\" to surprisingly high.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0D1V7L52V"
},
{
    "title": "Durability",
    "rating": "3.0 out of 5 stars",
    "content": "The only complaint I have is that the recipe book it comes with gives temperatures in Celsius, but the machine only displays in Fahrenheit so some conversion is necessary if you want to try anything out of the recipe book.",
    "post_time": "Reviewed in the United States on April 30, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Returned item did not like tray very hard plastic.Felt poor quality.",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "B0D1V7L52V"
},
{
    "title": "Get a bigger and better brand.",
    "rating": "5.0 out of 5 stars",
    "content": "I don't use this enough that I just missed the return window by a few days.",
    "post_time": "Reviewed in the United States on November 12, 2023",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I regret buying this and wish I had tested out more earlier but didn't have any groceries to dehydrate or the time.",
    "post_time": "Reviewed in the United States on April 4, 2023",
    "pid": "B0D1V7L52V"
},
{
    "title": "Bad temperature controls",
    "rating": "5.0 out of 5 stars",
    "content": "I can't for the life of me get fruit leather to be done.",
    "post_time": "Reviewed in the United States on July 16, 2023",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Everything else has been toasted vs just dehydrated. Brown toasted.",
    "post_time": "Reviewed in the United States on August 4, 2023",
    "pid": "B0D1V7L52V"
},
{
    "title": "Ideal para snack",
    "rating": "4.0 out of 5 stars",
    "content": "The degrees are odd. As in I need 125° and this only has the choice of 122° or 131°.",
    "post_time": "Reviewed in the United States on January 23, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have tried several things and this failed. The ONLY upside is the ability to pause the dehydrator while in use, to change temperature, time or add more.",
    "post_time": "Reviewed in the United States on August 26, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Appears very sturdy and will mode",
    "rating": "5.0 out of 5 stars",
    "content": "One of the better ones that I’ve had, the others have all been plastic",
    "post_time": "Reviewed in the United States on August 31, 2023",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Excited to use!",
    "post_time": "Reviewed in the United States on March 24, 2023",
    "pid": "B0D1V7L52V"
},
{
    "title": "Looks good!",
    "rating": "5.0 out of 5 stars",
    "content": "I love this dehydrator! My parrots are super picky, so I keep trying to find new ways to get them to eat healthy. This machine is compact, easy to use and clean. I made some veggies, apples, and peaches. So far they have loved everything I’ve made ! The apples I made, they ate like chips ! Very satisfied with the product.",
    "post_time": "Reviewed in the United States on September 1, 2019",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It came packed in bubble wrap, and arrived with no scratches. The directions are easy to understand and the machine easy to use. Def recommend it to anyone trying to find new ways to eat healthier or conserve food !",
    "post_time": "Reviewed in the United States on December 10, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Compact and easy to use !",
    "rating": "2.0 out of 5 stars",
    "content": "Love this. Holding up pretty well, just wish I got the bigger one. You can always take treys off. Can’t add treys you don’t have. I make beef jerky on this. It takes about 5 hours on max temp depending on the thickness. Delicious. Even dehydrating. Does it’s job. Easy to clean, love that it compact and just plugs into the wall.",
    "post_time": "Reviewed in the United States on October 25, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Spent extra on this for the stainless steel base and initially was kicking myself for not getting the extra 3 trays.  The product has solid build quality, stainless steel base, good controls, etc.  BUT the trays of fruit I put on the top don't dry at nearly the same rate as the ones on the bottom.  I spaced out my apple slices an appropriate amount but after the timer went off the apples on the bottom tray were becoming dry and brittle while the ones on the top, or 5th tray, were still soft and juicy inside.  I've dried about 5 batches of fruit and always had the same result.  This is not powerful enough for the extra trays.  It's not really powerful enough to consistently heat the 5 trays it comes with.  I was hoping to make beef jerky with this also but doubt its powerful enough to consistently heat it all.  I recommend checking out other dehydrators and making sure they don't suffer the same issue.  It's a shame because the build quality and aesthetics are otherwise great.",
    "post_time": "Reviewed in the United States on January 22, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Get the bigger one!",
    "rating": "5.0 out of 5 stars",
    "content": "This unit works great I would highly recommend it to any one looking for a good Dehydrator its worth the money you won't be disappointed its easy to program the temp and time is's really easy to clean I have ran 5 batches of beef jerky no problem it always starts not like other units that you use one or two times and won't come on again I am really satisfied with this product I would give it a 10 on a 1 to 10 rating.",
    "post_time": "Reviewed in the United States on February 17, 2022",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Simple to use dehydrator with adjustable temperature control and programable timer. Fits together to store in a more low profile way. Doesn't come with tray inserts or mat. Also the temperatures are already programed so spinning the knob only picks between the pre-set temps. About 10 degrees between each step.",
    "post_time": "Reviewed in the United States on August 1, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Great build quality BUT doesn't get warm enough for top trays.",
    "rating": "4.0 out of 5 stars",
    "content": "This machine surprised me as it worked better than I thought is would.  Has much more potential than advertised.  I use it to dry fruits for cocktails and I was able to dip my fruit in simple syrup, tapped dry, make sure they're not dripping, and dried them.  They came out vibrant in color and had a great taste.",
    "post_time": "Reviewed in the United States on August 11, 2019",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It does, what it says it does; it dehydrates food. So far I have made a gallon worth of cucumber chips. It's is easy to set up and use, and it turns off when the timer goes off. However, the top rack of the dehydrator, I wouldn't put any food on there because it needs extra time to dry out.",
    "post_time": "Reviewed in the United States on February 14, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Performance is great for the price point.",
    "rating": "4.0 out of 5 stars",
    "content": "Very happy with it's performance.  Would have given it a 5 star, but not fond of the center hole in the trays.",
    "post_time": "Reviewed in the United States on October 2, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like it. It works well and holds a good amount of product.",
    "post_time": "Reviewed in the United States on February 25, 2023",
    "pid": "B0D1V7L52V"
},
{
    "title": "Works as intended",
    "rating": "5.0 out of 5 stars",
    "content": "Have used several times and works great.",
    "post_time": "Reviewed in the United States on June 18, 2023",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Easy to use and clean. Would be 5 stars if fruit were a little more crisp like when you buy dehydrated fruit in a store. I cut everything very very thin. I'm still pleased though.",
    "post_time": "Reviewed in the United States on September 7, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Works great",
    "rating": "1.0 out of 5 stars",
    "content": "I wish I'd made a better choice.  This machine looks very nice in pictures, but is not so nice in person.  Many, many design flaws. The \"stainless\" is really thin, almost foil.  The trays have lots of raised and protruding bits not shown in the photos that make cutting mats for the trays next to impossible.",
    "post_time": "Reviewed in the United States on May 25, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It dries well enough, and holds a decent amount, but it can't handle very wet foods, because the center hole makes lining with plastic difficult without leaks.  Which would be fine except everything leaks all the way down and the base is impossible to get clean- the motor cover does not come off and nothing diverts all the little drips and bits from getting in- once a cycle is complete, it's stuck on really, really well, and you can't use water or soap, you just have to scrape and pick at it.",
    "post_time": "Reviewed in the United States on November 11, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Pretty nice machine",
    "rating": "5.0 out of 5 stars",
    "content": "The controls are also weird- you have to remember to hit the 'set' button before changing the temp etc., and the temp settings are weirdly arbitrary= I can't set at 130, it must be 131 or 136, everything's odd numbers.",
    "post_time": "Reviewed in the United States on August 2, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First experience with dehydrater, seems to work okay. Bit of a learning curve with thickness of cuts and time involved. I suggest thicker than you think as they get pretty flimsy and see through.",
    "post_time": "Reviewed in the United States on January 17, 2023",
    "pid": "B0D1V7L52V"
},
{
    "title": "Not thrilled, wish i'd picked a different one.",
    "rating": "5.0 out of 5 stars",
    "content": "Works very well. I've been using it to dry mushrooms all the time. Also looks great. A bit noisy though. Not sure if the other dryers also have the same noise issue (it's just the wind noise, not that it's malfunctioning). Would recommend if you need to dry stuff.",
    "post_time": "Reviewed in the United States on April 4, 2023",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Bought it to make beef jerky…. Haven’t tried anything else.  Love it",
    "post_time": "Reviewed in the United States on July 7, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Broke after 1.5 years",
    "rating": "3.0 out of 5 stars",
    "content": "No longer works after 1.5 years. Still blows air, but only cold air.",
    "post_time": "Reviewed in the United States on November 28, 2022",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator works exactly as described. I use it to make meat jerky, and it is easy to use and produces a delicious product. I varied the temperature a little and found the perfect combination for a jerky which is tasty and easy to chew. The dehydrator cleans up easily. I am very pleased with it.easy to use food dehydrator.",
    "post_time": "Reviewed in the United States on December 18, 2019",
    "pid": "B0D1V7L52V"
},
{
    "title": "Easy to use food dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "I used this product to dry my fresh herbs.  Works well.  So much easier and faster than using the oven, or hanging to dry.  Instructions were easy to understand and product was easy to use.  Highly recommend this product if you want to take control of your own health and make your own products with herbs.",
    "post_time": "Reviewed in the United States on August 25, 2019",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have used this product to make Jerky. It works very well and so far I am very happy with it! It is very easy to use and not hard to clean. I have tried a few recipes and they taste great!",
    "post_time": "Reviewed in the United States on July 12, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Works very well for drying fresh herbs",
    "rating": "5.0 out of 5 stars",
    "content": "We have only used it twice,  but it very easy to use. Timing for different foods works well,  temperature is dialed in correctly.  Great buy.",
    "post_time": "Reviewed in the United States on January 21, 2022",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "We use it for deer jerky. Would have given 5 stars but when I received it some of the trays were broken on one corner. Probably FedEx fault.",
    "post_time": "Reviewed in the United States on February 4, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Great Product",
    "rating": "5.0 out of 5 stars",
    "content": "Well first time using this for my cookies with royal icing. Problem with mine the icing was poked with the lid so mine must be too big! But will get used to it. Definitely would recommend to family and friends.",
    "post_time": "Reviewed in the United States on May 3, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had a really old dehydrator that I had lent out, so I decided to buy a new one.  My old one was round.  I love the square shape as it fits better on the counter and it is relatively quiet.  I also like that I may add 3 more trays if I wish.",
    "post_time": "Reviewed in the United States on September 7, 2019",
    "pid": "B0D1V7L52V"
},
{
    "title": "Dehydrater capability",
    "rating": "4.0 out of 5 stars",
    "content": "Nice compact dehydrator that is easy to use. Digital menu is awesome! Too bad no directions came with it... hope my jerky comes out good",
    "post_time": "Reviewed in the United States on July 27, 2019",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I was excited to finally get a dehydrator but after a few tries, I decided it was not what I expected. I tried a few simple things and a few recipes included with the machine. I found I had to almost double the recommended time to come close to the results I expected but even then my dehydrated food lasted only a week. I was very disappointed.",
    "post_time": "Reviewed in the United States on July 15, 2022",
    "pid": "B0D1V7L52V"
},
{
    "title": "Melted into a fire hazard",
    "rating": "1.0 out of 5 stars",
    "content": "I received as a gift in July 2023. Worked very well for jerky and drying fruits/vegetables. However, in January 2024, I woke up to it running over 200F on 131F setting. Front melted and burned everything. Reaching out to company, but customer service is closed on Saturday. Won’t buy another.",
    "post_time": "Reviewed in the United States on January 13, 2024",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Update: Kudos to customer service. They were responsive and appropriate. Refunded full purchase price after sending in photos and explanation.",
    "post_time": "Reviewed in the United States on January 27, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Good for you and good to use",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator works really well.  No problems at all.  Easy to set up, easy to use, clean up is a snap (the fruit always sticks to any dehydrator).  I would strongly recommend this one to anyone who wants a dehydrator for home use.",
    "post_time": "Reviewed in the United States on October 26, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My roommate used this baby for at LEAST four or five days in a row dehydrating green chile.  Not only did our house smell amazing, but the dehydrator did it's job very well with no issues whatsoever!",
    "post_time": "Reviewed in the United States on December 29, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Awesome product!",
    "rating": "5.0 out of 5 stars",
    "content": "Husband loves to make jerky. This little unit is great for the price. It has different temperatures and a timer, but the very bottom is difficult to clean. I use a damp pipe cleaner and paper towels.",
    "post_time": "Reviewed in the United States on August 1, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Came with a very detailed instruction manual plus a great recipe book. Super easy to clean dishwasher safe, and it has 6 racks. Easy to operate with adjustable temp and timer settings",
    "post_time": "Reviewed in the United States on January 10, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Easy to use. Great price.",
    "rating": "5.0 out of 5 stars",
    "content": "I use IT to dry my decorated cookies and I just love it. I can see all my cookies and their progress, all the trays adjust in height depending on how you place them which is also great. Really love this product. Is effective.",
    "post_time": "Reviewed in the United States on March 10, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "This dehydrator is leave and forget pretty easy set timer and temp and your good to go. Only thing i don't like is the cover for the fan doesn't come off to clean easy, but other than that easy cleaning.",
    "post_time": "Reviewed in the United States on September 7, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Great buy",
    "rating": "5.0 out of 5 stars",
    "content": "I might be doing something wrong with this appliance and maybe why I m not impressed with it. I tried dehydrating bananas twice. I followed the directions and had to triple the process time with still unfavorable results. So not sure if the machine doesn’t have enough power or not sure if I m not doing it right. l just know that processing thinly sliced bananas nicely placed apart on a couple trays shouldn’t take 40 hours. Yes that’s right …40 hours and they still were a bit soft",
    "post_time": "Reviewed in the United States on January 9, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use it every now and then, and it works great, not very loud. Everything came and was undamaged. It easy to wash off the racks. It's easy to run if you follow the directions. To problems with it so far.",
    "post_time": "Reviewed in the United States on August 3, 2019",
    "pid": "B0D1V7L52V"
},
{
    "title": "Works great",
    "rating": "4.0 out of 5 stars",
    "content": "Does everything we need it too.",
    "post_time": "Reviewed in the United States on June 28, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love the ability to set a time and temperature for making jerky!",
    "post_time": "Reviewed in the United States on October 23, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Very good product",
    "rating": "5.0 out of 5 stars",
    "content": "Love this product simple and easy to use Right out of the box my 1st food dehydrator I was a little intimidated not sure what to find but this food dehydrator is great I would definitely recommend this to anyone looking for a food dehydrator",
    "post_time": "Reviewed in the United States on July 29, 2019",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great, convenient and easy to use",
    "post_time": "Reviewed in the United States on September 12, 2022",
    "pid": "B0D1V7L52V"
},
{
    "title": "Simple and easy",
    "rating": "4.0 out of 5 stars",
    "content": "Unfortunately heating unit failed after eight usages.",
    "post_time": "Reviewed in the United States on March 26, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really love the compact size of this dehydrator.  It fits on the counter nicely and works great!  I was able to dehydrate mango slices and banana chips.  I can’t wait to use it for my herbs",
    "post_time": "Reviewed in the United States on August 12, 2019",
    "pid": "B0D1V7L52V"
},
{
    "title": "Does what it suppose to",
    "rating": "1.0 out of 5 stars",
    "content": "Will be contacting Amazon to see what they can do.",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I would like to now add that Amazon is replacing it.  Will review the next one.",
    "post_time": "Reviewed in the United States on September 30, 2019",
    "pid": "B0D1V7L52V"
},
{
    "title": "Failed pretty soon",
    "rating": "5.0 out of 5 stars",
    "content": "I just got mine today and had the meat ready to go. I had read on a couple sites to rotate the trays. I rotated and shuffled them! They are almost done!",
    "post_time": "Reviewed in the United States on April 3, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "This is THE perfect dehydrator. It has a lot of racks, super easy to clean, and the best part is its completely quiet.",
    "post_time": "Reviewed in the United States on October 3, 2022",
    "pid": "B0D1V7L52V"
},
{
    "title": "Jerky, strawberries, and mangos oh my!",
    "rating": "5.0 out of 5 stars",
    "content": "I liked how lightweight it is, how easy it is to operate, I liked how fast it seems. It takes 4.5 hours to have a nice dried fruit, it also is easy to clean.",
    "post_time": "Reviewed in the United States on October 29, 2019",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This does a decent job at dehydration but it takes a remarkably long time to get the work done.",
    "post_time": "Reviewed in the United States on September 19, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Have some spare time?",
    "rating": "4.0 out of 5 stars",
    "content": "Vivohome dehydrator is awesome I use it for beef jerky and it’s great!",
    "post_time": "Reviewed in the United States on August 24, 2019",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It hasn't shut off since I purchased it constant jerky lol easy to clean great product thank you.",
    "post_time": "Reviewed in the United States on July 5, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Is awesome",
    "rating": "5.0 out of 5 stars",
    "content": "Used it to make dog treats. It had no smell and was very easy to clean and setup. I would recommend to anyone needing a dehydrator",
    "post_time": "Reviewed in the United States on May 21, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Ran this beauty for over 6 hours trying to dehydrate basil. Didn’t even phase it. I turned up the temp twice, didn’t make a difference. Waited quite a bit of time before using so now I’m past my return window. I guess I can still the trays as drying racks. 🫤",
    "post_time": "Reviewed in the United States on August 22, 2023",
    "pid": "B0D1V7L52V"
},
{
    "title": "Jerky",
    "rating": "1.0 out of 5 stars",
    "content": "I ordered this dehydrator in August and it worked fine until May when the heat function ceased to work.  I went through the process of making contact to get it resolved (twice) and never heard back from anyone.  Since I really need my dehydrator, I've had to resort to purchasing another brand.  It seems I've wasted my money with this one.",
    "post_time": "Reviewed in the United States on May 27, 2023",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Dehydrated over 20lbs of meat so far and no problems. Multiple Veggies too.",
    "post_time": "Reviewed in the United States on October 23, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Best dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "Seems to be very easy to work. Making black garlic in it right now can't wait to try it.",
    "post_time": "Reviewed in the United States on February 26, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Silent, easy to clean, put off little smell or heat. Makes excellent dried fruits and beef jerky. Haven't used wax paper etc. Simple hand washing racks. Stores well.",
    "post_time": "Reviewed in the United States on January 9, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Great for drying herbs",
    "rating": "5.0 out of 5 stars",
    "content": "Just received this dehydrator and I've already created batches of dried herbs. So easy to use!",
    "post_time": "Reviewed in the United States on June 17, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Does what I bought it for. Perfect unit!",
    "post_time": "Reviewed in the United States on January 5, 2022",
    "pid": "B0D1V7L52V"
},
{
    "title": "Great item",
    "rating": "3.0 out of 5 stars",
    "content": "Takes a long time to dehydrator veggies.  Stopped blowing heat during 3rd dehydration process.",
    "post_time": "Reviewed in the United States on July 10, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The only bad thing about this the trays are not tall enough",
    "post_time": "Reviewed in the United States on August 29, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Stopped blowing heat",
    "rating": "5.0 out of 5 stars",
    "content": "this thing works great! very happy with the ease of use.",
    "post_time": "Reviewed in the United States on August 11, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I bought to dry fruit, peppers, and herbs. Used 4 times and it failed by melting a hole in the bottom of the housing.",
    "post_time": "Reviewed in the United States on December 18, 2023",
    "pid": "B0D1V7L52V"
},
{
    "title": "The only thing wrong with this is the trays are not tall enough",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator works great! The only complaint, I should have bought the bigger model.",
    "post_time": "Reviewed in the United States on February 5, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Dehydrated food, easy to use and looks nice. Can't complain.",
    "post_time": "Reviewed in the United States on July 23, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "great little dehydrator!",
    "rating": "5.0 out of 5 stars",
    "content": "For my daughter for Christmas. Very good and works like a very expensive item.  Fun and well worth the money..",
    "post_time": "Reviewed in the United States on February 27, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Product came in November 17, have been using it every other day for about 8hrs at 113°F. December 25 the Product no longer heats up; only the fan turns on with no heat.",
    "post_time": "Reviewed in the United States on December 26, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Takes a long time to dehydrate",
    "rating": "3.0 out of 5 stars",
    "content": "I dried apricots and it took 9 hours.And they still were on the moist side.",
    "post_time": "Reviewed in the United States on August 20, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I am angry. I bought this and the day after it arrived, I followed all of the directions. I cut up $30 worth of organic produce to dry. This was when I found out that the fan and heater were broken.",
    "post_time": "Reviewed in the United States on March 1, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Arrived Broken",
    "rating": "1.0 out of 5 stars",
    "content": "I had spend hours preparing everything. I decided I’d just freeze it and make smoothies with it until I realized that it all tasted like cheap plastic from China. Out of fear of getting cancer, I threw it out.",
    "post_time": "Reviewed in the United States on October 2, 2022",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I will be returning this.",
    "post_time": "Reviewed in the United States on January 23, 2021",
    "pid": "B0D1V7L52V"
},
{
    "title": "Plugged it in…didn’t work",
    "rating": "5.0 out of 5 stars",
    "content": "When we plugged it in the unit just kept beeping obviously indicating that it was “working.”  That was all it could do was beep…there was no way to stop the beeping…and the unit did not “turn on.”  We reached out to the company a month ago with no response about a refund or some kind of trouble shooting tips.",
    "post_time": "Reviewed in the United States on August 31, 2019",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I gave it to someone for a gift.",
    "post_time": "Reviewed in the United States on February 1, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Gave as a gift",
    "rating": "1.0 out of 5 stars",
    "content": "Made my first batch ever of teriyaki beef jerky. Everyone loved it! And has been asking when I’ll be making more.",
    "post_time": "Reviewed in the United States on March 7, 2022",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have done bananas and pineapple it called for 7 to 8hour temp at 73. The lowest temp it would go is 113 It took over 15 hours and  still not done. I'm not happy with this product. I had to throw away food. I would like to return it I dont have original book.",
    "post_time": "Reviewed in the United States on November 20, 2019",
    "pid": "B0D1V7L52V"
},
{
    "title": "Tray rotation",
    "rating": "5.0 out of 5 stars",
    "content": "I have purchased this dehydrator twice. I bought the second one because I did love it initially. The first time it worked for about 5 months and then all of a sudden the heating element went out. I thought, maybe its just this one, so I bought the same one again. BIG MISTAKE. Here I am 4 months later, with another broken heating element so Im thinking not much of a coincidence. DONT BUY THIS. You will waste your money.",
    "post_time": "Reviewed in the United States on January 16, 2020",
    "pid": "B0D1V7L52V"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I have made sweet potato chips and Apple cinnamon chips  it works great",
    "post_time": "Reviewed in the United States on November 9, 2023",
    "pid": "B0D1V7L52V"
},
]