[
{
    "name": "        Turtle Beach Pure SEL - Ultra-Light Ergonomic RGB Gaming Mouse, 8K DPI Optical Sensor, Mechanical Switches, Pretension System, Pure PTFE Glides, RGB Illumination – Black       ",
    "stars": [
        "64%",
        "19%",
        "9%",
        "5%",
        "4%"
    ],
    "pid": "B0D1CRYR8C",
    "ratings": "124 ratings",
    "other_info": {
        "Brand": "Turtle Beach",
        "Color": "Black",
        "Connectivity Technology": "USB",
        "Special Feature": "Lightweight, Ergonomic Design, LED Lights",
        "Movement Detection Technology": "Optical"
    },
    "discount_price": "$ 30.50",
    "normal_price": "$39.99",
    "about_this_item": [
        " Ergonomic shape weighs an ultra-light 49g  ",
        " Mechanical Switches for a crisp tactile feel  ",
        " Pretension click system for the most satisfying click  ",
        " 8K PixArt PAW3318 DPI Sensor  ",
        " Semi-translucent shell  ",
        " Pure PTFE glides, pre-tuned for smooth movements  ",
        " Programable AIMO intelligent RGB Illumination  "
    ]
},
{
    "title": "NOT The Same Burst Pro Shape!!! Otherwise decent, get it on sale though...",
    "rating": "3.0 out of 5 stars",
    "content": "The shape is NOT IDENTICAL to the Burst Pro!!!!!!!",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The mouse itself is of high quality, with subtle side flex if you squeeze the mouse a lot. Good mouse clicks and mouse wheel. The issue is why change the dpi button location? Putting it on the front left side of the mouse forced them to change the shape. The front doesn't narrow as much as the Burst Pro in width or height, and now the mouse is 2-3mm longer...",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Surprising!",
    "rating": "5.0 out of 5 stars",
    "content": "Quite a shame, as the mouse in general is a decent ambi mouse. But it's pretty dang lame that Turtle Beach didn't stay true to the shape after Roccat's big flop with the Burst Pro Air, meanwhile took the name from the Burst Pro... This mouse would've been perfect, and everything all Burst Pro users were asking for, if they just kept the same dang shape...",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This is why I only give it a 3*. It's performs and is built well (minus the minor sidewall flex), but it is not true to the Burst Pro and feels quite awkward in comparison. Also, $99 for a lightweight 1khz polling mouse? We can get similar, and better built devices that give 4k for the same price or ~$10 more..",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Game changer.",
    "rating": "2.0 out of 5 stars",
    "content": "Now, do we have to wait another year or two for Turtle Beach to get the Burst Pro wireless version successor correct...?",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have 19x10 cm hand I've tried every mouse it seems like. I've return every Razer mouse.  My rotation is the G pro, the Op1we, and the and the Pulsar X2h.  Once I put my hands on this I was so shocked. I was a fan of the shape of the Roccat Burst Pro but didn't like the weight or the RGB.  It's the first mouse I've used that I don't think about how I grip it I just put it up and play. Incredible mouse shocking that it's turtle beach. I don't even feel like I have anything in my hand.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Great shape with mediocre buttons",
    "rating": "4.0 out of 5 stars",
    "content": "Incredibly, unbelievably lightweight. Feels smoother and faster than top ultra-light $150 gaming mice. I went from a 65 gram lightweight mouse to this roughly 45 gram mouse and the difference in my gameplay is notable. This mouse competes and beats the Razer Viper V3 Pro in swiftness and accuracy. The construction of the mouse is not compromised, and it feels well built. Also, the shape and coating work exceptionally well for me. The best mouse I have ever used, without a doubt.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The kone mouse shape my favorite ergo shape. Truly the most comfortable mouse shape. The problem with this mouse is that the buttons require too much force. Buttons 1 2 and 3 are all pretty stiff. If the buttons were slightly lighter and had huano blue shell pink dot switches or similar then it could have been a great mouse. Overall not bad for the price.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Not for palm grip style",
    "rating": "5.0 out of 5 stars",
    "content": "I came into this as a fan of Roccat hoping that they kept that same philosophy but unfortunately, it also died with its name.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I daylily a Kone Pro and while the Pure has the same design languege but is ever so slightly smaller to accommodate a claw grip making it awkward for palm grip. This made it uncomfortable for me.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Better than I expected. G502 competitor.",
    "rating": "5.0 out of 5 stars",
    "content": "So, I've been fairly unimpressed with Turtle Beach and their offerings for the past decade or so. Always seemed to have the features and specs on paper but was typically left wanting more from either an execution or durability standpoint. I'm happy to say that the Kone II Air has left me feeling surprisingly impressed. For reference I'm coming from using multiple Logitech G502 mice over the last decade and that will be my comparison. I'm currently using a G502X Lightspeed, so the comparison should be pretty on par.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Wiiidddeeee, but works well",
    "rating": "4.0 out of 5 stars",
    "content": "Ergonomically, the G502 feels a bit smaller or more compact than the Kone. The maximum HxWxD dimensions are similar between the two but the midsection of the G502 is narrower, as in your thumb and opposing pinky sit closer together on the G502 lending it to a more natural claw or fingertip grip. The wider midsection of the Kone lends to a more natural palm grip. This isn't to say you can't use whatever grip you want, just that is what my hand feels just by resting it on each mouse. In use I consider both comfortable.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Decent mouse for DAW use",
    "rating": "4.0 out of 5 stars",
    "content": "I love that the Kone features a similar switchable freewheeling scroll wheel like the G502. I use both freewheeling and detent regularly, so having the option is almost mandatory for me at this point. To that point the Kone's scroll wheel feels great, in all dimensions, scrolling, pressing and tilting. So far, I'm quite happy with it.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Surprising, but expensive.",
    "rating": "4.0 out of 5 stars",
    "content": "The G502 does have the upper hand in the number of programmable buttons with the two extras alongside the left primary click button. Sure, if you use the shift feature on the Kone that changes things up, but it doesn't negate that there are still two more physical buttons on the G502. I will say I was worried about the placement of the 'shift' button on the Kone and it being accidentally pressed, but it's actually fine. There's enough space for my thumb to rest that I can roll it down to hit the shift button or up to hit one of the two upper buttons and it doesn't feel weird.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Premium Mouse, illumination control requires software",
    "rating": "4.0 out of 5 stars",
    "content": "Software I surprisingly favor the Kone and its Swarm II software. At least that is my initial impression. I have been a longtime user of Logitech Gaming Software and while it had its flaws and quirks, it largely did as I asked and was simple in its use. Moving to the G502X Lightspeed I was forced to migrate to G Hub and... I hate it. G Hub is a step back in simplicity and usefulness and its only redeeming qualities are that it looks slick and has a subjectively more modernized name. Swarm II feels more fluid and sensical in its UI and thus far, has does everything I needed with ease, especially auto switching of profiles when launching games.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Super lightweight",
    "rating": "4.0 out of 5 stars",
    "content": "I can't compare RGB between the mice as I opted for the RGB-less version of the G502 this time around, but I can say I do like the lighting on the Kone. The scroll wheel and the top half of each vertical strip are controlled independently from the bottom half of each vertical stripe. Combined with the Swarm II software's rather impressive RGB customization, you can make some really cool lighting.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Free spin wheel! Connectivity, responsiveness, good looks, performance, its got it all!",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, I've come away much more impressed with the Kone II Air than I excepted I would. So much so that I don't know which mouse I'll main. Given that the Kone II Air is cheaper than the G502 Plus Lightspeed (the more direct comparison since the Plus has RGB), I'd might consider the Kone the better buy unless you need those two extra physical buttons on the G502.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Awesome mouse.",
    "rating": "5.0 out of 5 stars",
    "content": "I've been a Logitech fan (especially the g500 line) for a long time, but got tired of replacing them every few years when their clickers die, so I got this Kone II Air to try something new. This thing is probably the widest mouse I've ever seen. It required adjusting my grip (ring finger on top instead of to the side), but it's not uncomfortable. Tracking is great, buttons feel good. DPI adjustability is good. The non-free spin mode on the wheel is just a little bit looser than the G502 Hero, which is good, as I find it a bit too tight on the Logitech, while the free spin on the Kone is a little slower, but still plenty fast enough. I like the placement of the Kone II Easy Shift more than the equavalent on the G502 Hero. I love that it has both 2.4 GHz and Bluetooth options, as I use both, depending on the circumstance.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Professional’s Dream",
    "rating": "5.0 out of 5 stars",
    "content": "I'm still testing battery life, but so far, using 2.4 lasts far less time (a few days of all day usage), while Bluetooth lasts longer.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Perfect Balance of Speed and Precision",
    "rating": "4.0 out of 5 stars",
    "content": "My biggest complaint is the number of buttons. I don't need an MMO mouse with 25 buttons, but the 2 extra on G502 are sorely missed on the Kone II.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Insanely lightweight gaming mouse",
    "rating": "4.0 out of 5 stars",
    "content": "While I can appreciate a super lightweight mouse, the appearance of those skeletal frame mice are a turn off for me. How do you even clean those mice?",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "They Weren't Kidding",
    "rating": "4.0 out of 5 stars",
    "content": "Thankfully, this is not the case here. Feels like Turtle Beach went with super lightweight materials & kept a normal appearance. Aside from the DPI switch (1 single LED near the scroll wheel), there’s no obnoxious RGB to be found on this mouse.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Seems great to me!",
    "rating": "5.0 out of 5 stars",
    "content": "I appreciate the extra skates… as well as the grip tape! The cable is nicely made too & does not hold a shape - it’s very flexible… I also appreciate how there’s an adapter that allows you to relocate the wireless receiver.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Roccat with a New Name",
    "rating": "5.0 out of 5 stars",
    "content": "The *feel* of the buttons are particularly nice. They’re crisp & have a short travel to them… really satisfying to use… though I wish the wheel had a left/right tilt click to it. (not a con - but this mouse would be strictly on gaming duty)",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Solid Performer in 2024",
    "rating": "5.0 out of 5 stars",
    "content": "Swarm II software is… OK. For the life of me, I cannot figure out how to use the Easy Shift function… and that’s with a Turtle Beach Keyboard as well.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Very Average Feel, Did not like the build",
    "rating": "3.0 out of 5 stars",
    "content": "By default, the dpi switch button is awkwardly out of reach (I'm neither a palm or a claw mouse gripper). In order to reach it with my thumb, I have to claw grip my mouse… but then the two side buttons would be uncomfortably out of reach. Not a dealbreaker but… it’s a con IMO. You’re either using the DPI button OR the 2 side buttons… I cannot foresee how you’d comfortably be able to use both.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Super light weight",
    "rating": "5.0 out of 5 stars",
    "content": "4/5",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "overall very good mouse",
    "rating": "5.0 out of 5 stars",
    "content": "When they call this an \"Ultra Lightweight\" mouse, they weren't kidding.  The thing it so light, it practically floats.  Of course, I'm not sure everyone likes that in a mouse, so just be warned.  Outside of that, it functions perfectly fine, has good tracking and is comfortable in my hand.  But, of course, being so thin and light, it also feels cheap and plasticky.  I will say, though, that applying the adhesive grips to the mouse made it SOOO much more comfortable in the hand!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "No Lag Comfort In Hand",
    "rating": "5.0 out of 5 stars",
    "content": "Just got the Kone II and I really like it.  Lots of button options that I dont have on my Logi gaming mouse and I like having the options for more mouse actions (always want one more in shooters!)  The 3d mouse wheel gives you extra and so does the lower mouse thumb button. The mouse is smooth (once you remove the stickies) and feels great to me. Nice look and lighting on this thing too which is great. No lag or anything and the performance of tracking and buttons are great. The size of the mouse is a little on the larger size so consider that when buying as it might fit medium to large handed people better.. or at least whatever your preference is consider it.  Another thing I love is the mouse wheel toggle mode where you can switch between clicky and smooth scrolling.  My logi wireless has that and I miss that on my other gaming mouse.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Big gamer mouse",
    "rating": "3.0 out of 5 stars",
    "content": "Lots of customization options from the software too from button mapping to lighting.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Good mouse. Could've been great.",
    "rating": "4.0 out of 5 stars",
    "content": "I'm a huge fan of the original Burst Pro and Burst Pro Air. I have a bunch of them, in white and black. However, they usually had issues where one of the two clicks felt bad. The Titan Optical switches would sometimes feel dull, uneven, or pop loudly. It would often take multiple copies to get a good one. Sadly, the Burst II Air is no different. My left click feels great, but my right click has a bunch of pre and post travel, and makes a loud popping sound when actuated. The rear side button is also a bit mushy, with a ton of pre and post travel. The forward side button feels fine, though. I do appreciate the DPI button location as I cannot press it unintentionally, but it is still functional if needed. Like the prior Burst Pro Air, this has 2.4 using the USB dongle and Bluetooth. It has only one small LED light, which is fine with me. The software is easy to use and does not feel bloated. I just wish Roccat (now Turtle Beach) would bin their optical switches to make them feel more even, and not pop so loudly. The weight of this mouse is great, as is the shape, but the iffy switch quality makes me hesitant to fully recommend it.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Great mouse if not a little pricey",
    "rating": "4.0 out of 5 stars",
    "content": "Edit: I did end up getting it replaced and my replacement copy is much better in terms of click feel. I still prefer other optical implementations like Razer, Pulsar, etc. but at least this isn’t as bad as the hybrid switches on the new Superlight 2 and G502X.",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Great Connection Options",
    "rating": "5.0 out of 5 stars",
    "content": "Been using it for a bit and I really like it. There are two things that I'm not the biggest fan of though. Those would be the price and the right and left click sounds.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "great mouse",
    "rating": "5.0 out of 5 stars",
    "content": "Price-wise, I feel $100 is a bit rich for Turtle Beach, but maybe that's just me. I've only owned one other item from them in the past and it was a headset, which was just OK to me. While the mouse does feel well built, especially for one being in the lightweight category where some can feel like just a shell of thin, cheap plastic, I feel this would be better suited around the $80 range.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Works Perfectly!",
    "rating": "5.0 out of 5 stars",
    "content": "The button clicks have that \"1990s click\" sound to them. I seriously don't know how else to describe it, lol. It just makes the mouse sound old. The thumb buttons feel nice and are at a good location on the side. There is a DPI button at the front-bottom area on the thumb side, which is a first for me. I'm used to them being on the bottom or just below the wheel. It's fine there though. It's out of the way and there's no way to accidentally hit it with your thumb.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Many buttons, very light weight",
    "rating": "5.0 out of 5 stars",
    "content": "No issues with battery life either. I used it via the dongle straight out of the box without charging and it lasted days without needing a charge, so I wouldn't have any problems with it dying on me since I tend to charge all my stuff every few days anyway.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Great mouse.",
    "rating": "5.0 out of 5 stars",
    "content": "Great mouse overall.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "GREAT GAMING MOUSE",
    "rating": "5.0 out of 5 stars",
    "content": "I love it when a designer incorporates different methods of connection because in the world of gaming or just general PC use people like to use their equipment the way they want. You have the option of BT,  wireless dongle, and wired connection.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "The best looking mouse I've owned",
    "rating": "5.0 out of 5 stars",
    "content": "The mouse fits my claws perfectly, I can't use dainty mice. It tucks your thumb away, and actually has a useful quickly accessible programmable button on the ledge.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Making gameplay smooth and responsive",
    "rating": "5.0 out of 5 stars",
    "content": "I believe most mouse performance is pretty close between higher tier brands, cutting hairs when it comes to response, report rate, resolution. Ergonomics and style of the mouse is great as I said.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "So many options",
    "rating": "5.0 out of 5 stars",
    "content": "Very nice gaming mousing. Has a ton of different options to help navigate your daily use. Rechargeable with a c port cable. Comes with charging cord and everything you need to get it connected. Has cute lights that time out so it dont drain your battery. Sits comfortably in my hand. Well worth every penny.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Bluetooth started failing.",
    "rating": "4.0 out of 5 stars",
    "content": "I love this thing, It feels so light and smooth. My one issue is one week in and the Bluetooth started just dying on me. Drift for no reason or random mouse slide. Could be my fault but I tried everything and it refuses to act right.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Mouse is an upgrade for my daughter!",
    "rating": "5.0 out of 5 stars",
    "content": "Great wired mouse for my daughter.  I chose the Kone 2 and she loves it. It easily hooked up to her computer and was ready to use instantly.  It's very sleek and cool, has beautiful rgb lighting on the sides, which she really likes. It's responsive and smooth, cord is very long, and feels super comfortable to handle. It's definitely an upgrade to her last no name $20 mouse, and it's still affordable. Performs as it should, she is happy with it. Would recommend if your looking for a nice mouse at a good price.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Working great",
    "rating": "5.0 out of 5 stars",
    "content": "This is a very lightweight mouse. It took me a little bit to adjust to it. It is really comfortable to use. I normally keep things charged up and have not tested exactly how long the battery life lasts yet. Overall I am really happy with how this mouse has worked for me and glad to try this one out.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Responsive and comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "This is great. Awesome for larger hands to prevent fatigue or overall discomfort. It's easy to set up and responsive when in use. Buttons are easily reachable and responsive when used. This is well designed and high quality!",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "I'm told it's awesome!",
    "rating": "5.0 out of 5 stars",
    "content": "I never knew a mouse could be so expensive but my son says he loves it!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "WIreless version solidly made and works well.",
    "rating": "5.0 out of 5 stars",
    "content": "We have the wireless version, and it is a good-sized mouse, works well with multiple functions. Looks good. Fits palm easily. Well-built.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Awesome mouse!",
    "rating": "5.0 out of 5 stars",
    "content": "Super accurate tracking, nice and smooth.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Lightweight and responsive",
    "rating": "5.0 out of 5 stars",
    "content": "Great for gaming or browsing.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Great gaming mouse",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to setup and use and made of quality materials.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Fine but not exceptional",
    "rating": "3.0 out of 5 stars",
    "content": "Roccat was bought out by Turtle beach several years ago and now the brand has been shuttered, with Turtle Beach branding taking over all of their previous products. The Burst II Air is a sort of refresh of the Burst mouse that previously existed and while a fine product with good build quality, I can't help but be disappointed. The coating is fine but not the best that I've seen and the multiple connection options is a nice feature. Feet are adequate, being pure virgin PTFE and glide well enough. No issues with the sensor either, it performs well with no spinouts. But it just isn't competitive in the mouse market at this price. No high polling rate option, the plastic itself while well built, doesn't feel very premium and just feels lacking especially when you compare it to something like the Deathadder V3 Hyperspeed where it has a superior coating, high polling rate option and larger sized feet all for the same price. It just feels like Roccat/Turtle Beach are out of date in the market and not keeping pace with all the other competitors and it can't help me feeling disappointed. This isn't a bad mouse by any means but for the price, there are far far better options out there.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Super light but still solid",
    "rating": "5.0 out of 5 stars",
    "content": "I've been using this as my travel mouse.  It's full size, which I like and connects really quickly and easily via bluetooth.  The 2.4GHz usb dongle fits inside it so there's always that option if bluetooth isn't your preference.  All the buttons have a satisfying click.  It does go into sleep mode when not being used, but is quick to wake up when moved.  It also has a power switch to choose between off, wireless dongle or bluetooth.  It glides smoothly and comes with extra slider pads as well as grip tape that can be used.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "I love light weight mice, and this is the lightest one yet!",
    "rating": "5.0 out of 5 stars",
    "content": "This arrived in a beautiful box that showed the mouse and a lot of its features. Opening the box was a really nice experience and the mouse looked awesome how they had it packed and displayed.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Great quality light weight mouse.",
    "rating": "5.0 out of 5 stars",
    "content": "This mouse is not large but it is not particularly small either. It is just about the perfect size. It is amazingly light weight. Really could not believe how light weight it felt. I love light weight mice just because I find them more comfortable to use for extended periods of PC gaming.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "White 46.26g with stock skates",
    "rating": "5.0 out of 5 stars",
    "content": "This mouse does not have any lights or rgb, other than one small led on the very top. I am fine with this. I love rgb but that would have added additional weight.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Good quality",
    "rating": "5.0 out of 5 stars",
    "content": "The mouse comes with grip tape for the sides and top, and also extra sliders for the bottom. The grip tape is very nice, sort of soft. It is not necessary to use it as I had no problems gripping the mouse without it. The mouse has a very fine texture to it. The extra slider pads are nice too.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Light weight competitive peak",
    "rating": "5.0 out of 5 stars",
    "content": "This mouse can be used in wired or wireless mode. Both ways worked fine. Using this mouse in both games and general desktop use, surfing the web was great. I know it has a good optical sensor and it tracked very well without issue. The light weight and shape of the mouse made it a pleasure to use. The clicks sounded and felt nice. The scroll wheel felt nice too. It was easy to change dpi.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Impressive",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first ever Turtle Beach mouse, and it is great. It is now one of my favorite mice! I think anyone who likes a really light weight mouse for gaming, and does not mind the lack of rgb, will love this.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Amazing",
    "rating": "5.0 out of 5 stars",
    "content": "I only have one con and that is the price. It is very expensive, near the top tier of expensive for a mouse. They offer a two year warranty but I really think at this price it should be a lifetime warranty, or at least 5 years.  If you can get past the price, it really is a well built, extremely light weight gaming mouse.",
    "post_time": "Reviewed in the United States on May 31, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Lighter than a feather",
    "rating": "5.0 out of 5 stars",
    "content": "I have been using the Burst Air II mouse for the last few weeks, and it has exceeded my expectations and my last gaming mouse. From the moment I started using it, I could feel the difference. At just 47 grams, this mouse is lightweight and ergonomic. The solid shell feels sturdy, and the included grip tape can be used to help maintain constant hold of the mouse during fast-paced gaming sessions. It is also extremely precise, and the DPI setting can be changed with the push of the side button. The scroll wheel is notched and has a good tactile feel. The buttons also have a nice click to them, and while using the mouse in wireless 2.4 GHz through the dongle, I have not experienced any noticeable lag or latency. The mouse can also connect in Bluetooth mode and works well; again, I did not experience any noticeable latency. When it comes to the battery life is also nice and long as it lasts approximately thirty-five to forty hours in 2.4 GHz mode. The skates also allow for nice and smooth glides across my mouse pad. Overall, this is a great gaming mouse that is built well, feels awesome, and can compete.",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Premium mouse, premium price",
    "rating": "5.0 out of 5 stars",
    "content": "First off, yes, this mouse is pricier than other lightweight wireless options. But let me tell you, the build quality is top-notch. Even though it’s super lightweight; it feels like you’re holding a feather, it’s still solid and well-constructed.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "insanely lightweight",
    "rating": "5.0 out of 5 stars",
    "content": "The buttons on my unit are satisfying to click, with just the right amount of resistance. The DPI range is impressive, though I doubt many people will need the full 26k DPI. Even 10k DPI is more than enough for most users.",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Love it!",
    "rating": "5.0 out of 5 stars",
    "content": "It’s also very comfortable to hold, making long gaming or work sessions much more enjoyable. The software for this mouse is great. It's user-friendly with a nice layout, making it easy to customize settings. Plus, they include grip pads for those who want them, which is a nice touch.",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Nice Mouse, Bad Software",
    "rating": "3.0 out of 5 stars",
    "content": "Overall, recommended!",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Great",
    "rating": "5.0 out of 5 stars",
    "content": "i grabbed this up as it stated it is a lightweight gaming mouse..... and man they were not kidding.... this mouse almost feels like your not holding anything at all.... it is by far the lightest mouse i  have ever used.... incredibly responsive.... the bottem \"skates\" make it glide across my mouse pad.... while i will likely end up going back to my old mouse for the buttons it has this is an incredibly impressive mouse overall... it feels well built and looks great in person.... the bottom is skeletonized (im assuming to save on weight) and looks really really good in person... very responsive and actually really good for gaming so far with the games i have tested it with..... ive used it wired and wireless and honestly cant tell the difference between the two as far as response time..... great option for gaming at high levels",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Great Quality!!",
    "rating": "5.0 out of 5 stars",
    "content": "Didn't think I'd like this as much as I do. I'm actually using it right now instead of my Logi so THAT is saying something! It's super lightweight. I put the grips on them because.......Why not lol? And when I'm done using it wirelessly for the day, I just unplug the dongle and plug in the mouse to charge for the night so I can use it again the next day with a fresh new charge! PERFECT!",
    "post_time": "Reviewed in the United States on May 31, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "insane mouse.",
    "rating": "5.0 out of 5 stars",
    "content": "The software is easy to set up. Whatever macros you wanna use is easy. And I think it's a great pickup!",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Nice feel and grip gaming mouse",
    "rating": "5.0 out of 5 stars",
    "content": "As far as hardware goes the mouse is great. While a little small for my hands, it is super light bordering on not there. Nice finish on all of the plastics, and a good spot to hold the dongle. My only complaint would be the difficult to reach dpi button, but it's not a major issue.",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Double scroll double click",
    "rating": "2.0 out of 5 stars",
    "content": "The issue for me with this mouse is the software. You would think a big company like Turtle Beach could get it right, but it's terrible. First time I opened the app it got stuck repeatedly updating the mouse until I force closed the software. After that it worked, but not well. Layout isn't super intuitive. I couldn't find any way to turn off any of the 5 default dpi settings, so the fact that I only want 2 means I'll have to constantly cycle the whole group. Lastly I couldn't find any way to save the profile to hardware, so the customization is useless unless I want the program running at all times.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0D1CRYR8C"
},
{
    "title": "Software breaks a beautiful thing",
    "rating": "1.0 out of 5 stars",
    "content": "Overall, it's a nicely built mouse that feels good in the hand. It's just too bad it's ruined by terrible software, which is too often the issue with mice.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0D1CRYR8C"
},
]