[
{
    "name": "        Neck Tightening Cream, Neck Cream, Skin Tightening Cream For Fine lines, Loose & Sagging Skin On Face, Neck, Décolleté (3.4 Oz)       ",
    "stars": [
        "76%",
        "11%",
        "3%",
        "5%",
        "4%"
    ],
    "pid": "B0D3FPGZ2F",
    "ratings": "151 ratings",
    "other_info": {
        "Brand": "DERPHEA",
        "Item Volume": "3.4 Fluid Ounces",
        "Item dimensions L x W x H": "2.36 x 2.36 x 2.36 inches",
        "Age Range (Description)": "Adult",
        "Special Feature": "Anti Aging"
    },
    "discount_price": "$ 24.99",
    "normal_price": "$8.33",
    "about_this_item": [
        " Visible Results: With regular use, this neck firming cream helps firming skin for a more youthful and revitalized appearance.  ",
        " Firming: Our Neck Cream is specifically formulated to help firm skin, providing a youthful appearance.  ",
        " Easy to Apply: The smooth and creamy formula of our skin firming cream for the face and neck is easy to apply and absorbs quickly into your skin.  ",
        " Safe and Effective: Made with healthy ingredients, our neck cream is safe and effective, and free from formula additives.  ",
        " Smooth and Hydrate: This neck firming cream is rich in nourishing ingredients that hydrate and smooth your skin, leaving it feeling soft and supple.  "
    ]
},
{
    "title": "See results",
    "rating": "5.0 out of 5 stars",
    "content": "I did see results with this product so pleasantly surprised. My neck is firmer.  Also works around mouth - smile lines. I’m 60 so happy to find a product that works at a reasonable price. Will keep using.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I waited several weeks before posting this review. I lost a lot of weight recently and saw a extra skin on my neck. This has greatly reduced the appearance of my sagging skin. I am pleased with the results so far.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Satisfied",
    "rating": "5.0 out of 5 stars",
    "content": "Product was good but was left outdoors. The instructions was to leave it on the porch not on the ramp.  Porch thieves could have taken off with it where it was left, third time this has happened",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm a throat cancer survivor and had really harsh radiation therapy applied to my neck. I survived the cancer but my neck suffered real damage. The skin is wrinkled and creased. I wanted very much to find a solution that would improve matters. I stumbled upon this cream and thought it might work, so I ordered it. Good! Immediately on application, I can see a short term tightening of the fine wrinkles and it has ingredients that are reported to improve skin texture over the long haul. So far, I am very happy. It's good to have something turn out right in your life after fighting through this major episode.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "It was as described",
    "rating": "4.0 out of 5 stars",
    "content": "I like that the cream does not have a fragrance to it and it does make my skin softer,but I have not noticed any tightening of my skin.I have been using for a few weeks now. I have to add that I am a 73 year old lady and I do not think too much can help at this age.lol",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I apply the face cream few minutes before my makeup.  It’s light in texture, smooths skin, won’t remove major wrinkles but will soften lines.  I like the product but wish it cost less. Would recommend it for any age or skin type. If I applied cream more often would probably have even better results.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Really great solution for a problem neck!",
    "rating": "5.0 out of 5 stars",
    "content": "This product is the absolute best cream I’ve bought in quite a while.  I will continue to use as the outcome is amazing. I’m older and this will change your neck features.  Strongly suggest to purchase.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a nice product to use… 64 years old trying to improve my skin before it’s too late. This was a good start to my improvement… Just need to make time each day to protect myself… looks gives you confidence ! Especially at 64 years old! I recommend this!",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "soft skin",
    "rating": "5.0 out of 5 stars",
    "content": "I like this moisturizer cream. It is not greasy, absorbs quickly, and doesn’t have a smell. Also, I felt some tightening on my face after a few applications.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was always skeptical about tightening neck and face cream but after trying it…I’m addicted.  I saw immediate results in a few days!  It left my skin soft and glowing.  No greasiness at all.  I used it first thing in the morning and in the evening after a shower.  You also don’t need to use a lot…a little goes a long way!",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Working better than branded products",
    "rating": "5.0 out of 5 stars",
    "content": "I tried couple of other products that claim to be very powerful in reducing wrinkles. When I saw this product I was very skeptical but wanted to give it a try . I have been using this product twice a day for the past 20 days and I have noticed a change . Happy that I purchased this product",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was really surprised that I like this cream so much! Light, absorbs easily, not greasy. Definitely tightens under my eyes and on my chest, still waiting to see what it does with the crepey skin under my chin. Will buy again!",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Pleasantly surprised!",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve tried numerous lotions for my middle aged skin, but Derphea stands out as the best thus far! I use it not only on my neck, but forearms, and hands. Unlike other lotions, it leaves my skin feeling hydrated rather than dry. Recommend highly",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a nice moisturizer. I would not say it tightens or helps with sagging skin, but it does help with dry skin. Very creamy.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Great lotion for crepey skin!",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried a LOT of different Skin Tightening Creams, Serums & Plexaderm, None of which have made any difference in the look or feel of my skin! Finally after using twice a day for approximately a month I'm beginning to see improvement!  Thank You  W  W",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I can feel the product working immediately after applying it, and, most important, I can immediately see the difference.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Nice Body Cream",
    "rating": "5.0 out of 5 stars",
    "content": "My skin absorbed the cream amazingly and within a week I noticed a very significant change in my neck skin appearance. I use it at night and it does not bother my sleep at all because it is not greasy or oily. love it!",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I lost a lot of weight I read the reviews on this and other products. This on stood out for me. I have lots of small skin wrinkles on my chest, arms, hands etc. After a week of use the little lines have become less noticeable and my skin is softer. I will continue to use the product.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Product delivers as promised",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered this after reading several reviews both on Amazon and other places.  It feels so light going on and the scent is slight.  I have been using it under my makeup during the day and then applying it again before bed.  I have experienced no breakouts or adverse reaction.  I’m looking forward to seeing awesome results.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve tried many creams in an attempt to reduce my fine lines and chicken neck… none of those seemed to work at all.  THIS PRODUCT, however, DOES WORK!  I’ve been using it for only 2 short weeks and can visibly tell a big difference.  This will be my go-to moving forward!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Starting to work",
    "rating": "5.0 out of 5 stars",
    "content": "Just started using it a few weeks ago and my neck is already looking better. Absorbs easily and works well under makeup. Great value for the price! Does not feel greasy at all.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been using this for a few weeks. I have seen a significant improvement. It is a generous size container. I will order this again.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "It Really Works!  I have seen a significant improvement. I will order again.",
    "rating": "5.0 out of 5 stars",
    "content": "I've been using this for a few weeks along with silicone patches and it seems to be doing a great job of tightening the skin on my neck. The cream has no smell and feels really nice, not too thick.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been using this for almost a month and have noticed a difference already. My neck is smoother, along with with my chest. It soaks into the skin quickly and leaves your face feeling moisturized. For the price, I am shocked how well this cream works. I highly recommend this product.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Working well",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve tried numerous creams for my neck and my Décolletage and this have given me great results!! I’m 66 years young!! Don’t mind getting older, just don’t want to look it!! 😉",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This product works well for firming up the skin on and around my neck.  It also works well under makeup.  I use it every day and also sometimes at night.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Amazing neck cream, that actually works!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I was pleasantly surprised to find a neck product that is affordable, has a silky application and leaves skin velvety smooth. I have been using this on my décolleté and arms and need a bigger jar!  The scent is a heavenly soft lemon.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This Derphea  face and neck cream is by far the best I've used... It goes in so smooth and is not greasy.. It definitely makes my skin feel very moisturized!!! I'll buy it again!",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Love this!!",
    "rating": "5.0 out of 5 stars",
    "content": "I have been using the cream for about a week. I like this product it does not leave my skin greasy and absorbs into my skin very quickly.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Although I have just started using this product, it’s rich, creamy texture is just what I need on my 73-yr old neck. I feel it is going to deep moisturize and tighten my neck to help its appearance.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Smoothed out crepey skin",
    "rating": "5.0 out of 5 stars",
    "content": "My wife has been using it for 3 weeks now and her skin is smoother than before using it. We are pleased so far with the product and results.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This product makes your skin feel tight and and gives it a glow within minutes of putting on! You can feel the difference! Facelift in a bottle!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Instant tightening",
    "rating": "5.0 out of 5 stars",
    "content": "I love this stuff",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use it on everything but i see the most results in my neck",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Can feel it tightening",
    "rating": "5.0 out of 5 stars",
    "content": "Very nice, not greasy. I've used it on my neck and I do see some improvement. I'm now starting on my face (around lips and marinette lines).  And it's not expensive!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I will purchase this product again.  It is the best neck cream I ave used",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "It works!",
    "rating": "5.0 out of 5 stars",
    "content": "I have used it for a few weeks and really like it.  It has a pleasant scent and goes on smoothly and greaseless.  I would recommend it.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I don’t leave reviews very often but I have to say that this cream works great. I seen noticeable differences in under a month. Will definitely buy again",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Tightening Face & Neck Cream",
    "rating": "5.0 out of 5 stars",
    "content": "Lost 160lbs in a year and this has helped the skin on my neck tighten up greatly",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This product is great. I have very sensitive skin but this product is so light and made with ingredients that work for people with sensitive skin. I love it.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Seeing results",
    "rating": "5.0 out of 5 stars",
    "content": "I have started using the cream for little over 2 weeks and I am already seeing improvements in my neckline. I am going to continue using for better results.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the smoothness of this product on my face and neck. I just started using it so no results as of yet, will continue using and will update later",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Smooth",
    "rating": "4.0 out of 5 stars",
    "content": "Feels good, not too greasy. Good value.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am really amazed how this works. I can feel it tighten on my face the minute I apply it.  I plan on purchasing another one. Love it. :)",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "It's nice",
    "rating": "5.0 out of 5 stars",
    "content": "I love the new tightening face and neck cream. I can tell a difference already.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use this daily and not only does it do a good job of keeping my skin firm, it is a great moisturizer without being heavy.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Awsome",
    "rating": "5.0 out of 5 stars",
    "content": "Used several different creams for my face. This one is the Best!!  Works Great and does exactly what it is suppose to do——tighten face and neck! I would buy this product again",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like the way the product moisturized my face and neck.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Love it",
    "rating": "5.0 out of 5 stars",
    "content": "I am very happy with this product.  I have been using it for about a month and it is tightening the skin on my neck and face.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love the way it makes my skin feel. Not greasy at all.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Happy with delivery  And product is doing what is supposed to",
    "rating": "5.0 out of 5 stars",
    "content": "Happy with delivery and product that what is supposed to",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great for sensitive skin 10 out of 10 recommend",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "You can see the difference in a few minutes! Recommend!!",
    "rating": "5.0 out of 5 stars",
    "content": "I like the texture and how it feels, works good I have noticed a difference. Good Value will buy again",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent product for fine lines. Smooths face",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Great tightening cream",
    "rating": "5.0 out of 5 stars",
    "content": "My skin was really dry and feels silky",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have not been using the product long but I see a noticeable difference in the look and feel of my skin. So far I am pleased woth the product.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Helps fine lines",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product!! It applies so easily and feels so smooth and refreshing when I applied it to my neck and face. The smell is soothing and the tightening effects can be felt as the product is absorbed into your skin.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have only been using this cream for about a week and I already can see and feel a positive difference! It was shipped and delivered faster than excepted which is an added plus!. I highly recommend this!",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Fabulous",
    "rating": "5.0 out of 5 stars",
    "content": "So far so good : ) I can totally see a difference",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this in just short amount of days I’ve seen some progress :)",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Muy buena",
    "rating": "5.0 out of 5 stars",
    "content": "Me gustó mucho esta crema me ayudo bastante para mi cara si la recomiendo",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Doesn't leave skin heavy!",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "Very rich a velvety on your skin.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "La utilizo para la cara y el cuello",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "You need to use it consistently",
    "rating": "5.0 out of 5 stars",
    "content": "Great scent! A little goes a long way! My new nighttime cream!",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recently purchased this product and could not be more happy with it. The fine lines in my neck are almost gone.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Excelente crema",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this after a recommendation from a friend who noticed results very quickly. I have been using for almost three weeks and I can say that my neck and jowls feel more smooth than before!  The cream is very moisturizing and glides easily! This feels like a very quality product and the ingredients are pretty top notch!",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Seems to be doing a lot to help my skin,, soaks in skin pretty fast,think this is an awesome product",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Smooth cream!",
    "rating": "5.0 out of 5 stars",
    "content": "This cream is truly amazing. My face is tighter and brighter and I look elegant. I love it.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "GREAT EXPERIENCE",
    "rating": "5.0 out of 5 stars",
    "content": "Haven't used the product for that long, but the experience has been wonderful, meaning it's easy to apply, no unpleasant odor, and absorbs quickly wth zero greasiness. Early opinion: definitely try it!!",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Ok product.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "It's ok",
    "rating": "3.0 out of 5 stars",
    "content": "Didnt really see a difference and it leaves a white film behind",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Not impressed expensive lotion. Smell is not bad. It feels like to put on.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Didnt notice any difference",
    "rating": "1.0 out of 5 stars",
    "content": "This product does not work at all.  After hagling back and forth with the seller for almost a month, they offered a 50% refund of my money as I did not have a way to return it for a full refund.  THEY LIED!!  I paid $24.99 for this lousy, useless product and only received a $10.95 refund, which is NOT 50%.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "This product is not made in the USA. I do not trust that the ingredients and their purity are being properly regulated.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Doesn't work",
    "rating": "1.0 out of 5 stars",
    "content": "I couldn’t tell a difference",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "My package was smashed and leaking.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Waste of money and horrible customer service",
    "rating": "5.0 out of 5 stars",
    "content": "Like that it works .  But now on Amazon it is unavailable",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Texture is great, a lot of cream in the jar and feels so smooth on my skin! Noticed a change pretty quick can't wait to continue",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Good Product",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this as a gift to my mom she is in her mid 60’s and after a few weeks she saw impressive results.  Tightened skin, less lines, and just healthier looking skin. She has been recommending it to her friends. So my honest opinion is give it a try and see for yourself the results! 10/10",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "everything",
    "rating": "5.0 out of 5 stars",
    "content": "goes on easy and it works",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Cream for neck and face",
    "rating": "5.0 out of 5 stars",
    "content": "It is a face and neck cream that feels great. Not overly greasy. It seems like it is helping with the smoothing and tightening.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Has a nice scent and doesn't feel oily",
    "rating": "5.0 out of 5 stars",
    "content": "This product smells nice and doesn't leave a residue. Seems like it's working to firm my skin. I'll update later after repeated usage.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like that there is not much of a scent it applies smoothly and evenly as not to thick. I am seeing a reduction in wrinkles and a smoother finish to the face and neck, works great under makeup",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Smoothes wonderfully",
    "rating": "5.0 out of 5 stars",
    "content": "Purchased this product to help combat aging on my neck and face. I was surprised that while it is thicker, it goes on smooth and is not greasy.  I have also seen improvement in the overall appearance of my neck and face. Lines are less noticeable and it moisturizes well. I will definitely continue to use.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am of that certain age where products that say \"Tightening Cream\" gets my attention. I have tried other more expensive products and thought that I would try something new. I am happy that I did. I use it on my neck and upper chest and it visibly reduces the look of the lines. It isn't permanent but neither is going to the gym. I use it daily and notice a big difference. No scent to the lotion. Goes on smoothly and soaks in quickly.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Excellent Cream for Neck and Face",
    "rating": "5.0 out of 5 stars",
    "content": "I didn't see results until I finished the jar. After that, I became a subscriber and a believer. It works very well. It's not dramatic, but the results are there. Try it out! My mother-in-law swears by it. She gives it to everyone as a stocking stuffer on Christmas.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recently tried out this cream and was highly impressed with it. It has kept my skin silky smooth and tight without damaging it! Highly recommend this cream!",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Gets rid of fine lines and tightens loose skin",
    "rating": "5.0 out of 5 stars",
    "content": "Escaleta producto, funciona muy bien.",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "B0D3FPGZ2F"
},
]