[
{
    "name": "        Neck Tightening Cream, Neck Cream, Skin Tightening Cream For Fine lines, Loose & Sagging Skin On Face, Neck, Décolleté (3.4 Oz)       ",
    "stars": [
        "76%",
        "11%",
        "3%",
        "5%",
        "5%"
    ],
    "pid": "B0D3FPGZ2F",
    "ratings": "149 ratings",
    "other_info": {
        "Brand": "DERPHEA",
        "Item Volume": "3.4 Fluid Ounces",
        "Item dimensions L x W x H": "2.36 x 2.36 x 2.36 inches",
        "Age Range (Description)": "Adult",
        "Special Feature": "Anti Aging"
    },
    "discount_price": "$ 24.99",
    "normal_price": "$8.33",
    "about_this_item": [
        " Visible Results: With regular use, this neck firming cream helps firming skin for a more youthful and revitalized appearance.  ",
        " Firming: Our Neck Cream is specifically formulated to help firm skin, providing a youthful appearance.  ",
        " Easy to Apply: The smooth and creamy formula of our skin firming cream for the face and neck is easy to apply and absorbs quickly into your skin.  ",
        " Safe and Effective: Made with healthy ingredients, our neck cream is safe and effective, and free from formula additives.  ",
        " Smooth and Hydrate: This neck firming cream is rich in nourishing ingredients that hydrate and smooth your skin, leaving it feeling soft and supple.  "
    ]
},
{
    "title": "It's ok",
    "rating": "3.0 out of 5 stars",
    "content": "Ok product.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Didnt really see a difference and it leaves a white film behind",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Didnt notice any difference",
    "rating": "2.0 out of 5 stars",
    "content": "Not impressed expensive lotion. Smell is not bad. It feels like to put on.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "This product does not work at all.  After hagling back and forth with the seller for almost a month, they offered a 50% refund of my money as I did not have a way to return it for a full refund.  THEY LIED!!  I paid $24.99 for this lousy, useless product and only received a $10.95 refund, which is NOT 50%.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Doesn't work",
    "rating": "1.0 out of 5 stars",
    "content": "This product is not made in the USA. I do not trust that the ingredients and their purity are being properly regulated.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I couldn’t tell a difference",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Waste of money and horrible customer service",
    "rating": "1.0 out of 5 stars",
    "content": "My package was smashed and leaking.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Like that it works .  But now on Amazon it is unavailable",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Not made in the USA",
    "rating": "5.0 out of 5 stars",
    "content": "Texture is great, a lot of cream in the jar and feels so smooth on my skin! Noticed a change pretty quick can't wait to continue",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this as a gift to my mom she is in her mid 60’s and after a few weeks she saw impressive results.  Tightened skin, less lines, and just healthier looking skin. She has been recommending it to her friends. So my honest opinion is give it a try and see for yourself the results! 10/10",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "everything",
    "rating": "5.0 out of 5 stars",
    "content": "goes on easy and it works",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Cream for neck and face",
    "rating": "5.0 out of 5 stars",
    "content": "It is a face and neck cream that feels great. Not overly greasy. It seems like it is helping with the smoothing and tightening.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Has a nice scent and doesn't feel oily",
    "rating": "5.0 out of 5 stars",
    "content": "This product smells nice and doesn't leave a residue. Seems like it's working to firm my skin. I'll update later after repeated usage.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like that there is not much of a scent it applies smoothly and evenly as not to thick. I am seeing a reduction in wrinkles and a smoother finish to the face and neck, works great under makeup",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Smoothes wonderfully",
    "rating": "5.0 out of 5 stars",
    "content": "Purchased this product to help combat aging on my neck and face. I was surprised that while it is thicker, it goes on smooth and is not greasy.  I have also seen improvement in the overall appearance of my neck and face. Lines are less noticeable and it moisturizes well. I will definitely continue to use.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am of that certain age where products that say \"Tightening Cream\" gets my attention. I have tried other more expensive products and thought that I would try something new. I am happy that I did. I use it on my neck and upper chest and it visibly reduces the look of the lines. It isn't permanent but neither is going to the gym. I use it daily and notice a big difference. No scent to the lotion. Goes on smoothly and soaks in quickly.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Excellent Cream for Neck and Face",
    "rating": "5.0 out of 5 stars",
    "content": "I didn't see results until I finished the jar. After that, I became a subscriber and a believer. It works very well. It's not dramatic, but the results are there. Try it out! My mother-in-law swears by it. She gives it to everyone as a stocking stuffer on Christmas.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recently tried out this cream and was highly impressed with it. It has kept my skin silky smooth and tight without damaging it! Highly recommend this cream!",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Gets rid of fine lines and tightens loose skin",
    "rating": "5.0 out of 5 stars",
    "content": "This cream works great! I love the creamy texture that feels so good going on. As it dries, you can feel it gently tightening. It doesn’t leave a residue and washes off. So far, it hasn’t irritated my skin at all and the scent is pleasant, but very mild.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0D3FPGZ2F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Recommended cream to apply to neck, jawline & chest. I am also applying it to the crepey skin on my stomach. and seems to be doing a good job of firming and smoothing the skin. Apply twice a day to clean, dry skin for best results.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0D3FPGZ2F"
},
]