[
{
    "name": "        Food Dehydrator Machine 800W, 12 Stainless Steel Trays Dehydrated Dryer with 12H Timer & 86°F-194°F Temperature Control for Beef Jerky, Meat, Fruit, Herb, Dog Treats, Veggies, Recipe Book       ",
    "stars": [
        "70%",
        "9%",
        "10%",
        "0%",
        "11%"
    ],
    "pid": "B0D4TNF1FF",
    "ratings": "14 ratings",
    "other_info": {
        "Brand": "Osluken",
        "Material": "Stainless Steel",
        "Color": "Silver",
        "Wattage": "800 watts",
        "Voltage": "1.2E+2 Volts"
    },
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": [
        " Large Capacity of 12 Trays: The dehydrator comes with 12 removable stainless steel trays (11.8\" x 7.9\") made of 304 food-grade stainless steel for safety and durability. All trays are dishwasher safe. Holds a variety of foods at once, such as vegetables, fruits, meats, flowers, etc. Designed to meet the needs of large volume food drying, the fruit dehydrator provides plenty of healthy and delicious 100% natural food for the whole family.  ",
        " Dual Fan Three-Dimensional Dehydration Dryer: This powerful 800W dehydrator features dual fans and 360° hot air circulation technology. It conducts heat to the box through the improved and thickened heating tube to form an internal circulation, so that the heat is evenly distributed to realize efficient and fast dehydration and drying. It can lock the nutrients of fruits, vegetables, meats and other foods without affecting the taste.  ",
        " Precise Timer & Temperature Control: Easily customize the drying process with precise drying time and temperature settings. Drying time settings from 1-12 hours (30 min. increments) and digital temperature presets from 86°F to 194°F (in 9°F increments), ensuring you create delicious dehydrated meals at the optimal temperature and time. The timer displays and automatically shuts off when dehydration is complete.  ",
        " Fully Visible Window: The dehydrator is equipped with thickened, tempered viewing glass and built-in explosion-proof lighting, allowing you to watch the drying effect of ingredients in real time as you wish, so you can enjoy the fun of turning ingredients into delicious snacks.  ",
        " Relatively Quiet & Overheat Protection: Low-noise dual fans with sound levels between 45 dB and 50 dB won't make unwanted noise in your kitchen or disturb your sleep during overnight dehydration. The unit will automatically shut down if the cabinet overheats during operation.  ",
        " User-friendly Accessories: Our dehydrator comes with 12 stainless steel drying trays, drip tray, recipe book, manual. Stainless steel trays eliminate concerns about the potential health risks of plastic drying trays. The recipes will inspire you to make a variety of homemade snacks and will unlock the potential of your dehydrator.  "
    ]
},
]