[
{
    "name": "        Food Dehydrator Machine Detachable, 8 Stainless Steel Trays, 600W Dryer for Jerky, Herb, Meat, Veggies, Fruit, Dog Treats, LED Display, 48H Timer & 86℉-167℉ Temperature Control, Recipe Book Included       ",
    "stars": [
        "75%",
        "17%",
        "5%",
        "3%",
        "0%"
    ],
    "pid": "B0D4VCNW8H",
    "ratings": "73 ratings",
    "other_info": {
        "Brand": "KEENSTAR",
        "Material": "ABS+Stainless Steel",
        "Color": "Black",
        "Wattage": "600",
        "Product Dimensions": "12.2\"D x 16.73\"W x 11.42\"H"
    },
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": [
        " 8-Tier Stainless Steel Trays: KEENSTAR Food dehydrator with build to last 304 stainless steel drying trays. Compared to plastic drying trays that are heavily contaminated with the food oils and juice, KEENSTAR corrugated mesh drying trays has a smaller contact area with the food, making it easier to clean. The machine body is made of food-grade high-quality plastic, all materials are BPA-free. Enjoy healthy, delicious & low-calorie snacks with the KEENSTAR Food Dehydrator Machine.  ",
        " Even Heat Horizontal Food Dryer: Hot air of the Vertical Food Dryer comes out from the bottom, the upper layer receives less heat and the food dries slowly, KEENSTAR Horizontal Food Dryer makes each tier food even heat , no need to manually adjust the position of the drying tray. The KEENSTAR Food Dehydrator has 600 Watts of drying power to ensure you can dry more food, faster and easier.  ",
        " Digital Temperature & Time Control: An enclosed thermostat from 86ºF to 167ºF in 9ºF increments. At the same time, the time can be set from 0.5-48 hours in 30-minute increments. It allows you to achieve the best results when drying different foods. We have prepared 6 optional drying function modes. You can adjust the time and temperature according to actual needs.  ",
        " Easy to Clean & Safty: Each stainless steel tray is dishwasher safe or washed with warm soapy water. When the timer ends, the dehydrators for jerky will automatically shut off. If the machine overheats, the overheat protection will turn on. The transparent outer casing helps you track your food's progress without opening the whole machine up.  ",
        " Large capacity but Not Bulky: KEENSTAR food dehydrator can be assembled and disassembled by yourself. You can prepare different types of dried fruits or jerky simultaneously in 7.2ft²drying space. If the food dehydrator is not used for a long time, it can be disassembled and stored in a small size. KEENSTAR food dehydrator comes with assembly tools, a mesh screen, a fruit roll-up sheet, a user manual, and a recipe.  ",
        " Customer Service: KEENSTAR provides 24-hour friendly customer service. If you have any issues related to KEENSTAR food dehydrator, please feel free to contact us. You can dry fruits, vegetables, grains, meats, herbs, and flowers, and also can be used to make snacks for your pets.  "
    ]
},
{
    "title": "Compact SIze, Lots of Trays, and See-through",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator is a little larger than a 1-foor cube. You won't have to open the door to check on the drying progress because the front and all sides are clear BPA-free ABS plastic. Set includes 8 stainless steel racks and a drip tray for the bottom. Looks a bit overwhelming when you see all the pieces in the box, but it really goes together very quickly using good instructions. A nice hex handled driver is included and no other tools are needed. Took maybe 5 minutes to assemble. Feels solid once the pieces are interlocked and the 4 long screws are tightened.",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "KEENSTAR Food Dehydrator Machine, 8 Stainless Steel Trays, Dryer for Jerky, Herb, Meat",
    "rating": "5.0 out of 5 stars",
    "content": "Best of all is the color touch screen controls which are very intuitive and very simple to adjust the time and temperature. There are a few seconds included in a video with the unit in heat mode so you can maybe hear the fan running. It's very quiet and much more silent than another one that we have used.",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Versatile and easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "This is a nice dehydrator that makes the most of a relatively small counter footprint.",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Works Great",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and simple to clean. Plenty of room for bigger batches. Breaks down easily and saves a good amount of room. I have no complaints about this.",
    "post_time": "Reviewed in the United States on March 15, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "So cool",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator has a modern look and is easy to use. It's not a high-volume machine but should be fine for most residential uses.",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Awesome!",
    "rating": "5.0 out of 5 stars",
    "content": "Good dehydrator works great. Perfect for deer Jerky or healthier dehydrated fruits. Very simple to put together and use. Great instructions and love the recipes suggestion book. Highly recommend. This is a great gift idea.",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Great concept, poor execution.",
    "rating": "2.0 out of 5 stars",
    "content": "Easy to use and clean. You can make your own healthy version of beef jerky.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B0D4VCNW8H"
},
]