[
{
    "name": "        Jabra Enhance Select 500 OTC Hearing Aids, Audiology Team Care Included, Bluetooth LE Audio & Bluetooth Streaming for Calls, Music, Media (iOS/Android), Nearly Invisible & Comfortable - Silver       ",
    "stars": [
        "56%",
        "26%",
        "0%",
        "7%",
        "11%"
    ],
    "pid": "B0D5WW8TSB",
    "ratings": "32 ratings",
    "other_info": {
        "Brand": "Jabra",
        "Color": "Silver",
        "Ear Placement": "In Ear",
        "Form Factor": "In Ear",
        "Model Name": "Enhance Select 500"
    },
    "discount_price": "$ 1,794.98",
    "normal_price": "$1,794.98",
    "about_this_item": [
        " OUR SMALLEST, MOST ADVANCED HEARING AIDS - Excellent in the most complex listening situations, like hearing multiple people at a loud party.  ",
        " LICENSED, US-BASED CARE - With our Premium Package, included with your purchase, our licensed Audiology Team and highly-trained Customer Service team are available 7 days/week to help you get the most out of your hearing aids.  ",
        " CUSTOMIZABLE - Virtually meet with our Audiology Team to get your rechargeable hearing aids custom-programmed to your individual hearing needs. You can also customize your hearing aid settings without Audiology Team support if desired.  ",
        " SOUNDSCAPE HEARING TECHNOLOGY - Hear conversations more clearly, know where sounds are coming from, and enjoy next-level noise cancellation with SoundScape proprietary speech clarity technology.  ",
        " READY FOR THE FUTURE OF CONNECTIVITY - Among the first hearing aids in the industry to offer Bluetooth LE Audio and Auracast, while also supporting existing connectivity such as hands-free calls, for current and future compatible devices.  ",
        " HANDS-FREE PHONE CALLS - Take calls just like earbuds when using iPhone 11 and newer, or your compatible Android device.  ",
        " TAP CONTROL - Answer calls to your compatible Apple or Android device simply by double-tapping your ear or hearing aid.  "
    ]
},
]