[
{
    "name": "        Heated Eyelash Curlers, 2 in 1 Clip-Type Eyelash Curler, Natural Curling 24 Hours Long Lasting, 3 Temperature Modes with USB Rechargeable, Gift for Women Girls (Black)       ",
    "stars": [
        "76%",
        "3%",
        "7%",
        "3%",
        "12%"
    ],
    "pid": "B0D5BDWMLM",
    "ratings": "335 ratings",
    "other_info": {
        "Color": "Black",
        "Brand": "MGKO",
        "Material": "Acrylonitrile Butadiene Styrene (ABS)",
        "Handle Type": "Clamp\" or \"Clip",
        "Included Components": "User Manual, Brush, USB Charging Cable"
    },
    "discount_price": "$ 15.",
    "normal_price": "$15.99",
    "about_this_item": [
        " 【Attractive and fast curling】：The lash curler can fast heat up within 10s and the curved curling head quickly creates a perfect, natural curl for your eyes. Lasts up to 24 hours.  ",
        " 【Adjust Temperature Accurately】：Our heated eyelash curler comes with 3 temperature settings from 60°c to 80°c to gently curl your lashes and create stunning curls for different types of lashes without frizzing or pinching them.  ",
        " 【How to use】： Press the root of eyelashes and stay for about 5-10 seconds. Brush to the middle of the eyelashes and press again for about 5-10 seconds. Then press the end of the eyelashes and stay for about 5-10 seconds. Repeat 5-8 times.  ",
        " 【Rechargeable Portable】:Fast charging and easy to carry , Rechargeable heated eyelash curler has a slim and compact design, perfect for carrying on the go. It is a must-have in every girl's makeup bag.  ",
        " 【Safe and Harmless】：The double-sided anti-scalding comb teeth are safe and do not harm the skin, and the lashes are protected from the grooves through the bumps so that they are curled without damaging the eyelids.  ",
        " 【Tips & Tricks】:Apply mascara repeatedly to the roots of the lashes, move to the roots of the lashes and curl them upwards. Repeat 3-4 times, then apply another coat of mascara to define the look.  ",
        " 【A perfect gift】：This innovative heated eyelash curler is the perfect Valentine's Day/Thanksgiving/Christmas and birthday gift for your loved ones.  "
    ]
},
]