[
{
    "name": "        LQZ Cold Press Juicer, Slow Masticating Juicer Machines, 350W Juice Extractor Machine, 5.3\" Large Bore Feed Chute Fit Whole Vegetables and Fruits, Easy to Clean Juicer(Black)       ",
    "stars": [
        "71%",
        "2%",
        "7%",
        "3%",
        "17%"
    ],
    "pid": "B0D6R6754H",
    "ratings": "191 ratings",
    "other_info": {
        "Brand": "LQZ",
        "Color": "Black",
        "Special Feature": "Portable",
        "Product Dimensions": "13.2\"D x 16\"W x 15.27\"H",
        "Finish Type": "Mirror Satin"
    },
    "discount_price": "$ 79.99",
    "normal_price": "$199.99",
    "about_this_item": [
        " 【Easy and Safe to Operate】Our masticating juicer comes with a large 5.3-inch feed chute with a blade-less design that stops the machine when the lid is opened. It not only improves juicing efficiency, but also ensures safety!  ",
        " 【50rpm Slow Grinding Technology】Our cold press juicer, through the multi-stage extrusion technology, low-speed slow squeezing technology, can effectively reduce the damage to the cell structure of the fruit in the process of juicing, reduce the heat generation and oxidation, so as to retain more nutrients and the original flavor of the fruit.  ",
        " 【Multifunctional and Efficient】 This 350W masticating juicer comes with a food-grade auger head that handles a wide range of vegetable and fruit, a dual-layer filter that separates the pulp for a smoother texture, and a juice yield of 99 percent.  ",
        " 【Easy to Clean】Our all-in-one cold press juicer has only three parts and comes with a special cleaning brush for quick assembly, disassembly and cleaning!  ",
        " 【Troubleshooting Steps】1.When installing the cold press juicer, make sure that the handle is perfectly aligned with the position of the on button.2.Insert the Spiral Grinding Head into the bottom and rotate counterclockwise to ensure that the Spiral Grinding Head is fully seated on the motor shaft.3.You should make sure that the cover is pressed down tightly.After confirming that the above steps are correct and the cover is tightly closed, try to turn on the device again.  "
    ]
},
{
    "title": "Fantastic Juicer, A Must-Have for Healthy Living",
    "rating": "5.0 out of 5 stars",
    "content": "I've been using this juicer for a few weeks now, and I couldn't be more impressed with its performance. If you are serious about your health then this is your juicer you need. It has exceeded my expectations in every way. It's a fantastic investment for anyone looking to incorporate fresh, homemade juices into their diet. I highly recommend it to anyone in the market for a reliable, high-performance juicer.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First and foremost, the build quality is excellent. It's clear that this brand has used high-quality materials, and the design is both sleek and sturdy. It fits perfectly on my kitchen counter without taking up too much space.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "EcoSelf Large Mouth Juicer",
    "rating": "1.0 out of 5 stars",
    "content": "The large 5.3-inch feed chute is a game-changer. I can feed whole fruits and vegetables without spending time on chopping. The safety feature that stops the machine when the lid is opened adds an extra layer of security, which is great if you have kids around.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The juicing process is incredibly efficient. The powerful motor and sharp blades make quick work of fruits and vegetables, producing a smooth and delicious juice every time. The juice tastes fresher and more vibrant compared to other juicers I've used in the past. I love that it handles leafy greens just as well as it does harder produce like carrots and apples. The extraction rate is impressive, leaving very dry pulp behind, which means you're getting the most juice possible out of your ingredients.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Excellent juice; won’t disassemble and unusable",
    "rating": "5.0 out of 5 stars",
    "content": "Cleaning up is a breeze, which is often a pain point with juicers. The parts are easy to disassemble and dishwasher safe, making the whole process hassle-free. This convenience has encouraged me to use the juicer more frequently, knowing that cleanup won't be a chore.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Another standout feature is how quiet it is. Compared to other juicers I've used in the past, this one operates with minimal noise, making it perfect for early mornings or late-night juicing sessions without disturbing the household.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Cold press juser",
    "rating": "3.0 out of 5 stars",
    "content": "I love this juicer so much. It works perfectly fine and lot faster than I was expecting. I like the act that the juice comes out one way and the trash come out the other way, which makes it easy to clean up.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer has efficient extraction ability to extract more juice from fruits and vegetables. The slow juicer preserves the nutrients in fruit and vegetable juice provides a healthier drink option.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Enjoy it",
    "rating": "4.0 out of 5 stars",
    "content": "The price and product quality are very good. Love this color.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Used the juicer for the first time this week and was impressed by how easy the juice flowed. However, I’ve been unable to disassemble or clean the juicer. I’ve done my best to remove the visible pulp but I cant unlock the units from each other to  properly clean, which means I haven’t been able to use the juice more than that one time. Disappointed but hoping o can get some direction of a replacement to continue on with my juicing.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Amazing product",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this for my household as I wanted to get to a more healthy lifestyle. I always was scared of the cleaning process with these types of products but this one is extremely easy to use and clean. The juice comes out very clean and all I have to to is cut whole fruits into halves. Best thing is the value for money and high end quality that you get with it.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer not only worked well, but it was quieter than I was expecting a juicer to be.  I loved that!  It also has a couple safety features I appreciate and will not operate if top parts are not securely on the base.  It separated the juice from pulp very well and was easy to use.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Quieter than expected",
    "rating": "5.0 out of 5 stars",
    "content": "First of all its so easy to clean and mess free.Performance wise is so good which yield high good quality pulp free juice as compare to my other juicer machine.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Value for money, easy to dry and easy assemble and dissemable.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Easy to clean",
    "rating": "5.0 out of 5 stars",
    "content": "Note:- dont put your machine parts in dishwasher it will change the shape of your machine which wont fit back and you can't take out juice.Always clean with warm soapy water and let it air dry.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I want to start making more of my food from scratch even what I drink is important. I wanted an easy to use easy to clean juicer and let me tell you this goes above and beyond for my needs. I used carrots, grapes, raspberries, blackberries, ginger, apple, red cabbage, small piece of beet, and coconut sugar small amount of water. This was perfect. Pay attention to instructions how to put together and get it working small pieces is needed to juice properly.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Had so much fun making my own blend of juice",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is great, works so well and can pretty much juice anything and everything. It’s super speedy and always gives me the best results. There’s never too much pulp and I feel like I’m drinking store bought juice when I use it. Would recommend!",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recently purchased this Cold Press Juicer, and I couldn't be happier with my choice! The first thing that caught my eye was its stunning pink color. As someone who follows a strict diet, I rely on fresh juices to keep me on track. This cold press juicer handles everything from tough leafy greens to soft fruits with ease. Very happy with the purchase.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Juicer does it all!",
    "rating": "5.0 out of 5 stars",
    "content": "I am really enjoying this it’s compact and doesn’t take up much space and does a great job so far",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The LQZ Cold Press Juicer is powerful and efficient, with a 5.3\" wide chute that handles whole fruits and vegetables easily. It preserves nutrients well and is easy to clean, making it a convenient choice for daily juicing. The sleek black design is a plus, but it does require some counter space.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Highly satisfied!!",
    "rating": "5.0 out of 5 stars",
    "content": "Love this juicer! Easy to use and clean! Comes with its own cleaning brush . Well worth the money, perfect countertop size nice and pouring cup to move to larger container. Juice was pulp free! makes orange juice faster than it takes to peel the oranges!",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really like this. it lets you collect you juice and the quality if great.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "This is great",
    "rating": "5.0 out of 5 stars",
    "content": "Might get another one for a gift.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What I like about this is that it uses centrifugal force to juice both vegetable and fruits",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Well made juice maker !",
    "rating": "4.0 out of 5 stars",
    "content": "This is price worthy product, first of all I was double about this juice maker cause it is pricey, however, when I start making my favorite bitter melon juice I start loving it, cause it produce lots of juice and I don’t have to redo it again. Second, this is such easy to resemble and quiet mode and it gives me the opportunity to perform juice at night while child is sleeping. Last, it is very easy to clean up machine! This is definitely a plus for me. I would definitely recommend to all of my friends!",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to assemble, material is strong and looks beautiful in kitchen. Works as expected.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Beautiful and strong",
    "rating": "5.0 out of 5 stars",
    "content": "This extracted juice very well a little noisy but overall one of the best juicers I have used. The pulp was 85-90 dry😱 The extractor container fills up fast.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I'm really impressed. Its ability to extract juice from fruits and vegetables without chopping is a big plus, and the performance is excellent—the juice comes out vibrant and almost pulp-free, which is just what I was looking for. I really appreciate the quiet operation and the compact design that fits perfectly in my kitchen without taking up too much space. Cleaning is also a strong point, as it disassembles and cleans easily, making maintenance a breeze, although I did have some trouble taking it apart the first time. In short, this juicer has transformed my morning routine, allowing me to enjoy fresh, healthy juices with minimal fuss.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Best little Juicer I have had",
    "rating": "5.0 out of 5 stars",
    "content": "This compact gadget is changing my routine for the better. I have been making fresh vegetable juice everyday and the clean up is so easy since the pulp is being pushed out of the machine. It is very easy to put together and disassemble as well and surprisingly not too loud when operating. The chute isnt too big so certain vegetable or fruit may need to be cut to fit the chute, it comes with a pusher to help as well. It comes with a small brush to help clean up the mesh and mostly just rinse off. Because it is so easy to use and especially clean up, I am more than happy to make fresh juice everyday!",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fill it on this machine never stays put. You always have to hold it down with your hand, making it impractical as you have to stand and wait until you’re done juicing. You can’t add all ingredients at once walk away and come back. You have to hold it shut or else it turns off.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Great juicer",
    "rating": "5.0 out of 5 stars",
    "content": "What truly sets this juicer apart, besides its citrus prowess, is how incredibly easy it is to clean. Cleaning my old juicer was a nightmare with its mesh filter that constantly clogged. This juicer? A breeze. No tiny bits getting stuck, everything cleans up effortlessly.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "When I first got it I thought it was broke bcus it wasn’t working but then I realized that everything has to be line up just to start it but once I figure that out I haven’t had a problem since but bayyyybeeee one thing I am going to say IS THAT THIS THE ONE RIGHT HERE GET IT THATS ALL TO IT LOL since I got this juicer I juice up everything I LOVE IT SO MUCH EVERY ONE ASK ME WHERE I GET IT FROM",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "I love this juicer",
    "rating": "5.0 out of 5 stars",
    "content": "I tried it and it works well and the juice becomes smoother for the features there are no obstacles whatsoever and the sound is not so noisy I like it and size good",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I got this and absolutely loved it. The product is game-changer. Its sleek design fits perfectly in my kitchen, and the powerful motor handles all types of produce effortlessly. The juice it produces is smooth and pulp-free, and it's surprisingly quiet. Cleanup is quick and easy, making my mornings hassle-free. Highly recommend for anyone looking to elevate their juicing experience!",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Works great juicer!",
    "rating": "5.0 out of 5 stars",
    "content": "The juicer surpassed my expectations! We are really enjoying it and the price is good. Silent, compact, does not take up much space, easy to use and quick to wash. Juice can be obtained from any vegetables and fruits. It was surprising that we got 3 glasses of juice from several fruits (1 orange, 2 apples and 1 carrot), and the pulp came out really dry. I am very satisfied with this purchase. Our mornings became joyful, and breakfasts became bright and healthy.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Omg i used it every day",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Good Quality",
    "rating": "5.0 out of 5 stars",
    "content": "Buen producto",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is very convenient and easy to use. Definitely made my life easy",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Very good",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use. I love it",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great quality and value",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Found my juicer",
    "rating": "5.0 out of 5 stars",
    "content": "Very nice juicer, works as aspected, great motor, easy to use and perfect size",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It’s OK, but some of the stuff is still hard to get out of the machine even if you use the brush",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "A nice juicer for my daily juicing routine. I’m been using it with pineapple, cucumbers, carrots, apple and oranges, it extracts a lot of juice.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and easy to clean it, the process takes a few minutes, making it easy for daily use.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Great juicer",
    "rating": "5.0 out of 5 stars",
    "content": "I also like the size, way smaller than my old one. Really convenient for my small kitchen",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This product works great! Easy to assemble.. When using its not loud, works fast, and you get actual juice and no pulp from it. I definitely recommend it. It's easy to take apart for cleaning.. must have for those who like fresh juice. Good value of the money",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Good",
    "rating": "5.0 out of 5 stars",
    "content": "It handles celery and other veggies really well. The large feed chute saves me time since I don’t have to cut everything up. The juice tastes amazing and keeps all the nutrients. Cleaning is super easy with just a few parts. I also appreciate the safety feature that stops the machine when the lid is opened. Highly recommend!",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Its worth the money guys. Go run for it.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Great for Fresh Juice!",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product. It has definitely been a life changer for my family.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This is an excellent juice machine, easy to clean and assemble. It squeeze more juice than all my previous machines, and very quiet, easy to operate. It works for both veggie and fruits, is very suitable for daily kitchen use. Also reasonable price and great service. I highly recommend this good product.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Ok juicer",
    "rating": "5.0 out of 5 stars",
    "content": "The juicer is ok hard to take apart",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "You get what you paid for. Made in China.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Less than descent",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is amazing, it squeezes all the nutrients out of the fruits, I am in love!",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Use this to make orange juice and does the trick no problem. Easy to use and great for the price. Highly recommend",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "The best Juicer ever!",
    "rating": "5.0 out of 5 stars",
    "content": "Es fácil de acomodar y limpiar exprime bien",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very convenient to use and clean, people who needs less hassle with cleaning and making juice this product is for you",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Juicer works great",
    "rating": "5.0 out of 5 stars",
    "content": "I havent used it yet but i am so excited to use this!! Its perfect!! The color is not too bright its easy to assemble as well!",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First time using a juicer, I like that it’s not bulky.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Muy bueno",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to dissemble and wash. Won’t cut any fingers at least",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nice juicer you can use any fruit or veggies you like to have. Cleaning the machine is very easy.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "awesome product",
    "rating": "5.0 out of 5 stars",
    "content": "it’s an awesome product i loved using it and it had no trouble",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like how easy is to make juice out of the whole fruit. Easy to clean great price",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Best juicer machine",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer works fantastic it’s great for your health and even fun using it as a family.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "The cold press idea to get vegetable or fruit juice is not good as it is a lot of waste of the pulp. I needed three times more of carrots to get one litter of juice. It might be ideal for coconut or olives to extract de juice to do oil, but not good for juice.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Works like a charm",
    "rating": "5.0 out of 5 stars",
    "content": "Only used once so far but I really like it. No complaints.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Definitely compact size, that is ok. It rocks as it was juicing as if the base was off balance. I had to strain the juice a couple of times to get a cleaner product. I compared this to the expensive juicer that it mimics it's design, and it's no comparison. If you don't mind straining after juicing then it's for you.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Not good to extract juice",
    "rating": "1.0 out of 5 stars",
    "content": "I was very hopeful based on other reviews. Poor quality, received used, broken and piece missing. I requested an exchange, but exchange was also broken and missing pieces! Returned both items and still waiting for a refund. Refund process is much slower than other Amazon items. I do not recommend this product or seller.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I missed my return window so I have to keep it. The hole for the pulp to exit is too small, therefore everything gets stuck. You will have to clean it at least 3-5 times to juice one pineapple.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Good juicer",
    "rating": "1.0 out of 5 stars",
    "content": "Compared this with other juicer and quantity is less, the base stuck to the juicer component and takes lot of juggle to take it loose and clean.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Returning the product not worth anything",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Do Not Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "The item does not work. The pusher was missing. After several attempts according to manufacturer instructions the juicer does not turn on or work. Dont waste your time or money.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Hard to unassemble and stop working after using for only 2.5 months.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Do not recommend",
    "rating": "1.0 out of 5 stars",
    "content": "The compartments seized and was unable to separate to clean had to throw out",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "The juicer got jammed after two uses. I could not get it unstuck.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Never again",
    "rating": "1.0 out of 5 stars",
    "content": "This product does not produce 99% yield. The disposed pruduct is still very moist and the space from the catch cup to the spout is not close enough and it spills.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Me faltaron un par de piezas, no servia la tapa de la jarra y tenia k moler agarrandola.😥😥😥",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Do not buy this product",
    "rating": "1.0 out of 5 stars",
    "content": "didnt turn out to be expected! :(((",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first juicer, so I do not have much to compare to. I started with oranges, removed the peel and as much white stuff in there as possible. The pulp came out fairly dry and there was plenty of juice. I moved on near the end of the oranges with blueberries. I have read these can give a bit of a problem for this kind of juicer. But I did get the juice out of them. Albeit a little thicker than the orange. I finished with a no-no for this juicer...Strawberries. The instructions say not to use strawberries as they are starchy in texture and can clog the machine. Well, I have over 100 pounds of frozen strawberries from my garden this year, and I wanted to try it. Very happy with the results. Now, full disclosure. When you thaw strawberries in the microwave, a lot of juice is already released. I just poured this into the juice collector, and then added the thawed berries to the juicer. Plenty more juice came out. Again, a little thicker, and the pulp that came out the pulp shoot was still fairly wet. But here is the best part. The pulp tasted amazing. Essentially like a good jam. You could totally just freeze the pulp as freezey pops or use right away as jam for toast. I did not try the orange or blueberry pulp this way. It didn't look as appetizing coming out.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Not what is stated",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer worked well. I look forward to when my apples ripen fully. Will try my hand at juicing those this fall.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As a health-conscious consumer, I've been on the hunt for a reliable and efficient juicer that can extract the maximum nutrients from my fruits and vegetables. After doing extensive research, I decided to invest in this masticating cold press juicer, and I have to say, I'm thoroughly impressed.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Great Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is worth every penny. I used to use very cheap juicers and they were very noisy. I decided to spend a little more for this and this purchase is a very quiet juicer and I don't worry about waking anyone up in the morning when I make my juice. I only batch a day or so in advance, so I haven't had any problems with overheating. (I also throw in fruits and vegetables whole fruits/veggies). It's very easy to disassemble and clean.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Best Juicer Ever",
    "rating": "5.0 out of 5 stars",
    "content": "I use it for about 35 minutes at a time without any problems. It's easy to use, easy to clean, and has a sleek design. I juiced carrots, ginger, radishes, cucumbers, apples, spinach and celery. I really like the zero pulp, deliciously smooth fresh juice. It's very quiet, doesn't take up much space, and is very efficient. I was worried about overheating, but haven't had that problem!",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Good speed !",
    "rating": "5.0 out of 5 stars",
    "content": "It is very easy to use and I managed to make a delicious celery juice. However, to prevent clogging, make sure you cut thick celery stalks into small pieces. It's also easy to clean and I appreciate its durability. I plan to use it to make more juice this hot summer.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Disappointed with Quality and Performance",
    "rating": "1.0 out of 5 stars",
    "content": "I purchased the LQZ Cold Press Juicer with high expectations, but unfortunately, my experience has been very disappointing. The product arrived with visible damage, The juicer also stopped working properly after just a few uses, which is unacceptable for a product at this price point.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The build quality feels cheap and flimsy, and it certainly doesn’t match the description provided. I found the cleaning process to be more tedious than advertised, and overall, the machine did not live up to its promises.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Slow cold pressed juice is the best",
    "rating": "5.0 out of 5 stars",
    "content": "I strongly advise potential buyers to think twice before purchasing this product. It does not deliver the performance or quality that it claims, and there are better options available in the market.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Feel free to adjust the review according to your specific experience, but ensure that it’s honest and reflects your true experience with the product.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Cool juicer",
    "rating": "5.0 out of 5 stars",
    "content": "This does a great job extracting all of the juice out of the fruit. The cold press process extracts the best flavored juice. And this was so easy to use and to clean. I can’t wait to juice some fresh black cherries so make homemade black cherry icecream! It’s going to be amazing!! I think this will last a long time because it seems really well made.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve been trying to improve my diet and health. Given that I need to eat more fruits and especially veggies, this juice press is an easy way to help me do that. This is my first juicer and it was easy to set up out of the box (after washing, of course) and I was making juice with a some apples, peaches, and bananas. I’ve made delicious combinations of juice everyday the last few days.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Best compact masticating Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "I love that it runs quietly, so I can make juice for the family in the morning without waking anyone. The parts are easy to clean and dishwasher safe. The color is also very attractive and subdued, which is perfect for our kitchen. If you’re looking for an easy way to make your diet healthier, then I highly recommend this press.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Amazing Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "Recently my juicer at home broke so I had to buy a new one.  I came across this product and decided to buy it because it was really pretty.  Typical juicers don't look very pleasing to look at, but this one does.  Even though it is pleasing to the eye, it is a very strong juicer.  I love my new juicer because it blends everything well without having to cut the fruit or vegetables into smaller chunks and the juice comes out like little to no pulp.  This is great for juice lovers like me!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recently purchased the LQZ Cold Press Juicer and it has exceeded my expectations in every way. The 5.3\" large bore feed chute is a game-changer, allowing me to fit whole fruits and vegetables without the tedious task of chopping them up. The 350W motor is powerful yet remarkably quiet, delivering smooth and nutrient-rich juice every time.One of the standout features is how easy it is to clean; the parts come apart effortlessly and are dishwasher safe, which makes the entire process quick and hassle-free. The sleek black design also adds a modern touch to my kitchen. Overall, this juicer offers exceptional performance and convenience, making it an excellent choice for anyone looking to enjoy fresh, homemade juice with minimal effort. Highly recommend!",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Exceptional Performance and Convenience – A Top-Notch Juicer!",
    "rating": "5.0 out of 5 stars",
    "content": "The LQZ Cold Press Juicer is fantastic! It efficiently extracts maximum juice, preserving nutrients and flavor. It's sturdy, quiet, easy to clean and store with detachable parts. This juicer is a game-changer for healthy, delicious juice. Highly recommended—five stars!",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I choose this because of anesthetic look of it. It’s so pretty! But then after I used it I become addict. Use it every 2 days now. Convenient and I feel so healthy drinking juice from it. I went online to look up recipe too. It’s easy to clean and blend very well. I have use over 10+ juicer so pretty familiar with function. Recommend.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Amazing Product!",
    "rating": "5.0 out of 5 stars",
    "content": "I used this juicer to make fresh juice, and the taste is truly amazing! It’s also very easy to clean with only a few parts that need washing. Plus, it’s very safe to use since it doesn’t have sharp blades but instead uses safe plastic components. Overall, this juicer is fantastic, and I would definitely recommend it to my friends. Love it!!",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have just bought a new home. I was really looking for a juicer for long time. In the beginning I was doubting about its efficiency. I used it in a daily basis since I bought it. My wife usually said this is the best machine I ever bought. My kids loved to help us. It’s easy to use, juice is usually pure and good looking. I highly recommend this. Thanks",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Love it!!!!",
    "rating": "5.0 out of 5 stars",
    "content": "Bought as a gift for my friend's housewarming party! Shipping was super fast and she absolutely loved it. After the party, I was still at her house helping her clean the mess and she made watermelon juice for us. It was super nice to see how easy it was to assemble and make juice out of it",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very effective product and works as described. high quality and durable. A plus.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "This is amazing! Fresh and Delicious Juice!",
    "rating": "5.0 out of 5 stars",
    "content": "Love how easy it’s to make my own juices with this machine. Instructions on how to assemble are pretty straight forward and easy to follow.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0D6R6754H"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The juice Machine it’s easy to clean and it doesn’t take much space on my kitchen. Looks great by the way. Good product.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B0D6R6754H"
},
]