[
{
    "name": "        Stove Top Cover for Electric Stove, 30\"x21\" Silicone Stove Mat for Glass Top Stove, Heat Resistant Glass Cooktop Cover, RV Cooktop Protector Mat for Counter, XL Dish Drying Mat for Kitchen (Black)       ",
    "stars": [
        "85%",
        "6%",
        "3%",
        "4%",
        "2%"
    ],
    "pid": "B0DCB6CNZG",
    "ratings": "138 ratings",
    "other_info": {
        "Material": "Silicone",
        "Size": "XL",
        "Color": "Black 30\"×21\"",
        "Brand": "Puliyunxiang",
        "Item Weight": "1.6 Pounds"
    },
    "discount_price": "$ 19.",
    "normal_price": "",
    "about_this_item": [
        " 【Glass & Ceramic Top Stove Cover】This extra large 30\" x 21\" silicone stove cover for top electric stoves is perfect for protecting your electric stove top, kitchen countertops from scratches and stains. Leaving you a clean and undamaged kitchen surface.  ",
        " 【Extra Kitchen Space】When the stove is not in use, the stove mat protector placed on the stovetop can serve as a countertop, It keeps surfaces clean and tidy while giving you more countertop space.  ",
        " 【Anti Scalding Silicone Mat】Our glass-top stove cover doubles as a silicone trivet mat that can hold hot pots and pans. Heat resistant up to 450°F, its raised wide ridges separate the hot pot from the table and protect your kitchen surfaces from scalding.  ",
        " 【Silicone Dish Drying Mat】The electric stove top cover is designed with wide convex ridges to increase air circulation and effectively capture dripping water from kitchen utensils, cups, fruits and vegetables. Its high edge and waterproof features keep countertops dry and clean, making it an ideal kitchen drying mat.  ",
        " 【Easy Clean & Storage】This stovetop counter cover is easy to clean, you can rinse and scrub it with water or even throw it in the dishwasher and just let it air dry naturally. Its flexible nature allows for convenient folding and compact storage, ensuring it stays ready for use whenever needed. Keeps your home away from dust and scratches, stay as good as new.  ",
        " 【Please Note】Please make sure your stove top cools down before you put the stove cover on and ensure that it is not used while cooking!!!  "
    ]
},
]