[
{
    "name": "        Cold Press Juicer, ZASMIRA Juicer Machines for Vegetable and Fruit with Upgraded Juicing Technology, Powerful Quiet Motor, Compact Size for Space-Saving Juicer, Easy to Clean       ",
    "stars": [
        "82%",
        "9%",
        "4%",
        "0%",
        "6%"
    ],
    "pid": "B0DCNBLLPX",
    "ratings": "97 ratings",
    "other_info": {
        "Brand": "Zasmira",
        "Color": "Navy",
        "Special Feature": "Overheat Protection",
        "Product Dimensions": "11.23\"D x 6.95\"W x 11.66\"H",
        "Recommended Uses For Product": "Fruits, Vegetables"
    },
    "discount_price": "$ 99.",
    "normal_price": "$199.99",
    "about_this_item": [
        " 【Enhanced Cold Press Technology】Zasmira cold press juicer features advanced 3-in-1 cold press technology, combined with 0.1mm ultra-fine compound grinding teeth ensures to extract juice which preserves vital nutrients and enzymes with enhanced purity and optimal absorption, making it an ideal choice for health-conscious individuals.  ",
        " 【Lock Design, Locked Nutrition, Juice \"JAR\"】 Zasmira juicer machines adopts the plug design to lock nutrition and avoid oxidation during juicing. Meanwhile, you can use it as a walking juice bottle to store the juice and drink it whenever you want or get a refill. This makes it a great helper for an outdoor picnic or a road trip.  ",
        " 【Compound Grinding Teeth Design】Zasmira mini juicer comes with innovative patent design with ultra fine up-down compound grinding teeth to filter the juice from the juice pulp. This design adds the fineness and purity to the juice, and also eliminates the hassle for mesh-strainer cleaning. Our juicer adopts streamlined design, all parts can be directly flushed clean.  ",
        " 【Compact and Lightweight for space saving】This cold pressed juicers designed with both functionality and aesthetics in mind. It equped with 100w Copper motor, which ensures stable and powerful performance to extract juice in a efficient way and keep the quiet operation.It has a sleek and compact design that seamlessly fits into any kitchen. Maximize your counter space.  ",
        " 【Ideal Gift with 3 Years of Warranty】Zasmira masticating juicer can handle a variety of ingredients from leafy greens, vegetables to soft fruits and hard fruits. With a 3-year warranty and 24/7 customer service, not only it is a practical addition to your kitchen, but also an ideal gift for you loved ones, let's cheer for health!  "
    ]
},
{
    "title": "Portable juicer and smoothie machine",
    "rating": "5.0 out of 5 stars",
    "content": "This is a good juicer and smoothie machine, you can take it with you anywhere: for travel, trips, etc. The machine is small, but powerful, easy to use and easy to clean. Overall, good quality product. It does exactly what it’s supposed to do, and is very simple to use. This is definitely something to add to your kitchen would definitely recommend.",
    "post_time": "Reviewed in the United States on February 25, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm surprised at how much power that little machine has; it's perfect for preparing protein at the gym.\"",
    "post_time": "Reviewed in the United States on February 13, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Great portable press juicer!",
    "rating": "5.0 out of 5 stars",
    "content": "It's easy to use and perfect for on-the-go juicing. The compact design makes it ideal for short travel. recommend for anyone looking for convenient and portable juicing option.",
    "post_time": "Reviewed in the United States on February 24, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is perfect for juicing and making smoothies. Trying to get summertime fine so this is just what I needed. I love how portable it is and I don't have to transfer juice from one container to another. I just put the lid on and go. Blends great, I'm very happy with this purchase.",
    "post_time": "Reviewed in the United States on February 23, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Small and easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "My old juicer can only get less than half of the juice comparing to this one. Would recommend because of the saving from all the fruits you have to buy. Save me time hand squeeze the remain of the fruits.",
    "post_time": "Reviewed in the United States on December 9, 2023",
    "pid": "B0DCNBLLPX"
},
]