[
{
    "name": "        TOPMAKE 【2024 Upgrade】 Scale for Body Weight, Digital Bathroom Scale BMI Weighing Body Fat Scale, 25 Body Composition Analyzer with App sync with Bluetooth, Batteries and Tape Measure Included, Black       ",
    "stars": [
        "98%",
        "2%",
        "0%",
        "0%",
        "0%"
    ],
    "pid": "B0DGTFWPVR",
    "ratings": "88 ratings",
    "other_info": {
        "Brand": "Topmake",
        "Color": "Black",
        "Recommended Uses For Product": " ",
        "Special Feature": " ",
        "Display Type": " "
    },
    "discount_price": "$ 79.",
    "normal_price": "$1.51",
    "about_this_item": [
        " 25 analysis of main body composition monitors:weight、body fat rate、BMI、muscle mass、BMR、moisture content、heart rate、fat mass、protein rate、lean body mass、subcutaneous fat rate、skeletal muscle rate、skeletal muscle mass、visceral fat、muscle rate、muscle control quantity、fat control quantity、standard weight、weight control、bone mass、body type、obesity level、health assessment、physical age、body score.  ",
        " Body fat scale length, width and height upgrade:giveaway batteries and tape measure、weight:3pounds、size:11.02x11.02x1 inch、long battery life for 1 years、safer with 6mm tempered glass、 press UNIT button on the back sideof the scale body to switch（kg/lb） 、max capacity: 400lbs/180kg.  ",
        " Sync weight data to other app:25 body composition measurements that can be monitored and tracked on the Unique Health app anytime, anywhere, over a period of time (daily, weekly, monthly, or even yearly), which can help steer you toward a healthier lifestyle or track your fitness progress.  ",
        " Support unlimited users:the TOPMAKE digital bathroom scale allows you to add unlimited users to the Unique Health app, baby mode can also record the weight of children and pets so that the whole family can share a scale.It is also the best gift for friends, family, men, women and colleagues.package contents - 1 x digital weight scale, 1 x user manual, 3 x 1.5v aaa batteries, 1 x tape measure.  ",
        " Bluetooth scale work with smart app:download Unique Health app at app store or google play, you can connect and sync your data from this smart weight scale with apple health, google fit, and monitor your health anytime. enable bluetooth on your phone and open the app, then step on barefoot to get all your body composition data.reply within 24 hours ＆ satisfaction guarantee:If the body fat scale equipment fails, we provide 2 year free replacement and free technical support for life.  "
    ]
},
{
    "title": "Amazing Smart Weighing Scale",
    "rating": "5.0 out of 5 stars",
    "content": "I really love this stylish smart weighing scale. It gives me so many different metrics to track my fitness journey and progress. It calculated body fat mass,  body fat percentage, BMR,  Heart Rate and a lot of other metrics that I’d love to know and keep a track of. Their app is also super intuitive and easy to use. I’d definitely recommend buying this if you’re looking for an easy to use smart weighing scale.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0DGTFWPVR"
},
{
    "title": "Thin, lightweight, and accurate",
    "rating": "5.0 out of 5 stars",
    "content": "Ordered this scale to check my weight occasionally and was delighted to find its incredibly light weight compared to previous scales I’ve owned. You can toggle between kilograms and pounds and it only takes 3 AAA batteries which is nice. The scale is accurate and very sleek, it doesn’t take up much room in both height or width and is easy to move around. Pairing to the Bluetooth phone app is optional, the numbers read in large letters on the main display.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0DGTFWPVR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Scale looks sleek and collects metrics very quickly. Weight is spot on and unit uses non-skid feet to keep it in place. Weight is shown by default in kilograms. Scale includes batteries and tape measure.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0DGTFWPVR"
},
{
    "title": "Sleek and fast scale",
    "rating": "5.0 out of 5 stars",
    "content": "The scale is nice quality. It did have my body fat higher than other methods (BodyStat had me at 15% and is a $2000 machine, skinfold had me at 19. This scale had me at 26%).  Most important is the trend tracking. This seems better than most as it isn’t just a mirror of BMI so it may actually be doing a body scan. I’ll have to use it over a few months to see how the body readings change.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0DGTFWPVR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "so thin and sleek looking. takes up no room which i love!",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0DGTFWPVR"
},
{
    "title": "Good Quality",
    "rating": "5.0 out of 5 stars",
    "content": "Scale is pretty accurate. When it measures, it doesn’t just measure my weight but also analyzes whole lots of data. Weight, Heartrate, BMI, Fat Mass, Fat Ratio, Muscle Rate, Muscle Mass, water ratio, protein ratio, etc. It feels like annual blood test but ones that you don’t have to starve the night before and drive early in the morning. The app gives you motivation to workout and be healthier again. It says my body age is older than my actual age",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0DGTFWPVR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Can keep track of multiple users, that's perfectly what i needed for my family",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0DGTFWPVR"
},
{
    "title": "Works Great!",
    "rating": "5.0 out of 5 stars",
    "content": "Works good for our whole family",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0DGTFWPVR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wanted to a scale for my weight room. I found this one which is more then just a scale light weight, thin, and has a app to track different heath attributes. These include heart, bmi ect. Come ready right out the box and scan qr to download and setup your app.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0DGTFWPVR"
},
{
    "title": "Health Coach, rather than just a scale",
    "rating": "5.0 out of 5 stars",
    "content": "Great scale with app showing many weight metrics! Very sturdy and works on carpet and hard floors.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0DGTFWPVR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the quality of this scale.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0DGTFWPVR"
},
]