[
{
    "name": "  The Alice Network: A Novel ",
    "stars": [
        "69%",
        "23%",
        "5%",
        "1%",
        "1%"
    ],
    "pid": "0062654195",
    "ratings": "73,062 ratings",
    "other_info": {},
    "discount_price": "$ 10.46",
    "normal_price": "$19.99",
    "about_this_item": []
},
{
    "title": "I will never forget this amazing story.",
    "rating": "5.0 out of 5 stars",
    "content": "I finished this book last night and I haven't stopped thinking about it. I would like to preface this by saying that I read a lot. Probably about 3 books a week. I do work a full-time job, so for me, that's a lot. If you look at my bookshelves you may have the impression that I rate all books 4 or 5 stars. Not true. I only rate the ones I love, that leave a mark. And while I would like to write reviews for all of them, I just don't have a whole lot of time for writing out everything I love about them. Regretfully so. As an author myself, I know how important reviews are, so I do hope to one day be able to go through my bookshelves and write at least a few words for them. But certain books that truly and utterly sweep me away while reading, I try to write something because I want others to experience a truly amazing book. And this book - it was truly amazing.",
    "post_time": "Reviewed in the United States on July 14, 2017",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Let me add that this isn't my typical genre. I probably wouldn't have even read it had my friend, Christie, not messaged me one night and said how much she was loving it. I waited for her to finish to get her final thoughts and what she said was... \"You have to read this! I can't stop thinking about it. I know you and you will LOVE IT.\" That's true...she does know me and she knows what books will likely make me all aflutter and get my heart racing. So, with that in mind, I bought the book. I didn't even need to second guess it. But I didn't start on it immediately. I had some writing of my own to do and another book I had started reading that I wanted to finish. But every time I turned on my Kindle this book was staring me down, so I finally gave in and said...\"I'll read the first chapter now and pick it back up later.\" Well...so much for plans. I started reading and before I knew it I was a few chapters in and glued to my Kindle. Page after page, I was IN it, totally invested and completely spellbound. I had just a vague idea of what the book was about as I tend to avoid reading reviews until after I've finished a book. Basically, I look to see who liked it and take that into account, but I don't want to know anything else. I love going into a book blind. And so, blind is how I started this journey.",
    "post_time": "Reviewed in the United States on July 26, 2017",
    "pid": "0062654195"
},
{
    "title": "All the Qualities for a Great Read",
    "rating": "5.0 out of 5 stars",
    "content": "From the start the author had me at the first line in the first paragraph in the first chapter.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The first person I met in England was a hallucination.\"",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "0062654195"
},
{
    "title": "Incredible",
    "rating": "5.0 out of 5 stars",
    "content": "I remember thinking...whaaat? I had to keep reading. I needed to know what kind of character I was dealing with here. Is she supposed to be a little crazy?",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Well, the answer to that is, no. She wasn't crazy. But she was brilliant and brave and troubled and worried and grief-stricken. She also, like many women in those days, had to deal with double standards and prejudices against women. It was a battle on every front. Literally. But her \"hallucinations\" were just her mind and heart pushing her to search for her cousin, Rose, who had gone missing during WWII in France. And when she decided she would follow her \"hallucinations\" until she found answers the story takes off - almost straight away. I loved Charlie. To be so young, she set out to find her best friend/cousin and I love her for loving Rose so much.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "0062654195"
},
{
    "title": "Beautiful, heartbreaking, excellent storytelling",
    "rating": "5.0 out of 5 stars",
    "content": "Enter Eve. Eve was the woman who could help her find Rose. Maybe. All Charlie had was a name on a report. The journey began there - at Rose's doorstep. The two women did not like each other one bit. Eve was much older and had lived a hard, unhappy life. She was not thrilled to have trouble knocking on her door late at night. And when you dive into her character and find out what all she had to endure your heart will break. Mine did. So many times. Because the story spans across two wars and many difficult choices. The past, 1915, and the present, 1947.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Throughout this book's journey so much is discovered about Eve and her past. Why was she so bitter and angry? What made her this way? While reading Eve's timeline (1915) we learn it all. Oh my God, do we learn it all. Not a detail is left to wonder. It's all laid out for us with every turn of the page. I can honestly say I have never been so affected while reading a book. Eve's story is one of the most heartbreaking stories I have ever read, and yet, I felt so much pride for her too. She was probably the most 'real' character I have ever had the pleasure of reading. And not just her - but every single character in this book is completely real to me. I feel like I not only read a piece of our history, but that I was actually there while it happened, while it all unfolded in real time.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "0062654195"
},
{
    "title": "Great read!",
    "rating": "5.0 out of 5 stars",
    "content": "So many characters I fell in love with. So many of them. The Alice Network, for which Eve was a part of, is not made up. It existed. These women did so much for the war effort during WWI, made unspeakable sacrifices, suffered the likes we will never fully comprehend. They are true heroines and real events are threaded throughout this fictionalized story. I am regretful that I had never heard of the Alice Network before reading this book. But now that I have I am better for having read it and I have been forever changed.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I could talk about this book for days. There is just so much I can't discuss here in this review for fear of giving away spoilers, but I will never forget it. I will never forget a single word written. So many quotes I have read and re-read. So many scenes I think about even now and get teary eyed over. The ending was perfection. A beautiful and long-lasting friendship was forged between Charlie and Eve by the time we make it to the end. More than friendship, even. A family was formed. And I can't think of a single thing I would change. Hard to read at times, yes. But it was the hard times that made the sweet spots so much sweeter.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "0062654195"
},
{
    "title": "Great read. Large print version so nice.",
    "rating": "5.0 out of 5 stars",
    "content": "I read this and bought a large print version for my mother in rehab facility recovering from a stroke. She read this in two days. It was a significant signal that she would mend.  Lovely story, excellent quality binding.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book left me speechless, it was an amazing story, told in such a way that I had to read it beginning to end with barely a break. Captivating read!!",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "0062654195"
},
{
    "title": "Amazing Book!",
    "rating": "5.0 out of 5 stars",
    "content": "As good or better than The  Rose Code. Characters so well drawn they are real. And I felt like I was there. Not sure to whom I wouldn’t recommend it.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book has an amazing story line...wonderful characters and really brings to life the horrors of War and the joy of redemption.",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "0062654195"
},
{
    "title": "fasten your seatbelt!",
    "rating": "5.0 out of 5 stars",
    "content": "This story will keep you guessing, while a bit of predictability maintains the flow. Tragedies of war will tear you apart as the characters struggle to deal with the mental carnage and form binding friendships in the process. A solid historical read with the touch of romance,  you'll love it.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What a story of amazing women that fought for the freedom of their country and endured all the atrocities that war brings to it.  Beautifully written, I couldn't put this book down. Although historical fiction, it shared the story of many.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "0062654195"
},
{
    "title": "Wonderful read",
    "rating": "5.0 out of 5 stars",
    "content": "I really loved the two tales of this story.The character development was wonderful.And it had a great ending..what goes around comes around…",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I could not put this historical spy thriller down ; I feared for these heroines with every page turned. This novel has fantastic characters.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "0062654195"
},
{
    "title": "Compelling from the start",
    "rating": "4.0 out of 5 stars",
    "content": "Thank you for some humor in a not funny at all time.  You made it possible to love all the women that fought for their country.  You made each of them to be able to stand proud.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This novel held my interest from the start. a unique story about the women who gave all during WW1 and WW2. I highly recommend.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "0062654195"
},
{
    "title": "Best Novel!",
    "rating": "5.0 out of 5 stars",
    "content": "This is the best storyline and character's that I have read in several years.  Historical fiction at it best.  10 star read!",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Learned a lot from this historical novel.  It's important to remember what came before our time, that people are not sheep, that everday people can be extraordinary.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "0062654195"
},
{
    "title": "Great read.",
    "rating": "4.0 out of 5 stars",
    "content": "Nice plot Action Facts Interesting characters Great reading for someone who likes historical fiction action Europe First and Second War 20 century",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So brave…..well written",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "0062654195"
},
{
    "title": "great action",
    "rating": "5.0 out of 5 stars",
    "content": "To put ourselves in their place-to honor our mothers and their peers.Thanks to them and to honor their bravery.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So may wonderful elements! I couldn’t w down and for once a happy ending.  I will look for more books by Kate Quinn.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "0062654195"
},
{
    "title": "To honor the brave women that we thank for our freedom",
    "rating": "5.0 out of 5 stars",
    "content": "The book enlightens the reader with truth and a tale of the women’s spy network. They were brave and daring in their devotion to country.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "While this is a fictionalized history it os based on many real heroines and villains .  It is so well written you will wonder if you can finish it.  Steady on and you will find it worth it.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "0062654195"
},
{
    "title": "fabulous in every way",
    "rating": "5.0 out of 5 stars",
    "content": "A story worthy of taking my time to read. You wont be disappointed you read this book that takes place over a 50 + year span. I grew to love the 2 women and the 1 man. Hopefully, you will, too.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Best book I've read in a long time.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "0062654195"
},
{
    "title": "awesome",
    "rating": "5.0 out of 5 stars",
    "content": "It was very well crafted kept me enthralled for days, which is not an easy task.  Great historical references made it that much more believable and enjoyable.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was so hard to put down. The story wrung every possible emotion out of me, left me well satisfied yet still wanting more…",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "0062654195"
},
{
    "title": "Well Done, Kate Quinn!",
    "rating": "5.0 out of 5 stars",
    "content": "War time drama leading to post war revenge.  The characters intertwine more and more during the retelling of past and present challenges.  The lives of spies, a pregnant teenager, a soldier with smoldering anger are revealed.  The action never stops.  The bonds of the characters shift as they work together.  Great read.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Liked the tales of spy episodes in the war and the outcomes.Dangerous and happy times make for a good story.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "0062654195"
},
{
    "title": "Strength and Perseverence",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this. Admire the heck out of its characters, and developed a new respect for a group of brave patriots who fought without fear.  Great investment, great read.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What a story~ or stories.  Not for the feint of heart, Kate Quinn has done it again!  I loved it!!!!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "0062654195"
},
{
    "title": "TWISTS AND TURNS",
    "rating": "5.0 out of 5 stars",
    "content": "I found this book to be extremely well written, the plot is really interesting and it becomes more and more riveting. I'm compelled to read her other books because I enjoyed this one so much, very substantive.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It was such a good story going back and forth between two young women, both brave, trying to find their way in the world",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "0062654195"
},
{
    "title": "amazing true book.",
    "rating": "5.0 out of 5 stars",
    "content": "What a story (and what a story teller.) Five Stars for The Alice Network about female spies in Europe during World War 1 (and II.)",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I could not put the book down and was sad when I finished it. It was everything a good thriller and mystery a book could be. I marveled how the author brought the  characters together with all their ups as downs. The ending was great 👍",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "0062654195"
},
{
    "title": "What a solid, charming WWII Historical Fiction...",
    "rating": "4.0 out of 5 stars",
    "content": "... filled with two strong, stubborn, willful women determined to do whatever it takes to heal their wounds, find answers, and, if necessary, enact revenge.",
    "post_time": "Reviewed in the United States on September 5, 2021",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "1915 Eve Gardiner is recruited as a spy in the Alice Network. Though she has a hindering speech impediment that has consistently held her back and causes others to see her as simple and stupid, Eve is anything but. She is fiery and bold, ready to go to great lengths to thwart the German enemy and see France liberated. She ends up going undercover in a France restaurant, covertly spying on German patrons and relaying their information to the spy network.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "0062654195"
},
{
    "title": "Importance of  Friends & Family",
    "rating": "4.0 out of 5 stars",
    "content": "1947  Charlie St. Clair is determined to find out what happened to her cousin Rose during the Second World War. Like sisters, Charlie grew up in America, Rose in France, and refuses to believe that Rose is dead, even though she and her family have not heard from Rose in several years.",
    "post_time": "Reviewed in the United States on August 27, 2020",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "As Charlie and her mother head to Switzerland to \"take care of\" Charlie's \"Little Problem,\" (unwed and pregnant), Charlie decides she is going to use the opportunity instead to go find answers in London, starting with Eve Gardiner, a woman who may know what happened.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "0062654195"
},
{
    "title": "This is copied from my book blog. It includes notes from our book club meeting in July.",
    "rating": "5.0 out of 5 stars",
    "content": "But Charlies is startled to find Eve an old miserable drunk with deformed hands, filled with bitterness and not keen to humor Charlie who is so obviously on a doomed mission. But eventually, the two women's stories begin to intersect, crossing at a common enemy that they will now do everything in their power to bring to justice.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "In many ways, this book had a lot of the same fire, spirit, and moxie as The Nightingale by Kristin Hannah. It told the story of two women, one who had seen more than her fair share of trauma, one who loved so deeply she was unwilling to let go, and how they find and help each other along the way, not allowing fear to stop them.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "0062654195"
},
{
    "title": "An American, a Scotsman, and an English spy in France",
    "rating": "4.0 out of 5 stars",
    "content": "What did it matter if something scared you, when it simply had to be done?”",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I often enjoy Historical Fictions that take such a deep look into human relationships and character during a time fraught with so much hatred, horror, and ugliness. I find these stories, although fictional, to be true portraits of the resilience, strength, and endurance that most people had to go through during these times. It is heartbreaking, but empowering at the same time. And you absolutely route for these women.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "0062654195"
},
{
    "title": "Enjoyed",
    "rating": "5.0 out of 5 stars",
    "content": "Though Eve's story was far more harrowing and intriguing, I found Charlie's unwillingness to conform to gender roles to be refreshing, especially during the time in which this was written. I wasn't overly interested in Charlie's search for Rose, but I was still along for the ride as the relationship between Charlie and Eve, as well as Eve's driver Finn, became close and fiercely protective while learning about Eve's past and all she went through.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was my first ever experience with Kate Quinn and I am definitely excited to read more from her in the future. This charmed me from the beginning and I think Eve and Charlie's story will stick with me for some time.",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "0062654195"
},
{
    "title": "Sobering",
    "rating": "3.0 out of 5 stars",
    "content": "Since the story is based on truth it's a hard one to read. Gruesome details, foul language and brutal scenes make this one not for the squeamish! I have enjoyed other books by this author, but I sincerely hope this will not become her method of choice, to shock the reader. Her historical accuracy are much appreciated, but I personally don't like the ugliness so prevalent in this story, whether based on truth or otherwise!",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was weary a first, but after a few chapters, I was hooked. Such a wonderful, sad, and complicated story during times of war. The characters were easy to picture, and their history before and together was what kept me reading. Loved this book.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "0062654195"
},
{
    "title": "Didn't want to put it down",
    "rating": "5.0 out of 5 stars",
    "content": "Set in the period post ww2, the book follows the unlikely intersection of two storylines with two  unassuming strong determined women protagonists on a shared adventure.",
    "post_time": "Reviewed in the United States on February 20, 2021",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Privileged American university student and math whiz, Charlie st Clair- ‘yank’, determines to ‘solve for x‘ and find her cousin Rose, lost at war. Foul mouthed British OBE, seeking revenge on her long lost foe ‘Rene’, who carries not just physical cracks and scars of her time as a British spy and a member of the ‘Alice Network’ in ww1.",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "0062654195"
},
{
    "title": "Powerful portrayal of the bravery of ‘Fleur du Mals’ of WW1",
    "rating": "5.0 out of 5 stars",
    "content": "A lucid reminder of the ghosts of war that last long after the war has ended.",
    "post_time": "Reviewed in the United States on February 1, 2018",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Following their journey and retracing events of the past through France, from roubaix to Rouen, Lille and accomplishing their mission in scenic Grasse (what’s not to love). The alternating chapters of which I’m not usually a fan of but in this book ensures that the experiences of the present are fully experienced in the context of the events of the past during WW1.",
    "post_time": "Reviewed in the United States on February 22, 2022",
    "pid": "0062654195"
},
{
    "title": "A Simplistic and Muddled Portrayal of WWII Female Spies",
    "rating": "3.0 out of 5 stars",
    "content": "The chemistry between three unassuming individuals are bound by two infallible reliable threads- love and humour (and a bright blue lagonda doesn’t hurt!)",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Charlie was born in a privileged family, not without her battles and pains, including that of losing her sibling but quickly realises,  life is not an arithmetic problem. If it was it would be easier, break people down to their common denominator and solve, numbers didn't lie, there was always an answer, the answer was either right or wrong’.",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "0062654195"
},
{
    "title": "Couregous Women",
    "rating": "5.0 out of 5 stars",
    "content": " I thought the author was also significantly ahead of the times here, in the 1940s, where the conversations between Charlie and Rose, two young girls were beyond the superficial ones around looks and beauty, Charlie wanted to grow up to be ‘different’ .",
    "post_time": "Reviewed in the United States on July 18, 2017",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The story is based on a real hero, Louise de Bettignies or Alice Dubois who ran a network of spies in Lille region during WW1, which further deserves merit, uncovering and celebrating the role and successes of these unknown, rarely spoken heroines of war.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "0062654195"
},
{
    "title": "Amazing book!",
    "rating": "5.0 out of 5 stars",
    "content": "The Alice Network is truly one of the most beautiful books I have ever read! Now I know that is a bold statement, but I truly stand behind that statement; from its cover, to the rough edge, to the amazing story, that truly rocked my world, that when you finish the book, your mind is blown.",
    "post_time": "Reviewed in the United States on July 4, 2017",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "But let me tell you about the book; The Alice Network is more than just one woman's tale of finding her cousin; it more than one man's struggle to right the wrong he committed; and it's even more than a old women's desire for revenge! And while all those things are true, in this book.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "0062654195"
},
{
    "title": "Great story.",
    "rating": "4.0 out of 5 stars",
    "content": "But The Alice Network is unique TO ME, as that the story has a ring of truth to it, and though I am English and studied WW1 and WW2 in secondary (High) school, I was taught very little about the women's role in the war, outside of the home front and nursing, so after reading this book, I started reading all I could about Louise de Bettignies, who was a spy for the British in World War 1, under the pseudonym Alice Dubois!! And if you read though the Author notes, there is a further reading section, which I'm planning on reading through.",
    "post_time": "Reviewed in the United States on October 21, 2019",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Alice Network is set over two time periods, we start in 1947, after World War 2, and with American/French Charlie St. Clair, an unwed pregnant young women, who was still reeling from the loss of her brother, and the longing to find her cousin, whom disappeared in France during the war. Her French mother was determined to resolve her \"little problem\" and then return to America like nothing had ever happened! But Charlie was determined to find her cousin, and to do that she had to escape from her mothers watchful eye, and get to London to find Eve Gardiner, the one women who might help her.",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "0062654195"
},
{
    "title": "World Wars historical with strong flawed women characters",
    "rating": "4.0 out of 5 stars",
    "content": "Now the second time period of this book is 1915, and Eve Gardiner story, which is a story of pain, betrayal, and determination of a young women, determined to do her part in the Great War, but one that left her broken, until 1947, when a determined young American arrives on her doorstep, looking for help!",
    "post_time": "Reviewed in the United States on June 19, 2017",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Oh my goodness, I could literally go on for days, raving about this book, and how amazing it is, but I implore you all to read this book! And be prepared to become as impassioned about this book as I am.",
    "post_time": "Reviewed in the United States on June 28, 2018",
    "pid": "0062654195"
},
{
    "title": "great book",
    "rating": "4.0 out of 5 stars",
    "content": "I give The Alice Network 5 stars!",
    "post_time": "Reviewed in the United States on August 7, 2023",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I liked that it was based on actual history.",
    "post_time": "Reviewed in the United States on February 24, 2021",
    "pid": "0062654195"
},
{
    "title": "A two parter...",
    "rating": "5.0 out of 5 stars",
    "content": "Characters in a book must have stakes. The reader must be convinced that there are important reasons for their actions, and that the consequences of failure can be dire. In police procedurals, detectives investigate and solve crimes. That’s their job, their stakes. If they don’t catch a murderer, for example, will someone else die? For soldiers, the reason they enlist to fight in a war, even at the cost of their own lives, may be because of duty and patriotism. Perhaps the stakes for a protagonist (or antagonist) are personal, like revenge for a past wrong. Think of the movie ‘Taken’ with Liam Neeson, for example, or ‘The Count of Monte Cristo’ by Alexander Dumas. This leads me to ‘The Alice Network’ and the stakes found in the story. The book is about the intertwined lives of two people: Evelyn (Eve), a young British woman whose patriotism caused her to become a spy in the Great War (WWI), and Charlotte (Charlie), an American college age woman on a personally important trip to post-WWII Europe. The reader bounces back and forth in time with these women, separate and together, on their quests. Evelyn becomes a spy to help end the war quickly; Charlie runs away into France to find a cousin she hasn’t seen or heard from in years. Except I was unconvinced by their reasons for doing these things--their stakes--and it was frustrating. Both made huge human errors—through ego, grief, and self-pity—that strayed into the cliché and seemed to artificially drive the story. And I didn’t really like either of them. They came together during the post WWII time period—a shattered, bitter older Eve and the naïve Charlie—in coincidence, not my favorite fictional trope.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "But as the story unfolded, I soon realized the first half of the book set me up for the brilliantly huge and consequential stakes of the second half, and that the second half was an amazing and redeeming read. As Charlie learned about the fate of her cousin, the stakes of her journey increased. She began to grow up and to deal with her self-pity and the consequences of her actions. And as Eve zeroed in on the man who caused her living hell, ‘The Alice Network’ became a fascinating and fast-paced tale of revenge and journeys of self-forgiveness for both Eve and Charlie. I ultimately enjoyed the book and its theme of redemption.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "0062654195"
},
{
    "title": "WWI vs WWII -- Literary Novel vs Chick- Flick",
    "rating": "3.0 out of 5 stars",
    "content": "It is an entertaining book and I enjoyed reading it, but I gave it only 3 stars because it has incongruences and a all-is-well one-star end.",
    "post_time": "Reviewed in the United States on September 15, 2017",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is the story of 2 women, 2 wars and one nasty male traitor.",
    "post_time": "Reviewed in the United States on November 3, 2023",
    "pid": "0062654195"
},
{
    "title": "An excellent read from a gifted author",
    "rating": "5.0 out of 5 stars",
    "content": "Eve and her story in WWI is well written and very engaging. I admired how the author could recreate masterfully the atmosphere of occupied France and the life of a female secret agent who was working to spy on the German invaders.  The male French collaborateur is also well depicted.  Eve and her challenges are all real.  The decadent verses of Bodelaire echoe in the air.  I went to re-read \"Les Fleurs du Mal\".  The predator -prey relationship is artistically defined.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The story of Charlie, on the other hand, is weaker and tainted by an unrealistic modern American feministic approach.  She is the second protagonist of this book: underaged, pregnant and searching for a purpose in life,  she goes on a quest all by herself, against the wishes of a pathetic mother, trying to clarify what happened to her beloved cousin who disappeared during WWII.  She's more predictable and less real.  No girl in those days would find liberation and consolation to a PTSD by sleeping with all her university pals.  Sex and self liberation were not connected.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "0062654195"
},
{
    "title": "Great read",
    "rating": "5.0 out of 5 stars",
    "content": "Her mother is more of a caricature of the ideal idiotic burgeoise maman than a true character.  The Scottish hunk who accompanies both ladies in their quest  is a little bit of a joke, a candy for dreaming housewives. It seems to spring out of one of those cheap romantic novels which you buy at gas stations and corner stores. The illustration on the cover  would portray this handsome shirtless mechanic passionately embracing the beautiful young girl in the rear of a stunning 1900's collector car.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The grand finale is bombastically unreal. It seems out of a Far West movie.  In a nutshell: half of this book was truly great, the other half was a disappoiniment.  Perhaps this stems from the fact that I had the privilege of hearing first hand stories from real French, Italian and German women, who lived during WWII and whose mothers lived during the previous war.  This talented but somehow naive author seems to have grasped some of the truths of what happened and how people were during those days, but her modern North American cultural approach reveals that she has more groundwork to do.",
    "post_time": "Reviewed in the United States on April 28, 2020",
    "pid": "0062654195"
},
{
    "title": "Great, couldn’t put it down.",
    "rating": "4.0 out of 5 stars",
    "content": "Personally, I found the end a literay mistake: unrealistic, rushed, over optimistic and somewhat childish. ",
    "post_time": "Reviewed in the United States on December 4, 2019",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kate Quinn's \"Diamond Eye\" was my favorite book this year so I naturally wanted to read more from her. \"The Alice Network\" tells the story of two women and alternates between 1915 and 1947. Eve Gardiner is a young woman who is recruited to become a spy during WWI and is trained by Lilli, the leader of the Alice Network. Charlie St. Clair is an unmarried and pregnant college student desperately looking for her cousin who was lost during this war. In the 1940s timeline, she meets Eve who has become old, bitter and a little crazy. Quinn skillfully unwinds both girls' histories and tragedies. While the book is wonderfully written and based on real people doing amazing things, it was, at times very disturbing. Still, an excellent read from a favored author.",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "0062654195"
},
{
    "title": "Great for my book club",
    "rating": "5.0 out of 5 stars",
    "content": "If you like historical fiction, World War eras, you will enjoy this book.",
    "post_time": "Reviewed in the United States on February 10, 2019",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Well written, I really enjoyed this book and recommend it. I will definitely check out other books by Kate Quinn!",
    "post_time": "Reviewed in the United States on January 4, 2019",
    "pid": "0062654195"
},
{
    "title": "Best book I’ve read in a while!",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this book! The characters are developed so deeply, you become so invested. There is a small part in the beginning that is somewhat slower but once it hooks you in, you want to read to the end!",
    "post_time": "Reviewed in the United States on April 23, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As soon as I started reading I knew I would like this book. One of the best I've ever read and really wanted the story to go on forever - to just never end. Great storytelling and never boring. Enjoyed the characters interacting with each other and a twist at the end I didn't see coming. 5+ stars. Expecting The Rose Code today by this author and can't wait to get started. What a journey!",
    "post_time": "Reviewed in the United States on February 21, 2024",
    "pid": "0062654195"
},
{
    "title": "Amazing Book!",
    "rating": "5.0 out of 5 stars",
    "content": "The book was very entertaining. Character development was fantastic. I plan to read anything Kate Quinn writes. She transports you back to that time period.",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I do see what the other reviewers are saying, the part of the book that takes place during WWI does seem to be written better than the part that takes place in 1947. I didn't love Charlie at first either but she grew on me. I do feel it's worth reading. The joining of the time periods was a bit contrived but the ride is fun. I loved reading about this female spy network that actually existed and played an important part in gathering intelligence in WWI. She does a good job of describing the war torn towns and how badly the people were affected by the shortages and the fear and stress of life under German rule. She talks about many issues specific to women. I see what the others are saying about it being a \"chick-lit\" book disguised as a historical fiction book, but hey, I like a little romance. I felt that it was whitewashed enough that I didn't have nightmares but realistic enough that I got the point. I have had to put down many good books because I just can't take the horrors depicted, the torture scenes etc. In fact I've had to swear off fabulous authors because I can't sleep. So if you are like me, and you like a little chick lit thrown into your historical fiction, but yet still want to read about a substantially interesting time period and some awesome women that spied on the Germans, risking life and limb quite literally, then go for it. I couldn't put it down until the final sappy page!!! No shame in rooting for some happiness amongst the ruins.",
    "post_time": "Reviewed in the United States on August 12, 2019",
    "pid": "0062654195"
},
{
    "title": "I loved it",
    "rating": "5.0 out of 5 stars",
    "content": "My most favorite novels are those which are set in the 1930’s and 1940’s before, during and right after the Second World War.  I enjoy reading everything about that era in history and so was drawn to read “the Alice Network” by Kate Quinn.  This novel is a fictional account of an actual British spy ring in Paris during the Great War, and the consequences that occurred both during and after the Second Great War.",
    "post_time": "Reviewed in the United States on November 22, 2017",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Charlie St. Clair is a young girl who is unmarried, pregnant, and hounded by her parents to “take care of the situation”.  Instead, Charlie takes off by herself with only one note that may lead her to her beloved cousin Rose, who is presumed dead.  Charlie thinks that Rose was involved with the Resistance in France during WW II and is not ready to give her up for dead.  She finds Eve Gardiner, a mouthy, drunken old woman, who may have information about Rose.  Eve Gardiner was recruited to be a spy in France during the First Great War.  She and two other women gave valuable information to the British about German troop movements and artillery.  Something happened to her during that time, something that made her live a life of drunkenness and seclusion.  When these two women join forces to find the truth, this is the story.",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "0062654195"
},
{
    "title": "Enjoyable historical fiction",
    "rating": "4.0 out of 5 stars",
    "content": "I thought this novel was very well researched and written and could not put the book down.  The intrigue, suffering and patriotism of the female espionage agents during both wars were painfully shown.  I applaud the author for bringing to light the escapades of our brave women who may have turned the tide of the war.",
    "post_time": "Reviewed in the United States on January 18, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Took a while to get into the story...it eneded up being a good story just a bit long and slow.",
    "post_time": "Reviewed in the United States on January 15, 2020",
    "pid": "0062654195"
},
{
    "title": "Women of War",
    "rating": "3.0 out of 5 stars",
    "content": "Loved the time periods and historical significance, although having chapters go from one to the other was disconcerting.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book kept popping up on my Amazon feed as something I would like.  I resisted it until it was chosen as one of the books for my book club.  I really enjoy historical fiction, especially books about the World Wars and the important roles played by women.  Half of this book was about the Alice Network of spies, many of them women, who were vital to defeating the Germans in WWI.  The other half of the book added little to the story and often seemed like fluffy padding with a heroine who I wanted to throat punch. And I will never understand how she captivated that dreamy Finn character!",
    "post_time": "Reviewed in the United States on June 15, 2018",
    "pid": "0062654195"
},
{
    "title": "Gripping",
    "rating": "4.0 out of 5 stars",
    "content": "The Alice Network follows the story of 2 women. Evelyn Gardiner, a female spy recruited to the Alice Network in France during World War I and Charlie St. Clair, an American socialite searching for her cousin in the aftermath of WW2. These women are brought together in a mesmerizing story of courage and redemption.",
    "post_time": "Reviewed in the United States on September 6, 2022",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book had history, suspense and even a bit of romance. It was a fast paced story about real life heroines whose actions and words were sometimes the difference between living and dying.",
    "post_time": "Reviewed in the United States on February 23, 2024",
    "pid": "0062654195"
},
{
    "title": "Know Right From Wrong",
    "rating": "5.0 out of 5 stars",
    "content": "What I liked; Dual POVs. gripping & well paced. I also liked that the Alice Network was a real network of spies and based on real people. The author did their research and I liked walking away learning something new.",
    "post_time": "Reviewed in the United States on October 12, 2018",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What I didn't like; A bit long as most historical fiction books are. I could have cut about 50-75pgs. The ending was also a bit \"movie-ish.\"",
    "post_time": "Reviewed in the United States on August 1, 2018",
    "pid": "0062654195"
},
{
    "title": "Bringing history alive",
    "rating": "4.0 out of 5 stars",
    "content": "The women in this book knew the difference and fought for it.",
    "post_time": "Reviewed in the United States on December 8, 2023",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Still a woman in every sense but a \"soldier\" fighting what was right and destroying what was wrong.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "0062654195"
},
{
    "title": "Excellent historic novel",
    "rating": "4.0 out of 5 stars",
    "content": "Read it ladies and gents, it will give you the courage to do what's right for YOU!",
    "post_time": "Reviewed in the United States on November 21, 2017",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The Alice Network is everything I'm looking for in historical fiction.  Historical facts and intriguing historical figures are seamlessly woven with a plausible fictional story and characters that enrich the history.  What makes it better?  Take something that deserves the spotlight, but has somehow not received the notice it deserved, and make it shine.  Women are so often lost to the pages of history, even when playing critical roles, like the Alice Network was.  Kate Quinn brings us one of the greatest spies against the Germans in World War I and the network of operatives she ran in occupied Northern France.  The price they paid, at the time and through the decades after, is deftly portrayed throughout.  Eve, Lili and Violette earn their monikers of fleurs du mal, as well as that of heroes.  The story moves forward to 1947, when Charlie, searching for her cousin who has disappeared in the fog of World War II France, appears on Eve's doorstep.  It is difficult to fully understand the impact that two major wars in less than 40 years, can have on the people and countries where so many of the battles were fought and lives were lost.  Finn, Eve's driver, is more than a side character; he helps illustrate some of those WWII scars.  There are no stones left unturned, including some direct quotes taken from history.  This is a spectacular book and I highly recommend it.  Fans of historical fiction will especially enjoy this one.",
    "post_time": "Reviewed in the United States on December 17, 2017",
    "pid": "0062654195"
},
{
    "title": "solid read!",
    "rating": "4.0 out of 5 stars",
    "content": "I really enjoyed this novel. I was hesitant at first since it is one of those books that cover two different time periods at once. One story follows a woman in WWI who becomes part of a spy network...the Alice Network. The other story follows a young woman in 1949 who is looking for her cousin who was lost in France during WWII. I don’t often like books that jump back and forth in time from one chapter to the next. But the way the stories of all three women intertwine is so well done and the characters are so intriguing that I had trouble putting the book down. I learned so much about both wars that I never knew before. The descriptions of society and women’s place in the society of each time period was most interesting to me. Women can face different challenges than men in everyday let alone extreme situations and the challenges these three women faced in their lives are extraordinary to say the least. The book does a great job of explaining how society and war can affect women in particular. Now I am making it sound like some kind of ‘chick-lit’ novel and it is certainly not that. Are we so used to viewing war from a man’s point of view that a work about women in war is somehow less important? If anyone thinks that, they need to read this book to learn exactly what the Alice Network was, how it operated and how important it was to the success of the Allies in WWI.",
    "post_time": "Reviewed in the United States on October 26, 2023",
    "pid": "0062654195"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good book with female protagonists. I’m not typically one for historical fiction but this was a pleasure to read. Not at the top of my list but solid book.",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "0062654195"
}
]