[
{
    "name": "  The Best Minds: A Story of Friendship, Madness, and the Tragedy of Good Intentions ",
    "stars": [
        "58%",
        "27%",
        "10%",
        "3%",
        "2%"
    ],
    "pid": "014313289X",
    "ratings": "2,612 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "self serving but thoughtful",
    "rating": "3.0 out of 5 stars",
    "content": "A good analysis of mental illness but for me just too many references to Yale, the Ivy League and brilliance. It just felt overdone, as though the reader wasn’t smart enough to pick up the importance to the story the first, second, third fourth times…",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The book is so chocked full of mental health jargon it is hard to follow the actual narrative. One must have more than a passing capacity for learning advanced psychology to get through the entirety, and unfortunately it became tedious.",
    "post_time": "Reviewed in the United States on March 26, 2024",
    "pid": "014313289X"
},
{
    "title": "Not A Casual Read",
    "rating": "5.0 out of 5 stars",
    "content": "This is great book in so many ways. It is beautifully written - I did not find a single word or phrase that wasn't needed. Rosen tells a compelling story that makes the book hard to put down.  In addition to the drama of the story, it deals with an important issue for our time: How should we treat those with severe mental illness?  Rosen doesn't so much answer that question as intelligently and sensitively place the tragic story of his friend in the context of that issue.  Clearly, our mental health system did not work in this case as in so many others.  Finally, Rosen's voice in this book is a comfort.  He is a very wise and compassionate writer.  I am old and an avid reader, and this is one of the best books I have ever read.",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One of the best books I I have ever read. Compelling and tragically sad. Totally held my interest! Strongly recommended!",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "014313289X"
},
{
    "title": "This is a Great Book",
    "rating": "4.0 out of 5 stars",
    "content": "In this book, author Rosen recounts the life of his best childhood friend, Michael.  They both were academically gifted, stellar students who became Yale graduates.  Then Michael began to experience symptoms of schizophrenia, and the majority of the book concerns the twists and turns of his life thereafter.",
    "post_time": "Reviewed in the United States on May 8, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This author makes the occasional digression into marginally related topics, such as schools of literary criticism (he was an English major), deconstruction, and the metaphors of madness that permeate our language.  Some authors' digressions are annoying (I first wrote \"drive me crazy\"(!)), but I thoroughly enjoyed the detours that Rosen made.",
    "post_time": "Reviewed in the United States on May 24, 2023",
    "pid": "014313289X"
},
{
    "title": "Fascinating and tragic",
    "rating": "3.0 out of 5 stars",
    "content": "I deduct one star because I thought the editing was not as tight as it should have been, and there were a few too many sentences that were confounding and unclear.  That said, any 500+ page book that I can't put down and zoom through in two days must have a lot going for it.  I highly recommend this work.",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The subtitle is what interested me. I have a “brilliant” brother, diagnosed with paranoid schizophrenia, who murdered a family friend, was sentenced to life, and was paroled after serving 9 years and walked out with the loving support of family (including me) and friends, with a condition of his parole being that he must stay on his meds, only to quit taking his meds and then repeating the psychotic behavior that he exhibited before his crime. My father was required to file  charges against my brother to have him re-incarcerated after he began threatening family members because the parole officer said he couldn’t make my brother take his meds. I agree with the conclusions in this book of Owen Fiss that all of Michael’s supporters should have inquired into the possibility of violence.  The signs were there. My family didn’t make that inquiry and didn’t see the signs before the murder that my brother committed but did when my brother was out on parole. By that time, we knew what he was capable of.  It is the institution which provides the structure necessary for my brother to stay medicated and he has even refused to take his meds in prison in the years after his parole was revoked. This book will stay with me for a long time. The author has captured the very essence of this illness.",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "014313289X"
},
{
    "title": "576 pages - I read it in two days!",
    "rating": "4.0 out of 5 stars",
    "content": "...in both length and content, Sadly, it feels the books were interleaved at random. While I found the story about Michael interesting, for the most part, the interleaved backstory on mental illness/law/lawyers/psychiatrists/etc detracted from the first. I also feel the author, at times, is too focused on trying to write clever sentences rather than clearly conveying ideas. I'm  not shocked the book received such high praise from the literati but it didn't reach that bar for me.",
    "post_time": "Reviewed in the United States on January 15, 2024",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "This book reads as a dissertation...it is thorough, researched, and excessively long.  Difficult to read, unless it is a topic of interest.  I wish Michael the best, wherever in his mind he is.",
    "post_time": "Reviewed in the United States on October 17, 2023",
    "pid": "014313289X"
},
{
    "title": "excellent",
    "rating": "5.0 out of 5 stars",
    "content": "Thoughtful and powerful. New insights into old problems and engaging storytelling. Can’t stop thinking about this book and the true characters.",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "An excruciating tale of a genius with schizophrenia who murders his fiancée, believing her to be a wind-up doll. Highly engaging, yet insightful.",
    "post_time": "Reviewed in the United States on May 12, 2024",
    "pid": "014313289X"
},
{
    "title": "painfully brilliant and illuminating",
    "rating": "5.0 out of 5 stars",
    "content": "I am a professional in the field of psychiatry and have been working with folks with schizophrenia for almost two decades. It brought me tears because this man’s journey is too close to so many others. In the retelling of his friends story Mr. Rosen details the historical and societal context of this tragedy. He illuminates how our broken heath care system has left the seriously mentally ill by the wayside. He describes how it all broke down and how his friend was able to go untreated with a treatable illness that led to preventable tragic consequences. I highly recommend this to any reader. Then send one to your local legislators. We need to do better. We need treatment before tragedy.",
    "post_time": "Reviewed in the United States on September 11, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Well thought out balanced and reasoned discourse related in A truly but uncommon tragedy mistake by most of the press irresponsibly",
    "post_time": "Reviewed in the United States on December 13, 2023",
    "pid": "014313289X"
},
{
    "title": "Beautifully written",
    "rating": "3.0 out of 5 stars",
    "content": "I loved this book, it was heartfelt, well researched and heart lifting and heart breaking all at once.  It was simply too long and fill with a great deal that could have been edited out…",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This account of a friendship, through the hard work of the author is also a history of how schizophrenia has been thought about over the last 100 years. It provides both anecdotal and research-based evidence that those who romanticized schizophrenia as a sane reaction to a crazy world have done harm to those who suffer from it, and to the larger society which mistakenly embraced it",
    "post_time": "Reviewed in the United States on January 7, 2024",
    "pid": "014313289X"
},
{
    "title": "Thought Out carefully",
    "rating": "5.0 out of 5 stars",
    "content": "For me, one of the best books I have ever read. It resonated for me on many levels (in addition to being beautifully written in an intellectual and approachable.way ).  I care about mental health for personal and professional reasons. The author told a deeply personal story against the backdrop of society..one of my best friends from high school died tragically as a result of his schizophrenia. And for me its also a Jewish story about those in my age range, when relatives surviving the Holocaust was not a distant memory. I have already recommended to friends and watched Jonathan Rose's interview with Abigail Pogrebin.",
    "post_time": "Reviewed in the United States on September 17, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "History of mental illness and its complexities. A must in a world with so much mental illness!",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "014313289X"
},
{
    "title": "Very good book… but way too long",
    "rating": "5.0 out of 5 stars",
    "content": "This may be the greatest book I've ever read.",
    "post_time": "Reviewed in the United States on August 20, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "And it is about so much more than it is about.  Yes, it is the story of the author's close friend, but it is also about the very real-world intersections between philosophy, psychiatry, and law.",
    "post_time": "Reviewed in the United States on January 26, 2024",
    "pid": "014313289X"
},
{
    "title": "Riveting story but not a riveting telling",
    "rating": "4.0 out of 5 stars",
    "content": "The story of Michael Laudor was so incredible that Ron Howard wanted to make a movie about it. The Best Minds, however, is a challenging book to read, written by a friend and a PhD in literature who, honestly needed a good editor. Although I don’t like to scan through parts of a book, I found it necessary because the many tangents (French deconstructionist writers, for example) took away from the story itself. The writing, overall, was a struggle for me to read.",
    "post_time": "Reviewed in the United States on June 5, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First quarter of the book is captivating. Next quarter I felt dwelt overlong on the medical and political challenges of mental illness.  Next quarter was gripping.  Final quarter was back in the weeds of stating and restating the legal conundrums of mental illness.  Nevertheless recommend to true crime buffs and students of mental illness as well as the more casual lover of nonfiction.",
    "post_time": "Reviewed in the United States on December 12, 2023",
    "pid": "014313289X"
},
{
    "title": "Story charms until it grabs you by the throat.",
    "rating": "5.0 out of 5 stars",
    "content": "Truly a great, moving work of brilliance.  This book is why I read; to be taken some place I haven’t been (even though I grew up in New Rochelle)  and learn, experience and wonder about humanity.",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book starts out a little slow, though very well written.  Once you get to know the characters, it gets hard to put down.  It is a fascinating look at mental health disorders.",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "014313289X"
},
{
    "title": "spectacular book",
    "rating": "3.0 out of 5 stars",
    "content": "Only three because it’s amazing that none of these people, any group of them did not band together to convince Carolyn Costello to leave Michael Laudor at a time they knew he was spiraling. I also take exception to the title: this mind broke, therefore we cannot call it a “best” mind",
    "post_time": "Reviewed in the United States on December 26, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "There is a lot in this book. The author’s focus is a childhood friend & his journey in the 1980-90’s accessing care for schizophrenia. Along the way we learn about mental illness, government policy, & the power of loved experience.",
    "post_time": "Reviewed in the United States on July 11, 2023",
    "pid": "014313289X"
},
{
    "title": "Captivating memoir of a fascinating person",
    "rating": "5.0 out of 5 stars",
    "content": "The author explains how his best friend who is a brilliant scholar suffers from schizophrenia.  His friend, Michael has the support of his family, Yale Law School and many friends, but it is not enough to save him. This is a compelling read.",
    "post_time": "Reviewed in the United States on December 18, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Usually I walk away throughout a book with slow returns… but continued nightly on this one.",
    "post_time": "Reviewed in the United States on March 10, 2024",
    "pid": "014313289X"
},
{
    "title": "interesting",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve already started recommending to friends and family.",
    "post_time": "Reviewed in the United States on November 11, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is an important book, worth fighting through the sometimes dense prose written like an Ivy League literary graduate wrote it. At its core this has completely changed the way I think about mental illness and the way we treat it in our current age. Highly recommended reading.",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "014313289X"
},
{
    "title": "The Best Minds? Is Rosen included?",
    "rating": "3.0 out of 5 stars",
    "content": "I just started reading Rosen’s book, The Best Minds about his long childhood friendship with Michael Laudon (who was ostensibly brilliant, schizophrenic, and who - during a psychotic episode - became a murderer). I was hoping that Laudon would be described by someone who genuinely liked & cared about him. But, within a few chapters, it feels like Laudon’s “friend” didn’t like him much at all - in fact, he appears to resent him and subsequently underscores Laudon’s negative attitudes, behaviors, etc. (rather than his positive qualities). With Rosen’s own emotions affecting how this story is reported, I’m finding it no longer an objective account of Laudor and his life’s journey, but rather a validation of why Rosen resented him. I’m hoping this changes in the upcoming chapters.",
    "post_time": "Reviewed in the United States on May 10, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book offers a comprehensive history of mental illness and the institutional attempts to deal with a devastating disease. The author showed amazing incite into the life of his schizophrenic childhood friend through a fascinating, empathetic account of his life which took a turn toward the dark side.",
    "post_time": "Reviewed in the United States on November 12, 2023",
    "pid": "014313289X"
},
{
    "title": "Well written, informative and engrossing",
    "rating": "5.0 out of 5 stars",
    "content": "The journey is inclusive. You will learn more about the complete complexities of schizophrenia than you ever thought possible. your ability to empathize with those that might reach out to you in need will be heightened exponentially...",
    "post_time": "Reviewed in the United States on December 25, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This writer brings us such deep understanding of the life of those with schizophrenia. He does such intensive research coupled with his experience with the mentally I’ll young man.",
    "post_time": "Reviewed in the United States on January 18, 2024",
    "pid": "014313289X"
},
{
    "title": "Brilliantly written...",
    "rating": "5.0 out of 5 stars",
    "content": "This book, written in a scholarly yet personal point of view and",
    "post_time": "Reviewed in the United States on June 30, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Supported by legal experts, mental health advocates and law enforcers, tells the story of two childhood  friends. They become adults,& one of them is schizophrenic. HEand commits a murder after he refuses to take his medication.",
    "post_time": "Reviewed in the United States on May 9, 2023",
    "pid": "014313289X"
},
{
    "title": "great understanding",
    "rating": "5.0 out of 5 stars",
    "content": "The story shows readers the ramifications of poor mental  healthcare here and the unbearable sadness of an improperly treated",
    "post_time": "Reviewed in the United States on March 15, 2024",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Brilliant young man who becomes a murderer,",
    "post_time": "Reviewed in the United States on December 26, 2023",
    "pid": "014313289X"
},
{
    "title": "Violence & Mental Illness",
    "rating": "3.0 out of 5 stars",
    "content": "This is one of the best books I have ever read.  It's the story of a brilliant young man as written by his closest childhood friend who himself is extraordinarily bright.  They go through JHS, HS, and college together.  The friend is beset by schizophrenia in his early 20s and the story continues to unfold from there.  Beautifully written, insightful, thought provoking, heartbreaking and beautifully written.  A must read if there ever was one.",
    "post_time": "Reviewed in the United States on April 24, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is extremely well written, captivating and informative! Highly recommend!!",
    "post_time": "Reviewed in the United States on November 6, 2023",
    "pid": "014313289X"
},
{
    "title": "Eye-opening!",
    "rating": "5.0 out of 5 stars",
    "content": "This book taught me, a mental health professional, a lot about the history of mental health treatment and the intersection of mental illness and the legal system. The tragedy at the heart of this story is a call for action for all involved with individuals with serious mental illness to recognize the importance of medication compliance to ensure the best possible outcomes for all. Rosen’s writing is superb and his research thorough and relevant.",
    "post_time": "Reviewed in the United States on May 10, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A terrific retelling of the life of his childhood friend and their decades long relationship and a well articulated history of mental illness in America over the last 80 years. Insightful, thought provoking and overall a terrific read.",
    "post_time": "Reviewed in the United States on September 27, 2023",
    "pid": "014313289X"
},
{
    "title": "outstanding",
    "rating": "5.0 out of 5 stars",
    "content": "I was mesmerized by this book.  It is remarkably crafted and the writing is sterling. Alas, it is the tragic story of Michael Laudor, the author’s best childhood friend.",
    "post_time": "Reviewed in the United States on October 14, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed this book.  The story of two friends.  One is diagnosed with scizophrenia in young adulthood.  Besides the story of this friendship and the illness, there is lots of information about the mental health system of today.  Very well written, informative, and enjoyable.  I highly recommend it.",
    "post_time": "Reviewed in the United States on May 28, 2023",
    "pid": "014313289X"
},
{
    "title": "astonishing",
    "rating": "5.0 out of 5 stars",
    "content": "I am in shreds reading this book. It is brilliant in every way.",
    "post_time": "Reviewed in the United States on December 22, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I appreciated the history of mental illness care intertwined with the heart breaking story of the author’s friend.  Both brilliant and ambitious young men, one cut down by mental illness.  Unanswered questions haunt the story, but it makes for a realization that illness is illness and autonomy not withstanding, should be treated.",
    "post_time": "Reviewed in the United States on June 6, 2023",
    "pid": "014313289X"
},
{
    "title": "Compelling",
    "rating": "3.0 out of 5 stars",
    "content": "I wanted to like this book and in the beginning I did.  Frankly, I had not remembered the tragic ending so I was looking forward to learning the events leading up to the murder.  However, getting there was a slog.  There was way too much extraneous information not relevant to the story.  As with other reviewers, I found myself skipping page after page.  All in all a disappointment.",
    "post_time": "Reviewed in the United States on June 10, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The thing I like best about this book was that it interspersed the story of the man with schizophrenia with research on the subject and the writer’s own personal and educational development.  It was hard to put down!",
    "post_time": "Reviewed in the United States on August 15, 2023",
    "pid": "014313289X"
},
{
    "title": "I am gobsmacked by this book.",
    "rating": "5.0 out of 5 stars",
    "content": "For me, Jonathan Rosen is the genius he could never compete against. His descriptions of Michael’s arrogance haunt me. The incredible amount of time and resources needed for invisible wheel chairs rings true and the laws make it impossible for families to make life saving decisions. I commend Jonathan for his courage and scholarship.",
    "post_time": "Reviewed in the United States on May 4, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wasn't familiar with Michaels story, but the book grabbed me immediately. It was relatable and yet hard to believe in many places, the history lesson of how far we have to go in addressing mental illness was motivating.",
    "post_time": "Reviewed in the United States on August 10, 2023",
    "pid": "014313289X"
},
{
    "title": "Had to abort at 20%….too much unnecessary detail",
    "rating": "2.0 out of 5 stars",
    "content": "I really wanted to like this book based upon the reviews and being on the best of 2023 lists, but I became so bored with the overlong detailed musings that I jumped ship at 20%. I found it to be a painful read and began skimming the pages looking for content relevant to main story line. So many unnecessary details and tangents. This author sorely needed an editor with a red pen who wasn’t afraid to cut.",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "An astonishingly beautiful memoir. The Best Minds treats an extraordinary range of topics that radiate out like the spokes of a wheel from its hub, the story of a gifted young man who descends into madness and kills his pregnant fiancé under the impression she is a simulacrum who means him mortal harm.",
    "post_time": "Reviewed in the United States on April 22, 2023",
    "pid": "014313289X"
},
{
    "title": "Incandescent",
    "rating": "5.0 out of 5 stars",
    "content": "This is simply one of the best written books and thought provoking story that I have ever read.  Thank you Jonathan.",
    "post_time": "Reviewed in the United States on September 3, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Beautifully written exploration of a highly complex and critically important subject. Touches the heart and the brain. A must read.",
    "post_time": "Reviewed in the United States on September 18, 2023",
    "pid": "014313289X"
},
{
    "title": "Excellent writing",
    "rating": "5.0 out of 5 stars",
    "content": "I liked the two major characters because they are real, had mountains of difficulties in their lives and overcame enormous problems.  The fact that everything in the book actually happened makes it more remarkable .",
    "post_time": "Reviewed in the United States on June 4, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Masterful writing that addresses issues like friendship, rivalry, society's treatment of mental illness, and many more in the most sensitive, insightful, and compassionate way. The extensive and thorough research, coupled with beautiful prose, make this a great read.",
    "post_time": "Reviewed in the United States on May 3, 2023",
    "pid": "014313289X"
},
{
    "title": "Wow!",
    "rating": "5.0 out of 5 stars",
    "content": "This book could not be put down!  The true story of Michael Landor as told by his childhood friend, Jonathan Rosen, is a crushingly sad tale of a brilliant person gone awry.  Excellent read!",
    "post_time": "Reviewed in the United States on May 29, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "For someone of Jonathan Rosen’s generation, this book is enthralling. A tribute to a childhood friendship, an indictment of so-called community mental health initiatives and the sad fallout of denial and “good intentions”.",
    "post_time": "Reviewed in the United States on June 14, 2023",
    "pid": "014313289X"
},
{
    "title": "True story of two young men with outstanding minds.  One turns out to be schizophrenic",
    "rating": "5.0 out of 5 stars",
    "content": "Do you want to be totally absorbed from the first page to the last? Mental illness, it’s effects on a family, community and a lifelong friendship. I loved this book.",
    "post_time": "Reviewed in the United States on July 5, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A very good book about the background and thought processes of a person with a kind of mental condition.",
    "post_time": "Reviewed in the United States on May 21, 2023",
    "pid": "014313289X"
},
{
    "title": "Beautifully written book.",
    "rating": "5.0 out of 5 stars",
    "content": "A story so engaging you want to keep turning the pages while also wanting to linger on the exquisitely framed words. My favorite kind of book.",
    "post_time": "Reviewed in the United States on July 2, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Best book I have ever read on mental illness.  I learned so much and hope this understanding moves humanity forward from where we are today.",
    "post_time": "Reviewed in the United States on May 17, 2023",
    "pid": "014313289X"
},
{
    "title": "Fantastic learning experience",
    "rating": "1.0 out of 5 stars",
    "content": "I read about 2 books a week. And I always do my best to finish any book. I stopped at 37% with this one. I skimmed over half of that. It sounded like such a good story. But it was more like reading a text book. I agree with the other 1 star reviews!",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I tried. Subject matter sounded interesting.  I stuck with it for 100 pages and was incredibly bored out of my mind.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "014313289X"
},
{
    "title": "Too long and boring",
    "rating": "1.0 out of 5 stars",
    "content": "Carrie was the real hero though her love lead to her being complacent and murdered.  She loved a schizophrenic that refused meds. She presumed she could manage him and be safe.  Too bad she was so wrong. She should have escaped when she learned he stopped  meds. If she got away, she might still be alive.  Love is blind...",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Funny, gut wrenching, and thought provoking, but it’s like the author was really penning three books in one. Two of which I would never have picked up. More satisfying are the many articles you can read with a simple Google search.",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "014313289X"
},
{
    "title": "Did not finish",
    "rating": "5.0 out of 5 stars",
    "content": "What an incredible book. Brilliant and heartbreaking. Vividly captured the struggles of mental illness and the way society views them.",
    "post_time": "Reviewed in the United States on July 5, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A powerful story. And yes, it is possible to hold two divergent thoughts at the same time. I recommend this book.",
    "post_time": "Reviewed in the United States on May 22, 2023",
    "pid": "014313289X"
},
{
    "title": "Murder and mental illness-- a very scary story.",
    "rating": "5.0 out of 5 stars",
    "content": "My family has lived this story and Rosen has captured it all beautifully.....and in such delicious prose.",
    "post_time": "Reviewed in the United States on June 1, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "You pretty much need a college degree to be able to enjoy this book.",
    "post_time": "Reviewed in the United States on June 19, 2023",
    "pid": "014313289X"
},
{
    "title": "Wonderful!",
    "rating": "5.0 out of 5 stars",
    "content": "I'm so happy this book has 539 pages...I'm enjoying every sentence of it.",
    "post_time": "Reviewed in the United States on May 15, 2023",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "This was May’s book for my book club and we were excited to read it but come to find out, no one could finish it. General consensus is that at the half way mark, it just wasn’t moving forward quick enough. It reads like a research paper. No dialogue.",
    "post_time": "Reviewed in the United States on May 2, 2024",
    "pid": "014313289X"
},
{
    "title": "I tried, couldn’t do it",
    "rating": "1.0 out of 5 stars",
    "content": "x",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a good book, though not a great one.  On the positive side, the story is compelling and parts of it are marvelous.  Especially strong are the parts of the book that detail the dynamics of young friendship, and which document the peculiar cultural moment that was a 1970s childhood.  As I happen to share a birth year with both the author and his friend, so much of his recounting rang true for me and vividly summoned up the past -- everything from those dreadful laminated SRA reading selections in elementary school, to the music we listened to and the TV shows we watched, to the 1970s public school curricula that had been totally overwritten by the 1960s hippie generation and which reflected their subjective ideals and the skepticism they brought to \"traditional\" education.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "014313289X"
},
{
    "title": "x",
    "rating": "4.0 out of 5 stars",
    "content": "Like the authors, I was taught those dreadful speed reading techniques that took a terrible toll on my comprehension, and I never got the instruction in \"western civilization\" that had been a standard curriculum feature just a few years before.  Instead, I learned about Indonesia all during 4th grade, read Beatles lyrics in English class, and was taught in social studies not about history but about how to question government propaganda.  All of which might have been quite illuminating if we had been taught basic skills and information first.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Presumably, potential buyers of the book know that it's about a highly-educated man suffering from schizophrenia, who gruesomely murdered his pregnant girlfriend, so I'm not giving away any spoilers here.  That core story can't help but be riveting. But the book is way too long and meandering: the author attempts to explain how things went awry by dissecting every idiotic fad that became fashionable among academics and interest groups in the 1970s and 1980s.  These things richly deserve the damning scrutiny that the author applies to them, but it didn't need to be nearly so detailed.  We really don't require page after page detailing theories of literary criticism such as structuralism, or the inner workings of the cadre of activists dedicating themselves to pursuing deinstitutionalization of the mentally ill.  Yes, these warrant being covered, but the sheer depth and breadth of these diversions into half-baked academic philosophies detracts from the forward momentum of the story.",
    "post_time": "Reviewed in the United States on May 30, 2023",
    "pid": "014313289X"
},
{
    "title": "Pardon the pun, but it's maddening",
    "rating": "5.0 out of 5 stars",
    "content": "I couldn't help but come away from the book shaking my head at the foolishness of so many supposedly intelligent people, and thinking that the author's description of \"best intentions\" gone awry was far too generous.  Rather, it's a story about how academia and special-interest advocacy become incubation chambers for the most blame-fool concepts one can come up with, the sort of blather that is so ridiculous that only an intellectual can believe it.  Apparently, it makes people feel smart to theorize that there is no objective reality, that language exists only to support oppressive power structures, and that mental illness is actually a glimpse of higher truths to which the rest of us neurotypical people simply aren't privy.  But that feeling is unwarranted.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "014313289X"
},
{
    "title": "Heavy, intellectual story",
    "rating": "5.0 out of 5 stars",
    "content": "The blunt truth of the matter is that Michael Laudor was given license to stab his pregnant girlfriend to death because countless people opted for feeling virtuous over acknowledging reality.  That reality is that the brain can malfunction just like any other body organ can, and when it does, very bad things can happen.  If someone is prey to delusions that the people around him are impostors seeking to kill him, he ought not to be left unmedicated, unsupervised, and in the proximity of kitchen knives and an unprotected woman.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "014313289X"
},
{
    "title": "Over-hyped",
    "rating": "5.0 out of 5 stars",
    "content": "It made countless privileged people feel good about themselves to argue that we should protect the mentally ill from discrimination in exactly the same way that we protect people from racial discrimination.  But it's patent nonsense, as anyone will realize if they spend even a moment thinking about it.  You don't give a toddler the keys to the family car, you don't allow a blind person to fly a plane or perform surgery, and you don't allow the paranoid delusional near weaponry.  And it doesn't matter how many times the person says, \"But I really, really want to do this and you're mean if you don't let me,\" it's still fantastically negligent to do any of these things.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "014313289X"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I was appalled when I got to the end of the book and read of the reactions of so many people to what happened. There were at least a few advocates who engaged in a bit of soul-searching and realized that their self-serving coddling of a terribly ill man led to a young woman's murder.  But far too many of them were only concerned about whether \"the cause\" had been set back by the crime.  Even after a pregnant young woman was slashed to death, these people could think only of their own standing rather than reassess whether they were promoting a ridiculously foolish agenda.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "014313289X"
}
]