[
{
    "name": "  Dreamland: A Novel ",
    "stars": [
        "67%",
        "21%",
        "8%",
        "2%",
        "2%"
    ],
    "pid": "0593449576",
    "ratings": "30,455 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "OMG!",
    "rating": "5.0 out of 5 stars",
    "content": "OMG!  This is on the same level as The Notebook and The Bridges of Madison County!  A very well thought out story and very well told!  I loved it!",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved the Colby and Morgan story. The Beverly story line had me confused, but that was the point.  I’ve been caring for family for a while. I could relate to the demands and getting caught with it taking over.  It was a reminder to hold on pieces of your own world.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "0593449576"
},
{
    "title": "Kept me guessing",
    "rating": "4.0 out of 5 stars",
    "content": "Good Read",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I would have liked a few additional chapters at the end.  Maybe on how they were able to make it work including some headaches and funny antidotes.",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "0593449576"
},
{
    "title": "Good Read",
    "rating": "4.0 out of 5 stars",
    "content": "A lot of the book centered on the lead up to the story , but the ending feel flat.",
    "post_time": "Reviewed in the United States on April 29, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bouncing between two very unrelated characters, you spend 90% of the book wondering how they will come together. Nicholas Sparks reliably tugs at your heart and gives an interesting story about family and love.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "0593449576"
},
{
    "title": "A good read, but ended too abruptly.",
    "rating": "3.0 out of 5 stars",
    "content": "This was a typical Nicholas Sparks book for me. You start it, trying to figure out where the story is going, then WOW! I did not see that one coming! Dog gone Nicholas Sparks, you did it to me again LOL!",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wonderful story!",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "0593449576"
},
{
    "title": "Classic Sparks Novel",
    "rating": "2.0 out of 5 stars",
    "content": "Just didn’t care for its storyline",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was one I wasn’t able to put down… like MANY of N.S. Books!! By far 2nd to the Notebook… ONE OF MY FAVORITES!!",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "0593449576"
},
{
    "title": "sweet love story",
    "rating": "5.0 out of 5 stars",
    "content": "I always enjoy a good Nicholas Sparks love story!  Great summer read  and it was a quick read. Enjoyed the Florida setting.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve been sitting on a lot of Nicholas sparks books. I started this and thought this was taking me to “safe haven” but nice twist!  Totally unexpected.",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "0593449576"
},
{
    "title": "So good!",
    "rating": "5.0 out of 5 stars",
    "content": "I liked the short chapters so if I just had a minute, I could pick it up and not be lost. The second part of the book was so intense and I couldn’t piece it together but that seemed to make it even better!",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I just bought 3 books. I’ve only read one so far. But this is the next one I’m starting. Arrived a little slow, but is in good shape.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "0593449576"
},
{
    "title": "Nicolas Sparks never disappoints",
    "rating": "5.0 out of 5 stars",
    "content": "I don't know how he does it, but his books get better every time a new one comes out! This book left you wanting more, I had a hard time putting it down. The flow was beautiful, and the end was heart breaking!",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I almost dumped the book from my Kindle because of the plot design: two seemingly unrelated characters, Colby and Beverly, with absolutely no connection.  Colby’s story seemed like the typical Nicholas Sparks romance novel.  Beverly’s story was very unsettling and upsetting, almost like a thriller/mystery.  I thought, after a couple of chapters, I’ll just read the “Colby” chapters.  But I persevered begrudgingly and suffered through the Beverly story too. (Spoiler Alert) My mother had Bipolar 1 mental illness all her life.  Too many memories were evoked as I read about Beverly.  Nicholas Sparks either did a lot of research or knows someone with Bipolar 1 very well: he absolutely nailed not only the daily chaos, but the inner workings of the mind, especially during the “manic” phase.  In the end, Colby’s story had a predictable resolution.  Trust me when I say, Beverly’s story will be on a repeat cycle for the rest of her life…sadly.",
    "post_time": "Reviewed in the United States on July 1, 2023",
    "pid": "0593449576"
},
{
    "title": "Good condition",
    "rating": "3.0 out of 5 stars",
    "content": "I think  the author should have had a trigger warning for readers. This book contains some distressing events mixed in with a \"normal\" love story.I found myself skimming through a lot of this book as it droned on for too long about details that didn't matter. Little character development and lots of events glossed over, such as the love part. The description of mental health sounded straight from Google. As a therapist, I was frustrated that the author didn't realize schizoaffective disorder seems more accurate of a diagnosis. And the pirate part, just was weird and shouldn't have been there.",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "And love that the story takes place in our area so I can relate to all the places he references.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "0593449576"
},
{
    "title": "What a book",
    "rating": "3.0 out of 5 stars",
    "content": "Returned because print was to small",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love Nicholas Sparks. I kept thinking this book doesn’t seem like his. Then, he shocked me so bad I had to go back and reread the paragraph. Excellent book. I highly recommend!!",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "0593449576"
},
{
    "title": "Two Stories Become One",
    "rating": "5.0 out of 5 stars",
    "content": "I thought it interesting there there appeared to be 2 separate books. But as you finished chapters in book 1 and moved to book 2, you’re so enthralled in what you’re reading you forget there’s a separate storyline.  Then it all comes together in a way that’s so unexpected- then you realize all along you knew.  You sneaky little devil, Mr. Sparks!  Thoroughly enjoyed every second of the read!",
    "post_time": "Reviewed in the United States on May 12, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoy Nicholas Sparks books and this one didn't disappoint. I knew there was some connection to all the characters and enjoyed how the story came together at the end.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "0593449576"
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "It's no surprise to me that a Nicholas Sparks book draws me in and keeps me turning pages.  His stories are diverse and interesting, his characters are real and compelling.  I recommend this and any of his books.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "was very well received",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "0593449576"
},
{
    "title": "A Page Turner",
    "rating": "5.0 out of 5 stars",
    "content": "The twists and turns of the plot were awesome! I also loved the depth of the story and the subject matter.  I have been hooked on Nicholas Sparks since reading The Shack, and am sure that I will be a life-long fan.",
    "post_time": "Reviewed in the United States on June 8, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was confused when every few chapters were about a different person, but I trusted the author  and kept reading.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "0593449576"
},
{
    "title": "gift item",
    "rating": "3.0 out of 5 stars",
    "content": "I usually love Mr Sparks books but this one was disappointing. I could easily put it down & do something else. His other books I had to always finish. This one didn’t flow & too much descripted words that I didn’t think were necessary. Yes it had the surprise factor but just did not flow for me.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The story was romantic, and then it got real interesting concerning the sister and her situation, which was interesting. Sparks never leave me hanging.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "0593449576"
},
{
    "title": "Awesome twists and turns",
    "rating": "5.0 out of 5 stars",
    "content": "Great read.  Kept my attention for the entire read. This topic is close to my heart.  Such a great author.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved two stories melding into one, I want it to keep going!NS you are a master storyteller! Thank you!",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "0593449576"
},
{
    "title": "a real cliff hanger t",
    "rating": "5.0 out of 5 stars",
    "content": "Wow.  Very well written and with a decidedly different way of story telling. Lots of twists and turns. Not to mention a surprise ending. Love this book.",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book took me by surprise. It was weaving together two opposite storylines, which weren’t apparent until later in the book.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "0593449576"
},
{
    "title": "incredible",
    "rating": "5.0 out of 5 stars",
    "content": "I always enjoy Nicholas Sparks' books and I was not disappointed with this one. It has a great storyline. I read it in a few hours!",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The craziest thing is I do have a boyfriend, he is a farmer and I could never figure out why we can't be together most of the time. Reading this book did put things into perspective, I know our story isn't like Morgan and Colby's but kudos to you Nicholas.",
    "post_time": "Reviewed in the United States on January 31, 2024",
    "pid": "0593449576"
},
{
    "title": "Great story!",
    "rating": "5.0 out of 5 stars",
    "content": "I loved every line in this book, and it maintained a bit of old school that I always find and makes me love reading novels. Every now and again it helps me escape the reality of the world we live in.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful love story with a great ending.  The twist with Paige was  good one.  I really didn’t see it coming.",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "0593449576"
},
{
    "title": "Loved the book",
    "rating": "5.0 out of 5 stars",
    "content": "Mr. Sparks has done it again!! Loved this story, so believable. Music, love, tragedy all heart just like all of his stories before.",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Please continue to write these beautiful heartfelt novels. It makes such an impact every time I read one of your books!!",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "0593449576"
},
{
    "title": "Loved it.",
    "rating": "5.0 out of 5 stars",
    "content": "I bought it used and was in good shape. I like the large print.",
    "post_time": "Reviewed in the United States on May 2, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It kept me entertained and interested. It was not an obvious read and I enjoyed the path it took. I recommend this book!",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "0593449576"
},
{
    "title": "Excellent Read -A real page turner",
    "rating": "5.0 out of 5 stars",
    "content": "Usually a book while enjoyable has a certain amount of predictability, this book did not. It’s hard to describe it without spoiling the surprises. Believe me, you will be intrigued and surprised.",
    "post_time": "Reviewed in the United States on January 4, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The characters were well developed. The twists and turns.",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "0593449576"
},
{
    "title": "Book",
    "rating": "5.0 out of 5 stars",
    "content": "Nicholas sparks is a genius when creating characters with truly good but realistic hearts. What a pleasure to read a real life story with kind, caring and sacrificial characters.",
    "post_time": "Reviewed in the United States on January 12, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "OMG!!! I haven’t read a book in years and i couldn’t put this book down!!! Everyone must read this book..",
    "post_time": "Reviewed in the United States on June 25, 2023",
    "pid": "0593449576"
},
{
    "title": "Love",
    "rating": "5.0 out of 5 stars",
    "content": "This was a really good book I love the stories it was really cool to find out Beverly was Colby's sister I didn't see that coming but I'm glad Colby and Morgan ended up making it work. I'm also glad Morgan got her music career it was just a really good book I read it a five out of five if you can",
    "post_time": "Reviewed in the United States on October 21, 2023",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoy Nicholas Sparks books even though they somehow always break your heart. I’ve read every one of his books and look forward to his new releases every fall.",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "0593449576"
},
{
    "title": "As always, Nicholas Sparks helps us fall in love & somehow breaks our hearts too!",
    "rating": "4.0 out of 5 stars",
    "content": "This one is no different from any of his others, but I still really enjoyed it. I loved the characters right away and could not put this one down. Colby is a farmer who takes a week off for vacation, falls in love and his whole world falls apart while he is gone. I wasn’t shocked by his choices but was pleasantly surprised how it ended.",
    "post_time": "Reviewed in the United States on November 16, 2022",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Please note, this book has references to mental illness and domestic violence.",
    "post_time": "Reviewed in the United States on November 12, 2023",
    "pid": "0593449576"
},
{
    "title": "There is hope, even in the grimmest reality",
    "rating": "5.0 out of 5 stars",
    "content": "Thank you to NetGalley for the ARC, so I could read this one early.",
    "post_time": "Reviewed in the United States on January 24, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The story of brother and sister seemed separate and disjointed: Colby’s full of the joy of new love; Beverly’s (Paige’s) unbearably painful. Even the most clever mystery buff would not have suspected the surprise of how they came together. As a therapist myself, I very much appreciate how the author portrays bipolar disorder, as a series of disruptions to an otherwise highly creative and hopeful life. And Colby’s devotion to his family did not necessarily mean an end to his own future happiness. Hope lives for us all.",
    "post_time": "Reviewed in the United States on February 27, 2024",
    "pid": "0593449576"
},
{
    "title": "Two stories merged beautifully",
    "rating": "5.0 out of 5 stars",
    "content": "Romantic,  not racy.",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Demonstrating unconditional love and prioritizing the importance of family.",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "0593449576"
},
{
    "title": "Finally a happy ending!",
    "rating": "4.0 out of 5 stars",
    "content": "I think this is my favorite Nick Sparks story.",
    "post_time": "Reviewed in the United States on September 27, 2023",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I wish I could have heard more about Morgan's cabin in MN since I live here :)",
    "post_time": "Reviewed in the United States on December 3, 2022",
    "pid": "0593449576"
},
{
    "title": "Good, but not my favorite",
    "rating": "5.0 out of 5 stars",
    "content": "Most stories have me crying at the end.  This one had me smiling! Also touched on the very real bipolar mental health issue that some people struggle to live with... a very serious disorder.",
    "post_time": "Reviewed in the United States on April 13, 2024",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I thoroughly enjoyed Colby’s parts of “Dreamland,” but I found myself wishing Beverly’s parts would be over sooner. Once everything tied together at the end, I understood why it was such a big part, but it detracted from the romance in the story. It was a good read, but it was probably my least favorite of Nicholas Sparks’ novels. I wanted to like it more than I did.",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "0593449576"
},
{
    "title": "Unexpected story style",
    "rating": "4.0 out of 5 stars",
    "content": "Of course there's a love story, but this book has several twists. Colby always wanted to perform, but family issues forced him to take over the homestead. When the opportunity arises to take a short hiatus from his daily life, he jumps at the chance. There he is drawn to a young, wide-eyed college student, Morgan, also there on vacation with friends, thus the love story angle. Then there is stressed beyond belief, Beverly, at first the reader is not sure how she fits into the book's storyline. Morgan's aspirations vs her parents' goals, vs new love, must say good-bye to Colby, who must return home and reality. Beverly's life bubble breaks, all within the course of a week.  This twisted tale was an interesting read, but not even in the top 10 of his books.",
    "post_time": "Reviewed in the United States on July 13, 2023",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Wow what an amazing book. I read this book in just two days. It grabs you from the very beginning and doesn’t let go. From start to finish amazing. Amazing book by an amazing author.",
    "post_time": "Reviewed in the United States on September 20, 2023",
    "pid": "0593449576"
},
{
    "title": "AMAZING",
    "rating": "4.0 out of 5 stars",
    "content": "Another great book from Sparks. The first part of the book has quite a bit of background, but in the middle it all comes together with an ending you won't forget!",
    "post_time": "Reviewed in the United States on September 18, 2023",
    "pid": "0593449576"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Interesting premise of bouncing between 2 different points of view (Colby and Beverley) who aren't at all connected for the majority of the book. Colby's love interest, Morgan, doesn't even have chapters told from her POV, which was also interested.",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "0593449576"
}
]