[
{
    "name": "  All the Broken Places: A Novel ",
    "stars": [
        "73%",
        "20%",
        "4%",
        "1%",
        "1%"
    ],
    "pid": "0593653440",
    "ratings": "22,948 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "The best book!!",
    "rating": "5.0 out of 5 stars",
    "content": "This was the best book I’ve read in a long time. It is so well written. I loved ALL of the characters and how the author intertwined them all. Historical fiction fans- This is a must read.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love historical fiction and was drawn to this book because it was about WWII and the protagonist was a female. I bought it for a long car trip I was taking.  I was almost a third of the way through the book before the story became compelling.  It was not one of those books where I felt like I just could not put it down.  The actions of the female protagonist as a teenager did not feel authentic.  It got better later in the book, where the author focused more on the protagonist as a 91 year old woman.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "0593653440"
},
{
    "title": "Historical Fiction with Female Protagonist",
    "rating": "5.0 out of 5 stars",
    "content": "A story far too many people have forgotten - or not belied.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The past is not gone.  It’s  branches continue to effect us.Reviw by P.M.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "0593653440"
},
{
    "title": "Broken - but not destroyed",
    "rating": "5.0 out of 5 stars",
    "content": "This book kept me off balance.  I understood Gretel’s innocence and guilt, and waffled between whether she took the wrong path after WWII or was simply a victim herself, incapable of making a moral decision.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "VERY well written.  Some books are very confusing when they jump back and forth through time.  Not this one.  Each change in era was purposeful and slowly brought the entire story to light.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "0593653440"
},
{
    "title": "Could not put it down",
    "rating": "5.0 out of 5 stars",
    "content": "I received book on a Wednesday and finished Friday morning.  I’ve already sent copies to my sister in Idaho and my son in Lost Angeles. Love Love this story",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book jumps back and forth over time, but never reveals the date. So, one has to discern it as you read each chapter. This is slightly annoying, but manageable.  It tells a story from a different perspective, with the main character enduring and running from a guilt that can never be eased.  This book will remain hauntingly in my mind.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "0593653440"
},
{
    "title": "Best Novel I’ve Read in Decades",
    "rating": "5.0 out of 5 stars",
    "content": "Interesting story about The Holocaust from a point of view that is most unusual. Covers one woman’s life from 19 years of life well into her nineties!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is such a good book to read love it",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "0593653440"
},
{
    "title": "Your past will always always haunt you",
    "rating": "4.0 out of 5 stars",
    "content": "Can’t say I liked Greta, but definitely her story kept me interested in finishing  the book. I thought the ending matched her persona.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was hooked immediately and couldn’t put this book down. Very well written and captivating. A must read!",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "0593653440"
},
{
    "title": "What a great book!",
    "rating": "5.0 out of 5 stars",
    "content": "Such a great read!  It will takes on many twists and turns! Such a wonderful story!You will enjoy this read!",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I liked the back and forth of the chapters during the war and after it.  You will have a love/hate relationship with Gretel but in the end you'll come to like the 91 year old woman she became.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "0593653440"
},
{
    "title": "excellent",
    "rating": "5.0 out of 5 stars",
    "content": "I am not ready to write a review for this outstanding book.  It has affected my thoughts intensely.  Read in 2 days. Could not put it down.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I truly enjoyed how the author showcased an opposing viewpoint of the holocaust, allowing us to see the guilt and pain from a young child that was born into Nazi Germany. An extremely thought provoking novel about guilt and redemption.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "0593653440"
},
{
    "title": "Excellent story",
    "rating": "4.0 out of 5 stars",
    "content": "I thought this book to be an interesting read. I enjoy historical fiction, so this novel reads well in that regard. But it stretches the imagination to think that Gretel’s mother, a German trying to hide her German nationality, would go to Paris with her 15 year old daughter after the war. It’s not logical! Perhaps, if they had gone to Switzerland or Sweden or another country that had been neutral during that period it might make sense. But really, you have to suspend belief to think she would have gone to Paris.",
    "post_time": "Reviewed in the United States on March 25, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Then, I find it hard to believe that Gretel had so much guilt. She was a child/teen when the events happened. She lived in a controlling environment and had been essentially brainwashed from an early age. It was like being in a cult. She knew right from wrong in the context of which she had grown up. This is not to absolve her of all actions, but really the guilt seems overdone considering the lack of control she had over anything. A psychologist could best speak to this, but we do know that a persons brain is often not fully developed until their late to mid- twenties. The heavy guilt about the war did not ring true. Maybe she would have some about her brother, but the rest just seemed a contrived story line. Perhaps if she had been in her late teens this overwhelming guilt trip might make sense.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "0593653440"
},
{
    "title": "Needs more stars",
    "rating": "5.0 out of 5 stars",
    "content": "Also, the fact that Gretel did not realize that David was so obviously Jewish given his surname and her background does not ring true. Again, have to suspend belief and go with the storyline",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have not read The Boy in the Striped Pajamas, so perhaps that would have given greater context to this novel. I found the storyline regarding Heidi and her concern for Henry much more believable and realistic. Although, in some ways I question how likely it was that she and her husband would ended up living in the same building as her daughter that she had given up at birth.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "0593653440"
},
{
    "title": "slow start",
    "rating": "4.0 out of 5 stars",
    "content": "I didn’t think I would like this book as it was slow to start. I needed something to read, and this was all I had while on a plane recently I picked it up again and read the whole thing. It was a very sad story.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A powerful, well written story, from a unique perspective. I could barely put it down. The stories should be told in hopes that history doesn't repeat itself.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "0593653440"
},
{
    "title": "\"There but for the grace of God go I.\"",
    "rating": "5.0 out of 5 stars",
    "content": "I inhaled this book in a day and late into the night. Excellent writing. Powerful story. A must-read!",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There are so many WW2 historical fiction books out there, sometimes it’s hard to differentiate them. John Boyne has done a wonderful job of telling this story from a unique perspective. I thoroughly enjoyed this book.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "0593653440"
},
{
    "title": "3 words: read this book!!",
    "rating": "5.0 out of 5 stars",
    "content": "When I put great effort, time and thought into a complimentary review it gets rejected by Amazon. However, if I write a non thought provoking and grammatically incorrect review such as “It Good” there are no issues. So be it! My review for this product is “It Good”.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed reading this historical fiction book!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "0593653440"
},
{
    "title": "Not your typical WW2 book",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent plot and character development. A book that had me thinking about it while I was at work and I couldn’t wait to get back to it. I’m not always. WW2 fan, but this is an absolute exception. 19/10 recommendation!!",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "John Boyne's \"All The Broken Places\" is a gripping novel that won't let go of you even after you have finished it. It's the story of the life a woman who was born the daughter of the Commandant of a Nazi death camp. The story only briefly touches on that time. But of course, her family  history casts a shadow over her entire life.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "0593653440"
},
{
    "title": "It Good",
    "rating": "5.0 out of 5 stars",
    "content": "The novel travels through two separate tracks of time. It begins in 2022 where she lives as a 91-year old woman in London. We learn the current situation of her life. The novel then flashes back to protagonist and her mother fleeing from Germany to France after the war. The stories wend separately through the novel, growing closer in time until they finally connect at the last.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The story touches many lives but always comes back to the central question- how do people deal with evil, particularly when it permeates their own life.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "0593653440"
},
{
    "title": "A really excellent story",
    "rating": "5.0 out of 5 stars",
    "content": "an excellent story that really captures you and has interesting historical details, well worth reading and learning about what happened after the war in Germany",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have read a lot about the Holocaust, seen documentaries about it, and visited the Holocaust museum in Washington.  I have never seen it from this view. I could not put it down. Read it if you are interested in this era of history.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "0593653440"
},
{
    "title": "Redemption",
    "rating": "5.0 out of 5 stars",
    "content": "Kept my interest.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "So far I like it. My book club is reading it for this months book.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "0593653440"
},
{
    "title": "Excellent!",
    "rating": "5.0 out of 5 stars",
    "content": "This story is so very heartening. The character of Gretel is so private and complex. Truly the best book I've read in ages",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "great author in each book",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "0593653440"
},
{
    "title": "Easy read so far.",
    "rating": "5.0 out of 5 stars",
    "content": "Couldn’t put it down",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great character development. Taught history from a different perspective. Had a purpose. Dealt with horrific topic from a very human dynamic. Conflict and Intrigue",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "0593653440"
},
{
    "title": "Superb storytelling.",
    "rating": "5.0 out of 5 stars",
    "content": "I love historical fiction and All the Broken Places, by John Boyne, is a novel I couldn't put down.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a gripping, well-written thriller based upon the unspeakable horrors of the Holocaust--but not limited to it. John Boyne parcels out the information gradually leaving the reader begging for more. A few twists and turns mark the text as the book shows a different kind of survivor's guilt and a different kind of redemption. Bravo!",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "0593653440"
},
{
    "title": "Easy read.",
    "rating": "4.0 out of 5 stars",
    "content": "Historical fiction- my favorite genre.  Excellent read.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very interesting life circumstances that many people of German decent would have to deal with, and a surprising twist at end of the novel.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "0593653440"
},
{
    "title": "your family’s prior history can have major effects on your life",
    "rating": "5.0 out of 5 stars",
    "content": "I just finished All The Broken Places by John Boyne. If a book can be disturbing and riveting all at the same time, it would describe this piece of historical fiction perfectly. This novel is the continuation of the story, The Boy in The Striped Pajamas. However, it primarily centers on Bruno's sister Gretel, and gives details of what happened to her and her family after the war. Like other historical fiction novels, this too alternated between past and present, a clever way to entice the reader to keep turning pages.",
    "post_time": "Reviewed in the United States on December 10, 2023",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I don't want to give too much away in regards to the plot, but what I will say is I had great difficulty liking the main character Gretel, a sign she was well written. At times I had to walk away from the novel because Gretel made me angry and my head spun. She was often self-absorbed and in great denial of the horrors the Nazi Party had created, and then just as quickly would be overcome with guilt and fear of others finding out about her, or her family's past. As the years go by, Gretel matures and appears to accept her family's guilt, while attempting to put the past behind her. But all dark secrets have a way of catching up as she will find in the most unpleasant way.",
    "post_time": "Reviewed in the United States on April 16, 2024",
    "pid": "0593653440"
},
{
    "title": "Disturbing and riveting",
    "rating": "5.0 out of 5 stars",
    "content": "All The Broken Places is very well written, as all John Boyne books tend to be. There are twists and turns in the story that I never anticipated and the ending was a bit of a shock, although I should have seen it coming. This novel was a great way to both continue and end the story of The Boy in The Striped Pajamas.",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is an enjoyable story, fast paced, and well-constructed.  I found interesting, Gretel's journey, the plumbing of her psyche, examining her own involvement and personal guilt concerning her years in Germany as a young adult. Readers will not be disappointed. However, certain elements in the story seemed contrived, and were lacking in credibility. I won't reveal details, due to spoilers, but I sincerely doubt that some events taking place in her life could have happened exactly as told. That is my main criticism, but otherwise I found this a book worth reading",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "0593653440"
},
{
    "title": "Good book, a few caviats",
    "rating": "5.0 out of 5 stars",
    "content": "Trigger warning, this book has domestic violence, murder and the Holocaust interwoven throughout the book.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "  Oh this book! 91 year old Gretel Fernsby has a secret. Well that is an understatement! Her whole life is nothing but secrets. She has lived in the same “flat” for 60+ years. With each passing chapter you learn a little more of her escape from Germany and her attempt to escape her past but sometimes our past is always in the present. And her past does come crashing down on her and she takes care of things as only she could do…at 91, well technically 92 now. You will not forget Gretel Fernsby. This book was unputdownable, I needed to know what the next chapter would reveal. Toward the end of the book there were 2 chapters a mere 38 words that blew my mind. Did not see it coming! Excellent story,",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "0593653440"
},
{
    "title": "All the Broken Pieces",
    "rating": "5.0 out of 5 stars",
    "content": "Never a dull moment. I never could guess what might be coming next!",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The ends a real killer.",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "0593653440"
},
{
    "title": "Unforgettable",
    "rating": "5.0 out of 5 stars",
    "content": "Once I finished this book I wanted to start over and read it again. Everyone in this book is unforgettable.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love John Boyne books and this is no exception. I enjoyed the way the story was told- past and present. There were so many cliffhangers that I couldn’t wait to get to the next chapter. It was amazing the two different voices he used for Boy in Striped Pajamas. The first book was told through the innocence of a child and the second was by an adult that had lived a long time.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "0593653440"
},
{
    "title": "So Good!",
    "rating": "5.0 out of 5 stars",
    "content": "What a great book!  I've never read a historical fiction book from a close Nazi perspective.  Several unexpected twists to tie it all together.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Rarely do I find myself truly emotionally vested in a book, but that wasn’t the case here. I was all in. If you liked The Boy in the Striped Pajamas, this is a MUST read.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "0593653440"
},
{
    "title": "Great read and perspective",
    "rating": "5.0 out of 5 stars",
    "content": "Yes, I too, read this book in one day.  What a beautiful story, and all the angles of time.  I loved it.  The guilt, yet a young girls feeling throughout.  Intertwined in her heart and mind.  Beautiful.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the first story of the horrors of Germany I have read about from a young German girl's perspective whose father was a commandant in the German army.  It tells her story from the time she lived next to a camp not truly understanding but knowing.  Her guilt and life having to change her name and hide from Nazi hunters.  Was she guilty? Should she have been punished for her father's deeds?  It's up to you to decide.",
    "post_time": "Reviewed in the United States on June 8, 2024",
    "pid": "0593653440"
},
{
    "title": "A gripping and emotional tale",
    "rating": "5.0 out of 5 stars",
    "content": "Very well written.  You feel the enormous weight the main character carries throughout the book.  Really enjoyed reading this one.  I’ve already recommended to friends",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you enjoyed The Boy in Striped Pajamas then you will enjoy this story as well. JB is very talented and knows how to write compelling narrative of how people were able to justify their heinous actions on behalf of the government.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "0593653440"
},
{
    "title": "Beautiful novel",
    "rating": "5.0 out of 5 stars",
    "content": "Ommmgg!!! Just read it! I kept telling my boyfriend I need someone else who has read this so I can talk to them about it- like some wild Netflix show!",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A book that reads like nonfiction in part because of how closely it resembles actual events and in part because John Boyne is a skilled writer. I’m recommending this to all my friends.",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "0593653440"
},
{
    "title": "I love a flawed protagonist",
    "rating": "4.0 out of 5 stars",
    "content": "I love a flawed protagonist. A true hero, someone resplendent in high mortals, after all, is easy to root for.  But a character who does evil, as well as good,  a person who makes the reader squirm a bit as they decide which path they’d take when presented with ethical choices, that’s the kind of figure I prefer at the center of my novels.",
    "post_time": "Reviewed in the United States on December 29, 2022",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Gretel Wilson, or whichever surname she’s using these days, is that kind of character.  Contemporaneously, she’s an adorable 91 year old Londoner who still enjoys strolling through Hyde Park and gossiping with the neighbor across the hallway. But she has a dark past - the daughter of a Nazi commandant who ran a concentration camp - that’s she kept hidden for eight decades.  And that’s about all I want to say about this novel because if you choose to read it, I want it to unfold as perfectly for you as it did for me - one incredible storyline after the other.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "0593653440"
},
{
    "title": "a sad time in history",
    "rating": "5.0 out of 5 stars",
    "content": "This isn’t a perfect book.  At times some of the plot twists are a bit too fantastical for my tastes. But it was a novel that I couldn’t put down, that I needed to finish just to find out how Gretel’s story ends, and by my definition, that makes for an awesome read.  As John Boyne writes in his afterward , “it is a novel about guilt, complicity, and grief,” and if you’ve lived a long enough and interesting enough life, you’ve dealt with all of those emotions at some point.  This book will help you examine them even further.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A true capture of a lovely 12 year old girl caught in a horrific time in history.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "0593653440"
},
{
    "title": "Riveting story",
    "rating": "5.0 out of 5 stars",
    "content": "In some ways I was angered and in some ways I understood.  But I can’t stop thinking, would I have made a different choice.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I couldn’t put this book down. I loved the complexity of the character and wrestling with who she was. Highly recommend.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "0593653440"
},
{
    "title": "surprises all the way to the end",
    "rating": "5.0 out of 5 stars",
    "content": "Fascinating story about WWII and the aftermath written from a very different perspective.  Loved it. The primary character was so intriguing.",
    "post_time": "Reviewed in the United States on April 23, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It was a very interesting book told from a different perspective of the Jewish Holocaust. I throughly enjoyed the read as it takes you to a satisfying conclusion.",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "0593653440"
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "Riveting novel that brings history to life.",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Truly, a spectacular read. I was captivated from sentence number one. Of the hundreds of books that I have read in my 59 years, ‘All the Broken Places: A Novel’, is easily in the top five. I have not been able to stop thinking of the characters. Reading Author, John Boyce’s novel was more than just reading a story. It was like taking a Master Class in the themes of guilt, culpability, grief and looking at my own moral compass.  Extraordinary. I want to read it all over again.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "0593653440"
},
{
    "title": "A GREAT read",
    "rating": "5.0 out of 5 stars",
    "content": "Wow! This book moves at a quick pace with plenty of twists. Very moving. I couldn't put it down.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Sad, complex story of a woman who can never really escape her past…the sins of the father carried on through generations.",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "0593653440"
},
{
    "title": "Broken but living",
    "rating": "5.0 out of 5 stars",
    "content": "I read a lot on this subject. this was a unique approach to the aftermath of the war. it was mesmerizing , I could not put it down.",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Book was interesting but could have delved into the past more.",
    "post_time": "Reviewed in the United States on April 24, 2024",
    "pid": "0593653440"
},
{
    "title": "read it. one of the best books i've read.",
    "rating": "5.0 out of 5 stars",
    "content": "From the moment I began to read “All the Broken Pieces”, I was hooked.  The characters were so real, I felt as if I were acquainted with each of them.  Being eighty-one years old myself, I could identify so well with Gretel in her wishes for privacy, her understanding of the motives of her son, her caring for her neighbor.  I have read many books about the jews and how they were treated, but not from the perspective of a german woman who felt such guilt for what her father and her people did during the war.  I highly recommend this book.",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I can't say enough about this unusual exploration of the horrors of the Holocaust.  Because it is much more than a condemnation of this tragic period of history.  I can't recall a heroine at the center of a novel who is in her 90's; can you?  This is a page turner.  Complex yet quickly read.  Explores Germany, France, Australia ending in London for main story lines.  It is a sequel to The Boy in the Striped Pajamas, but I cheated and streamed the movie.  This gave me an imaginative view of Gretel's family that I would recommend.",
    "post_time": "Reviewed in the United States on March 8, 2024",
    "pid": "0593653440"
},
{
    "title": "Ending is a big surprise",
    "rating": "5.0 out of 5 stars",
    "content": "This is a must read. More coincidences than Dickens. A great follow up to the Boy in the Striped Pajamas.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book turned me upside-down. The surprise that left me with my mouth hung open, the gentle prose that carried me back and forth between two eras, the conflicting emotions about the main character... I read at night until my eyes just wouldn't stay open any longer.  I hated having to stop reading because I knew I had to sleep. To say it moved me is too simplistic. Beautiful. Just beautiful.",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "0593653440"
},
{
    "title": "An excellent read",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful writing and a satisfying ending.  Loved this book.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "All The Broken Places is a riveting novel that will keep readers enthralled from start to finish. The author skillfully weaves together a complex plot of internal and external conflicts, complemented by parallel flashbacks that guarantee an unforgettable reading experience. Every page turn brings surprises that heighten the suspense, drawing readers deeper into the story’s mysteries.",
    "post_time": "Reviewed in the United States on June 28, 2023",
    "pid": "0593653440"
},
{
    "title": "Amazing, indepth characterization",
    "rating": "5.0 out of 5 stars",
    "content": "This novel explores what it might be like to survive as a German after WWII. Most of us think there is no way we would be a party to the travesties that occurred. Gretel shows us how surviving had left her scarred, determined, and willing to pay any price for her perceived guilt. This novel is from a point of view I have never read from before. It has taken me to emotional depths, sympathies, and had given me a wider world view.",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I read this book in two days and will probably read it again at some point soon. Definitely recommend as an insight to different perspectives on the Holocaust.",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "0593653440"
},
{
    "title": "Hard to Put Down",
    "rating": "5.0 out of 5 stars",
    "content": "I am deeply floored by this book. John Boyne is such a gifted writer with remarkable insight. This was a story of a family member of a very high ranking SS officer. It is her younger story and her present day story, alternating back and forth chapter by chapter. It dives deeply into the complexity of such a person, the dualities, the guilt, the complicity, as well as the contradictory capacities for compassion as well as cruelty. It’s deeply disturbing, yet a very compelling read. I have read several WWII novels, but I can’t recall one that also takes place in a character’s other phases of life including her geriatric nineties post-pandemic.  I think this is a unique and important story.",
    "post_time": "Reviewed in the United States on October 1, 2023",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": " I feel I must read The Boy in the Striped Pajamas, which is tied in with the character of this novel.",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "0593653440"
},
{
    "title": "A very important and deeply moving novel",
    "rating": "5.0 out of 5 stars",
    "content": "The complexity of emotions are simply remarkable.  I have read 100s of non fiction and historical fiction on the holocaust and this as such a unique perspective. Getting all of Boyne’s books now!",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This story is a very difficult read. It is shocking and haunting. A story of a girl/woman who lived with guilt her entire life that the reader will never fully understand. I promise the story is worth reading and remembering.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "0593653440"
},
{
    "title": "one of the best books I’ve ever read",
    "rating": "5.0 out of 5 stars",
    "content": "All the Broken Pieces is the continuation of “Boy in the Striped Pajamas”.",
    "post_time": "Reviewed in the United States on March 1, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very well written and beautifully done by the author.",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "0593653440"
},
{
    "title": "There are no words",
    "rating": "5.0 out of 5 stars",
    "content": "Without planning it, I read this book directly after reading another novel,that was directly opposite in viewpoint. It was so interesting for me. That being said, this book stands in it's own.  I was drawn in immediately, hooked after only the first few pages. I loved the main character, and felt for her. I highly recommend this book and look forward to other reads by this skilled author.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "0593653440"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was so compelling. Wonderful storytelling with original plot twist. I enjoyed every minute of it. Great read for a trip or a beach or a cozy chair.",
    "post_time": "Reviewed in the United States on December 13, 2023",
    "pid": "0593653440"
}
]