[
{
    "name": "  The Beekeeper of Aleppo: A Novel ",
    "stars": [
        "57%",
        "29%",
        "10%",
        "2%",
        "2%"
    ],
    "pid": "0593128176",
    "ratings": "44,180 ratings",
    "other_info": {},
    "discount_price": "$ 9.49",
    "normal_price": "$18.00",
    "about_this_item": []
},
{
    "title": "an important read",
    "rating": "4.0 out of 5 stars",
    "content": "I would give this book 5 stars, but it is a difficult read. I chose it because in this crazy world, I thought I might be losing my own ability to appreciate humanity. This book started me back on that path.",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I think the author, Christy Lefteri, missed an amazing opportunity to educate the world about this crisis in Syria.  I wanted to love this book.  I knew it would be a difficult and sad subject matter and I was ready for it.  Unfortunately, I was terribly disappointed in this book.  When I find myself not picking up the current book I’m reading, I know I’m not loving it.  At about 50% I went and checked the two- and three-star reviews on Amazon.  I was correct, I wasn’t the only one.  I love historical fiction and especially loved Mark Sullivan’s Beneath A Scarlet Sky and The Last Green Valley.  He took the bits and pieces FROM THE DISTANT PAST and wove both stories in to amazing novels.  The crisis in Syria is a very recent, current event. Based on the author’s front-line experience helping Syrian refugees, I expected a much better story.  The author teaches creative writing.  Maybe she was trying to appeal to a difference audience or maybe tried to be TOO creative.  Instead, just tell the story!  The book had a good foundation but got lost.",
    "post_time": "Reviewed in the United States on May 14, 2023",
    "pid": "0593128176"
},
{
    "title": "Missed The Mark",
    "rating": "5.0 out of 5 stars",
    "content": "I did like the descriptions of Aleppo and all that was going on; the bees, their behaviors and Nuri’s love for them and how he misses them.  I also liked the photos at the end – the belonged at the very beginning of the book.",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I did not like the back and forth from the UK to Syria, the UK to Turkey, back to the UK, to Greece, back to the UK.  I lost track of where they were.  It was very confusing and diminished the storyline.  If you want to tell a story, tell a story – don’t cloud it with a veil of mystery.  I know this is a modern technique, but it really harmed this story.  The whole story line of Mohammed really dragged down the story.  I understand grief and how we all deal with grief differently, but this was bizarre.",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "0593128176"
},
{
    "title": "This will tug your heartstrings",
    "rating": "5.0 out of 5 stars",
    "content": "The author claims her premise was “What does it mean to see?”  Instead, in my humble opinion, it should have been – “What do you know about the conflict in Syria?  Let me show you.  I’ve been on the front lines of this suffering, and I want you to see what these people are experiencing.”  That would have made a great book.",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The book ends at 86% and it was an abrupt ending.  I did not expect it.  I usually check this feature in advance.  I know all electronic books are not organized in the same way.  I was mad at myself for not checking.  So 14% of the book is the Author’s Note, Dedication, and Excerpt from Songbirds, etc.  In the end:  a huge disappointment.  I still learned something about Syria and the refugees but oh, it could have been so much more!",
    "post_time": "Reviewed in the United States on December 22, 2023",
    "pid": "0593128176"
},
{
    "title": "Love moves all",
    "rating": "4.0 out of 5 stars",
    "content": "You know you are reading a great book when you are living the very life of the protagonist. You have incorporated the emotions, actions and reactions along with the hopes, dreams and desires of that character's heart and soul. That is what this book meant to me.",
    "post_time": "Reviewed in the United States on January 2, 2022",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Christy Lefteri has written a most moving story of love and loss of everything that one takes for granted. Reading of the voyage endured by Nuri and his wife reminds me of the thousands of refugees who have been forced to leave lives they love to preserve their living. Even trying to put myself into their journey is almost impossible. Looking at the life I enjoy and contrast it with anyone fleeing from danger. This story needs to be widely  shared.",
    "post_time": "Reviewed in the United States on January 25, 2024",
    "pid": "0593128176"
},
{
    "title": "Heart-wrenching and Eye-opening",
    "rating": "5.0 out of 5 stars",
    "content": "As we sit in relative safety and watch and listen to news reports on the number of \"illegal\" migrants entering our country or Europe, we are usually not exposed to the true humanity of the crises. Instead, the migrant situation is a flashpoint political topic. This book instead offers a glimpse into what individuals must go through to leave dangerous conditions and try to find a peaceful existence somewhere in the world, where they and their families are safe, like us. For me, this story was eye-opening.  It helped me comprehend the absolute desperation of these people and how much they've lost and sacrificed. I hope we can demonstrate compassion while developing some solutions for these people without sacrificing the safety we have and that most of them seek. Thank you, Ms. Lefteri.",
    "post_time": "Reviewed in the United States on December 26, 2020",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was one that made you peer into the lives of people who seek asylum and have a better understanding and comprehension about their experience.  Unfortunately, there are people who escape a war torn country and they must struggle with finding their way through the challenges of seeking refuge, getting proper papers and dealing with a whole host of unexpected variables and this story highlights those through the lens of a handful of interesting characters in the book.  Overall, a good read!",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "0593128176"
},
{
    "title": "Prompt and well packaged",
    "rating": "5.0 out of 5 stars",
    "content": "Was as described. Very clean and well packaged",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love historical fiction, and this book did not disappoint. It was so eloquently written and I learned so much about a different culture. Would highly recommend!",
    "post_time": "Reviewed in the United States on February 24, 2024",
    "pid": "0593128176"
},
{
    "title": "What a great book!",
    "rating": "5.0 out of 5 stars",
    "content": "Wanted to learn about Syria and the refugee issue.  That I did.  However, it befuddles me why authors think they must confound a novel with a convoluted and confusing time warp instead of telling a story in a direct sequence.  This book is full of flashbacks and mental states that makes it difficult for the reader to know where the characters are and when, what is real and what is not, and most frustrating of all whether they were actually granted final asylum in Great Britain so the main character could return to beekeeping and whether the wife's eyesight returned so she could continue her art.  Instead the book ends abruptly leaving the reader hanging.  Just found this book frustrating to read and just could not connect with the characters nor comprehend the author's supposed symbolism.",
    "post_time": "Reviewed in the United States on October 26, 2023",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Beekeeper is a deeply human story of loss and journey due to geopolitical conflict. The author’s success in this novel is multilayered while providing a portrait of personal tragedy, hardship and survival without focusing on the underlying politics. I see this detail as one of the triumphs of Christy Lefteri’s novel. The civil conflict in Syria and the ensuing refugee crisis are simply too current for us to process without devolving into confrontational dialogue and attempts to assign guilt.",
    "post_time": "Reviewed in the United States on August 22, 2023",
    "pid": "0593128176"
},
{
    "title": "Good Story...Difficult Read",
    "rating": "5.0 out of 5 stars",
    "content": "The author successfully avoids that political dead end and crafts an emotionally powerful story. Her protagonist, a partner at apiaries outside Aleppo, relates the story moving seamlessly between his situation awaiting asylum procedures in England and the scenes from the past as he and his wife flee Syria en route to asylum. The author uses a very creative technique to achieve these transitions from present to past in each of the chapters. Rather brilliant I must say.",
    "post_time": "Reviewed in the United States on April 21, 2022",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In short this novel is deeply moving and a highly rewarding read.",
    "post_time": "Reviewed in the United States on March 27, 2024",
    "pid": "0593128176"
},
{
    "title": "The Human Tragedy of Shifting Geopolitical Sands",
    "rating": "4.0 out of 5 stars",
    "content": "Wow..we who live in the west have no idea how bad it is in Syria. I don’t have the words. Its too tragic to speak about what these people have experienced. Im glad I read about it. A piece of ours hearts should be exposed to what others have endured. You feel something inside you that makes you not want to speak about it. But you can read about it. And you will get a glipse of the horrific circumstances these people have been forced fo experience. You feel like you are there with them watching, but they can’t see you. And because of that, you would never ask an actual Cyrian person what it was like to experience  and eyewitness the barbarity and madness that were heaped upon them. It just feels rude to even speak of it after reading this story. But you can’t help but connect with their suffering and loss. But its important to know about it and get a glimpse of what others endured. It somehow felt like a movie instead of a novel. It was as if we were there watching their loss, trauma, and bewilderment those must’ve experienced. I can see the chatacters as if I was watching a movie. The characters were so real, you felt like you knew them and their thoughts and emotions. THIS GIVES YOU AN IDEA WHAT MODERN WAR REALLY LOOKS LIKE.",
    "post_time": "Reviewed in the United States on September 24, 2020",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Author Christy Lefteri tells another amazing & heartbreaking story that needs to be told to & read by everyone. It is about the people who must flee their homes in Syria. Most of us have no idea what can happen to us when we are caught inside a war zone & need to get ourselves & our families out.  Find out what happened!",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "0593128176"
},
{
    "title": "We don’t get the news fr",
    "rating": "5.0 out of 5 stars",
    "content": "\" I never thought I would be sitting down somewhere, next to other families, drinking coffee, without the sound of bombs, without the fear of snipers.\"",
    "post_time": "Reviewed in the United States on April 24, 2024",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": ".",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "0593128176"
},
{
    "title": "Unfinished",
    "rating": "3.0 out of 5 stars",
    "content": "This novel was powerful in places, but was also almost ephemeral in places and it was hard to figure out what the author was trying to accomplish.  I would NOT recommend if you are bothered by depression.  And at the end, there is no resolution: if asylum is not granted, then the main characters will be forced to return to the hell that was their country.",
    "post_time": "Reviewed in the United States on March 24, 2024",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was recommended this book by a close friend in London, who like me is an avid reader.  The book intrigued me as it was written by an English Cypriot like myself and so I tried all over Paphos and then Cyprus to find the book with no luck and succumbed to reading it on my kindle.  I felt it was sad that all bookstores in Cyprus were not stocking this book for two reasons, one the authors parents were Cypriot and two Cyprus had dealt with with its own heartache of being a war torn country with refugees fleeing for a better life.",
    "post_time": "Reviewed in the United States on July 27, 2020",
    "pid": "0593128176"
},
{
    "title": "Heart breaking but also inspirational",
    "rating": "3.0 out of 5 stars",
    "content": "I bought this book when it was first released and started devouring it immediately but sadly had to put it down as the subject was too raw at that time for me.  I was volunteering at a refuge in Cyprus for refugees mostly from Syria.  One day four of the children opened up to me and told me their story about they had managed to make it to Cyprus with their families.  It was heart breaking.  I went home that night and cried myself to sleep and didn't open the book again till today.",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This book should be read by everyone if only to understand the pain and heartache that these refugees are prepared to ensure to make it to a safer and happier place.  I recommended it to say many people who loved it as much as I have now.  All that remains is for me to purchase it in paper form to go in my library.",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "0593128176"
},
{
    "title": "Beautiful prose !",
    "rating": "5.0 out of 5 stars",
    "content": "Thank you to the author for bringing this subject to people's attention.",
    "post_time": "Reviewed in the United States on July 1, 2021",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Well written, but a difficult story to read.",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "0593128176"
},
{
    "title": "Disturbing, depressing...",
    "rating": "5.0 out of 5 stars",
    "content": "Too sad for me but the writing was amazing. I wish I could give it more stars.",
    "post_time": "Reviewed in the United States on November 18, 2020",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I didn't really care for the way this was written. Ending a chapter with a word that starts next chapter. And so depressing.  While I get it and the war in Syria was awful, this was the wrong book to read for me right now.",
    "post_time": "Reviewed in the United States on January 9, 2023",
    "pid": "0593128176"
},
{
    "title": "A Fantastic Read!",
    "rating": "5.0 out of 5 stars",
    "content": "I am a huge fan of Khaled Hosseini.  I absolutely loved The Kite Runner, A Thousand Splendid Suns and And The Mountains Echoed.  Because of my love for those books, I had very high expectations for Christy Lefteri's The Beekeeper of Aleppo.  I am pleased to say that The Beekeeper of Aleppo does not disappoint.  Ms. Lefteri has masterfully crafted a heartbreaking story of the plight of a Syrian refugee family without relying on graphic violence or predictable heartbreaking cliches.  Nuri is a beekeeper and native son of Aleppo; his wife Afra is an artist.  As the civil war escalates in Aleppo, Nuri loses his beloved bees, Afra her sight and both of them their only son.  With nothing left to keep them in Syria, they are have no choice but to follow Nuri's cousin to England in the hope of rebuilding their lives.  Ms. Lefteri has succeeded in guiding the reader on a journey from Syria, into Turkey, across the sea to the filth and despair of a Greek refugee camp and then finally to the U.K.  It is in Greece that Nuri and Afra demonstrate the resilience of the human spirit and the lengths the desperate are willing to take to survive, and the depravity of those willing to prey on them  I cannot recommend this book highly enough!",
    "post_time": "Reviewed in the United States on November 3, 2023",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The characters are well developed. The story showcased the refugees’ struggle to find safe haven and process their heartbreak in a troubled world. I heard of the war in Syria in 2016 and wondered about the fate of the people caught in the middle of it. Moved me to tears.",
    "post_time": "Reviewed in the United States on November 23, 2023",
    "pid": "0593128176"
},
{
    "title": "Beautifully told",
    "rating": "4.0 out of 5 stars",
    "content": "I love my book club; I am challenged to read books outside my comfort zone. This was one of those books. This beautifully written story gives insight into the lives and living conditions of refugees into Europe. There are so many dangers, losses, and hardships that those of us blessed to live in safety rarely consider. This story follows beekeeper Nuri and his wife as they leave war torn Syria to join a friend in England.",
    "post_time": "Reviewed in the United States on April 7, 2021",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The writing style, while well done, is unique. Chapters end and start with the chapter title as a connecting word between them. The chapters flow between the current situation and the characters’ travels to get to that point. There were times it was a little hard to follow, but overall was quite effective.",
    "post_time": "Reviewed in the United States on March 9, 2023",
    "pid": "0593128176"
},
{
    "title": "Heartbreaking Storyline",
    "rating": "5.0 out of 5 stars",
    "content": "The story touches on some very difficult topics but handles them with as much grace and sensitivity as possible. I think our book club discussion will be quite interesting this time.",
    "post_time": "Reviewed in the United States on April 3, 2022",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The book brings you into their devastating journey from Syria to freedom.  Heavy story.  Very descriptive. It was very confusing when it jumped from one location to another and between past and present. Not a fan of that writing style - it does not add to the story, IMO. Also did not care for the gimmicky style of having the chapter title be the closing word for the prior chapter paragraph and the first word of the next paragraph. That did not add to the story either.",
    "post_time": "Reviewed in the United States on January 24, 2021",
    "pid": "0593128176"
},
{
    "title": "Poignant and deeply moving",
    "rating": "4.0 out of 5 stars",
    "content": "There are some books that will always linger in my mind. for years and years and forever. The Beekeeper of Aleppo is one of them. There are some books that profoundly change you and this is one of them. The Beekeeper of Aleppo is something every single one of us should read, because we need to see and understand what refugees are living through. The journey through grief and PTSD is so real, so poignantly unraveled, it’s like you are walking through it yourself. It is such a powerful story, even more so because there are people who are still living through it.",
    "post_time": "Reviewed in the United States on October 3, 2023",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This week my student spoke to me about her father, fighting in Ukraine… I remember the stories of other students, having to flee their countries, speaking about  what they left behind… this book brings you those journeys in such deep clarity. Please read it. Please share it. Please do something to help the refugees",
    "post_time": "Reviewed in the United States on September 17, 2023",
    "pid": "0593128176"
},
{
    "title": "Excellent but heartbreaking",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this well-written and heartbreaking story of a married couple who leave the city of Aleppo to begin a long and difficult journey to escape war and to make it to the UK where they hope to find refuge.  The story goes back and forth in time to tell the tragedies and at times, hopelessness Nuri and his blind wife face as they stay in immigrant camps.  Nuri was a beekeeper in Aleppo and yearns to obtain hives if he makes it to England, and to return to his career.",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There is a lot of information about bees and beekeeping and a lot of symbolism.  It is an excellent read but prepare to be heartbroken at times as you hope for this likeable couple to reach their destination.  The story is based on the author's experience working with immigrants like these.",
    "post_time": "Reviewed in the United States on October 30, 2023",
    "pid": "0593128176"
},
{
    "title": "Immigration woes",
    "rating": "4.0 out of 5 stars",
    "content": "A difficult book to read. The story is heartbreaking but the strength of characters for this couple is impressive.",
    "post_time": "Reviewed in the United States on February 6, 2023",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The Beekeeper of Aleppo is an absolute masterpiece. This gripping and heart-wrenching tale takes you on an emotional journey. The characters are beautifully crafted, and the storytelling is powerful and poignant.",
    "post_time": "Reviewed in the United States on July 30, 2023",
    "pid": "0593128176"
},
{
    "title": "Slow paced",
    "rating": "4.0 out of 5 stars",
    "content": "I liked learning about the people, customs, and history of a culture I had little knowledge of. However, I found the pace too slow. The main characters moved from one place to another to find a safe life, and while things happened, I did not feel their emotions or fears. Because of this, I lost interest and quit reading after half the book.",
    "post_time": "Reviewed in the United States on March 6, 2023",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This book is a fictional account of one man’s efforts to get himself and his wife out of war-torn Aleppo and eventually to sanctuary in England.  The journey is devastatingly difficult both physically and emotionally.  Indeed, in the author’s post-story comments, she said one of her goals was to create empathy for the plight of refugee immigrants.",
    "post_time": "Reviewed in the United States on December 11, 2021",
    "pid": "0593128176"
},
{
    "title": "Realistic portrayal of a refugee’s great pains trying to escape his war-torn homeland",
    "rating": "5.0 out of 5 stars",
    "content": "So it’s an interesting read.  And thought provoking.  But it’s also emotionally difficult as it’s a very, very sad story.  Depressing, actually.",
    "post_time": "Reviewed in the United States on March 4, 2024",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "How does one rate a book that is so enlightening and feels so personal (5 stars), and yet that is not a story that entertains or excites the reader (1-2 stars)?  I think the answer depends on what the reader wanted and expected.  Based on the Amazon description, the book delivered what should have been expected by the reader.  Still, in my case though, maybe because I’m too shallow or lacking sufficient empathy, I simply didn’t enjoy reading such depressing fare.",
    "post_time": "Reviewed in the United States on October 25, 2021",
    "pid": "0593128176"
},
{
    "title": "How hard it is to leave your home in wartime.",
    "rating": "5.0 out of 5 stars",
    "content": "Bottom line: The story is, analogy-wise, like beneficial medicine that is difficult to ingest.",
    "post_time": "Reviewed in the United States on March 22, 2024",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I t was so hard for the characters to leave their home and find a new life.",
    "post_time": "Reviewed in the United States on November 6, 2023",
    "pid": "0593128176"
},
{
    "title": "EMIGRATING BY FORCE...",
    "rating": "5.0 out of 5 stars",
    "content": "THIS BOOK Tells the story of departing a war torn country for a western country. The impossible trials, the mental & emotional strife, the hunger & danger & the people who are strong enough to make it. The PTSD. The impossible requirements placed on them. As we sit comfortably in our homes in freedom to come & go, we need to open our eyes to the lives of immigrants & try to learn what it took for them to arrive on our shores & what we can expect for them. Everyone should be required to read this book in high school and college. It will be a good discussion book for my book club.",
    "post_time": "Reviewed in the United States on December 26, 2023",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Well written narrative of life as a Syrian refugee.",
    "post_time": "Reviewed in the United States on June 22, 2023",
    "pid": "0593128176"
},
{
    "title": "Beautifully Written",
    "rating": "4.0 out of 5 stars",
    "content": "The storyline of this book kept me needing more info. Will they make it? Who is this new little boy? How can people be so very cruel to each other?",
    "post_time": "Reviewed in the United States on March 6, 2023",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the optimism at the end of the story!",
    "post_time": "Reviewed in the United States on December 9, 2022",
    "pid": "0593128176"
},
{
    "title": "Different style of storytelling",
    "rating": "3.0 out of 5 stars",
    "content": "With all the flashbacks and repetition by the middle of the story was losing interest. Certainly sympathetic to the situation yet not engaged in what would come next.",
    "post_time": "Reviewed in the United States on December 5, 2023",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I waited a few weeks to write this review to decide how best to describe the book. I both liked and was somewhat disappointed with the book. First, I  was interested in the subject and I liked the characters; they were interesting and it was easy to get drawn into their situation and feel how heartbreaking it was. But - I also felt that the characters weren't quite developed enough. I would've liked to know more about them and their life before the war. There was some of that, but not too much. I also would've liked some more interaction among the characters in the present. Perhaps the author was trying to give a sense of how isolated and unreal their present life was, but I would've enjoyed getting to know the characters better. Overall, I liked the book and it held my attention to the end.",
    "post_time": "Reviewed in the United States on April 25, 2020",
    "pid": "0593128176"
},
{
    "title": "interesting",
    "rating": "5.0 out of 5 stars",
    "content": "Ms. Lefteri helped me see a world I thought I knew. Yes, we hear horrific stories and feel we understand. I consider myself compassionate, but I never took the time to “see” and learn stories from refugees. From Nuri and Afra’s world in Aleppo through their struggle of a changing world I now have an inkling of exposure to their world. This has been a difficult read! At times I had to put it down and come back to it as the truth of our world played out. I always came back not wanting to leave Nuri and Afra on their journey. I would recommend this to anyone who wants to learn and grow in their knowledge of a refugee’s physical and emotional journey. My hope is that somehow, someway we can all be inspired to reach out a hand to someone in need.",
    "post_time": "Reviewed in the United States on July 2, 2021",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a quick read with a compelling story. I really enjoyed it. Reading this makes you think again about the challenges refugees face, the dangers, the sorrow, the fears, the hunger, the poverty… I learned about bees and I gained additional respect for refugees.",
    "post_time": "Reviewed in the United States on February 28, 2023",
    "pid": "0593128176"
},
{
    "title": "Engaging and Insightful",
    "rating": "5.0 out of 5 stars",
    "content": "A beautiful, moving story about love, hope and renewal.  The imagery is captivating and horrifying.  It’s incredible that people survived these situations.",
    "post_time": "Reviewed in the United States on December 9, 2023",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Amazingly lyrical prose supporting an outstanding tale. Nearly a perfect book with one exception that I didn't like the gimmick of ending one section with the same word starting the next section.",
    "post_time": "Reviewed in the United States on November 6, 2023",
    "pid": "0593128176"
},
{
    "title": "Excellent book!",
    "rating": "5.0 out of 5 stars",
    "content": "This is probably one of the most important books I have ever read. This is a story of war, loss and finally hope that refugees endure. This novel hit me directly in the heart.",
    "post_time": "Reviewed in the United States on January 11, 2022",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Although a novel, the author spent time as a volunteer in refuge camps and came away with a solid knowledge of the refuge experience.",
    "post_time": "Reviewed in the United States on April 19, 2023",
    "pid": "0593128176"
},
{
    "title": "Beautiful Story",
    "rating": "5.0 out of 5 stars",
    "content": "Lefteri’s writing is haunting and spare and filled with symbolism.",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The reader is imbedded with Syrian refugees in rubber boats as they cross the ocean and also as they experience the difficulty of living in various refugee camps.",
    "post_time": "Reviewed in the United States on March 13, 2020",
    "pid": "0593128176"
},
{
    "title": "Interesting read",
    "rating": "4.0 out of 5 stars",
    "content": "Modern-day story of the tragedy of forced migration due to political upheaval and hatred and greed.  Heartbreaking to know but heartwarming to feel the strength of human spirit will never be broken.",
    "post_time": "Reviewed in the United States on February 18, 2023",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Reading this book, I became the characters. We must all read this book or one like it & begin to feel the ache. In so many ways, we are all ONE!",
    "post_time": "Reviewed in the United States on October 7, 2023",
    "pid": "0593128176"
},
{
    "title": "We All are Immigrants",
    "rating": "4.0 out of 5 stars",
    "content": "Sad story at some points that tells what immigrants who leave their home country because of wars, the perils they encounter trying to get passage on boats,  perils when on the boats at sea.  What I didn't like at first, was jumping from the present, to the future to the past.  But I didn't know it was the future at the time!  The ending seemed abrupt but you found out all the secrets at that point.  It was interesting.",
    "post_time": "Reviewed in the United States on September 22, 2021",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The book looked new but every now and then there were places where there was no text.",
    "post_time": "Reviewed in the United States on November 21, 2023",
    "pid": "0593128176"
},
{
    "title": "The plight of immigrants",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book! Reading the bad reviews, it’s clear the readers don’t understand the book and that isn’t on the author or the book. Each chapter reflects different periods of time in their journey. It’s very easy to figure out by reading where they are if it is the past or present. As far as the reviews about the pages leaving off mid sentence, that’s the point. It’s almost like another chapter starting on a word ending the sentence of the previous, but it isn’t a new chapter. A new chapter means you’re switching the time period, and the cutoff is still in the same time period, just a different context. I think it’s brilliant! I understood it, it’s easy to understand once you get the hang of it. I read it in two days, I couldn’t put it down!",
    "post_time": "Reviewed in the United States on February 18, 2021",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The story was a bit hard to track because it jumped back and forth between present and past, but it reflected the main character’s difficulty with maintaining in the present as he was prone to slipping into PTSD delusions.",
    "post_time": "Reviewed in the United States on November 22, 2022",
    "pid": "0593128176"
},
{
    "title": "Problem with printing this book.",
    "rating": "4.0 out of 5 stars",
    "content": "Tough read but glad I did. Brings refugee crisis up close and personal.",
    "post_time": "Reviewed in the United States on June 2, 2023",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This a beautifully crafted novel that transports you into the lives of the refugees and their hopes for what we take for granted. Extremely compelling . I will recommend this book for my book club.",
    "post_time": "Reviewed in the United States on September 5, 2023",
    "pid": "0593128176"
},
{
    "title": "Read it in two days!",
    "rating": "4.0 out of 5 stars",
    "content": "This book about the Syrian war and what it did to the people who lived there, was heartbreaking and inspiring. We all need reminders of how awful war is so that, hopefully, we can create peace and not war.",
    "post_time": "Reviewed in the United States on October 30, 2022",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good book. I enjoyed the story. Eye opener re the people who live in Aleppo and try to escape.",
    "post_time": "Reviewed in the United States on November 6, 2023",
    "pid": "0593128176"
},
{
    "title": "Deeply disturbing and equally disappointing book.....it just didn’t  work",
    "rating": "2.0 out of 5 stars",
    "content": "This book grabs your attention and focuses you on it’s two main characters. The story starts out in a compelling way but the last part of the book is confusing, almost incoherent and way too annoying to finish.  While you are reading it you will see constant contradictions about where the characters are and what they are doing. Long stretches make no sense because you can’t tell if what you are reading is real or just a dream. The author says this book is about a central question: “how do we see?“ I suppose the author is referring to one of the characters having dramatic blindness. But the book has almost nothing to do with “how we see“ the author lost her way, did not know how to make the story move forward, and left the book without an incoherent ending. I do not understand how the editors with this unfinished manuscript be published in this form. As I said the author can write compelling fiction but she can’t tie things together in a way that makes sense. You will certainly suffer along with the characters, but you will not know what is real and what is not. This book needs another three or four edits and the author needs to rethink her lack of clarity. If you read this Book to answer the question “how do we see?” Then you will get no answer. The author did not have one and the book does not supply one.",
    "post_time": "Reviewed in the United States on February 11, 2021",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Whether they leave their homes and country because of war, horrific conditions, oppression, or just hopes for a better life, the truth of their journeys is heartbreaking. I wish our world, our humankind had a better answer as it is a problem that continues to grow. The situation with Ukrainians is just the latest example.",
    "post_time": "Reviewed in the United States on April 20, 2022",
    "pid": "0593128176"
},
{
    "title": "Disturbing in the truth of what migrants have to live through.",
    "rating": "5.0 out of 5 stars",
    "content": "If you've ever had an opinion either way about people seeking asylum in a new land, this book brings to life what that experience is like. Heart wrenching yet uplifting as well, it couldn't be more relevant to our times. Like the family around whom the story unfolds, most of us think trauma will never happen to us, but trauma is universal and can come at the least expected times. Even if you haven't formed an opinion or thought much about refugees, this book is also about traumatic human experiences and is well worth the read.",
    "post_time": "Reviewed in the United States on January 20, 2022",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I would have preferred the author write the story sequentially but this style seems to be the trend. But what a heartwrenching story of incredible loss, of loved ones, of home. The challenges of asylum seeking were all but overwhelming. Nuri and Mustapha are both inspiring refugees learning to live with incredible trauma.",
    "post_time": "Reviewed in the United States on April 4, 2022",
    "pid": "0593128176"
},
{
    "title": "Definitely worth reading",
    "rating": "4.0 out of 5 stars",
    "content": "This book portrays the darkness of existence and tragedy of evil",
    "post_time": "Reviewed in the United States on April 18, 2022",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Thank God for bee keepers who bring us not only the taste of honey but also keep the essence of life and hope alive.",
    "post_time": "Reviewed in the United States on April 1, 2020",
    "pid": "0593128176"
},
{
    "title": "Amazing, heartbreaking, but hopeful",
    "rating": "5.0 out of 5 stars",
    "content": "May this book encourage us to be creators of life  nurturing decisions no matter what.",
    "post_time": "Reviewed in the United States on April 13, 2022",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I almost never write book reviews but this is a special book. This is a book with stories on many different levels. There is the outward story of the journey of a couple to flee the Syrian war. And there is the inward journey of a couple traumatized by war losses which has left them strangers to each other. It is a book about immigrants, forced to flee for their lives leaving everything they have known and loved.  It is a book about the best and the worst in the human spirit. It is a book about the extremes the human psyche will go to to deal with trauma that is overwhelming. And as is true for all trauma survivors, this wise author knows that the journey towards healing is through love and connection.",
    "post_time": "Reviewed in the United States on July 3, 2023",
    "pid": "0593128176"
},
{
    "title": "Sadness. Life is fragile",
    "rating": "4.0 out of 5 stars",
    "content": "I read every word and never got bored.  Only my personal life took me away from it for about 10 days and then I was right back in with all my senses.  This is an amazing story that rarely falters and grips the reader with the simplicity and complexity of realism.  What's it like to be a refugee from our most egregious wars?  You'll get a taste of it and more from this classic novel.  Don't miss it!",
    "post_time": "Reviewed in the United States on January 14, 2022",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Excellent and creative book that chronicles a couple’s journey out of a civil war to the UK. It is written with such empathy, and able to address even the most harrowing challenges the couple faces without sensationalizing the traumatic experiences they endure.",
    "post_time": "Reviewed in the United States on October 20, 2021",
    "pid": "0593128176"
},
{
    "title": "Book club pic",
    "rating": "2.0 out of 5 stars",
    "content": "Friendship,  hardship, devotion to a craft.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "This book may have been good but it was missing half of the page in the chapter endings and then the next  chapter began randomly with another part of the book.  I never could figure out what was happening or what I missed.  Not sure how  they can sell something like this.",
    "post_time": "Reviewed in the United States on January 10, 2024",
    "pid": "0593128176"
},
{
    "title": "Some of the sentences or paragraphs in the book chapter endings and beginnings are missing.",
    "rating": "5.0 out of 5 stars",
    "content": "Christy gave each character so much life that it was easy to bring them into mine. This question always enters my thought when I read a historical fiction but this book isn’t so historical yet, How can the human race be so cruel to one another. We can do better!",
    "post_time": "Reviewed in the United States on March 1, 2023",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We have been hearing of the horrors year after year faced by the innocent victims of the war and Assad's regime.This accurate portrayal of a  couple who have lost everything and were forced to flee Allepo to make their way to asylum and a new life brings the reality of an unimaginable period of time to life in a,way that the news can't. If it moves you to in some way to help these and other political refugees through donations to international aid groups, I am sure the author's purpose in writing this novel will have been met.",
    "post_time": "Reviewed in the United States on July 26, 2021",
    "pid": "0593128176"
},
{
    "title": "Heart rendering",
    "rating": "5.0 out of 5 stars",
    "content": "The story is tough to digest, though it’s emotion is well-communicated and it makes a lot more sense at the very end. To those who think words are missing, the sentence is supposed to complete with the title of the second part of the chapter. It’s the narrator unable to stay in the present without being drawn to the past that he’s living through at the same time.",
    "post_time": "Reviewed in the United States on April 18, 2022",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Enough of the camps and the temporary housing. It's like beating a dead horse over and over. I actually put it down after around 150 pages-it just got tedious. Ms. Lefteri's writing is very good and she can spin a page turning story, and I appreciate what she did for the immigrant population and I appreciate also her experiences, but the story just got old. This would have made a very good novel if she had kept the story going.",
    "post_time": "Reviewed in the United States on October 14, 2022",
    "pid": "0593128176"
},
{
    "title": "Gut wrenching and real horrors of refugees from Syria",
    "rating": "4.0 out of 5 stars",
    "content": "I have seen various refugee stories on the news but none have ever touched me like this story. The trauma that this couple went through to try to stay alive. I decided to read because of the title as I have been infatuated with bees for a long time because of their decline. In this story they were very symbolic of their resilience. I highly recommend the Beekeeper of Aleppo. It was a learning experience for me.",
    "post_time": "Reviewed in the United States on January 11, 2021",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was a worthwhile read that takes you to a place you won't get to by watching news reports.  For me, the best books evoke thoughts/feelings/emotions and Beekeeper certainly accomplishes that, and it educates as well.  One facet of this book that is truly outstanding (but tragic) is the author's ability to compel the reader to feel the power and pain of loss, especially when that loss is through a senseless acts.",
    "post_time": "Reviewed in the United States on June 28, 2021",
    "pid": "0593128176"
},
{
    "title": "Good emotion",
    "rating": "5.0 out of 5 stars",
    "content": "This book was very well written. It put a personal face on the plight of refugees no matter what country they are fleeing to gain safety for their families. There is a lot of danger during the long journey and the fear of not gaining asylum and being sent back.",
    "post_time": "Reviewed in the United States on May 28, 2022",
    "pid": "0593128176"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I plan to read it again and I never do that even with other books I have loved.",
    "post_time": "Reviewed in the United States on April 10, 2023",
    "pid": "0593128176"
}
]