[
{
    "name": "  The Paper Palace (Reese's Book Club): A Novel ",
    "stars": [
        "46%",
        "33%",
        "15%",
        "4%",
        "3%"
    ],
    "pid": "059332983X",
    "ratings": "84,582 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Loved this book",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book. Great characters and a good story",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book drew me in from the first paragraph. The author’s descriptive writing provides a detailed picture of each scene and each person. Interestingly the author toggles between the far past and the present until a long bout in the past brings the reader up to the present. The characters are all flawed and real. It is as if you’ve stepped into one family’s life and are learning about everyone who touched it. Be sure to either keep a notebook of all the characters or google for a list.",
    "post_time": "Reviewed in the United States on March 22, 2024",
    "pid": "059332983X"
},
{
    "title": "Draws you in",
    "rating": "3.0 out of 5 stars",
    "content": "There is no hidden meaning in this story. It is just a story that reflects one family’s life. It’s a relatively quick read that I enjoyed.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This book was very hard to get into. I do enjoy a book that goes between the past and present time but I found this one hard to follow. I did get into it but was more interested in finishing it than anything. Then I was disappointed in the ending.",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "059332983X"
},
{
    "title": "Interesting story but …",
    "rating": "4.0 out of 5 stars",
    "content": "A 50 year old woman has to choose between her husband and a lover.  That's the hook on which to hang the life story of Elle, who was raised by casually cruel and neglectful parents.  It was engaging enough, but ultimately, I did not make space for it on my bookshelf.",
    "post_time": "Reviewed in the United States on April 13, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Book is good but haven’t finished. Easy to read lettering and nice size to hold.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "059332983X"
},
{
    "title": "Moderately engaging but flawed",
    "rating": "5.0 out of 5 stars",
    "content": "The story could not be more clear, as the author paints such a beautiful picture of every single scene.  You feel like you are there with her.  The story is well written and keeps you wanting more.  I applaud her!!!!!",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "For me,  the beginning of this book was a bit slow, but before too long, it took off running! Lots of surprises. I really enjoyed it but found the ending frustrating,  I mean, I assume the author wants us each to decide on the ending we wanted. It's definitely a good summer read!",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "059332983X"
},
{
    "title": "Pretty cover",
    "rating": "4.0 out of 5 stars",
    "content": "Couldn’t put the book down.",
    "post_time": "Reviewed in the United States on September 12, 2023",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Each summer I look for a few typical beach reads, something with a compelling story, some drama, and a summery setting, and a good sense of place that will carry me away. I do look for good writing, which can be hard to find in concert w the features listed above. This one had all of the above, and I really appreciated that the protagonist was age 50, which for me made her easier to relate to. I enjoyed it. It has a lot of dark moments but those are not overwhelming, and are balanced by moments of light. Just as in life.",
    "post_time": "Reviewed in the United States on March 30, 2024",
    "pid": "059332983X"
},
{
    "title": "Sensitive material, but still wanted to finish",
    "rating": "3.0 out of 5 stars",
    "content": "This was a rough read. The writing was well done, but there is A LOT of sensitive material that can make a reader uncomfortable. Still, I wanted to know how it ended so I ended up finishing the book regardless.",
    "post_time": "Reviewed in the United States on June 5, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The story is fantastic, the book itself came apart at the bind, made it hard to read and hard to keep once I finished.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "059332983X"
},
{
    "title": "Book broke apart",
    "rating": "5.0 out of 5 stars",
    "content": "The Paper Palace will be your next favorite book and deserves a spot on your top ten list. This literary masterpiece is Miranda Heller’s first novel. One day at their family summer Cape Cod retreat, Elle, mother of three and happily married to Peter, finally has sex with Jonas, her best friend from childhood through her teens whom she probably should have married. Three pages into the novel, Elle thinks, “I love him. I hate myself; I love myself,  I hate him.” For the rest of the novel, Elle wrestles with whether to leave Peter, whom she also still loves. Elle grew up with parents and grandparents who divorced often. A sad part of the book is Elle’s protectiveness of her mother. After her mother’s broken marriages, she finally finds a man who makes her happy. However, to protect her mom and that peaceful happiness, Elle keeps a harmful secret that leads to a tragedy at Cape Cod and connects her emotionally to Jonas forever. This book is beautifully written. Normally I skim over detailed descriptions of nature, but I found myself jotting down some of Heller’s phrasing about the ocean, campsites, and swimming. Pay attention to what she says about swimming. It’s a metaphor for the book’s ending which I am sure you will want to discuss as thousand of readers are debating it on several on-line forums and at book clubs. This deeply emotional book is on several best book lists and Target and Reese’s Book Clubs. I will read this book again.",
    "post_time": "Reviewed in the United States on December 8, 2021",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I bought this book right after hearing the author interviewed by Mary Louise Kelley on NPR. Together they made it sound like a \"must read.\" Well, I am mostly a non-fiction reader, do not enjoy novels written in first person and find tedious description, that does NOT move the plot, unbearable. So I am amazed that I finished this book as if it were a page turner for me.",
    "post_time": "Reviewed in the United States on July 29, 2021",
    "pid": "059332983X"
},
{
    "title": "Top Ten on My List",
    "rating": "1.0 out of 5 stars",
    "content": "There were some surprises along the way and the plot moved from the protagonist's long ago past to the present of one particular day, hour by hour. That part was clever.  But at times I got lost in the description and just skimmed over it.",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I somehow sensed that the ending might not be satisfying - more like a short story ending.  There were two elements at the very end that led me to believe that I wasn't 100% sure about the choice that Elle made. Maybe that's the way I'm supposed to read it.",
    "post_time": "Reviewed in the United States on July 27, 2021",
    "pid": "059332983X"
},
{
    "title": "If YOU LOVE OVER WRITTEN DISCRIPTION",
    "rating": "4.0 out of 5 stars",
    "content": "If you want a summer novel to take to the beach, this book is full of water scenes. If you love detailed description you won't be disappointed. Since the writer is an HBO producer, it might make a better movie than a book.",
    "post_time": "Reviewed in the United States on July 3, 2022",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "PS: I re-read the last chapter twice and I think I figured out the ending, but not the one I hoped for.  I'd love to discuss this book with another reader, because I don't want to spoil it for anyone just starting the book or thinking about doing so. For some reason, maybe a personal one,  this story haunts me.",
    "post_time": "Reviewed in the United States on April 30, 2022",
    "pid": "059332983X"
},
{
    "title": "Just…not good",
    "rating": "2.0 out of 5 stars",
    "content": "I’m in shock that this book has such good reviews. I am halfway through it and I don’t think I’ll even try to finish it.",
    "post_time": "Reviewed in the United States on May 16, 2022",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Firstly, the Author jumps around continuously through the entire book. Every chapter is a different state, country, era, of someone’s life- the main character’s mother, the main character herself, her father, their random spouses. Some of these chapters are completely pointless and irrelevant to the plot or the book itself- which I’m not sure there truly is a plot, aside from the character screwing a childhood friend?  Is that really an entertaining story? Not so much.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "059332983X"
},
{
    "title": "Disappointed",
    "rating": "3.0 out of 5 stars",
    "content": "Story bounced back and forth in time every 2 or 3 pages.  And there was more real ending.  It was a good story line though.  I  Don't recommend it.",
    "post_time": "Reviewed in the United States on May 12, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "After reading too many \"highly rated\" poorly written books, this book opened like a breath of fresh air.  The writing was just so good.  As I read on, I couldn't put it down.  Yes, there were things that bothered me that I was able to overlook.  For example, after years of denying their love, Jonas turns Elle around and takes her from behind.  Why?  And, how many perverts does a person encounter in one's life?  What is the author's point creating a character that not only encounters sexual abuse in her childhood home but seems to run into it on the streets wherever she lives?  Why was the additional street violence a necessary element to the story?  Why had Jonas and Elle NEVER considered that Rosemary was a victim as well, and why did this knowledge so easily absolve them of their crime?",
    "post_time": "Reviewed in the United States on September 4, 2021",
    "pid": "059332983X"
},
{
    "title": "Desperate to love this book  Spoiler alert",
    "rating": "3.0 out of 5 stars",
    "content": "Again, all of this I was able to ignore until I got to the ending.  The author has coyly suggested that she never meant for it to be open-ended, that the answer to who Elle chose is in the penultimate paragraph.  Readers have been left feeling confused.  I was left feeling confused until I re-read the end and came to the only logical conclusion.  The ending wasn't cleverly open-ended.  It was, in fact poorly conceived and written.  Once you come to that simple fact, you are free from this book that could have been so much better.",
    "post_time": "Reviewed in the United States on March 4, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was just a slow and tortuous chore for me. It was well written, quite lyrical at times, so it wasn't that. I just couldn't relate to, nor did I like, any of the characters. I simply couldn't care what happened to them, whether they found happiness. The most appealing character to me was Elle's mother. At least she had some spunk. Got 1/3 through and then, something I rarely do, just quit.",
    "post_time": "Reviewed in the United States on December 28, 2023",
    "pid": "059332983X"
},
{
    "title": "Couldn't get through this one",
    "rating": "3.0 out of 5 stars",
    "content": "It was a good book. Kept me on my toes. I didn’t love the end. But it’s possible that I didn’t fully understand it.",
    "post_time": "Reviewed in the United States on January 2, 2022",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I gave three stars, and I would have given two and a half. It was very well written, and I thoroughly enjoyed being taken through the vistas of this characters life. I also enjoyed the command of time this author wrote with as she fluidly moved back and forth between memories and present time. That said, while I appreciated the potential each of the character of this story had, I didn’t at any time, feel like they had any depth. There wasn’t enough substance to even the main character to feel a connection. When we come into the present time, after most of the middle and very significant years of the characters life being glossed over in a few very short paragraphs I am left with as many questions and potential conclusions as I had throughout the entire story. If this was a book about a frustrated character, then the author succeeded in creating a shared frustration in the reader. If this was a story communicating divorce fragments a child’s development, then was the author attempting to convey the message through fragmented storytelling? It never completely becomes clear. The main character throughout the story only ever has the weight of the paper dolls she and her sister made as children. A lot of very significant events happen throughout the story and are never fleshed out. No one relationship is ever delved into enough.",
    "post_time": "Reviewed in the United States on February 5, 2022",
    "pid": "059332983X"
},
{
    "title": "Good read",
    "rating": "2.0 out of 5 stars",
    "content": "I purchased this book without reading any reviews, based solely on the jacket synopsis. Now, as I recommend it to friends, I am reading reviews and feel the need to contribute. As a writing instructor with degrees in literary criticism, this book left me speechless in some ways. As others have written, there are scenes of sexual assault that might trigger some readers. And they are sometimes written about with such nonchalance that makes the violence being described feel even worse. However, because those scenes are discussed in first-person, the psychology of the victims cannot be ignored. This novel is brilliantly constructed and themes of family, trauma, love, etc. are woven together masterfully. This is not some easy, light-hearted \"summer read.\" It is literature. The kind of literature that belongs on a University syllabus. It is heartbreaking, funny, infuriating, heartwarming. If you can get through the ugly parts, you will not be able to put it down. Read it carefully and thoughtfully and this is a story that will stay with you for a long, long time. A place that will feel familiar by the end. Characters that you will recognize. I will read everything this author creates, from this point forward. The Paper Palace is something special.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I tried reading this book.  It just wasn't for me. It was a bit on the heavier side, dealing with issues of sexual abuse of children.  I didn't read it all, so I can't say how the entire book is but if you want a lighter, easier read book, this may not be for you.",
    "post_time": "Reviewed in the United States on December 11, 2023",
    "pid": "059332983X"
},
{
    "title": "Beautiful Imagery",
    "rating": "3.0 out of 5 stars",
    "content": "I really wanted to like this book. I gave it several tries but I couldn’t finish it . It was hard to stay interested.",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I liked the story, but parts felt very disconnected to me and then the ending was so unsatisfying. I need a book 2 and a real conclusion as messy and heartbreaking as it could possibly be.",
    "post_time": "Reviewed in the United States on April 29, 2024",
    "pid": "059332983X"
},
{
    "title": "Awesome Book",
    "rating": "5.0 out of 5 stars",
    "content": "Great gift and read!",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "As I finished this book, I felt the unexplored theme was selfishness. Clearly Elle exhibits it, as does her mum (loved that character) but the selfishness within Jonas was virtually ignored. It felt as if the author was in love with him, willing to overlook his flaws. From the moment when he stays Elle’s hand on the boat to the last moment in the book, he is singularly focused on what he wants. It is Elle, not Jonas, who pays the price.",
    "post_time": "Reviewed in the United States on January 9, 2024",
    "pid": "059332983X"
},
{
    "title": "What about Jonas?",
    "rating": "4.0 out of 5 stars",
    "content": "This is a tough one to review - although I felt compelled because I didn't know until I finished the book that this was the author's first novel.  Wow!  What a debut.",
    "post_time": "Reviewed in the United States on May 24, 2022",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Regardless of what you think of the characters or the story, it was extremely well written and edited. At times it was painful, but at other times some of the dialogue or retorts made me literally LOL!",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "059332983X"
},
{
    "title": "Definitely worth reading",
    "rating": "5.0 out of 5 stars",
    "content": "I hate reviews that relate the details of the plot, so I skip right to the point.  It's well written, intriguing, funny, heart wrenching, and I can't wait for another novel by this author.  Give it a try!  Now that I say that, I'm not quite sure why I didn't give it 5 stars.",
    "post_time": "Reviewed in the United States on March 26, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I'm confused...what the hell happened?  I feel like I woke up in the middle of a dream and will never know how it ended.",
    "post_time": "Reviewed in the United States on January 23, 2023",
    "pid": "059332983X"
},
{
    "title": "HUH...",
    "rating": "4.0 out of 5 stars",
    "content": "Amazing book! Loved the writing style and the plot of this book! Kept me wanting more the entire time and I never got bored or wanted to put the book down! I even used this book as a large book share that I participated in too! Give it a try!",
    "post_time": "Reviewed in the United States on August 12, 2023",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A very enjoyable book.  The author did a great job with character descriptions and settings, in general.  I wouldn’t say it was the most original storyline of the century, but the sequencing and the characters kept the story engaging.",
    "post_time": "Reviewed in the United States on August 11, 2023",
    "pid": "059332983X"
},
{
    "title": "One of my all time favorite books!",
    "rating": "5.0 out of 5 stars",
    "content": "I was a bit off put by other reviewers declaring that the book had no defined ending.  The author’s notes at the end of the book explain this.  I had figured it out, but then again, I am a stickler for details.",
    "post_time": "Reviewed in the United States on July 20, 2021",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You will enjoy this book:  it takes you away and leaves you quite satisfied in remembering that everyone has a secret!",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "059332983X"
},
{
    "title": "Disturbing and graphic.",
    "rating": "2.0 out of 5 stars",
    "content": "Sexual abuse of children graphically written. Child neglect normalized. I don't understand why anyone would write something like this. It isn't entertaining (obviously) and it isn't inspiring. It is everything sad, disgusting, and dysfunctional that you can think of. I won't even put this in the donate bin because I can't pass it on in good conscience.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Our cook club read this and we all enjoyed it very much. We felt for the main character. There were many different feelings about what happened at the ending - which was interesting. A great read!",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "059332983X"
},
{
    "title": "A great book - a sequel would be appreciated as the ending was a head-scratcher",
    "rating": "4.0 out of 5 stars",
    "content": "This book was intense. It broached some tough subjects. It made you see the “grey” in situations that you may think should be black and white!",
    "post_time": "Reviewed in the United States on October 7, 2023",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "There was so many sad things that occurred, some parts were a little shocking and the ending left you wondering what happened.",
    "post_time": "Reviewed in the United States on October 12, 2023",
    "pid": "059332983X"
},
{
    "title": "Intense storyline…interesting read",
    "rating": "1.0 out of 5 stars",
    "content": "I’m sorry I spent a few valuable hours of my precious lifetime on Earth reading the first half of this book before I deleted it from my kindle. I’m sorrier I didn’t read the reviews earlier, which might have tipped me off to go and do something else. I decided to read it while visiting the area of the Cape where the book is set. There’d been some buzz about it. I’d heard the author interviewed, and she seemed like a character. If only her fictional characters were as intriguing. The descriptions of the outer Cape landscape are good, hence, the one well-deserved star. The characters ... I couldn’t find a single one to care about, except maybe the giant snapping turtle whose indignant rage I found relatable. Lots of trite, predictable descriptions heavily peppered with sexual assault and abuse to, I don’t know, be provocative and “challenging”? {sigh} If you empty a bottle of hot sauce onto your SpaghettiOs, they’re still SpaghettiOs, only now they make your eyes water—which in the case of this book may be a blessing because tears are cleansing. Anyway, for sure there are books about despicable characters who commit horrendous deeds that are good books—the characters are still somehow sympathetic, and their actions serve the greater purpose of the narrative and art. You think to yourself, “Wow, that book made me think of something I haven’t thought of before! It didn’t make me feel bored or icky at all! I sure am glad I read that book!” This is not one of those books.",
    "post_time": "Reviewed in the United States on July 1, 2022",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "However, lots of people seem to like this book. You might be one of those people. Read the other reviews. If they resonate, don’t mind me. But if you’re a cranky, picky reader too exhausted to read yet another book ponderously chronicling the sticky dregs of human nature to no meaningful end, stop right there, turn off your phone, and go pet a puppy or smile at a baby or something. You’ll be glad that you did.",
    "post_time": "Reviewed in the United States on June 2, 2022",
    "pid": "059332983X"
},
{
    "title": "Was okay.",
    "rating": "5.0 out of 5 stars",
    "content": "The writing was beautiful, the metaphors lovely, the story pulled me in immediately, and I couldn't put it down, but every one of Elle's decisions made me cringe. From cheating on her husband, a man she admired and loved, to constantly breaking her lover's heart, to letting her step-brother molester her every night for the most absurd reason, I kept hoping I'd find some redeeming qualities, but no, I felt only disgust. I know it's a popular story line now to feature flawed heroes, but when your own life is not a train wreck, it's hard to be really fulfilled by a book that makes you feel sorry for all the people in Elle's life. Thus I'm conflicted.",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I felt like this book was a very real depiction of what it’s like to love deeply and been hurt deeply. I would love to read the book from Jonas’ pov if I could.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "059332983X"
},
{
    "title": "Oh, my. Wish I could get those minutes back.",
    "rating": "5.0 out of 5 stars",
    "content": "I usually investigate books touted by celebrities but this one was not a winner for me! I found that I had a very difficult time getting invested in the characters - I just couldn’t relate and didn’t like them at all as the book continued.  For me this book was alot of work and no reward!!!!",
    "post_time": "Reviewed in the United States on March 27, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I wasn’t sure what to expect but was quickly caught up in the story because of the writing style.  For me, a great book is 40% story line and 60% writing technique.  Kudos to Ms Crowley Heller.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "059332983X"
},
{
    "title": "great read! awesome for beach or travel",
    "rating": "5.0 out of 5 stars",
    "content": "I had to hang in there in the beginning but once I did, I was hooked!! I highly recommend this one",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Some books are so overhyped and I grow weary even to finish them because the hype was basically ALL . BUT #thepaperpalace is a different story. It came up on an Instagram feed I follow (NOT a famous person’s) and I ordered it based on what she said - which was very little- other than WOW. This novel ~ wow ~ (the word applies!!) I kept rereading as I went because I didn’t want to miss a thing…I also didn’t want it to end. The structure fascinated me - the present point of view is ONE DAY but the past goes way back and is omnipresent throughout the narrative of the one day (it’s just that way in real life too) We see Elle’s life as she ponders, reflects, and wonders what comes next… There are three generations meeting on #capecod and they will permeate your head and heart as that day unfolds. You won’t see what happens from sunrise to sunrise coming, but you will turn those pages! #againandagain",
    "post_time": "Reviewed in the United States on September 12, 2021",
    "pid": "059332983X"
},
{
    "title": "Mesmerizing in structure and style!",
    "rating": "2.0 out of 5 stars",
    "content": "The characters were severely underdeveloped in my opinion and i did not feel any connection to them/ care what happened to them whatsoever. To me, the sequence in which the book was written was very confusing and just seemed like a string of random, unfortunate events that didn’t have anything to do with the present. It was way too confusing to have so much back story about mothers and grandmothers that also had little impact on the actual story. I kept waiting to feel more attachment to the characters, and was just disappointed. It seems like there was just tragedy after tragedy thrown together in attempt to make an interesting story and to make readers feel bad for the main character. I just found it to be demoralizing at times and not easy to follow. Each traumatic event was just blatantly stated without a story developing from it. The story felt very scattered and disconnected with none of the tragedies connecting and too many irrelevant characters being convinced. I found myself being confused and struggling to remember who was who every time I picked up the book.",
    "post_time": "Reviewed in the United States on September 27, 2023",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Unlike others who wrote critical reviews, I'm not bothered by the events of the plot, per se. What did bother me was Elle's inability to speak up when she needed to, to get her mother to protect her when that was so obviously what was needed. I'm treading lightly here so as not to spoil anything. Those who have read the book will know what I'm talking about.",
    "post_time": "Reviewed in the United States on February 12, 2022",
    "pid": "059332983X"
},
{
    "title": "Not for me",
    "rating": "3.0 out of 5 stars",
    "content": "Of course, if Elle had spoken up when any normal person would have, the central issue/plot point would have been unable to exist.",
    "post_time": "Reviewed in the United States on January 7, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I also found unbelievable what happened between her and Jonas after said central plot point played out. I don't think I would have reacted the way they did. I guess what I'm really saying, I suppose, is that this story simply should not exist.",
    "post_time": "Reviewed in the United States on January 1, 2024",
    "pid": "059332983X"
},
{
    "title": "A story of a woman's inability to make good choices.",
    "rating": "3.0 out of 5 stars",
    "content": "I think I've read that Reese Witherspoon has bought the rights to film the book. I don't know if I'll watch it or not. My only curiosity lies in who will be cast as the main characters.",
    "post_time": "Reviewed in the United States on July 27, 2021",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Overall a good story but I felt some things could have been left out all together. Graphic scenes seem to come out of nowhere and the plot/story wouldn’t have suffered had they been left out.",
    "post_time": "Reviewed in the United States on August 17, 2021",
    "pid": "059332983X"
},
{
    "title": "Graphic!",
    "rating": "5.0 out of 5 stars",
    "content": "I did not expect to get swept away by this book, but amongst busy holiday preparations and kid stuff, I finished it in three days. Completely and utterly fell into the world of the paper palace. It’s not something I can explain, it’s something you have to experience. Don’t hesitate, just read it!",
    "post_time": "Reviewed in the United States on February 20, 2022",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I wanted to love this book because I know the setting, but ultimately I didn't care about the main character. Elle is self-absorbed, pretentious and unsympathetic, despite her history.",
    "post_time": "Reviewed in the United States on July 24, 2023",
    "pid": "059332983X"
},
{
    "title": "Kept me waiting!!!",
    "rating": "5.0 out of 5 stars",
    "content": "Loved the beginning and most of the book. However, kept waiting for what I wanted to happen and it never happened so it keeps you guessing. I would have loved different ending.",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Well written, really great book",
    "post_time": "Reviewed in the United States on October 14, 2023",
    "pid": "059332983X"
},
{
    "title": "Great read",
    "rating": "4.0 out of 5 stars",
    "content": "If you and your family have a place that generations have spent every year together, the primary setting of this novel will resonate with you.  It also holds secrets for Elle that have affected her life since her early teens.  This is an easy read and one could ponder her dilemmas but it is basically a beach read.  Some characters are memorable especially Elle’s feisty mother.  I consider it 3-1/2 stars but gave it the benefit of the doubt.",
    "post_time": "Reviewed in the United States on June 13, 2022",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Such wonderful characters and such beautiful and descriptive writing.  The author paints such beautiful pictures with her words.  I will recommend this to everyone I know",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "059332983X"
},
{
    "title": "a Place we Call Home",
    "rating": "1.0 out of 5 stars",
    "content": "In the first several chapters there was a woman cheating w her best friends husband at their summer home and the main character is telling about how her uncle and mother were sexually abused by their step father performing sodomy at age 6 and 9. No longer a fan of Reese or her book recommendations. Is she aware of what’s going on in the world? Wake up Reese!!!!!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Depressing and complicated. The book starts off interesting, and sexy, and like a fun mystery, but when you figure out what the mystery is all about it is just depressing. Make you never want to let your children out of your sight. I am not sure if I should spoil it since the book jacket mentions nothing of the actual plot...",
    "post_time": "Reviewed in the United States on November 5, 2021",
    "pid": "059332983X"
},
{
    "title": "couldn’t put it down",
    "rating": "3.0 out of 5 stars",
    "content": "The writing is good, the beat is nice. It flashes back and forth a lot which can be hard, but it is not that hard because we're always revisiting the same tentpoles.  Seems like it would be a good vacation read, but actually it is not. I felt gross reading it in the office of the obgyn while waiting for an appointment last week. Which is usually my favorite place to read, because it is quiet, and there is no tv on, and no one bothers me when they know I am going to that dr.",
    "post_time": "Reviewed in the United States on January 4, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "3/5 because the book is so misleading.",
    "post_time": "Reviewed in the United States on October 1, 2023",
    "pid": "059332983X"
},
{
    "title": "What is Reese thinking?",
    "rating": "5.0 out of 5 stars",
    "content": "The writing is beautiful.  The reading made me feel sick, I couldn’t stop, like I was being sucked down the drain.",
    "post_time": "Reviewed in the United States on March 28, 2024",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I thought the book's ending was a bit ambiguous, then I read the acknowledgements and knew the ending. Initially, the going into the past and back to the present was confusing, until going back to the past dealt with what was the former present. Overall, it was a book that I read faster than most; I didn't want it to end.",
    "post_time": "Reviewed in the United States on December 4, 2022",
    "pid": "059332983X"
},
{
    "title": "Beautifully written!",
    "rating": "5.0 out of 5 stars",
    "content": "It's hard to know what to say about this book. It's so deep and tangled. The unwavering love and connection she has with Jonas is familiar and it was easy to get lost in as I was reading. The tragedy in each person's life is sometimes hard to read through. Watching these imperfect people stumble through life, products of those before them, is so real and palpable. Some people had a hard time with the ending because it appeared to be abrupt but in reality, it's not. Here you are in present day, after reading about the preceding decades and she has a decision to make and that's pretty much it. Otherwise she would have been telling the same story over and over. The amount of healing Elle goes through was beautifully crafted by the author. I'm excited to read more from her.",
    "post_time": "Reviewed in the United States on September 10, 2021",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I usually don’t write negative book reviews because I understand how much of one’s heart and soul goes into the writing process.  This is going to be the exception.  The reason for the negative review is the nonchalant depictions of incest, rape, and childhood sexual abuse.  If you are going to use these themes, you better make sure it leaves a powerful impact on the destruction and damage it physically, emotionally and psychologically causes the abused. It this book, it was just a casual theme thrown in the mix almost normalizing it as acceptable.  We have enough of this in society and in Hollywood, we don’t need more.  This book is also boring.  Really boring.  I kept waiting for it to go somewhere but it never did.  I kept waiting for a plot twist, never happened.",
    "post_time": "Reviewed in the United States on July 11, 2021",
    "pid": "059332983X"
},
{
    "title": "Ehhhh",
    "rating": "5.0 out of 5 stars",
    "content": "This was novel was at times difficult to read. The sexual encounters are a little graphic but it is the brutal sexual assaults on women that make it a tough read. I did not read this novel for a long time because I have always found adultery distasteful. I was afraid that I would dislike the main character, Eleanor, so why bother. The backstory, is what is so amazing, as to why Eleanor betrays her husband. There are so many flawed characters in this novel. The women are judged so harshly. This novel makes it seem that women have no control over their libido and that as a consequence their children will suffer. There a very few nice characters in this novel and they are both men.",
    "post_time": "Reviewed in the United States on December 27, 2021",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I can’t believe this smut is recommended by this many readers and Reese Witherspoon. Granted I didn’t finish the book but considering in the 2nd chapter a six year old child is forced to give their stepfather a blow job and younger  brother is forced to give same man a hand job I just can’t proceed. I get this stuff happens in real life but there is no need to glamorize it. It is disgusting and couldn’t even continue.  If we stop financially supporting filth maybe authors will start putting out better content.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "059332983X"
},
{
    "title": "upsetting sexual themes",
    "rating": "5.0 out of 5 stars",
    "content": "This book is a painting in words. The images the author creates can be seen and felt.",
    "post_time": "Reviewed in the United States on June 1, 2022",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you think you have a dysfunctional family, you’ll feel so much better about it after reading The Paper Palace.",
    "post_time": "Reviewed in the United States on September 6, 2021",
    "pid": "059332983X"
},
{
    "title": "Filth",
    "rating": "5.0 out of 5 stars",
    "content": "So many interesting and colorful characters who all come together during summers on the Cape…but in between those summers life is a whirlwind.",
    "post_time": "Reviewed in the United States on April 10, 2023",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I will, at some point, read this novel again. It’s one of those that touch your soul and fill your heart. I wish there were a place in this world for everyone like the Paper Palace.",
    "post_time": "Reviewed in the United States on January 22, 2024",
    "pid": "059332983X"
},
{
    "title": "a stunningly gorgeous book",
    "rating": "4.0 out of 5 stars",
    "content": "The author takes us through several long term family and other relationships of a very fortunate but very conflicted woman.  She is beautiful, wealthy, loved, and gifted but nevertheless lacking in self assurance in critical circumstances.  We go back and forth between periods in her life when she makes major choices that often satisfy but also haunt her.  We see how her family members help shape her, but don't ultimately determine what she decides.  The Cape Cod setting reminds me of New England summer vacations I've experienced, with a certain specialness of place and friendship that seeped into my bones and shaped my outlook.  The descriptions of the family place are vivid and so are the characters.",
    "post_time": "Reviewed in the United States on May 31, 2022",
    "pid": "059332983X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Such an amazing story and so well crafted and beautifully written. I will not forget this book and the memories it brought back to me of the lessons I've learned through the course of my life and the questions brought to me over time. It was given to me as a birthday gift from my sister in law and I'm so lucky to have been given it and her as well when I got married. 💓",
    "post_time": "Reviewed in the United States on July 26, 2021",
    "pid": "059332983X"
}
]