[
{
    "name": "  Trust (Pulitzer Prize Winner) ",
    "stars": [
        "46%",
        "29%",
        "16%",
        "5%",
        "4%"
    ],
    "pid": "0593420322",
    "ratings": "31,662 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Enjoyable reading",
    "rating": "5.0 out of 5 stars",
    "content": "My book club pick. I’ve recommended it to other book clubs.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved how this book was written in four different writing styles. The author tells the same story four times as though written by four different authors. There is some true history referenced but not the main focus of the book.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "0593420322"
},
{
    "title": "This is a great read",
    "rating": "3.0 out of 5 stars",
    "content": "I didn’t finish this book. It is very well written but it is all related by the writer. There is no action or interaction with the characters. You are told everything that happens to them in a narrative form. Not my favorite type of fictional writing.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A few times I got lost.  But the story and the history of the times was so interesting.  The way he wrote about the final days of Mildred was so insightful.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "0593420322"
},
{
    "title": "Not my style",
    "rating": "5.0 out of 5 stars",
    "content": "Beautifully written beginning to end - I went into this book relatively blind to the plot and it is easily in my top 3 books in the last 10 years",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed this unique book. 4 parts that are interconnected gave you different versions that made you wonder. I wouldn't want all books to have the same structure, but I felt it worked great in this one.",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "0593420322"
},
{
    "title": "A Book To Remember",
    "rating": "4.0 out of 5 stars",
    "content": "It's not the easiest read, but it's worth hanging in.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Spoiler alert:",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "0593420322"
},
{
    "title": "one of the best books I’ve read in a long time",
    "rating": "5.0 out of 5 stars",
    "content": "I completely disagree that this is a book mainly interested in “women’s” issues and that the reveal is Mildred being the savant. That she is the genius, is not what I dispute. That is not, in my mind, Diaz’s point. The question I found myself asking is how come I sympathized with Mildred? If I consider Mr Bevel a vain almost criminal person for contributing to the stock market crash that led to the Great Depression, how come when I discover it is really his clever artsy wife, I am not as disgusted? Because she was philanthropic? Artsy? Smart? Female? Dying of cancer? Because she liked music? Does that make her more trust-worthy. Should I trust her? Why do I feel the same ownership, identification and sympathy toward Mildred that Ida does?",
    "post_time": "Reviewed in the United States on June 4, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is the brilliance of what Hernan Diaz pulls off: That I am indicted by my own prejudices. Ultimately Mildred is as guilty of commercial explotation as Andrew, but the reader (evident from peoples reviews) judges her less, is tempted to interpret her as heroic, oppressed(?) even! Ha Ha! This is Diaz mocking us for our own ridiculous ways of demonizing and valorizing. She was obscenely wealthy and her power was a game to her, and capital wooed her, as it did Andrew, and Ida and Jack, and us.",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "0593420322"
},
{
    "title": "very interesting",
    "rating": "4.0 out of 5 stars",
    "content": "Very different from what I usually read.  Well written.  So unique.  I learned a lot.  Had a hard time figuring out who to trust…but that was the point!",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fabulous historic tale of high finance  dealings in NYC pre 1929. Woven around crisp characters, artfully written, totally captivating. A page turner!!",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "0593420322"
},
{
    "title": "Brilliant!!!",
    "rating": "5.0 out of 5 stars",
    "content": "“Trust” by Hernan Diaz is a lot. “Books within books” test your abilities, and you must reread a lot. That doesn’t mean it isn’t worth the work. You will feel more competent when you finish. The main character, Benjamin Rask, is wealthy and mysterious, earning a great deal on the market but remaining disdainful of excessive wealth.",
    "post_time": "Reviewed in the United States on November 2, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The novel picks up when we learn about mental illness, solitude, and the 1929 stock market crash. Benjamin Rask navigates it so well that some of his peers hold him responsible. The part that the reader forgets is that you are reading a fictional novel about a fictional story, leaving you to doubt the reliability of the narrator and the “facts” that he presents.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "0593420322"
},
{
    "title": "Worthy of a Pulitzer",
    "rating": "3.0 out of 5 stars",
    "content": "When one “story” ends and another begins, the confusion doubles. You have to meet and absorb a lot of new characters, and you will not get the point right away, but the reveal is rewarding. Men in the business world will respond well to the financial aspects divulged and how they tie in with the familial strife presented by the author.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Since the novel spans a century, you will identify with some parts more than others. The third “novel” by Ida Partenza speaks of life as an Italian immigrant at the turn of the century, and I wanted more of that. For this reason, the book requires patience, but you have my word that it is worth it. A little knowledge of the stock market wouldn’t hurt, however.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "0593420322"
},
{
    "title": "a treat to read",
    "rating": "3.0 out of 5 stars",
    "content": "Novels like “Trust” do not come around often because one could easily do them poorly. You have to do a great deal to keep the stories straight; your enjoyment will depend on how intriguing the story is. I found the presentation of contradicting facts interesting, but you had to re-learn everything.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Extremely well written",
    "post_time": "Reviewed in the United States on August 1, 2023",
    "pid": "0593420322"
},
{
    "title": "Truist",
    "rating": "3.0 out of 5 stars",
    "content": "Fascinating story",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Well deserved Pulitzer",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "0593420322"
},
{
    "title": "Come for the stock tips, stay for the clever take-down of the patriarchy",
    "rating": "4.0 out of 5 stars",
    "content": "Come for the stock tips, and stay for the clever take-down of the patriarchy. Hernan Diaz writes beautifully, and this book-within-a-book-within-a-book is a satisfying, steadily unfolding puzzle. Worthy of all the recognition and buzz that it’s received.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful and hauntingly written. I will be thinking about this book for along time.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "0593420322"
},
{
    "title": "An important read",
    "rating": "4.0 out of 5 stars",
    "content": "Trust is a most interesting, philosophical novel. It is written in 4 parts.  Part one is a complete novella.  Part 2 is an incomplete memoir, telling a story similar to Part one.  Part 3 is a complete memoir of the woman who assisted the first person narrator of Part 2. Part 4 is the diary of a key character in Parts 1-3, whose story is not understood until Part 4 is read. Trust raises the question - Which is the true story?  Can it ever be fully known? Or is it always a matter of perspective? What is most interesting about Trust is that it is also the story of the world of finance, and raises similar questions in that world.",
    "post_time": "Reviewed in the United States on November 10, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "In TRUST Herman Diaz clever imagination, attention to detail, and appealing writing exposes the reader to the life of 1920’s mega capitalists accumulation of unimaginable wealth. What this wealth can do and what it can’t do.  Through this novel within a novel the history of New York as the finance capital of the world is traced back through the country’s economic cycles starting with Thomas Jefferson up to the 1920’s.  In economic booms, embargoes, recessions, the 1929 stock market crash and its ensuing depression these mega capitalist continue to accumulate their massive fortunes.  Is their inherent greed  mitigated by their belief that what they are doing will be helping the economy to regain sound footing?  Their opulent life style stands in contrast to the struggles of ordinary people during this period.",
    "post_time": "Reviewed in the United States on May 8, 2023",
    "pid": "0593420322"
},
{
    "title": "Very philosophical",
    "rating": "4.0 out of 5 stars",
    "content": "Diaz has much to say about capitalism, Marxism, greed, esoteric financial instruments, and what may be good for the country.  The reader can learn a lot about these things in this well recommended novel.",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I over generously gave it 4 stars but only for the creativity of the plot and presentation.  I never developed any interest that would make me look forward to keep reading.  Although I did finish it.",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "0593420322"
},
{
    "title": "Insatiable accumulation of wealth",
    "rating": "5.0 out of 5 stars",
    "content": "As you progress through various characters’ stories, confusion slowly lifts and the connections make sense. They are connected yet separate. Interesting how novel offers explanations for certain world wide events: solutions only the author can share and that make sense historically. Who’s really the financial wizard? The brain pulling all the strings and getting none of the applause.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I had great hopes for this Novel due to its winning a Pulitizer and being on Barack Obama's Favorite Book List of 2022, but I did not enjoy it as much as I had thought I would. I did enjoy many parts of this book. I liked the multiple perspectives and narratives regarding the main protagonists. I especially liked the character development established in third of the four books that compose the novel. The first book, however, is incredibly dull; it did not grab my attention largely because it focused more on telling than showing. The other three books are much better in description but then sometimes it seems the description is excessive. I did enjoy the unraveling of the mystery of the protagonists, but I felt some important questions were not answered about the characters that I believed should have been.",
    "post_time": "Reviewed in the United States on November 22, 2022",
    "pid": "0593420322"
},
{
    "title": "the beauty is in the final revelation.",
    "rating": "3.0 out of 5 stars",
    "content": "smart and epic",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Warning -- there's a bit of a reveal here. This novel, written in 4 parts, requires patience to find out what it's about, and if one sticks with it to the end, the reader realizes that it has been worth it. Written in 4 parts that from the titles of each seemed to be unconnected, when I started, I had no idea just what was going on. Was this single novel in fact going to  be a group of 4 different stories? The first part I found difficult going, the writing style stilted and dated, though the story was interesting in an odd way. And then I moved on to part 2 and began to see that there might be a connection, maybe, but it wasn't clear just what -- but the writing style changed dramatically. Part 3 again is different, now a far more accessible writing style, and this is where we learn the tie between parts 1 and 3. The novel finishes with part 4, which in a way is a sort of epilogue, with a major twist on the truth of parts 1-3. Ultimately, when all the parts are integrated by the reader, this is a powerful book about the worlds of wealth in NY in the early 20th century, but more about personal relationships, ego, and self-deception. Well worth reading.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "0593420322"
},
{
    "title": "such a strange, wonderful book",
    "rating": "5.0 out of 5 stars",
    "content": "During the first two segments of this book, I nearly decided not to continue. By the third segment, when I finally realized what was taking place, the book became riveting. This is an amazing, imaginative piece of work.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "“Most of us prefer to believe we are the active subjects of our victories but only the passive objects of our defeats. We triumph, but it is not really we who fail—we are ruined by forces beyond our control.” (p73)",
    "post_time": "Reviewed in the United States on January 14, 2023",
    "pid": "0593420322"
},
{
    "title": "This book is not about a Roaring Twenties financier",
    "rating": "5.0 out of 5 stars",
    "content": "Don’t make the mistake of thinking this is the story of a powerful Roaring Twenties financier. Yes, he’s a dominating, heavy-handed force in this novel. But he’s not the protagonist. In fact, he’s not really all that important after all. This book is really about…well…no, I won’t say it. If I told you it would spoil the experience.",
    "post_time": "Reviewed in the United States on November 22, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Section I is a straightforward, reasonably interesting novella about an eccentric big shot and his wife. After that comes the autobiography of a bombastic blowhard (actually it’s a working draft of an autobiography, nicely executed by Diaz but badly misunderstood by many Amazon reviewers). The two books within a book have clear, striking but enigmatic similarities. So now the real story begins. What’s behind these two books? How are they related? What truth is lurking at the intersection? It all unfolds slowly, but you’ll enjoy the trip and will be pleased and surprised with the direction you end up heading.",
    "post_time": "Reviewed in the United States on March 15, 2024",
    "pid": "0593420322"
},
{
    "title": "Circles within circles",
    "rating": "3.0 out of 5 stars",
    "content": "Hernan Diaz’s “Trust” is exceptional. He builds a story around a mythical financier whose actions and audacity appear to have created the Great Depression followed quickly by the untimely death of his wife. However the straightforward way I have described the book is not the way the reader experiences it. Diaz plays with perception and the public mind. First we read the story as discussed in a roman a clef that details a fictionalized version of the story (a fiction of a fiction). Thus we begin this story casting the characters in exaggerated versions of themselves. Then we churn through the notes of the financier prepared for his memoirs. The reader then sees a self serving perspective to the events, confirmed by the third perspective provided by the erstwhile ghostwriter of those memoirs as she recounts her observations of the man who never quite measured up to the titan described in the memoirs. Throughout, we are tantalized by the wife, a figure who dominates the narrative over the protests of the husband and author who try to minimize her.",
    "post_time": "Reviewed in the United States on March 19, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Where this novel transcends is the final few pages, as truths come tumbling out and the central tragedy of the novel becomes writ large.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "0593420322"
},
{
    "title": "Engrossing and dense",
    "rating": "5.0 out of 5 stars",
    "content": "Engrossing and dense novel with fascinating ideas about the \"unseen hand\" in major market movements.  Some beautiful passages and excellent character studies that show the complexity of human emotions.  Abstract concepts made it a bit hard to read. It will be more enjoyable on the second reading.",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Andrew Bevel isn't Citizen Kane. This novel has an over-complicated structure and terrible stereotypes, from the somewhere-on-the-spectrum financial genius, to the brilliant woman in the wings, to the dissipated socialites in Europe, to the Swiss psychiatric establishment, and ultimately the Italian anarchist father who hides a heart of gold under his Bakunin posters. There are enjoyable moments in the book, but too many stick figures (poor girl Ida's boyfriend Jack, who enters stage left, walks across, and exits stage right; or the mean butler; or the well-connected woman who doesn't get the job and runs home to tell Dad or somebody). This was a complicated story, but in the spirit of Andrew Bevel, it seems to have been written for the common man (trans. not very smart). I must be getting cranky.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "0593420322"
},
{
    "title": "The Great Crash was Tedious",
    "rating": "5.0 out of 5 stars",
    "content": "The book is written in a different rhythm than the commonly accepted ones you normally read. Enjoyable nonetheless.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Trust is an exceptional story within a story, within a story. Well written and so deserving of the praise. But, you have to push through parts to get to the best parts. The book highlights the challenges of being a woman, an immigrant and a working poor person at a time when the American dream was reserved for European men of renowned families…with a twist at the end. I loved all the financial analysis of the times when the stock market was unregulated and it was truly the Wild West of finance. The financial crisis of 2008 was very similar to the bust of 1929 and the care and research done to explain the similarities is so appreciated at a time when we still struggle with these concepts. Well done.",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "0593420322"
},
{
    "title": "Well written, well researched, but....",
    "rating": "3.0 out of 5 stars",
    "content": "\"Trust\", a fictitious, generational history of a wealthy American clan, is in parts an interesting read. How the novel garnered a Pulitzer, however, I will never fathom. Its narrative is like a musical composition that uses stops, odd bars, crescendos, diminuendos, and other devices to mask a lack of cohesion and purpose in its structure. No matter how much the author plays with time and setting or random story notes, the story lacks emotional depth and full characters that mean something to the reader. In its cold detachment, \"Trust\" resembles \"Succession\" the successful streaming show about another rich, powerful American family business. The book is a more serious artistic and historical effort, but like \"Succession\", takes itself too seriously and loses its way telling the story of how the rich live and rule the world. \"Trust\" is a similar soap opera, but without the sex and profanity required to gather TV viewers. The book was worth reading and finishing, but left me longing for the richer historical fiction of authors like Erik Larsen or a really good non-fiction history tome.",
    "post_time": "Reviewed in the United States on October 18, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Starts slowly, not terribly engaging, but then it turns and twists and the reader is not sure what to trust anymore. Good title.",
    "post_time": "Reviewed in the United States on March 4, 2024",
    "pid": "0593420322"
},
{
    "title": "A book that leaves you thinking",
    "rating": "4.0 out of 5 stars",
    "content": "I thought some more editing towards the end of the narrative would improve it.",
    "post_time": "Reviewed in the United States on February 23, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Overall the story was good, but I don’t think the writing nor the plot development was Pulitzer material. The characters, with the exception of Mildred were underwhelming developmentally. Mildred was the only one that seemed alive and concrete.",
    "post_time": "Reviewed in the United States on January 19, 2024",
    "pid": "0593420322"
},
{
    "title": "Better than Average",
    "rating": "5.0 out of 5 stars",
    "content": "Of course, I was eager to keep reading and find out how the book's four sections—each with a different first-person narrator—all tied together. The book began strong: I enjoyed the first section, with its faux-Henry James or faux-Edith Wharton writing style, which really seemed to work.  But the other sections were nowhere near as engaging. (Was that to underscore, by contrast, the character flaws of some of the other narrators? If it was, I didn't end up caring.)  The overarching message about how women have historically been denied credit for their creative brilliance and accomplishments felt totally heavy handed.  (And I say this as an open-minded woman myself.)  So, the whole drawn-out denouement unfurled in ways that became far less scintillating than expected.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I don’t have much to say about the usual questions like what this book is about or what I liked about it but for what it’s worth, I highly encourage you to see for yourself.",
    "post_time": "Reviewed in the United States on May 26, 2023",
    "pid": "0593420322"
},
{
    "title": "Overrated",
    "rating": "4.0 out of 5 stars",
    "content": "This story is centered at the turn of the 1900s. The entire work is an immersion into a couple who share a life but not their souls. It is not about happiness or loneliness , even though these characters live solitary lives alone but together. The lack of emotions from the characters was engrained for many reasons, including infant and birth mother fatalities, infectious diseases, wars, lack of medical breakthroughs, industrialization, migration, and every social issue. The power was controlled by Caucasian males with social standing, wealth, political favors, and limited access to education for everyone else.",
    "post_time": "Reviewed in the United States on June 10, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I can't say I enjoyed the book, but I can say the author transported me to a time when graciousness was important. I was impressed at how the author was able to keep secrets.",
    "post_time": "Reviewed in the United States on February 24, 2023",
    "pid": "0593420322"
},
{
    "title": "incredible – a triumph",
    "rating": "1.0 out of 5 stars",
    "content": "Well done.",
    "post_time": "Reviewed in the United States on September 24, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This novel is written in 4 parts (voices). Each voice was very different in tone and style, describing many of the same people and events from completely different perspectives and levels of understanding. Reading it takes some focus, and, for me, a little flipping back and forth to try to figure out the different perspectives.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "0593420322"
},
{
    "title": "Thoroughly absorbing and incredibly well written - Diaz deserves the Pulitzer he won.",
    "rating": "5.0 out of 5 stars",
    "content": "Once I started Trust I could not stop reading! It is one of the best written novels I have read in years. If not ever. The book, separated into 4 distinct parts, tells an intriguing story of power, money, and relationships. The characters leap from the page and you live with them as their lives unfold. The story is not a mystery, but it does have twists and turns to keep you on your toes. The portrayal of the principals from 4 different perspectives is unique, something I have never encountered. Many reviewers have addressed the threads of the 4 stories, I want to add my agreement with the their assessment of the plot, etc, but focus more on the writing. Beautiful. Expressive. Descriptive. The smooth flow of words, ideas, and themes is all-encompassing. And I hated it when it ended. A true tour de force. Thank you Herman Diaz for a wonderful, wonderful reading experience.",
    "post_time": "Reviewed in the United States on October 18, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I decided to read this book after hearing an interview with Henan Diaz. He carried himself well and sparked an interest in me based on his description of the three stories in the book. Not a book telling one story but three stories. It was about wealth and high society in America in the early 20th century. It sounded like fun and the title \"Trust\" promised a bit more.",
    "post_time": "Reviewed in the United States on June 15, 2022",
    "pid": "0593420322"
},
{
    "title": "They are rich but troubled and insecure",
    "rating": "4.0 out of 5 stars",
    "content": "This book came through for me. Diaz's writing is beautiful. Not all the time, but there were many times I was rewarded with the kind of writing that had me rereading sections of his book.",
    "post_time": "Reviewed in the United States on August 20, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "In addition to being well-written, I found myself very interested in the characters. How they managed their wealth, society, and relationships.",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "0593420322"
},
{
    "title": "An Intriguing Novel",
    "rating": "4.0 out of 5 stars",
    "content": "The surprise ending surely got me. I was left feeling rewarded that I read this book. It was great storytelling on a subject of interest and a few pages of highlights I'll be resisting for a very long time.",
    "post_time": "Reviewed in the United States on July 2, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After I had read half of the book, I was dismayed by the flat writing style. The author had fooled me because he was intending to write that way. In the second half, his style blossoms and the story becomes one of discovery by the third person \"author\". Brilliant!",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "0593420322"
},
{
    "title": "Did not love",
    "rating": "5.0 out of 5 stars",
    "content": "The messages are contemporary: the vanity of men, the male manipulation of women and the perceived banality of capitalism. The author's message is anti-capitalist for sure and the author fails to adequately explain how the investment markets really function. He must have been an \"Ocuppy Wall Street\" admirer. That said, it is an entertaining read!",
    "post_time": "Reviewed in the United States on February 19, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I will never understand why Barbara Kingsolver's masterpiece Demon Copperhead had to share the 2023 Pulitzer Prize with this book.",
    "post_time": "Reviewed in the United States on October 8, 2023",
    "pid": "0593420322"
},
{
    "title": "Outstanding book that falls apart...physically!",
    "rating": "3.0 out of 5 stars",
    "content": "I was hooked on this book from the start.  However, when I turned a page about a third of the way from the beginning, the page came out in my hand!  This has happened several times since then and I am nearing the last third of the book.  I did not \"break\" the spine so this was unexplained and very disappointing.  There is no sign of glue on the pages; they just float out when I turn the page.  It's past my return date, so I will probably buy another one.  I want to have a copy in my library, even if it's a paperback.  It's outstanding!",
    "post_time": "Reviewed in the United States on November 29, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You probably heard of it",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "0593420322"
},
{
    "title": "A Truly Different Approach",
    "rating": "4.0 out of 5 stars",
    "content": "Diaz is an exceptional writer and Trust is a truly different novel, using a different construction technique that puts Diaz's brilliance on display.  I recommend that you read Trust. It is both a good depiction of the history of the late 19th and the 20th century, and brilliant character development and their individual psychological make-up.  Enjoy Trust, it will be,well worth your time.",
    "post_time": "Reviewed in the United States on October 12, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Brilliant writing!  I loved the multiple perspectives of the main plot given by each of the characters, that ultimately led the reader to an unexpected ending. I love surprise endings!",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "0593420322"
},
{
    "title": "unexpected  ending",
    "rating": "5.0 out of 5 stars",
    "content": "A captivating \"page turner\" with enough complexity to, as Diaz suggests of good literature, \"exist in the vague space between the intellectual and the emotional.\"  I give it five stars.  That said, I do think Diaz \"bends and aligns reality\" to fit the ideal that he hopes to convey vis-a-vis gender politics.  I fully agree that women, especially in decades past, were unfairly subjugated to minor roles, while men took the glory.  But I think, in reality, two things can be true; women were unfairly repressed, AND men like Ford, Carnegie, Vanderbilt, Rockefeller, etc. etc., etc., can be rightfully commended for achieving greatness.  Then again, I'm not certain that one can garner a Pulitzer these days without turning up the volume (to distorted levels) on racism, bigotry, misogyny, etc.; though I think society is beginning to grow weary of the level to which these themes have been a bit exaggerated --and wise to the not-so-subtle misandry that's often pedaled as justice.",
    "post_time": "Reviewed in the United States on July 10, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This story unravels in the most unusual way and yet, like a car crash, you can’t take your eyes off the spectacle.  The use of words so tightly knit with the character’s personalities that it is spellbinding.  This story earned the Pulitzer in the most appropriate way possible.  It was a great read.",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "0593420322"
},
{
    "title": "Per Diaz, this novel \"exists in [that] vague space between the intellectual and the emotional.\"",
    "rating": "4.0 out of 5 stars",
    "content": "Started slowly because I had problems with the language of the era. Once I realized the secret of the story, I was hooked. I am so happy that I did not give up on the book.",
    "post_time": "Reviewed in the United States on November 16, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a brilliantly plotted book, although it takes some time (more than halfway through) to realize just how brilliant. Indeed, the title is the first among many things that completely misleads the reader into thinking that s/he's reading about finance, when in reality it's about... (no spoilers here). The true theme of the book is about one of the most important issues in contemporary America, even though the novel takes place from mid-19th century to around the mid-20th. In short, this is one of the few books of fiction that I have read that has me thinking more about it AFTER I finished reading it than while reading it -- layer upon layer. By the way, the writing itself is of a high standard, so even if you feel \"bamboozled\" by the plot, you'll enjoy the reading experience itself.",
    "post_time": "Reviewed in the United States on October 4, 2023",
    "pid": "0593420322"
},
{
    "title": "Literary gem",
    "rating": "4.0 out of 5 stars",
    "content": "Interesting read but missing seemingly important pages (see pic).",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Enjoyed reading Trust and discussing with a friend as he read along with me. Great issues for discussion.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "0593420322"
},
{
    "title": "Surprisingly enjoyable",
    "rating": "2.0 out of 5 stars",
    "content": "I found the book to be convoluted and confusing. I couldn’t figure out why the book “ended” and then started over. I skipped ahead, skimming as I went and found that the same story was told 4 times. Too repetitious for me.",
    "post_time": "Reviewed in the United States on November 2, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After finishing, I found the following description from another reviewer which better explained the structure. and so, if you are going to read this book, read the description below.",
    "post_time": "Reviewed in the United States on March 13, 2023",
    "pid": "0593420322"
},
{
    "title": "Pretentious to cover for lack of character development.",
    "rating": "2.0 out of 5 stars",
    "content": "I don’t understand how this book won the Pulitzer - I can only assume that using one’s full vocabulary is enough to win over the judges and gives the five star reviewers a sense of intelligence.",
    "post_time": "Reviewed in the United States on March 31, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The books unique hook, in that it’s one story told in four different ways, is also its downfall because there just isn’t enough room for meaningful character and plot development. I found the last section particularly painful to read as it was just so contrived in order to “fill in the blanks”. Here we are supposed to be reading the diary of a dying woman, too ill to write more than a few poorly constructed sentences yet, she managed to tell a very lucid and long winded story of how she was the brains behind the whole operation all along. This part is peppered with some incredibly pretentious musical, philosophical and historical references that make this whole section read as forced and unnatural. Honestly, I’d give it a miss.",
    "post_time": "Reviewed in the United States on August 27, 2023",
    "pid": "0593420322"
},
{
    "title": "Good story but need look up many word definitions",
    "rating": "5.0 out of 5 stars",
    "content": "This engaging story unfolds predominantly in the early 1900s against the backdrop of the tumultuous fluctuations of Wall Street. The narrative is skillfully crafted, although it did require me to explore various words and their meanings. Additionally, a basic understanding of the financial world and its terminology proved beneficial in enhancing my appreciation of the book.",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Once you understand you are reading a Novel, and then an autobiography of the main character the novel is based on and then a post script written by the person who helped the person \"make-up\" his autobiography, and then a journal written by the main characters wife on her deathbed you are in good shape. In the mean time enjoy the ride. This is truly a wonderful novel about greed, how we view history and most importantly how we think about traditional roles in marriage and business.",
    "post_time": "Reviewed in the United States on September 6, 2022",
    "pid": "0593420322"
},
{
    "title": "Smart, surprising, and very well written",
    "rating": "4.0 out of 5 stars",
    "content": "My local Washington Post gave it a terrific review.  And I liked the sound of the story-line; about a financial titan, and his wife, from the 20s and 30s.  I'm just not gonna give too much away here by saying more.  But it's thoughtful and well-executed.  His little twist is fun, though it HAS been done before in print and in film.  Still, I read it and really liked it, and gave it to my girlfriend and she read it and really liked it.  It's now in the hands of her cousin.  While it certainly aspires to be regarded as literature, and the author was a finalist for the Pulitzer in 2017, that doesn't mean it is a plodding read.  It's a page-turner.  Reads easily and you WANT to turn the pages.",
    "post_time": "Reviewed in the United States on April 29, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This is a fictional narrative first, but learned a lot about booms and busts of the Stock Exchange over its long history.  Format tells the story from different perspectives and draws the reader into the mystery and intrigue of the truth. The last section is of 4 parts is truly gripping and a twist is revealed.  Writing is beautifully written and number of good metaphors convey real emotion. Book will bring you into the world of wealth and happiness and a little madness. How metal heath was treated in the 1920s brought to the surface as well as questioning on happy marriage of soulmates. Don’t want to reveal too much more.",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "0593420322"
},
{
    "title": "Great Read",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed the generations of family's and why it was written. A good story but I am also",
    "post_time": "Reviewed in the United States on November 6, 2023",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "a slow reader.",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "0593420322"
},
{
    "title": "Do You Understand the Machinations of the Exchange’s Booms and Busts?",
    "rating": "2.0 out of 5 stars",
    "content": "Reads with the same sort of tone and feel of \"East of Eden\" and similarly charts the rise and fall of families over a long span of time.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "0593420322"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book itself arrived on time, in great condition.  No complaints.",
    "post_time": "Reviewed in the United States on January 10, 2024",
    "pid": "0593420322"
}
]