[
{
    "name": "  Eleanor Oliphant Is Completely Fine: Reese's Book Club (A Novel) ",
    "stars": [
        "64%",
        "27%",
        "7%",
        "1%",
        "1%"
    ],
    "pid": "0735220697",
    "ratings": "236,617 ratings",
    "other_info": {},
    "discount_price": "$ 9.63",
    "normal_price": "$18.00",
    "about_this_item": []
},
{
    "title": "So good!",
    "rating": "5.0 out of 5 stars",
    "content": "What an amazing story of bravery, strength!  I loved quirky Eleanor (and Raymond) too.  Beautifully written tale about trauma and the courage to find one’s self!!",
    "post_time": "Reviewed in the United States on October 15, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "At first I wasn’t really fond of Eleanor Oliphant but I now find her pragmatic and I find that through everything she was going through mentally and emotionally she still kept her job and I loved the relationship that formed between elanor and Raymond and how she had a deference to touching before her breakthrough then she was more relaxed in her own skin, also I loved the ending! Thank you Gail honeyman for a delightful story.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "0735220697"
},
{
    "title": "wow, the twist! totally surprised by the twist! no spoilers,",
    "rating": "5.0 out of 5 stars",
    "content": "Initially, Eleanor’s odd and extremely judgmental personality irritated me. As I read on , each painful encounter she had with her mother endeared her to me. Her mothers harsh and brutal words cut deep into my heart and opened a space for Eleanor. I learned to love her dearly.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As a court ordered Child Advocate, I would highly recommend this book to understand the depth of trauma and its impact.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "0735220697"
},
{
    "title": "Oddly Exquisite Eleanor",
    "rating": "5.0 out of 5 stars",
    "content": "I chose this book for my Book Club. I would venture to say that they would all classify it as a 5 Star read:",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I never read the back of the book, I like going in not knowing the plot. This book was not anything that I was used to reading but I truly enjoyed it! It had great humor, I laughed out loud throughout. It was sad but overall had an amazing and wonderful ending. Highly recommend!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "0735220697"
},
{
    "title": "Not what I expected…",
    "rating": "5.0 out of 5 stars",
    "content": "A very fast read, filled with lots of fodder for “word of the day“ enthusiasts! A tale of surviving the worst. Warm and encouraging. I absolutely loved it and I am sure it will stick with me for quite some time.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Me encantó la profundidad que le dieron al personaje, sus experiencias, su pasado y todo lo que pasaba a su alrededor. A pesar de ser una persona con mucha amargura y prejuicios, sentí mucha empatía por el Eleonor, porque era una persona razonable, y quería cambiar pero no sabía cómo, pues hay cosas que no se pueden aprender en la soledad.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "0735220697"
},
{
    "title": "Curative, stirring, diverting",
    "rating": "4.0 out of 5 stars",
    "content": "Kept me interested,  I enjoyed the characters and the story.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Eleamor is the resilient person we all want to be or know. I loved the perspective that challenged societal norms.  How silly these conventions actually are among adversity.  The writing has a charming flow.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "0735220697"
},
{
    "title": "Well written story about a woman in a modern world",
    "rating": "4.0 out of 5 stars",
    "content": "Written in the first person, the novel delves into the life of a survivor. I found Eleanor to be a quirky, socially awkward woman with a mysterious past that slowly unravels throughout the story. I got to know her before understanding the childhood that shaped her.",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The storyline gave me a sense of mystery, as small details of Eleanor’s life were revealed deliberately, each one prompting more questions. The themes of loneliness, the desire for change, and self-care are intricately woven into the narrative. I found Eleanor’s attempts to physically transform herself—waxing, nail care, and hair—reflect a deeper journey towards self-acceptance and care.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "0735220697"
},
{
    "title": "Good Read",
    "rating": "5.0 out of 5 stars",
    "content": "Honeyman's portrayal of Eleanor’s alarming stalker behavior, self-aware alcohol dependency, and functional alcoholism added depth to her character, highlighting her coping mechanisms. The novel also explores themes of singlehood, therapy, and the importance of a support system. I was touched by Eleanor’s unintentional humor and unexpected friendship, which brought light to her world and reaffirmed that even in the midst of personal struggles, connection and laughter are possible.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A powerful quote from the book resonated deeply with me: “The past is a living thing.” Eleanor’s journey towards understanding her past and embracing her present is both heartbreaking and heartwarming. This novel is a testament to the resilience of the human spirit and the transformative power of friendship.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "0735220697"
},
{
    "title": "a great read!!",
    "rating": "5.0 out of 5 stars",
    "content": "I loved how the author closed the story.  Took a bit of time to get there.  But that was actually the point of the main character. Took her a while to get there.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Uncharacteristically written, unfolds so brilliantly and the ending is like a warm hug on a bright sunny fall day. Just a delicious read!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "0735220697"
},
{
    "title": "good read",
    "rating": "5.0 out of 5 stars",
    "content": "love this book,  makes you cry and laugh.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was a wonderful book. Eleanor was a darling. Glad I read this! Not exactly literary- but full of heart and well-written.",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "0735220697"
},
{
    "title": "Sweet story; lovable heroine",
    "rating": "5.0 out of 5 stars",
    "content": "Eleanor was so different, not some cookie cutter character. Although it was sad in many ways, there was relief and I think Gail Honeyman did a great job with her characters.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "If you feel lost, alone or different from others read this book. Everyone has a past and a story to tell but Eleanor Oliphant is proof that it doesn’t define you. Heart warming, funny and identifiable, this book will bring out the best in you.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "0735220697"
},
{
    "title": "Good read",
    "rating": "5.0 out of 5 stars",
    "content": "Good story line and easy to follow the story",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Eleanor Oliphant is Completely Fine is a book for that caused me to lose all awareness of space and time. This was a book that took up my entire Saturday, of which I was \"completely fine\" with (couldn't help myself).",
    "post_time": "Reviewed in the United States on March 10, 2018",
    "pid": "0735220697"
},
{
    "title": "Eleanor Oliphant is Completely Fine is a book for that caused me to lose ...",
    "rating": "5.0 out of 5 stars",
    "content": "Eleanor Oliphant is a finance clerk for a graphic design firm in Glasgow, Scotland. Socially inept, honest, and quirky, Eleanor embarks on a journey of self-realization, (unintentionally at first) due to a series of events with Raymond Gibbons, an IT guy at her firm, who helps Eleanor break out of her protective shell as she visits the depths & secrets of her past with Mummy. She also tackles \"love at first sight\" with a pompous rock star on the rise and learns a great deal in the process.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "For a book to be both unwittingly hilarious and downright heart-wrenching is not an easy task for an author. I found myself laughing out loud...howling, really. It was a good thing I was home alone during this read. Between giggling unabashedly and tearing up within moments of each other, I could not keep track whether my tears being caused by the humorous thought processes going on inside Eleanor or her dark past, which the author so smartly reveals.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "0735220697"
},
{
    "title": "Great book",
    "rating": "4.0 out of 5 stars",
    "content": "One of the things I noticed straightaway from Gail Honeyman, which I appreciated throughout the book, was how slowly the story of Eleanor's past unfolded. It was like a very delicate wound was slowly and cautiously being unwrapped so that the reader could sincerely appreciate it for what it was as well as its origin. By weaving the story together the way she did, Honeyman helped me clearly comprehend the severe events leading up to Eleanor's inner & physical wounding.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Her relationship development with Raymond is like a well choreographed dance. While at first, Eleanor was a reluctant partner, she slowly settled into her partner as trust & affection developed over time.  One such event beginning this progression of change was the rescue of Sammy, the unconscious old man in the street, by Eleanor and Raymond",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "0735220697"
},
{
    "title": "Good story",
    "rating": "5.0 out of 5 stars",
    "content": "And let's not forget Mummy...I harbored a deep hatred for Mummy pretty quickly, yet I couldn't resist wanting to know what was going to come out of her mouth next. She was so ferociously appalling! To try to understand how and why a person could become this toxic was bewildering for me (obviously, mental instability and illness played a large part as well) I found myself so wanting to speak to Mummy on behalf of Eleanor when she was given the opportunity time and time again to defend herself, yet she weakly took the verbal punches instead.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Honeyman used character foils quite well and with subtlety within her character development. These foils added great dimension to the plot and also balanced the scale of Eleanor's interaction with her world.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "0735220697"
},
{
    "title": "Great story of overcoming issues",
    "rating": "5.0 out of 5 stars",
    "content": "-The self-obsessed rock star as a foil to Raymond",
    "post_time": "Reviewed in the United States on June 7, 2018",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "-Raymond's mother as a foil to Mummy",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "0735220697"
},
{
    "title": "Good read/A little disappointed",
    "rating": "4.0 out of 5 stars",
    "content": "An extremely well crafted",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "novel with a wonderfully relatable protagonist. Eleanor's wry outsider observations about the machinations of modern society are poignant and hilarious. The ending was a little disappointing as it was too abrupt. A good read nonetheless.",
    "post_time": "Reviewed in the United States on August 1, 2017",
    "pid": "0735220697"
},
{
    "title": "Wonderful Summer Read! Great for Book Clubs!",
    "rating": "4.0 out of 5 stars",
    "content": "Eleanor Oliphant is completely fine",
    "post_time": "Reviewed in the United States on June 7, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "  By Gail Honeyman",
    "post_time": "Reviewed in the United States on December 4, 2017",
    "pid": "0735220697"
},
{
    "title": "Its content is very repetitive.",
    "rating": "5.0 out of 5 stars",
    "content": "Reviewed by Jay Gilbertson",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": " Fine. Think of that word for a moment. Fine. We blurt it out when asked how we are or how the kids are or how the soup is. But in this particular novel, Eleanor Oliphant is anything but. What she is will surprise you, maybe even scare you a bit, certainly she’ll teach you a few things and I just know, in the end, you will come to love her. I did.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "0735220697"
},
{
    "title": "5 STARS!!!!!!!",
    "rating": "4.0 out of 5 stars",
    "content": " Told entirely in first person, we see the world through Eleanor’s eyes. I should note that this is not an exciting, adventure-filled tale full of lofty thoughts and delightful characters that race through life and blast off into the sunset. Hardly. It’s a revelation of what it’s like to live on the very edge of life. To exist as almost a shadow-person. Eleanor is someone we all have known and seen and passed by. And, she deserves a closer look.",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": " This is author Honeyman’s debut novel, I had to check to make sure, the writing is that of a well-seasoned blockbuster. The way she skillfully weaves Eleanor’s tattered and dark and mysterious life into something vital is at the core of why this tale matters. We learn early on that Eleanor has a very scared face, that she lives alone, works as an accounts receivable clerk in an office and routine and order rule. Each Wednesday, like clockwork, she speaks on the phone to her mummy. Keep in mind, Eleanor is nearly thirty.",
    "post_time": "Reviewed in the United States on April 16, 2024",
    "pid": "0735220697"
},
{
    "title": "Eleanor Oliphant is completely fine —- a novel",
    "rating": "4.0 out of 5 stars",
    "content": " “It’s only been a week, I know, but it feels like an age since we last spoke, Mummy. I’ve been so busy with work and—She cut across me, nice as pie on this occasion, switching her accent to match mine. That voice; I remembered it from childhood, heard it still in my nightmares.”",
    "post_time": "Reviewed in the United States on August 4, 2018",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": " Socially, this woman is a totally inept. Not only does she lack a clue as to how humans interact socially, she has pretty much simply given in to the fact that she will most likely always live alone. And then a musician catches her eye while all the time Raymond, the IT guy at her work-place, hovers on into her strange life. She justifies her very existence with simple facts as only she can see them.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "0735220697"
},
{
    "title": "A Book Club Review of Eleanor Oliphant",
    "rating": "5.0 out of 5 stars",
    "content": "This is a book club review, with very little summary of the book itself. Our book club read this book as our February book club. Our book club rates books on readability, likability, quality, and of course, discussion merit. Eleanor Oliphant ended up being in our top favorite book club reads of all time, hence the five star rating.",
    "post_time": "Reviewed in the United States on March 9, 2018",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Eleanor Oliphant is a dark comedy about a woman's  journey into finding her path, to opening up, and to facing her emotions/head/past. It's difficult to give a summary of this book that does not include spoilers, which I believe could take away from the beauty of this book. However, due to the dark nature of this book, there may be triggers here for some readers (please see very bottom note with spoiler triggers).",
    "post_time": "Reviewed in the United States on April 26, 2024",
    "pid": "0735220697"
},
{
    "title": "Eleanor!",
    "rating": "5.0 out of 5 stars",
    "content": "As a book club read, this book rated very high, an 8 of out 10, because of the amount of discussion that came from it. We were truly invested in this discussion - members shed tears, laughed, hugged... it was a wonderful book to discuss. We talked for hours and hours, and eventually ran out of time. We rarely have so much discussion with books that is so deep and meaningful. And everyone agreed that the book was likable despite the dark subject matter. The book is so incredibly funny and sweet, that it makes the hard topics just a bit easier. As far as quality, the book is far from flawless. Individual ratings were the book in general were about a 6, so a bit lower. (I, personally, would have rated it more of a 2 to 3 - I'm not sure I would have finished it without the commitment to the book club.) But as far as a book club selection, the book was a great deal of fun and very worthy of a group discussion.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The book takes place in Scotland, which made for a fun and lively theme, and a Scottish potluck. This book, surprisingly, has a LOT of food mentions, so there was plenty of recipes to select from. Everyone enjoyed eating the foods that Eleanor and the other characters mention in the book.",
    "post_time": "Reviewed in the United States on December 2, 2020",
    "pid": "0735220697"
},
{
    "title": "Uplifting",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, this book is recommended for book clubs!",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "***SPOILER TRIGGER WARNINGS*** I so often get asked for triggers, I just share these for book club reviews now. After all, what may be fine for the individual reader is not always great in a book club/group discussion. But, of course, triggers are also spoilers, so please do not read on if you do not want that. I will also add the disclaimer that none of these triggers were an issue for our book club, and no one had any problems with the subject matter. We include these strictly as a warning for other book clubs. Topics included: Childhood abuse and trauma, murder, death, suicide topics, alcoholism, and mental health issues.",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "0735220697"
},
{
    "title": "Quirky character!",
    "rating": "4.0 out of 5 stars",
    "content": "The story that got me in the groove to start reading again 😊 I absolutely loved it. It's a fantastic story with a not soon to be forgotten voice",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great read!",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "0735220697"
},
{
    "title": "Great book!",
    "rating": "5.0 out of 5 stars",
    "content": "Eleanor Oliphant is nothing further from being fine!",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I finally got a chance to read Eleanor Oliphant. I was worried about all the hype surrounding this novel and I kinda dreaded starting it because I didn't know if I was going to like it.",
    "post_time": "Reviewed in the United States on April 10, 2018",
    "pid": "0735220697"
},
{
    "title": "I made space for this on my very tight bookshelf",
    "rating": "5.0 out of 5 stars",
    "content": "This falls in the category of books about people on the spectrum, but this character has a back story that makes it fresh.  A difficult life story is mixed with humor and charm.  Well worth it.",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered this book so I could have time to read it before our book club meeting; it was delivered very quickly and I finished it in no time. Great read!",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "0735220697"
},
{
    "title": "Great book!",
    "rating": "5.0 out of 5 stars",
    "content": "Gals Family book club choice.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Well written for such a dark childhood themed story.  Loved the first person dialogue and quirky character.  Very sweet late, but  true coming of age story.  Can’t wait for the movie!",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "0735220697"
},
{
    "title": "Movie worthy!",
    "rating": "4.0 out of 5 stars",
    "content": "Well-written, engaging, poignant .....gives you insight to the effects of emotional and verbal abuses  that a young child suffers through to her adult life. Eleanor is a smart, incredibly naive woman who survives her trauma by using her imagination and neediness to complete her fantasy into a non-existent romance....unaware of a love and friendship that is right in front of her. She eventually opens  up and \"sees\" her potential as a woman and a human being with the help of friends and counseling. Wonderful book!",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a hard read but enjoyable. I don't know if I'd really recommend it as it is a very triggering read.",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "0735220697"
},
{
    "title": "Loved it!",
    "rating": "5.0 out of 5 stars",
    "content": "This is the most well written book I've ever read. The author's use of words was never forced, sentences following so naturally. Eleanor's own, special vocabulary seemed so natural for the character that I never questioned it. I had to look up A LOT of word definitions, though! Most of all, the author gave an excellent picture of what extent the human mind will go to protect us from such harmful memories. Kudos to Honeyman.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this book so much that I sent copies to my friends!",
    "post_time": "Reviewed in the United States on January 24, 2024",
    "pid": "0735220697"
},
{
    "title": "Wow",
    "rating": "5.0 out of 5 stars",
    "content": "Oh, I am so sorry to say goodbye to Eleanor. She stole my heart. I was rooting for her to become \"completely fine\" or even better, and she did not disappoint.  At first I was afraid this was going to be a predictable chick lit/romance.  But no, a much deeper, complicated story, and Eleanor is one of the most courageous, complicated, and lovable heroines I've come to know since Kya from Where the Crawdads Sing.  When I think of Eleanor, the phrase \"odd duck\" comes to mind, which is not a bad thing.  I am just so glad she came to embrace that part of herself, and all her other lovable, quirky traits.  This story made me laugh out loud and shed tears too.  That is a rare, but wonderful thing.",
    "post_time": "Reviewed in the United States on July 22, 2020",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One would think reading a book about depression, loneliness and abuse would certainly bring you down. Gail Honeyman’s novel, Eleanor Oliphant is Completely Fine is proof such a book can be funny, inspiring and heartwarming.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "0735220697"
},
{
    "title": "Charming character",
    "rating": "5.0 out of 5 stars",
    "content": "Eleanor Oliphant is quite eccentric, she struggles in social situations and openly speaks her mind.  When she and her co-worker Raymond help a stranger on the street one day, her carefully constructed predictable life begins to change course in the most unpredictable positive way.",
    "post_time": "Reviewed in the United States on February 19, 2023",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book, wow...  Where do I begin? First of all, I think Eleanor deserves a medal for being so put together and solid on the outside while her mental state is in such trouble.  And then she deserves another award for stepping way out of her comfort zone and giving the world a second chance.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "0735220697"
},
{
    "title": "Great book!",
    "rating": "5.0 out of 5 stars",
    "content": "After learning what Eleanor lived through, I can't imagine someone being fine. Yet she's proving it to everyone day after day that she is doing her very best.  Raymond is such a gift sent to her in a form of the most unlikely, but perfect friend. He never judges Eleanor like everyone else does and he is the ideal companion for her to slowly open the door to new things and opportunities. And it's no surprise that Raymond ends up being Eleanor's guardian angel.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is everything: sad, funny, heartbreaking, heartwarming.  It really teaches you not to judge, but to accept and to care.  I think everyone should read it.  Eleanor is the character that will stay with you long after you finish the book.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "0735220697"
},
{
    "title": "Loved it!",
    "rating": "5.0 out of 5 stars",
    "content": "The first 60 or so pages was wavy, like it had gotten wet and dried but it was readable. Otherwise okay.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you know anyone on the spectrum, or anyone dealing with childhood trauma. this is a good way to glance into the mindset. I really enjoyed her vocabulary and humor too.",
    "post_time": "Reviewed in the United States on October 24, 2022",
    "pid": "0735220697"
},
{
    "title": "A great binge read",
    "rating": "5.0 out of 5 stars",
    "content": "This story has you rethink your subconscious vain and materialistic ways. Read it straight through to the end. Kept me curious.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Honestly, the best part of reading a book is the personal digestion of the sum of its parts. Yet here I am. Writing. I can confidentiality say, this book is going on my top 10 favorite books.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "0735220697"
},
{
    "title": "I never write book reviews...",
    "rating": "5.0 out of 5 stars",
    "content": "Eleanor Oliphant is a rare and vulnerable character. It was a joy to partake in her journey.",
    "post_time": "Reviewed in the United States on May 19, 2019",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a wonderful novel, as we get to watch the \"evolution\" of Eleanor into a \"normal\" person.",
    "post_time": "Reviewed in the United States on October 3, 2023",
    "pid": "0735220697"
},
{
    "title": "Eleanor Stole My Heart",
    "rating": "5.0 out of 5 stars",
    "content": "My favorite books always feature beautifully flawed, quirky characters, and Eleanor Oliphant is one of the best of those characters to whom I have been introduced for quite some time. Gail Honeyman has crafted a delightfully eccentric character whose tragic past left her scarred, both literally and figuratively, and the story of her journey to understanding and accepting that past and the ways that it has shaped her identity is told in a beautifully insightful way that covers a great expanse of emotions.",
    "post_time": "Reviewed in the United States on July 14, 2017",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Eleanor Oliphant is very unique. She lives alone, sticks to very strict routines, and has a frankness that is very often off-putting to those around her. She speaks to her mother on the phone once a week, and the reader is led to understand that her mother is in jail for reasons somehow connected to a fire in Eleanor's childhood and her resulting placement with social services, but the details of Eleanor's childhood do not become clear until the end of the book. Eleanor develops a bit of an obsessive crush on a local musician, drinks entirely too much vodka, and makes her first real friend in a recently hired coworker, Raymond.",
    "post_time": "Reviewed in the United States on March 9, 2020",
    "pid": "0735220697"
},
{
    "title": "I loved it",
    "rating": "5.0 out of 5 stars",
    "content": "Throughout it all, readers are provided with a first person point-of-view that is different from any other narrator I have ever read. Eleanor views the world in fairly black and white terms. When she treats herself to a manicure for the first time, she very honestly tells the reader (and the manicurist, actually) that she could have done a better job herself for free. She does not understand many pop culture references, and I found her reaction to a Spongebob Squarepants helium balloon quite delightful. Her difficulty understanding human emotions and the emotional needs of others was intriguing, and her interactions with others were sometimes cringe-worthy and many times humorous.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Above all else, I found Honeyman's writing style to be very descriptive in a way that enabled me to envision the characters and events in the book in my head, but also to understand exactly how they felt. As someone very familiar with clinical depression on a personal level, I found Honeyman's description of Eleanor's thoughts and feelings spot-on. Eleanor is one of those characters who has tried to make loving her very difficult, but I knew from the first chapter that her efforts would make me love her even more dearly.",
    "post_time": "Reviewed in the United States on July 9, 2019",
    "pid": "0735220697"
},
{
    "title": "dark but wonderful",
    "rating": "5.0 out of 5 stars",
    "content": "I was right.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Eleanor Oliphant stole my heart.",
    "post_time": "Reviewed in the United States on December 6, 2021",
    "pid": "0735220697"
},
{
    "title": "This book is much more than fine!",
    "rating": "5.0 out of 5 stars",
    "content": "I read Eleanor Oliphant  in one day and  I loved it.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The author, Gail Honeyman said, “It's a story of the -  transformational power - of  small  acts  of  kindness.”",
    "post_time": "Reviewed in the United States on February 11, 2021",
    "pid": "0735220697"
},
{
    "title": "A must read",
    "rating": "5.0 out of 5 stars",
    "content": "Gail wrote Eleanor’s life, as a person:",
    "post_time": "Reviewed in the United States on May 13, 2019",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "\"that has been knocked off kilter by an unnamed childhood horror which she can only recall from her sense of , “before” and “after”,  and",
    "post_time": "Reviewed in the United States on August 8, 2018",
    "pid": "0735220697"
},
{
    "title": "A fun read…in a weird way",
    "rating": "5.0 out of 5 stars",
    "content": "I almost put this book aside after the first bit. It felt pretentious and silly. So wordy, with lots of big ‘fancy’ words, that are not normal to most conversation. But then it started clicking in place, and the abundance of big fancy words made sense. As a childhood  trauma survivor, I identified a bit with Eleanor. As the story builds to the point where  I began to understand her trauma, I felt a small connection, and even recognized some of my own triggers and quirks. Very well written, and easy to read-I finished it in just a few days. I wanted to know the details so badly, I kept coming back for more. There’s a little twist at the end that I most definitely did not expect!",
    "post_time": "Reviewed in the United States on December 2, 2023",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Enjoyable enough but Eleanor is not as funny as the author is trying to make her seem... I could surmise that the author thought Eleanor's random statements were funny... but really, she was annoying.  That is the author's fault not Eleanor.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "0735220697"
},
{
    "title": "Good not great",
    "rating": "5.0 out of 5 stars",
    "content": "A solid 7 on a 1-10 scale.",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this book because I know someone who thinks just like her about many of her thoughts and beliefs. She is very practical. I will re read this book. It was that good to me.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "0735220697"
},
{
    "title": "This book was everything",
    "rating": "5.0 out of 5 stars",
    "content": "II had no idea what this book was about.The author did a beautiful job of developing a horrific story. The character, Eleanor, was such a likeable person",
    "post_time": "Reviewed in the United States on February 8, 2021",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Eleanor Oliphant is a 30-year-old loner. She has no social skills, no friends, no filter. Her days are all the same.  She goes to work Monday through Friday (is ignored by her co-workers), and from Friday afternoon to Monday morning, stays in her apartment drinking vodka and eating frozen pizza. Other than the grocery/liquor store clerks, she has no interaction with anybody.  That is, except for weekly phone calls with Mummy. But the reader will notice that something is off about their conversations…",
    "post_time": "Reviewed in the United States on May 21, 2023",
    "pid": "0735220697"
},
{
    "title": "A Lovely Surprise",
    "rating": "4.0 out of 5 stars",
    "content": "Eleanor’s world is very small. But she’s completely fine. She doesn’t know or expect anything different. Then one day her computer at work gets a bug, and she has to call the IT department. A new guy named Raymond comes to look at it. Little does Eleanor know, her world is going to change.",
    "post_time": "Reviewed in the United States on September 29, 2019",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "“Eleanor Oliphant was a book of the month selection for a reading discussion group I belong to on Goodreads. If not for that, I likely never would have picked up this book.  Generally, I avoid books with titles like this, and book covers like this one. So even with the 4.6 (out of 5) rating on Amazon, my expectations weren’t high.  And, as expected, I found Eleanor to be totally obnoxious and rude in the beginning chapters. But her quirkiness began to grow on me.  Slowly I saw there had to be reasons why Eleanor was the way she was, and I began to root for her.  I went from thinking this was a silly “fluff” book to discovering it’s a wonderfully written story about abuse, loneliness, healing, and connecting.",
    "post_time": "Reviewed in the United States on March 22, 2024",
    "pid": "0735220697"
},
{
    "title": "Don't judge a book by its cover!",
    "rating": "3.0 out of 5 stars",
    "content": "I love this book. Much to my surprise, I’m giving it five stars.",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "0735220697"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Eleanor Oliphant struggles with appropriate social skills. Her life is routine orientated and just plain lonely.  She is blunt and judgmental—not due to a specifically diagnosed disability but more due to the outcome of a horrendous but forgotten childhood.  Her life begins to spiral and with the help of a new ‘friend’ from work, she begins to recall moments of her childhood.  The highlight of the novel was seeing Eleanor blossom and come to the realization of her pain.  Strange as it seems, I appreciate how slowly the story of Eleanor’s past unfolded interjecting details in bits.  I will remember this story in its entirety and Eleanor in particular. This was a powerful, uplifting and often humorous book.",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "0735220697"
}
]