[
{
    "name": "  The Spy and the Traitor: The Greatest Espionage Story of the Cold War ",
    "stars": [
        "77%",
        "18%",
        "3%",
        "1%",
        "1%"
    ],
    "pid": "1101904216",
    "ratings": "32,680 ratings",
    "other_info": {},
    "discount_price": "$ 9.80",
    "normal_price": "$20.00",
    "about_this_item": []
},
{
    "title": "Incredible True Story",
    "rating": "5.0 out of 5 stars",
    "content": "I wish this could be made into a movie.  It is SO incredible.  I couldn't put it down.  All true and gripping, nearly every moment.  Photos are great, also.  What it takes to be a spy!  If nothing else, a fabulous memory!  You won't believe some of the convoluted directions this spy had to remember!  And the get-away is breathless!",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "John Le Carre says this is the best true story spy book he's ever read, and he's right.  It's so well written.  Even the protagonist, who only read it once it was published, said it was \"flawless.\"  I read it on a cruise and it was the perfect book to keep my attention for a couple of days.  One mark of a good book is that it doesn't leave any unanswered questions.  You're not left wondering, \"I wonder why he did that?\" or \"Why didn't he realize that?\" Or \"Why didn't he follow through?\"  Every question you have is answered and I appreciate that in a book.  It takes a lot of care to read through your own writing and anticipate what needs to be clarified or expounded on.  I really, really enjoyed reading this and learned a lot about Russia, the KGB, how disillusionment motivates you, courage, MI-6, the British, the Danes, spycraft, etc. etc.  It was very interesting.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "1101904216"
},
{
    "title": "Long after I finished it, I was thinking about this book",
    "rating": "4.0 out of 5 stars",
    "content": "The history of Oleg and what he and his family went through was well written.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Spy and The Traitor is touted in its subhead as \"the greatest espionage story ever told.\" That isn't just publisher hype.  The real events and the story of Oleg Gordievsky, KGB officer and diplomat reads like something from a John LeCarre or Robert Ludlum story...except it's true and marvelously documented.  Raised by a father and older brother who both served devotedly and unquestioningly in the KGB (dad worked through Stalin's purges and survived in the KGB's precursor agency). Loyalty to the service then would seem to be a given--betraying the agency and its million members (you read that right) would be like sabotaging the family's business.  Yet events and history continue to flummox human expectations.",
    "post_time": "Reviewed in the United States on October 14, 2018",
    "pid": "1101904216"
},
{
    "title": "An enjoyable read",
    "rating": "5.0 out of 5 stars",
    "content": "First the invasion of Hungary, then the erection of the Berlin Wall (which Gordievsky was present to see) and finally the brutal crushing of the Prague Spring in Czechoslovakia all drove this KGB officer further and further away from the party.  Exposure to the West in Copenhagen  and later in London provided a first hand taste of liberty and freedom. It served as the final push into the eager and eternally grateful arms of his M16 handlers. The double agent provided them with not merely a trove of concrete information but invaluable insight into the workings of the KGB and planning of the Soviet Leadership.  It is no exaggeration to say Gordievsky was our Kim Philby.  The details of these meetings, contacts, \"drops\", etc.  and how spies operated from the end WWII until the dissolution of the Soviet empire is fascinating and novelistic in the telling.  Gordievsky's escape or \"exfiltration\" from the USSR by M16 is nothing short of breathtaking--a Bourne Identity moment.",
    "post_time": "Reviewed in the United States on March 5, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Best of all though is the historical and moral context that gives readers a perspective of events' meanings.  Ben McIntyre is a masterful storyteller and detailed chronicler. He thoroughly but concisely points out the import and value of Grodievsky's insights--particularly warning the Brits and thereby the Americans that the Soviet leader Yuri Andropov genuinely believed the West was intent upon a first nuclear strike.  Appreciating that paranoia can be as perilous as animus, first Thatcher and then Reagan worked to assuage Soviet fears.  It was Gordievsky who prepped both sides for successful summits in the 80s and it was he who counseled wisely to neither disband nor include the USSR in the SDI or Star Wars initiative.  Rather, ratchet up the pressure and they would go bankrupt trying to keep up, which is precisely what happened.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "1101904216"
},
{
    "title": "Splendid history & a gripping read",
    "rating": "5.0 out of 5 stars",
    "content": "Gordievsky certainly didn't single handedly end the cold war--there were dozens of events and officials who played a significant role.  But Oleg Gordievsky was surely in the first rank of those who made a valuable contribution earning the appreciation of Reagan, Thatcher, the CIA, M16 and yes, QEII (the monarch, not the ocean liner).  Best of all, McIntryre doesn't put a patriotic gloss on his subject's behavior.  What Gordievsky did was of enormous benefit to democracy and the West but it destroyed his marriage, implicated his wife and children as well as family and friends who all paid some price for his defection.  In short, his actions both saved and ruined lives and the choices he made can be rightfully regarded as both morally defensible and appalling or enraging to those who knew him.  Unsurprisingly, his marriage failed and most Russian friends regard him with disdain and disgust.  In the western intelligence community he is a hero.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is terrific, important history and a wonderfully well-told tale.  Enjoy!",
    "post_time": "Reviewed in the United States on August 25, 2021",
    "pid": "1101904216"
},
{
    "title": "Excellent and well written true spy story surpassed the best le Carre spy fictions",
    "rating": "5.0 out of 5 stars",
    "content": "I was unable to put down this book. It's more interesting than some fictional spy stories written by le Carre. The author was able to turn a true spy story into an amazing story in a fictionalized way with many historical references that made it a history book about the cold war at the same time. The CIA totally lied about Adrich Ames who provided the Soviets with a list of KGB agents working for the west which included Gordievsky's name, for money. CIA dropped the ball when Ames had been behaving in a way that the CIA should have fired him or demoted him, but instead, promoted hin that allowed him access to information that killed many, and almost destroyed Gordievsky. As for the MI6 handler of Oleg, he should have told Oleg not to go back to Moscow when he was suddenly summoned. He was greedy for more intelligence than doing the right thing to allow him to defect and protect him and his family. He left it to Gordievsky to decide, which Gordievsky felt obligated to keep spying for MI6, for he discerned the MI6 handler was reluctant to give up on continuing to get high level intelligence from him on the Soviets. It almost got him killed. Then admitted his mistake after the fact. Not professional!  Oleg was right not to reveal what he was doing to Leila whom he knew he couldn't trust her. Though she enjoyed the privilege and freedom in England, at the core, she was a patriotic Soviet citizen, with her father and grandfather having worked for the KGB. This allowed her special privileges as a Russian, making her unable to relate to the repression of all other ordinary Russians. Oleg had amazing instincts about people but made a wrong decision about his handler's lack of responsibility to protect him. The two British couples who worked at the US embassy in Moscow were the heroes, including the baby. I totally enjoyed this book and wished I had come across it long ago.  It's brilliant!",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the story of Oleg Gordievsky who rose through the ranks of the KGB and achieved the lofty position of being in charge of all KGB agents in the United Kingdom in the mid-1980s.  He may have risen even higher in the KGB except he was finally exposed as working for the British MI6.  He was exposed -- in part -- by Aldrich Ames when the CIA was able to discover the name of the highly effective spy who did so much for British Intelligence.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "1101904216"
},
{
    "title": "great book",
    "rating": "5.0 out of 5 stars",
    "content": "Even though some times you think you are reading a novel it’s shocking that all what you have in front it’s true.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Exciting and terrifying read.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "1101904216"
},
{
    "title": "Couldn’t put it down.",
    "rating": "5.0 out of 5 stars",
    "content": "This book reads like a movie.  I could not put it down.  I immediately ordered 5 more by this author after completion.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Oleg Gordievsky was a KGB spy who underwent an ideological conversion and was the rare individual who passed secrets to the British not for money but for principle, according to author Ben Macintyre.",
    "post_time": "Reviewed in the United States on December 12, 2018",
    "pid": "1101904216"
},
{
    "title": "Best nonfiction book ever read",
    "rating": "5.0 out of 5 stars",
    "content": "Certainly in the period from the 1930s through the 1960s, the Soviet Union had much more success in penetrating Western democracies than those democracies had in placing a mole in a closed Soviet society. Some Soviet success was rooted in the ideological attractiveness of Communism which reached its zenith during the depression of the 1930s and produced true believers from atom spies Klaus Fuchs, David Greenglass, and Julius Rosenberg to the “Cambridge Five” that included Kim Philby.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "But in Macintyre’s telling, the KGB of the 1970s lacked the ideological fervor of an earlier era and was not as effective as it had been in previous decades. Nevertheless, in the battle of spy vs. spy, the Soviets found that with enough money they could buy spies. Those particularly susceptible to selling out were experiencing personal and professional disappointment, and money became a compensating factor in self worth.",
    "post_time": "Reviewed in the United States on November 13, 2023",
    "pid": "1101904216"
},
{
    "title": "Rare Penetration of the KGB in the Soviet Era",
    "rating": "5.0 out of 5 stars",
    "content": "Macintyre is at his best in describing British management of Gordievsky once he made contact to pass along secrets. Very few within MI6 knew of this Soviet spy, due to the lessons learned some years earlier. Kim Philby, who had risen to the highest levels of British intelligence, passed along names of those spying for the West to the Soviet Union.  A great deal of thought was given to how and when to act on knowledge acquired through Gordievsky, so as to ensure that his cover was not blown. The British also found ways to discredit Gordievsky’s London superiors and thus open the path for their spy to be promoted to head the KGB in Britain.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Unfortunately, the Soviets had their own spy, Aldrich Ames, who had become the head of the CIA’s Soviet counterintelligence. Ames’ personal life was in disarray and he had met a woman with expensive tastes. He was therefore eager to sell information to the Soviet Union for money. It was Ames who blew Gordievsky’s cover and that of a score or more of those in Soviet Union who were working for the West. Many identified by Ames were arrested, tortured, and killed.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "1101904216"
},
{
    "title": "Loveeeeee",
    "rating": "5.0 out of 5 stars",
    "content": "The author notes that spy bureaucracies, whether Soviet, British, or American are imperfect. The Soviets praised KGB teams that reported suspicious activity. Those that did not were sharply criticized. This hardly rewarded objectivity. When someone within the KGB made a mistake (as in losing track of Gordievsky’s movements), the inclination was to cover up the error. Such frailties led to bad decisions.",
    "post_time": "Reviewed in the United States on June 13, 2019",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Similarly, in appointing Ames to a position of importance, the CIA failed to note the danger signs in terms of behavior and spending that should have revealed a traitor in their midst.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "1101904216"
},
{
    "title": "Fabulous Read",
    "rating": "4.0 out of 5 stars",
    "content": "I really enjoyed this true-life spy story that read like a thriller. There were a few parts that dragged on a bit, but a great read overall.",
    "post_time": "Reviewed in the United States on March 8, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Here is my favorite quote:",
    "post_time": "Reviewed in the United States on September 30, 2019",
    "pid": "1101904216"
},
{
    "title": "Amazing story of Oleg Gordievsky",
    "rating": "5.0 out of 5 stars",
    "content": "Totalitarian Societies",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "“In all totalitarian cultures, the individual is encouraged to consider the interests of society before personal welfare: from Nazi Germany to Communist Russia to Cambodia under the Khmer Rouge and North Korea today, a willingness to betray those nearest to you for the greater good was the ultimate mark of committed citizenship and ideological purity.”",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "1101904216"
},
{
    "title": "Suspenseful",
    "rating": "5.0 out of 5 stars",
    "content": "I was somehow referred to this book on Amazon while looking into Aldrich Ames literature.  Am certainly glad i was, The Spy and the Traitor is the story of Oleg Gordievsky and his career in the KGB and his defection.  His story I guess is relatively untold compared to the infamous Aldrich Ames but his importance was extremely high.  Ben Macintyre tells the exciting story of Oleg and keeps the reader on the edge of their seat throughout the book.  Without the reader knowing what happened the book reads like a true spy novel, yet is entirely based on fact.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Oleg Gordievsky was a family KGB man, his father and brother were both in the KGB and he too followed the family tradition despite a streak of ideological doubt.  He married into the KGB literally with his wife as a fellow operative and the loveless life created the conditions for his dissatisfaction to boil into anti-establishment when he went on his foreign assignment to Denmark.  Oleg realized while he was abroad the richness of other cultures and vibrancy of environment and began to deeply question the model of Soviet rule after exposure to life in a foreign country.  He eventually managed to get posted in the UK through his creation of a strong relationships with his English counterparts and there started one of the most fruitful spy relationships of the Cold War.  Oleg became the UK government's eye into the inner workings of the KGB and Soviet apparatchik and gave natural insight when others would have been at a loss of interpretation.  The book is very personal and describes Oleg's marriage, divorce and remarriage.  It takes the reader through the conditions that formed his core beliefs as well as the environment that led to his extreme and critical introversion about the double life he was living.",
    "post_time": "Reviewed in the United States on October 30, 2018",
    "pid": "1101904216"
},
{
    "title": "very well written",
    "rating": "5.0 out of 5 stars",
    "content": "The book is exciting to read, when it becomes clear to the KGB that they have a mole, the escape plan of Oleg is put into place and the reader is taken on a remarkable journey.  I don't want to get into the details as the book must be read to get the appropriate immersion but its truly the substance of a must make movie.  The book was hard to put down and the last third was impossible.  After reading the book i immediately went to Wikipedia to look into all of the details and it was astounding that i knew as little as I did about this character.  Definitely worth reading as it is illuminating as to the workings of the KGB, historically significant in the context of the Cold War and as exciting as a spy novel could be, amazing.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A very interesting read",
    "post_time": "Reviewed in the United States on April 23, 2024",
    "pid": "1101904216"
},
{
    "title": "Astonishing!",
    "rating": "5.0 out of 5 stars",
    "content": "It reads like a fiction spy novel, but its a true account of events.  As a Cold War Veteran, I enjoyed this book.  I can put pieces of the puzzle of how we trained and why we did what we did.",
    "post_time": "Reviewed in the United States on January 28, 2019",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Interesting explanation of spy-worlds & works.",
    "post_time": "Reviewed in the United States on April 9, 2019",
    "pid": "1101904216"
},
{
    "title": "Well written and researched",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed the writing and the dramatization (though the ending seems a bit drawn out with more redundancy than I care to read). I also enjoyed the post-script about the \"players/characters\" reactions to the book. Leads me to read more books by this author.",
    "post_time": "Reviewed in the United States on December 26, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A fascinating tale, and a real one. A historic page turner. A compelling argument as to why we should double our efforts to support Ukraine. Hopefully, there will be another “spy” or two that will take Putin down.",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "1101904216"
},
{
    "title": "Better than Bond!",
    "rating": "5.0 out of 5 stars",
    "content": "You cannot admire and honor Oleg.  He was able to rise above the false doctrines of Communism and see the human spirit longing to be free. To be free to make their own decisions and sources of enjoyment and progress.  So much courage and self control is hard to imagine.  All of what he did was so so good.  The cost to him was so, so sad.  All that was dear to him was the price he paid.",
    "post_time": "Reviewed in the United States on December 31, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "so much detail, all known now 40 years later. i wonder what this era is hiding, we will only know",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "1101904216"
},
{
    "title": "sad and inspiring",
    "rating": "5.0 out of 5 stars",
    "content": "what devious deeds went on while we slept",
    "post_time": "Reviewed in the United States on August 5, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My wife thought I should read more fiction, so she bought this book for me. She didn't know it was actually non-fiction. As I began reading I found it fascinating to learn what was happening in the world soon after graduating college in 1984. Interest rates where 17% and I was recently married. To read what was happening with Oleg Gordievsky and his impact on the cold war at the same time as the beginning of my career was humbling. What is happening in the world today we don't know about. Had to put the book down a few times and couldn't read it before bed on occasion. A great read of non-fiction in a fiction format. Finishing the book is now leading me onto \"Agent Sonya\".",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "1101904216"
},
{
    "title": "great read",
    "rating": "4.0 out of 5 stars",
    "content": "Just some of the finest writing I've been privileged to read.",
    "post_time": "Reviewed in the United States on July 23, 2020",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A true story of Oleg Gordievsky, a KBG agent who switched allegiance and started spying for the British after the Berlin wall went up.  As Oleg rose through the KBG ranks, he became a more and more valuable double agent to Britain’s MI6.  But it was a life of added stress.  With the paranoid KBG always as suspicious of their own agents as they were of the British, he was potentially taking a risk every time he passed information to the British agents.  And the one threat he had no control over?  Double-agents working for the Russians.",
    "post_time": "Reviewed in the United States on December 11, 2023",
    "pid": "1101904216"
},
{
    "title": "First book of Macintyre's I've read",
    "rating": "5.0 out of 5 stars",
    "content": "It was also a life of self-imposed loneliness.  Posted overseas, Oleg’s fellow KBG agents were his friends, yet he knew he was betraying them.  He also had to keep his double life secret from his family.  His first wife would surely have reported him to the KBG.  Would his second wife have reported him, too?  He didn’t know, and so couldn’t take the chance.",
    "post_time": "Reviewed in the United States on March 4, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After being called back to Russia, he realized he was under heavy suspicion of being a KBG traitor.  But the KBG wanted to prove Oleg betrayed Russia.  Could he be spirited out of Russia before the KBG net closed in on him?  That part of the book is as thrilling as any spy novel.",
    "post_time": "Reviewed in the United States on October 16, 2023",
    "pid": "1101904216"
},
{
    "title": "A great insight to espionage during the Cold War",
    "rating": "4.0 out of 5 stars",
    "content": "A great insight to espionage during the Cold War. A bummer was that the pictures inserted 1/3 and 2/3’ds through the book tell you what happens at the end of the book. So don’t look at the pictures until you are done reading the book. Come on publisher, put the pictures at the end of the book.  I liken the book to the series, “The Americans”.",
    "post_time": "Reviewed in the United States on August 8, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You will not be able to put this book down.  A monumental work of research and intrigue.  A window into the soul of a spy and the consequences of the career.",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "1101904216"
},
{
    "title": "A page turner",
    "rating": "4.0 out of 5 stars",
    "content": "I would have given the story itself 5 stars. I deducted a star, however, because it was a struggle to read such small print. This was not a Mass Market purchase, I should add. I am an avid reader and cannot recall ever having been faced with print this size, which was also rather faint in certain places. Otherwise, as I said, it is a 5-star story.",
    "post_time": "Reviewed in the United States on August 3, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Excellent storytelling and interesting insight into clandestine spy services.",
    "post_time": "Reviewed in the United States on December 22, 2023",
    "pid": "1101904216"
},
{
    "title": "Small print",
    "rating": "4.0 out of 5 stars",
    "content": "This is another brilliant non fiction thriller from Ben MacIntyre who has made something of a speciality of espionage stories, usually of World War II vintage. This time the subject is the the Cold War and Soviet defector Oleg Gordievsky, whose actions were so critical to bringing down the Soviet Union.",
    "post_time": "Reviewed in the United States on November 21, 2018",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "  This book bears more resemblance to the work of John LeCarre than it does to any non fiction writer.  I thought it got off to a slow start, and maybe he spent too much time setting up the Gordievsky's decision to bolt and not enough to the decision to not tell his wife of his plans. Maybe that is just not feasible, but it felt like a kind of betrayal that was not addressed in the story.",
    "post_time": "Reviewed in the United States on January 29, 2024",
    "pid": "1101904216"
},
{
    "title": "Never heard of the most famous spy",
    "rating": "3.0 out of 5 stars",
    "content": " Also, I am confused by the title.  Does the author consider Gordievsky to be both a spy and traitor?  The portrait of him seems to be too admiring for that to be the case. Or is Gordievsky the spy and Aldrich Ames, an American who turned over state secrets to the USSR and who appears briefly, but significantly here, meant to be the traitor?  But Ames is not discussed enough to warrant co star billing.",
    "post_time": "Reviewed in the United States on May 1, 2022",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "  Highly recommended. Although I will say some of MacIntyre's books on WWII, and the preparation for DDay, are even better.",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "1101904216"
},
{
    "title": "Non-fiction John LeCarre",
    "rating": "3.0 out of 5 stars",
    "content": "I really liked that this one was based on a real person. The background story was really interesting and held up the whole book. Highly recommend if you enjoy spy craft. This one is the real deal.",
    "post_time": "Reviewed in the United States on December 22, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Spy and the Traitor  Ben Mcintyre",
    "post_time": "Reviewed in the United States on July 3, 2021",
    "pid": "1101904216"
},
{
    "title": "Best non-fiction spy thriller ever written",
    "rating": "5.0 out of 5 stars",
    "content": "Wild that I grew up while a lot of this was happening... Great story about someone who risked his life to change the world for the better.",
    "post_time": "Reviewed in the United States on February 5, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The only reason I did not give this review 5 stars is because it just isn't for everyone.  You will need to deal with Russian names, often long, and having a middle name with an \"itch\" at the end, to say nothing of nicknames - Also German and Slovak names, difficult to pronounce, not easy to remember, and also long.  All names are constantly changing due to code names, in the nature of the \"spy industry\".  But - if you want to know more about the Cold War, can view somewhat unsettling events with a sprinkle of humor, and don't mind occasionally needing to re-read a passage for clarity, then this book is for you.  You may be amazed to learn how much can be and was accomplished despite not having the use of internet, social media, and google search.  You may also see people described who are similar in nature to people you know today.",
    "post_time": "Reviewed in the United States on August 22, 2021",
    "pid": "1101904216"
},
{
    "title": "Not for everyone",
    "rating": "5.0 out of 5 stars",
    "content": "What a great story.  A captivating tale about a brave man who gave everything and in the end gave up everything do what he knew was right.",
    "post_time": "Reviewed in the United States on January 22, 2024",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "well written",
    "post_time": "Reviewed in the United States on March 30, 2024",
    "pid": "1101904216"
},
{
    "title": "Fascinating and spellbinding.",
    "rating": "5.0 out of 5 stars",
    "content": "Great story! Well written history with an engaging, hard to put down story line. A book about a man I knew nothing about before, but am pleased to know now. A hero! Read it!",
    "post_time": "Reviewed in the United States on December 28, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great story and details of this interesting figure in history. It is amazing all that he was able to reveal.",
    "post_time": "Reviewed in the United States on February 5, 2024",
    "pid": "1101904216"
},
{
    "title": "A great spy story--and true",
    "rating": "5.0 out of 5 stars",
    "content": "Without hyperbole, I can say that this is truly one of the greatest spy stories of the Cold War!",
    "post_time": "Reviewed in the United States on February 6, 2021",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book tells the story of Oleg Gordievsky, a top-level KGB agent who had access to many of the Soviet Union's secrets.  Ben MacIntyre traces Gordievsky's life and career, including the influences that led him to becoming a British spy.  But the really exciting stuff is the story of Gordievsky's escape from the Soviet Union after the KGB began investigating him for betraying the Soviet Union.",
    "post_time": "Reviewed in the United States on January 24, 2024",
    "pid": "1101904216"
},
{
    "title": "Highly recommend",
    "rating": "3.0 out of 5 stars",
    "content": "This is a very well-written book.  Throughout the book, there is clear evidence that MacIntyre has a deep knowledge of the espionage world, including many of the tiny details of spycraft.  MacIntyre held my interest throughout the entire book.  Furthermore not only is the tale of Gordievsky's escape exciting, but the intelligence that he provided MI6, the CIA, and other Western intelligence services was of extraordinary quality, and truly important.",
    "post_time": "Reviewed in the United States on February 14, 2021",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you wish to read about Cold War espionage, I would definitely recommend this book as a must-read.",
    "post_time": "Reviewed in the United States on December 6, 2023",
    "pid": "1101904216"
},
{
    "title": "Surprisingly good",
    "rating": "5.0 out of 5 stars",
    "content": "It's very easy to lose track of time while reading this book.  I kept thinking \"I'll just read a few more pages and stop...\"  Three hours later I managed to put it down.",
    "post_time": "Reviewed in the United States on November 25, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good Book if you like spy and true stories. Would recommend.",
    "post_time": "Reviewed in the United States on February 10, 2024",
    "pid": "1101904216"
},
{
    "title": "Good Book",
    "rating": "5.0 out of 5 stars",
    "content": "Move over John LeCarre!  This stuff is absolutely real and as such incredibly fascinating.  As one of the 10 undercover agents to be sent to the United States in the 80s, I can absolutely validate Mr. McIntyre's description of KGB methods and operations as well as spy training 101.  There are sections that take me right back to ice cold Moscow in the late 70s.  Great research!!!  In addition, this book is also a highly insightful dive into the psychology of espionage.  Unlike the characters in conventional spy literature, the actors in this story are truly three dimensional, real people with strengths and weaknesses.  The juxtaposition of two spies who worked against their own country - one for money and the other out of conviction - is a poignant play of good vs. evil.  And then there is the action.....  This book is a must read (and so are the other five books by the author) for anybody  with an interest in the reality of a world constructed from the fabric of lies where nothing seems real and where the occasional triumph of the truth makes for an exhilarating conclusion.",
    "post_time": "Reviewed in the United States on October 10, 2018",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m a big fan of this book. I didn’t realize it was more or less a biography of a real life Russian spy who becomes a double spy for Britain during Margaret Thatcher’s time and President Reagans term. It’s a fascinating look into the Russian state of mind during this time period. Pertinent information is passed to the U.S. during this time from Britain. This spy probably helped to avoid WWIII. We owe him a great deal of gratitude. Fascinating read.",
    "post_time": "Reviewed in the United States on June 14, 2023",
    "pid": "1101904216"
},
{
    "title": "Great Read and as Authentic as a Tale about Spies can be",
    "rating": "5.0 out of 5 stars",
    "content": "I believe I saw this on one of Bill Gates reading lists, and I’m a fan of Cold War history so I gave it a shot. Glad I did, top ten books of all time for me. Great book and intense last few chapters you will not want to put it down.",
    "post_time": "Reviewed in the United States on August 10, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "With little deviation from a chronological retelling, Macintyre lays out the decade plus story of what may have been the West's most consequential spy in the Soviet Union. Highlighting the transition from discontented member of his national service to traitor/hero, the author stresses the human dimension of Gordievsky's conversion of allegiance. But, in the process Manlcintyre still keeps an eye on the nuts and bolts of his central focus' output, and it's wide ranging impacts. He also details a surprising empathy inside the intelligence services, and one which may have been most critical in the success of Gordievsky's recruitment and running, both from his MI6 handlers and the man himself. Over all a good, fair handed read on a tale so rich it's worked its way into many of the spy thillers penned afters its revelation, and executed in a focused, but not overly minute, manner.",
    "post_time": "Reviewed in the United States on March 11, 2021",
    "pid": "1101904216"
},
{
    "title": "This is a true story",
    "rating": "5.0 out of 5 stars",
    "content": "This book contained so much information and yet didn't get stuck on many of the small particulars.  Very fast paced.  I did find in the beginning that I was slowing down trying to make sure that I was interpreting the spy terminology correctly and correct in my assumptions of whose side they were working for or talking about.  I never read a true non fiction book on the spy world before and found all of the details of how we work together, for each other, against each other - all so interesting.  I also feel as though it taught me so much more about Russia and to see one clear picture of a different world there.  Additionally, I felt as though  I could understand the main character in this book and the sad life and decision that he choose to live. Very eye opening book.  I would suggest this book if you want a little more insight into the world of spying and espionage.",
    "post_time": "Reviewed in the United States on July 20, 2020",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the third of  Macintyre's book I have read and this one ranks right up there with his best. If there was a problem it was because I read it into the wee hours of the morning.  Couldn't put it down.  Like his other books-although non-fiction-it reads like fiction. I knew something about Gordievsky and Ames (from other books I had read) which prompted me to want to read Macintyre's account.  Because it comes from the perspective of the \"other side\".  And, it didn't disappoint. This book  gives the reader a better understanding and insight into the workings of the former KGB. That was missing from other books I had read. .  If anyone is interested in how \"spy craft\" works this is a must read. It is unfathomable that an individual would take the kind of risks and personal sacrifices he made and is still here to tell about it.  .",
    "post_time": "Reviewed in the United States on December 25, 2018",
    "pid": "1101904216"
},
{
    "title": "Great Spy Thriller",
    "rating": "5.0 out of 5 stars",
    "content": "Oh yeah!  If you were a fan of the TV show the \"Americans\" you will even appreciate that show even more.",
    "post_time": "Reviewed in the United States on February 11, 2019",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a well written book.  It grabs you and you stick with it - a fast read.  I'm not someone who reads spy novels, but this is not a novel - it's the true story of what may be the biggest spy deal of the cold war.  I remember the guy who was the traitor in the book, but didn't know about the Russian spy who was working for England.  When those stories come together, you're amazed at how really stupid spy bureaucracies can be (or any bureaucracy).  I mean, the CIA wasn't suspicious of a mid-level guy buying fancy sports cars and a big house, for cash.  It was sitting right in front of them, and they didn't even look.  The same thing with the Soviets - their bureaucracy was so rigid that what happened could happen.  Shows the value of thinking outside of the bureaucratic box now and then.  Tunnel vision will get you in trouble - and it certainly was a big part of this.  Great book.",
    "post_time": "Reviewed in the United States on January 26, 2019",
    "pid": "1101904216"
},
{
    "title": "A thriller and shows how close we came to nuclear war with Russia",
    "rating": "5.0 out of 5 stars",
    "content": "A fantastic read if you are into spy stories - and it's true. Given Putin's threat of nuclear attack, it's helpful to know that it nearly happened during the Reagan presidency. The double agent, Oleg Gordievsky knew that Andropov  believed that the US would strike first, and, like Putin, he was  looking for 'evidence' to back up his belief. Gordievsky's information was deemed so believable, that it influenced Reagan to calm the situation.",
    "post_time": "Reviewed in the United States on October 13, 2022",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "How the US blundered into blowing Oleg's cover and his rescue are fascinating.",
    "post_time": "Reviewed in the United States on October 28, 2023",
    "pid": "1101904216"
},
{
    "title": "A powerhouse of a story",
    "rating": "5.0 out of 5 stars",
    "content": "This book, while slow to read at times, picked up intensely during part III of the novel. It was well-written and incredibly intriguing. 4.5/5 stars, rounded up",
    "post_time": "Reviewed in the United States on February 13, 2020",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was very interested to read this account of the KGB Colonel who used his disenchantment of Communism and a Totalitarian regime to  effectively spy for the West. I have no use for someone who would betray their county for a better car or cash (Aldrich Ames, Harold James Nicholson) in hand but I do understand trying to bring about change for the country you love that you feel is on the wrong path. I really admire Oleg Gordievsky for the difficult choices he made. I was heartbroken for him that the KGB refused to release his wife and children for so long that their marriage didn’t survive. In a totalitarian state it’s sad that you can’t trust your own spouse not to turn you in. That type of regime turns brother against brother, children against parents and the family is the loser in the end. But the story was enthralling and especially the end.  I am passing this book along to my peeps.",
    "post_time": "Reviewed in the United States on July 31, 2023",
    "pid": "1101904216"
},
{
    "title": "Entranced from the first pages...",
    "rating": "5.0 out of 5 stars",
    "content": "I love it when l I am suggested books that are great.  This is a 007 movie for sure.",
    "post_time": "Reviewed in the United States on December 22, 2019",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is an amazing story showing someone shaping the world.",
    "post_time": "Reviewed in the United States on July 18, 2022",
    "pid": "1101904216"
},
{
    "title": "This is awesome",
    "rating": "5.0 out of 5 stars",
    "content": "It's an awesome history.  A breath of fresh air.  Wow following convictions.  Something lacking today.",
    "post_time": "Reviewed in the United States on September 23, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "“The Spy And The Traitor” is the riveting true story of Oleg Gordievsky, a high level KGB operative, exfiltrated out of the Soviet Union in July 1985 after years of spying for the Brits. Ben McIntyre, the author,  writes with extraordinary detail, dividing the spy world between “good guys” and “ bad guys,” naming names (not just of spies) but of British politicians and notables complicit with the KGB. McIntyre’s lengthy Part III, the actual exfiltration of the spy to Finland, is mesmerizing holding the reader’s attention  as if shackled to page after page of the clever disguise and artifice.",
    "post_time": "Reviewed in the United States on November 8, 2020",
    "pid": "1101904216"
},
{
    "title": "Riveting, thrilling !",
    "rating": "5.0 out of 5 stars",
    "content": "McIntyre ends with the capture and imprisonment of Aldrich Ames as the treasonous culprit; with ringing muteness of the quality,  or lack thereof,  of the intelligence resources in this country. The book has maps and telling informative color photos.",
    "post_time": "Reviewed in the United States on March 10, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The behind the scenes actions of a true hero, of the many spies within the KGB, MI6, MI5, CIA and others nation’s spy networks, was a revelation. As we conducted our day to day lives, little did we know that real wars were being conducted in secret.",
    "post_time": "Reviewed in the United States on May 27, 2019",
    "pid": "1101904216"
},
{
    "title": "Loved this book",
    "rating": "5.0 out of 5 stars",
    "content": "Ben Mcintyre has the amazing ability to investigate the stories of great spies and telling those stories in an entertaining way. Throughout the Spy and the Traitor you get to know Gordievsky and understand his contribution to Britain and the world. Great insights into the life of spies and how it prevented major conflicts with the information he was able to gather. It is fun and easy to read.",
    "post_time": "Reviewed in the United States on January 25, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "An excellent story well told by the author. One of my takeaways was how awful, how corrupt, and how evil was the Soviet Empire. So evil one of their star spies couldn't help but notice and turned to the light. Now we have an equally corrupt, evil, and awful man leading the poor Russians down another tragic path. Poor Russia, never free, always lied to, perpetually hungry and miserable, and often the world's pariah. Makes you wonder if they'll ever taste the sweet fruits of freedom?",
    "post_time": "Reviewed in the United States on May 29, 2022",
    "pid": "1101904216"
},
{
    "title": "Great Story",
    "rating": "5.0 out of 5 stars",
    "content": "Wow, this was a great book.  I love Cold War spy books and movies and this one had the added benefit of actually being true.  The machinations that these people went through to accomplish their goals was incredible.  From the tiny clues left to communicate, to the sweeping effects on world-wide political policy, it was fascinating.  Although, when viewing traitors to America, I feel betrayed, when I read Gordievsky's story, I saw a person who risked his life for his ideology of freedom and democracy even though his native society eschewed those principles.  I would say that the spy game is much like I have heard pilots say their professions is, hours of boredom punctuated by moments of terror.  It is no wonder that le Carre had good things to say about this book.",
    "post_time": "Reviewed in the United States on January 27, 2021",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Reads like a fictional spy drama but was true. I didn’t know the story so it made it interesting and brought out many facts about the Cold War I didn’t know.  The spy was a true hero and the effects were extremely positive for us all…Very good read",
    "post_time": "Reviewed in the United States on November 27, 2022",
    "pid": "1101904216"
},
{
    "title": "chiller thriller",
    "rating": "5.0 out of 5 stars",
    "content": "Neil",
    "post_time": "Reviewed in the United States on March 13, 2021",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In this exciting, real-life espionage tale, Macintyre tells the tale of Oleg Gordievsky and the embrace of Western values that led him to eventually reject and fight the political regime of his homeland. The exploits found in a spy thriller – the contacts, dead drops, code words, hidden signals, exfiltration plans, etc. – are all found here with the added gravitas of having actually occurred. More importantly, the critical information supplied by Gordievsky enabled the the highest levels of the UK and US to better understand and confront the Kremlin. Also woven into this story is the parallel betrayal and threat posed by the CIA’s Aldrich Ames. As Macintyre makes clear though, in one case duplicity was driven by lofty principles and ideals, in the other by greed and cold, hard cash.",
    "post_time": "Reviewed in the United States on August 6, 2023",
    "pid": "1101904216"
},
{
    "title": "true spy story",
    "rating": "5.0 out of 5 stars",
    "content": "Ben Macintyre has captured a slice of spy vs. spy history in exquisite detail and with an author’s voice that sweeps one into the tension, temperament and tenure of the Cold War.  Frickin’ brilliant!",
    "post_time": "Reviewed in the United States on June 12, 2019",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I found the book well written and hard to put down. The information dovetails nicely with other accounts of cold war interactions between the USSR and the West - books like Midnight in Chernobyl; Raven Rock, and The Dead Hand. It's absolutely astounding to me that there was so much misinformation and misunderstanding on all sides. You wonder how we got through that period without going to war; and whether we have learned anything that will help us avoid similar problems in the future. With respect to Gordievsky's post-betrayal interrogation and escape, I have to admit I ended up wondering if it all wasn't a little too pat. The author presents reasonable arguments for how it all happened, but I had the nagging feeling that something wasn't quite right. It's impossible to know if Gordievsky could have been of any value to the KGB after his escape to the West, but...",
    "post_time": "Reviewed in the United States on August 12, 2023",
    "pid": "1101904216"
},
{
    "title": "Edge-of-the-seat thriller grounded in actual KGB and MI6 operations",
    "rating": "5.0 out of 5 stars",
    "content": "This book read like a fiction novel but it's a totally true story from the cold war time. Great read and would definitely recommend to someone looking for a non-fiction with some action.",
    "post_time": "Reviewed in the United States on September 25, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s so much fun giving good books to someone!  These days we have to have a escape!  TY",
    "post_time": "Reviewed in the United States on July 24, 2023",
    "pid": "1101904216"
},
{
    "title": "Well written account of a spy who has profoundly impacted our lives",
    "rating": "5.0 out of 5 stars",
    "content": "Bottomline: This book offers a detailed account of possibly the most impactful cold war spy. While it’s a non-fiction book, it’s a page turner so well written that I found it impossible to put aside.",
    "post_time": "Reviewed in the United States on February 3, 2020",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book describes the collaboration of a highly ranked KGB spy with British intelligence during the cold war, the impact it had on the West-Soviet relations and the personal price he paid. It makes you reflect on how one person could impact the course of history as this man did, by exposing the West to Soviet thinking and by mitigating the chance of a nuclear war in the height of the cold war.",
    "post_time": "Reviewed in the United States on June 25, 2023",
    "pid": "1101904216"
},
{
    "title": "Thrilling! Scary! Brilliant!",
    "rating": "5.0 out of 5 stars",
    "content": "If you are intrigued with espionage, the work of the KGB, MI6, the cold war period, and the motivations, personal sacrifices, and values of intelligence officers you will enjoy this book.",
    "post_time": "Reviewed in the United States on February 12, 2019",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A book that provides clarity and insight about a person who had tremendous influence over a rapidly changing world. It also provides context about events during that period (70-80s) when headlines around the world were scary all the time.",
    "post_time": "Reviewed in the United States on October 10, 2022",
    "pid": "1101904216"
},
{
    "title": "The most compelling, intriguing and unbelievable true story that I've ever read!",
    "rating": "5.0 out of 5 stars",
    "content": "It's very hard to put into words how this story affected me. Other reviewers have done a very thorough job of outlining the story. I can only encourage you to read it, and then challenge you to be able to put it down! My only critique (not of the book, but the formatting) is if you're reading this on your Kindle, that during the climax of the story, it is interrupted by several pages of photographs that are spoilers, before you read the outcome! So, be warned to close your eyes and fast forward. I hope that someone such as Tom Hanks, Steven Spielberg, or one of the great directors that excels at bringing epic stories such as this to life will get to work on this excellent story. Thank you, Oleg Gordievsky,  for everything you've done for England and America in the name of democracy.",
    "post_time": "Reviewed in the United States on October 19, 2018",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love spy novels and movies, but this account of an actual KGB double agent was fantastic reading. An insightful glimpse into West vs. East espionage during the Cold War. Kept me on the edge of my seat during the interrogation and escape. Great read!",
    "post_time": "Reviewed in the United States on March 29, 2019",
    "pid": "1101904216"
},
{
    "title": "Better than Fiction",
    "rating": "5.0 out of 5 stars",
    "content": "Of the five Ben Macintyre true stories I've read, Spy and The Traitor is the best, and even the best fiction thriller cannot capture the realism this book does. If this book helps to keep the horrors of Socialism/Communism and the Soviet Union and Russia alive in the minds of those who were too young to know about it maybe that system will be less likely to ever re-emerge, although it would appear that Putin would like to have it all back. Deepest bows to MI6 and MI5 for their remarkable, dedicated work and continuing loyalty to Oleg Gordievsky, the KGB spy at the center of this who hated the evils of Communistic Russia and risked everything to help end it and was in fact pivotal in its demise. Don't miss this book. Note: Don't review the second set of photos/captions before finishing the book as they contain spoilers.",
    "post_time": "Reviewed in the United States on June 22, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I could not put this book down.  It is the true story of a rising star in the Russian KGB who became disenchanted with communism and methodically, planfully became a British spy who persevered, and survived, over decades.  He lived a double life and narrowly evaded detection and death numerous times.  The cloak and dagger machinations on both Russian and British sides are worthy of a John Le Carre or Ian Fleming novel.  The extraordinary courage of the hero is admirable, and insights into his thought processes are fascinating, as his deeply held principles guide him to make profound personal sacrifices for a greater ideal.  This true story gives us a fascinating glimpse into the world of espionage of which we are mostly unaware, but which can have enormous impact on our lives.  I highly recommend this book.",
    "post_time": "Reviewed in the United States on May 11, 2020",
    "pid": "1101904216"
},
{
    "title": "The Best Spy Book",
    "rating": "5.0 out of 5 stars",
    "content": "Outstanding! Very well written and I would recommend this book to anyone with a desire to learn more concerning Russia and the KGB! My hat is off to Ben McIntyre for compiling a truly historical review!",
    "post_time": "Reviewed in the United States on May 8, 2023",
    "pid": "1101904216"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I don’t often read spy stories or novels, but I was intrigued when I came across this book so I took a chance on it. I thought Macintyre did a fantastic job of conveying the story of a remarkable spy whose information and analysis during the Cold War hastened its end and literally shaped the world we live in today. The story of the exfiltration effort had me glued to the book and unable to put it down.",
    "post_time": "Reviewed in the United States on July 31, 2021",
    "pid": "1101904216"
}
]