[
{
    "name": "  The Girl Who Was Taken ",
    "stars": [
        "57%",
        "30%",
        "10%",
        "2%",
        "1%"
    ],
    "pid": "1496701003",
    "ratings": "33,451 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "keeps you guessing",
    "rating": "5.0 out of 5 stars",
    "content": "Couldn’t believe the end !!! Keeps you engaged ! Finished this book in 5 days …. You will not be disappointed",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Overall a great, easy read! But very sick and twisted.. I loved how it kept you guessing on who this killer was and the potential for it to be anyone. But still shocking who the killer actually was and the theories behind it. I didn’t love how the ending left me with unanswered questions. Was it Nicole or not??",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "1496701003"
},
{
    "title": "Left with more questions then one…",
    "rating": "4.0 out of 5 stars",
    "content": "I like the premise of the story, but it is a regular story not quite amazing. I can guess the culprit, and the closing is not quite revealing. But overrall is a good story",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed reading The Girl Who Was Taken. The suspense was amazing and hooked me to the end. I recommend this book.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "1496701003"
},
{
    "title": "Great story not quite amazing",
    "rating": "5.0 out of 5 stars",
    "content": "The story keeps you glued to find out where it is going.  I had a moment, to let go of my breath I didn't know I was holding, and say Whew!",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Spoiler* The first half of the book is TOUGH to get through. It was recommended by a friend and I ended up asking twice if it was worth the struggle. Its a decent story with lots of twists, but with one glaringly obvious clue to the culprit. Victims families always have a point of contact. Someone they interact with for updates, whether it is the investigator themself, or an appointed person. The fact that no one in Nicole's family was working with someone to try to find her was such a big missing piece it made it obvious law enforcement was involved. A couple of unanswered questions by the end and the wrap up seemed a little rushed. But, good enough for a one time read.",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "1496701003"
},
{
    "title": "Great thriller",
    "rating": "4.0 out of 5 stars",
    "content": "This was a great book, but I am so disappointed with the ending and endings are HUGE in my mind. I do not want to give it away other than, sorry, but you will not like the ending or it would have been 5 stars in my eye. I am warning because I love a good book, but when it doesn’t have a good ending, what is the point?",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One of the best books I’ve read. It’s suspenseful, an edge of your seat read, and one that will make you keep guessing.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "1496701003"
},
{
    "title": "Great Read!!",
    "rating": "4.0 out of 5 stars",
    "content": "Good book. Worth reading",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I couldn’t stop reading/listening to this book! I don’t think this man can write a bad thriller! I can’t wait to get my hands on more of his books.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "1496701003"
},
{
    "title": "4.5 stars",
    "rating": "4.0 out of 5 stars",
    "content": "This was a really good book I had been wanting to read a charlie donlea book and he didn't disappoint, the only reason I didn't give it 5 stars was because the ending was not what I wanted lol but overall still very good read something very different from what I have read before this",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you like solving mysteries and being taken for a wild ride, this is the book for you. It was incredible.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "1496701003"
},
{
    "title": "Couldn’t Put It Down",
    "rating": "5.0 out of 5 stars",
    "content": "Thoroughly enjoyed this medically informative thriller that kept me reading until my old eyes stop me. I learned a lot about Medical Examiners, the purpose and nomenclature.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Quick , easy read  I was never bored.  The story was not as believable at the end..",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "1496701003"
},
{
    "title": "Really detailed about ME work",
    "rating": "5.0 out of 5 stars",
    "content": "I will read his next book just for the medical/forensics",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "love his books.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "1496701003"
},
{
    "title": "loved the medical/forensic intertwined",
    "rating": "5.0 out of 5 stars",
    "content": "pros-The story is well written with good character development which keeps you guessing",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Cons- characters were confusing at first",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "1496701003"
},
{
    "title": "The girl who was taken",
    "rating": "5.0 out of 5 stars",
    "content": "I kept a flow chart back of book. A clue kept you guessing but I guess its was meant to do that. The ending seriously? A little far fetched for me but people like surprise endings.",
    "post_time": "Reviewed in the United States on May 23, 2017",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m not a reader, but this book made me want to continue until the end!!",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "1496701003"
},
{
    "title": "stunning",
    "rating": "5.0 out of 5 stars",
    "content": "In a million books I’ve read of the genre, this one got the only review I’ve ever written. Freaking amazing!",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book kept my attention and I never wanted it to get to the point.  Author going to be a have to read another one!!!!",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "1496701003"
},
{
    "title": "good read",
    "rating": "4.0 out of 5 stars",
    "content": "This book was really great it kept me wondering and wanting for more but the ending was a bit like a cliffhanger but other than that the book was amazing I would definitely recommend if you like stories that have plot twist. 🙂🙂🙂",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The red herrings were so well done. Couple typos and one misused word but excellent story and great beach read.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "1496701003"
},
{
    "title": "thrilling",
    "rating": "4.0 out of 5 stars",
    "content": "Very engaging story telling. I kind of but didn't see the twist coming. Did a good job of laying out other suspects. I liked Livia's character as well.",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Really loved this book. Kept me guessing. Can’t wait to read other book. Very well written and I found only one word error.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "1496701003"
},
{
    "title": "Excellent.",
    "rating": "5.0 out of 5 stars",
    "content": "Such a good book. Kept you guessing the entire time, and the ending was very unexpected. Will definitely be reading another book by this author!",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "“The Girl Who Was Taken” is another amazing tale by my newest favorite author, Charlie Donlea.",
    "post_time": "Reviewed in the United States on October 3, 2020",
    "pid": "1496701003"
},
{
    "title": "Engaging!",
    "rating": "5.0 out of 5 stars",
    "content": "A fellow Amazon.com reviewer that I follow wrote an outstanding review on one of this author’s books that convinced me to take a look at this writer’s work last month.  Since then I have read “The Suicide House, Some Choose Darkness, Summit Lake,” and “The Girl Who Was Taken.”  I have already bought “Don’t Believe It” and will read it next.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The author is really skilled at providing red herrings and other techniques to keep the reader guessing who the killer is.  I am normally pretty good at figuring out the killer early on in murder mysteries, but have been stumped by this and all of his other books.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "1496701003"
},
{
    "title": "Fantastic book with a twist",
    "rating": "4.0 out of 5 stars",
    "content": "I have never read a book by the author, but I loved it!  I thought I had figured out who.  In fact, I thought it was too obvious, but I was way wrong!  I will be reading more books from this author!",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed putting the pieces together and the twist caught me off guard. It’s a book I will recommend to my friends!",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "1496701003"
},
{
    "title": "Intriguing Story",
    "rating": "3.0 out of 5 stars",
    "content": "It’s like you know but you don’t and the story was not written to have as sequal.  I wish I was more like my sister who reads the last chapter of a book  before she starts reading from the beginning.  If I had, maybe I would not have such mixed feelings about this book.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Really good….kept me guessing. But I wanted just a little more than what the ending gave me. I guess I wanted confirmation!",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "1496701003"
},
{
    "title": "Was a good read until the end",
    "rating": "5.0 out of 5 stars",
    "content": "Livia Cutty is a smart, resourceful and pragmatic medical examiner in training and she comes out on top in this exciting story of a killers lies. I’m glad they discovered what happened to Nicole and where she was left. Meagan went through hell and so did her entire family. I really enjoyed this book to the very end and on another note this is my 6th Charlie donlea book and he is always a sure thing for entertainment. 😍 highly recommend reading this book!",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Another 10/10 banger from Charlie Donlea - he’s legitimately my favorite fiction writer, and it’s not even close. I’ve now read every single book and short story, and constantly crave more! If you’re on the fence, just buy it. You won’t regret.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "1496701003"
},
{
    "title": "Great…..but wanted more",
    "rating": "5.0 out of 5 stars",
    "content": "Such a big twist that leaves you literally gasping!! So awesome, read it in about 5 days! Couldn’t put it down!",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great character development. Very strong writer. Awesome description- you feel like you are with the characters in each of the chapters.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "1496701003"
},
{
    "title": "incredible thriller with mind blowing twists!",
    "rating": "3.0 out of 5 stars",
    "content": "This book may have actually been a four star read. It could possibly have been a five.",
    "post_time": "Reviewed in the United States on November 9, 2023",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The writing was good and the story was even better.",
    "post_time": "Reviewed in the United States on April 2, 2023",
    "pid": "1496701003"
},
{
    "title": "Great Psychological Thriller.",
    "rating": "4.0 out of 5 stars",
    "content": "The writer took his time to ensure that all his characters were totally fleshed out and believable.  The author writes very intelligently, and I did enjoy thd twists and turns along the way.  I was able to intuit the ending, however, it could very well be a good surprise twist for some readers.  Even though I guessed the ending and the who-dunnit, the great characters and the plot was well written enough that I still very much enjoyed the ride.  I did notice that going back and forth in time from chapter to chapter did sometimes pull me out of the storyline, sort of slowing down the flow of the book for me.  I would definitely recommend this book to anyone who loves thrillers, with there being a caution that adult themes abound in the novel, and may not be appropriate for very young, or extremely sensitive readers.",
    "post_time": "Reviewed in the United States on October 29, 2023",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was well written and kept me thinking. I figured out the whodoneit rather early but still throughly enjoyed the story",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "1496701003"
},
{
    "title": "great book",
    "rating": "5.0 out of 5 stars",
    "content": "This book was written extremely well.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just when you think you figured it out, you’re wrong. And when you think you figured it out again, you’re wrong again! Absolutely loved this book because it was unpredictable and exciting.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "1496701003"
},
{
    "title": "Incredible read",
    "rating": "5.0 out of 5 stars",
    "content": "And the ending!! Totally wasn’t expecting that! Highly recommend!",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Wow all I can say is if you want to read a book you can’t put down you need to read The girl who was taken. I really enjoyed it. I think Charlie is one of my new favorite authors.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "1496701003"
},
{
    "title": "just couldn’t stop reading!",
    "rating": "5.0 out of 5 stars",
    "content": "Everytime I thought I figured out what had happened, it turns out I hadn’t. Great thriller, well written. Would definitely recommend.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed it all. The pace, the suspense, and the characters were perfect. I did not suspect who the killer was, which is unusual for me. Great editing. No unanswered questions. As a nurse myself, I enjoyed reading about the medical aspect as well. I hope to read more from this author.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "1496701003"
},
{
    "title": "Awesome",
    "rating": "4.0 out of 5 stars",
    "content": "I loved the twists and turns in the story. I like to think I can see through a story well before the 'big reveal'. That did not happen in this book.",
    "post_time": "Reviewed in the United States on April 10, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book was really good. The story pulled you in, kept you guessing. I just really wish the ending was more of an ending and less of a cliffhanger. Still worth the read.",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "1496701003"
},
{
    "title": "4 stars!",
    "rating": "4.0 out of 5 stars",
    "content": "What a rollercoaster this story took me on! I love how the story was divided between past and present timelines. It’s a perfect way to give Nicole a voice even if she’s missing in the present timeline. I will admit that the beginning of the book dragged a bit because it was more through the lens of Livvie and exploring the job of a medical examiner. It was interesting to read but at times the medical jargon went over my head and got a bit tedious to get through. What this book does superbly is drop so many breadcrumbs that just when you think you’ve got it all figured out another one is thrown your way. I thought I had the book solved midway and boy was I wrong. The ending left me screaming and that’s all I’ll say about that. First time reading from this author and it definitely won’t be my last.",
    "post_time": "Reviewed in the United States on October 13, 2023",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It was really great as far as the twists and turns in the book, but I wish the ending was different. It leaves unanswered questions and I don’t like that.",
    "post_time": "Reviewed in the United States on April 10, 2024",
    "pid": "1496701003"
},
{
    "title": "good",
    "rating": "4.0 out of 5 stars",
    "content": "Took forever to read because the beginning was so boring. Many times I wanted to quit and read a different book but decided to keep giving this a chance. Once I reached 60%+ I couldn’t stop reading until I finished it!",
    "post_time": "Reviewed in the United States on April 17, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This story had me guessing until the end. I cried, I yelled and stayed up way to late to finish. I'm looking forward to more good reads from Charlie Donlea.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "1496701003"
},
{
    "title": "Great ending, Sluggish Start",
    "rating": "5.0 out of 5 stars",
    "content": "this book keeps you hooked in from the first page, I couldn’t put it down through the twists and turns of the story. Would HIGHLY recommend, even if you are new to thrillers",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What a terrific thriller! It was difficult at times to keep up with everything happening at such a fast pace! Well written, characters well developed, the multiple plots split up and came together several times! No typo’s either - I’m a spelling and grammar editor type! Hard to find e-books that are well edited! Only maybe 3 words missing!! Great job Charlie! Kinda scares me a little that you could twist this so well - your dreams must be CRAZY!!! JK!",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "1496701003"
},
{
    "title": "My new favorite author!",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent character development, steady pacing and a well thought out plot made this an incredible book. The last couple of chapters were so tense that I actually had to take breaks every few minutes!",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "No graphic violence, profanity or sex, but there's lots of kidnapping, terror and death. This book is definitely not for the sensitive or the young.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "1496701003"
},
{
    "title": "PAGE TURNER",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely loved this book and when I thought I had figured it out, I definitely had not. This is a must read if you like psychological thrillers.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "1496701003"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great book it’ll keep you on your toes",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "1496701003"
}
]