[
{
    "name": "  When the Jessamine Grows: A Captivating Historical Novel Perfect for Book Clubs ",
    "stars": [
        "58%",
        "30%",
        "9%",
        "2%",
        "1%"
    ],
    "pid": "149674070X",
    "ratings": "2,800 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Exceptional Read !",
    "rating": "5.0 out of 5 stars",
    "content": "THE author is exceptional. Well written. A good read in the study & appreciation of what the period of time had and its impact on a  family, community, war, endurance, grief and love.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very interesting! New perspective of old issue! Enjoyed this book.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "149674070X"
},
{
    "title": "Good book",
    "rating": "5.0 out of 5 stars",
    "content": "Great story. Interesting characters. Strong female protagonist (loved Joetta!) Will be one I reread.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fast delivery",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "149674070X"
},
{
    "title": "One of my favorite books this year!",
    "rating": "4.0 out of 5 stars",
    "content": "A story I wasn’t sure I wanted to read at first, but was quickly drawn into the narrative. The tragedies of the Civil War were many. This well written and engrossing story will break your heart and keep you reading to the end. Well worth the time to read and get a glimpse of one families journey through that very difficult time in history. Have some tissues handy.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "A novel notion that there were those in the colonies who would not declare loyalty to one side or the other in the Civil War.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "149674070X"
},
{
    "title": "Very good book.",
    "rating": "5.0 out of 5 stars",
    "content": "Read it in two days. Very good writing, easy to follow.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is one of the best books I have ever read about ordinary farmers who lived through the Civil War in the south. Heartwarming and heartbreaking. The mother in this amazing book is so strong. I didn't want it to end, and am hoping she will write a sequel about this brave family.. I can't recommend this book enough. A great historical fiction read.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "149674070X"
},
{
    "title": "A  thought provoking story!",
    "rating": "4.0 out of 5 stars",
    "content": "The end of the book is wide open to a sequel.  Is there a book 2?",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was a little slow getting involved, but about a third of the way in, I could not put it down. It was a terrible time in our history, and it revealed the many hardships and conflicting feelings of the hardworking farm families, just trying to eke out a living and stay safe. A beautifully written book!",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "149674070X"
},
{
    "title": "Fast Paced",
    "rating": "5.0 out of 5 stars",
    "content": "This book is more about the relationship of Joetta ( the mother and wife ) of her family during the civil war.  Her 15 yr. old son leaves one night to join the war and her husband soon follows to bring him back. Joetta and her husband have remained neutral which is the premise of this story. The story is centered in a small town and on Joetta's farm where she and her young son and argumentative father-in-law remain. Being neutral leaves her very vulnerable and causes relationships in the community to cease and property damage to her farm by her community. Joetta remains strong throughout the story while going through so many hardships.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I read this book in two days. I never realized neutrality could cause such conflict . This was an easy book to follow. Glad I took the time to read it when I generally stick to WW2 books.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "149674070X"
},
{
    "title": "different part of Civil War history",
    "rating": "5.0 out of 5 stars",
    "content": "I love historcal fiction.  As a Civil War re-enactor I especially read that period.  This was a nice story, well written that portrayed a side of our history I have not run into before.  An amazing tale that I don't want to give away but I encourage you to give it a read.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Provided a relaxing 2 day read",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "149674070X"
},
{
    "title": "Book for interesting read",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed this story line.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Husband would like other books by this author. made a fast read.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "149674070X"
},
{
    "title": "Good Read",
    "rating": "5.0 out of 5 stars",
    "content": "This book was hard to put down because it moves.  The story is captivating as it portrays how your trust in others  can become a knife in your back.  The protagonist in this story you become.  You can feel her emotions.  The is a part in the story that brings tears of sadness, tears of fear, tears of joy.  YOU read book this if you love historical novels.  I have read all of Donna Everhart’s books,  I have never been disappointed.  All of her books are “gotta keep reading.”  This is y I ask for more in my title!",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book takes a look at the Civil War through the eyes of a woman in North Carolina and its effect on those who don't want to go to war.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "149674070X"
},
{
    "title": "Gift",
    "rating": "5.0 out of 5 stars",
    "content": "Put it down. I had ancestors in the same area who were also in the war.  And their ancestors fought the revolution. It made reading it like a small window into what they may have endured.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I really enjoy this book and wish it hadn't ended. One of those stories you wish was part of a series.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "149674070X"
},
{
    "title": "Excellent book",
    "rating": "5.0 out of 5 stars",
    "content": "Such a good book.  I know this is often said about good books but I really didn’t want to quit reading until I finished",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easily the best book I've ever read! I loved it! Difficult to put down and very thought-provoking. You won't be disappointed!",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "149674070X"
},
{
    "title": "Highly recommend",
    "rating": "5.0 out of 5 stars",
    "content": "Once again Donna Everhart has written a novel that entertains and educates. This novel centers around Joetta McBride and her family in North Carolina before and during the Civil War. I have read many novels set during that period told from the perspective of a slave owner or slave. Donna has told her story from the perspective of a wife of a small farmer who owns no slaves. When talk of war begins, she feels the fight is not their fight, that only the rich landowner has anything to gain or lose from the war. She doesn't take 'sides' and neither does her husband, a view that serves to ostracize them. However, when her oldest son runs away to join the Confederate fight, she is drawn into a battle she never wanted.",
    "post_time": "Reviewed in the United States on January 29, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This author does such a fantastic job putting you into Joetta's 'skin' you will feel her pain and her disappointments and understand how this mother only wishes for her simple life of home, hearth and family to return.",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "149674070X"
},
{
    "title": "Outstanding",
    "rating": "5.0 out of 5 stars",
    "content": "If you have never read a Donna Everhart novel, you are missing a writer who can take you into the hearts of her characters. And you don't forget them. Five stars all the way.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What a wonderful book! This painful story of overcoming the trials of war, the loss of freedom,friendship and the testing of one’s tenacity was fantastic! Our writer has us on the edge of our seats,hoping for the best for our heroin and her family. It was such a terrible time for America, but justice prevails for the countrymen who fought hard for the freedoms we take for granted now.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "149674070X"
},
{
    "title": "Donna does it again!",
    "rating": "4.0 out of 5 stars",
    "content": "From the beginning to the end, the story is rich with the beauty of the land, and the people who dwell on it. As they till the soil, their lives are fraught with troubles they must endure to survive.",
    "post_time": "Reviewed in the United States on April 2, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Read this touching tale, you won’t be able to put it down!",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "149674070X"
},
{
    "title": "How sad we treat people who think differently.",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first book by Donna Everhart. I found this story thought provoking and different from most civil war stories. The main character is a very strong woman who sticks by her beliefs even though people punish her for it. I definitely intend to read more books by her.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A beautifully written account of survival during the Civil War. The characters are real and easy to identify with. Written from a unique perspective of a family neither for the confederate or union army and the consequences that befall them. Full of heartbreak and inspiration.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "149674070X"
},
{
    "title": "Relatable",
    "rating": "4.0 out of 5 stars",
    "content": "Found the story believable and relatable to events going on in todays world",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Educational, storyline is compelling making this a hard book to put down.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "149674070X"
},
{
    "title": "Hard to put down!",
    "rating": "5.0 out of 5 stars",
    "content": "This book was very enjoyable and also very sad at times.  Joetta was a brave and strong woman.  Through all diversity she kept her beliefs and morals.  The division in our country reminds me of what our country is facing today.  If you turn your back on our history the nation will face the terrible destruction again.  I hope there will be strong and brave people who will stand up for our country when needed.",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was such a good book, and the second of Donna Everhart’s that I’ve read.  I learned a couple of new recipes I’d never heard of before, like switchel and grits bread, both were actually pretty good!  Being born and raised in the mountains of north ga, I was surprised my own grandparents had not shared these with me. This read was emotional for me, whether hormones or actual feelings from getting caught up in such a good book, I do not know, but I did cry a few times within the pages.  It only took me 2 days to read it.  I’ll be buying and reading all Donna’s books!",
    "post_time": "Reviewed in the United States on March 19, 2024",
    "pid": "149674070X"
},
{
    "title": "a great story",
    "rating": "5.0 out of 5 stars",
    "content": "Great book.  Will follow this author too.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was difficult to put down.  A story of hardships and love in a difficult time and place. Good read.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "149674070X"
},
{
    "title": "Fabulous read!",
    "rating": "5.0 out of 5 stars",
    "content": "Love Donna's writing style.  Story of heartbreak, strong convictions, love and major comebacks during the Civil War.  Looking forward to reading more of her work!",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a very good read. The main character was developed well in the story and she stood strong in the face of adversity during a time when women’s opinions were not valued.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "149674070X"
},
{
    "title": "When the Jasmine Grows",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this book. I loved thinking back to what that time in history was really like, this book captured that for me.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A very sad story about a very strong southern woman during the civil war",
    "post_time": "Reviewed in the United States on April 3, 2024",
    "pid": "149674070X"
},
{
    "title": "What is jessamine?",
    "rating": "2.0 out of 5 stars",
    "content": "Don't expect to find the answer in this book. After slugging through numerous repetitions of the same story, we finally are introduced to Jessamine toward the end of the book. A vine that grew up the columns on the porch of the heroine's house. Titling a chronicle of the harrowing experiences of non-supporters of the rebel cause during the civil war for an insignificance plant is a bit puzzling to me. And I'm not a fan of contrived narratives that magically restore all the suffering and losses experienced during the whole book at the end of it. Nice try, though, of describing how the confederacy treated its own based on rumor and suspicions.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I found this a riveting read.  Joetta McBride is one of the most characters I’ve read about.  Her story is so well told she seems real and through her actions and thoughts, a new perspective on the Civil War also came to life. Ms. Everhart is a most talented author and I highly recommend this book.",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "149674070X"
},
{
    "title": "Exceptional Novel",
    "rating": "5.0 out of 5 stars",
    "content": "I loved the telling if the Civil War from this perspective. Donna Everhart never fails me. Engaging, believable, tender and traumatic - another sensitive portrayal of a difficult issue by this amazing author.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The civil war caused so many troubles. It also showed strength in some people. Great read!",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "149674070X"
},
{
    "title": "Poignant and poetic",
    "rating": "5.0 out of 5 stars",
    "content": "She is an excellent, descriptive author who makes you feel like you are exactly where she is describing. You fall into her novels.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Enjoyed the characters and easy to picture each one. This book revealed a story of a country divided and how hard it was to survive, and trust.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "149674070X"
},
{
    "title": "Great Book",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this s triumphant story",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I'm hoping she will add  sequel to this  book so we will know how the family is doing in Texas and if Henry has found them yet.",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "149674070X"
},
{
    "title": "Donna Everhart does it again",
    "rating": "5.0 out of 5 stars",
    "content": "Great story and great writer. I could see and feel the emotions of every character in the story. I just put in an order for several more books written by Donna Everhart. She has me hooked!",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed this story from beginning to end. Increíble and realistic characters!!! Recommend to all!!!",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "149674070X"
},
{
    "title": "Civil War fiction",
    "rating": "5.0 out of 5 stars",
    "content": "I literally read this book in one day. I love anything that's got historical vibes. This book follows a family's trials during the Civil war....highly recommended.  This is a book I will share.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like the story line so far. I have yet to finish it. Another interesting book was suggested so I switched.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "149674070X"
},
{
    "title": "Interesting read. Well written",
    "rating": "5.0 out of 5 stars",
    "content": "I have enjoyed reading and own all of Donna Everhart's",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "publications, just finishing her latest January 2024 release- When The Jessamine Grows. Her books",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "149674070X"
},
{
    "title": "\"Hats Off\" to Donna Everhart's Historical Southern Fiction",
    "rating": "4.0 out of 5 stars",
    "content": "capture life in the South, as her characters endure hardships and adversities. Being a North Carolina native myself, I found her geographic relevance to my own location and travels within the state, with accuracy and detail. It's clear that a great deal of research has been spent in regards to the given historical time period and location. Both heartwarming and heartbreaking stories unfold in each book, making for eager anticipation with each page turn. I look forward to her next release.",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Good read but too many actual battle actual accounts that makes parts boring.",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "149674070X"
},
{
    "title": "very good historical information",
    "rating": "5.0 out of 5 stars",
    "content": "Slow start, interesting enough to finish.  I won't be purchasing other books written by this author.",
    "post_time": "Reviewed in the United States on May 12, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The first 3/4 of this book was,like watching paint dry…extremely slow paced & overly detailed. It was an okay book, but not great. It felt as if the author was trying to make a statement (using the Civil War as the backdrop) to compare it to the current split political climate .",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "149674070X"
},
{
    "title": "I wish it had been based on actual facts.",
    "rating": "5.0 out of 5 stars",
    "content": "Great character development. Somewhat uncomfortable on the close correlation of southern politics currently.  i had to stop reading on occasion trying to process the severity of  historical events and how certain perspectives persist to this day!",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In the middle of this book right now.  It is very good in my opinion.  I have read all of her books as I really enjoy them.  Love reading about history with an interesting story behind it.  I don't know how they all lived through it.  Thank you, Ms. Everhart, for writing all of these stories for us.  You are appreciated.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "149674070X"
},
{
    "title": "Great book!",
    "rating": "5.0 out of 5 stars",
    "content": "Have read several of her books.  All were very good, but this one may be her best.  Great read!",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Donna Everhart writes in a way that makes you feel like you are a part of her characters.  This story is about the brutality of the Civil War but focuses on the lives of the people affected by it and  their unwavering strength to endure.",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "149674070X"
},
{
    "title": "Gripping read of hardship during war",
    "rating": "5.0 out of 5 stars",
    "content": "I haven’t read it yet but it was highly recommended!",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book and enjoyed the characters, I felt like I was there in the story.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "149674070X"
},
{
    "title": "Looks good!",
    "rating": "5.0 out of 5 stars",
    "content": "The descriptions were amazing !",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Thoroughly enjoy the story, how you went about it.  Bringing Charlie into it to fill a void left my Henry’s “disappearance “.",
    "post_time": "Reviewed in the United States on February 22, 2024",
    "pid": "149674070X"
},
{
    "title": "I couldn’t put this book down, the descriptions were clear and not wordy.",
    "rating": "5.0 out of 5 stars",
    "content": "Great book.  Thanks and congratulations!",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is our history,  present,  and our future. Each one of us standing on our values, integrity, and inner perseverance  in these uncertain times,  we can not quit believing in our heavenly father. He has given us strength to persevere .  thank you for writing this book and reminding each one of us to never give up",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "149674070X"
},
{
    "title": "great novel",
    "rating": "5.0 out of 5 stars",
    "content": "I kept forgetting I wasn’t reading a memoir. It was so personably written it was hard to tell the difference. Love it!",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Civil War was truly a terrible time for our young nation.  How did these people in the south manage?",
    "post_time": "Reviewed in the United States on February 14, 2024",
    "pid": "149674070X"
},
{
    "title": "Great read!",
    "rating": "5.0 out of 5 stars",
    "content": "Think Cold Mountain!  Well written and fast paced.",
    "post_time": "Reviewed in the United States on April 30, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": " A strong woman with strong opinions still resonates today.  Couldn't put this book down.",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "149674070X"
},
{
    "title": "Great book!",
    "rating": "5.0 out of 5 stars",
    "content": "This was the first book I've read by Donna Everhart and loved it. I will be reading more by her.",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book based during Civil War times because it was from a perspective I've never read before. Great story kept me involved the whole way. Great ending.",
    "post_time": "Reviewed in the United States on April 23, 2024",
    "pid": "149674070X"
},
{
    "title": "Beautifully written",
    "rating": "5.0 out of 5 stars",
    "content": "Very clean as far as romance is concerned.",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "When the Jessamine Grows is consistent with Donna Everhart’s other books but this may be the best. I love the imagery and that I could empathize with Joetta  along with other characters. There are no wasted words and no persuading in feeling a certain way. It’s just a great book.",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "149674070X"
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "This is an excellent story, well written story set in an interesting era. She has become a favorite author, great story teller.",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s a page-turner for sure. An anti-war novel with an inspiring woman protagonist, and also a fascinating and unique perspective on the American Civil War. A couple if less than plausible plot turns but I really enjoyed this historical novel.",
    "post_time": "Reviewed in the United States on February 16, 2024",
    "pid": "149674070X"
},
{
    "title": "Gripping novel",
    "rating": "5.0 out of 5 stars",
    "content": "I loved the story and Everhart's style of writing. I felt like I knew the characters and could relate to their feelings. The story had many twists which I found surprisingly hard to put this book down.",
    "post_time": "Reviewed in the United States on February 16, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book! It really got down to showing the depth of this war and its ravages. Just following along with one families challenges made me stop and think of just what these people went through during this time in history. Loved it from beginning to end. Would definitely recommend.",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "149674070X"
},
{
    "title": "Donna Everhart has done it again . . .",
    "rating": "5.0 out of 5 stars",
    "content": ". . . but this one is different, and different from most civil war era books as well--it is the heart-rending story of a mother who struggles to keep her family intact through the senselessness of the war, yet never losing her sense of integrity of what she believes in.",
    "post_time": "Reviewed in the United States on January 25, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful book, incredibly well-written. Provides a different perspective of the war that needs to be told. I love all of Ms. Everhart’s book",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "149674070X"
},
{
    "title": "excellent",
    "rating": "3.0 out of 5 stars",
    "content": "The story is based on a farm couple living in North Carolina during the Civil War.  Farming with their two sons, one that wants to join the south..",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Joetta was a loving mother and wife with a strong moral compass.  She did everything to keep her family together and follow what she believed was right. The book is a must read  and should be a best book of the year",
    "post_time": "Reviewed in the United States on January 26, 2024",
    "pid": "149674070X"
},
{
    "title": "Surviving war.",
    "rating": "5.0 out of 5 stars",
    "content": "A",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have read all of Donna Everharts books and I really enjoyed this one. All of her books are awesome. Wish there were more to read!",
    "post_time": "Reviewed in the United States on March 23, 2024",
    "pid": "149674070X"
},
{
    "title": "Excellent!",
    "rating": "3.0 out of 5 stars",
    "content": "Good historical novel of life in the south during Civil War.  Kind of repetitive in many places yet an eye-awaking how some survived during such challenging times.",
    "post_time": "Reviewed in the United States on March 31, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "love this book ...such a great story",
    "post_time": "Reviewed in the United States on May 2, 2024",
    "pid": "149674070X"
},
{
    "title": "Great service ands product. Thank you",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely loved this book and couldn't put it down.  Now I only wish I had another one just this good to read!",
    "post_time": "Reviewed in the United States on March 15, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Raw and real exploration of hardships lived during conflict. I wondered if I could have been as loving and persevering when faced with harsh realities of maintaining values as a minority. Thanks for bringing this viewpoint to life.",
    "post_time": "Reviewed in the United States on February 6, 2024",
    "pid": "149674070X"
},
{
    "title": "Amazingly told",
    "rating": "5.0 out of 5 stars",
    "content": "This book is so well written. It kept me on the edge the entire book and the twists at the end was shocking. I found myself in each character and had empathy for them all. Seeing the prejudice and hatred was hard.",
    "post_time": "Reviewed in the United States on January 25, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy page turner. Interesting story.",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "149674070X"
},
{
    "title": "Great read",
    "rating": "3.0 out of 5 stars",
    "content": "Redundant.  Hard for me to get into but I stuck it out. Not a book I would recommend. Hey, but that’s just me.",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great story about the times of the War Between the States and one woman's strong will and determination to survive.",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "149674070X"
},
{
    "title": "Slow For Me",
    "rating": "5.0 out of 5 stars",
    "content": "This book makes me want a sequel. I want to know what happens next to these characters. I’ve read all of Donna Everhart’s books and this one did not disappoint.",
    "post_time": "Reviewed in the United States on January 27, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nice read!",
    "post_time": "Reviewed in the United States on April 26, 2024",
    "pid": "149674070X"
},
{
    "title": "Engaging and well written story!",
    "rating": "3.0 out of 5 stars",
    "content": "Not like Paulette Jiles or Cold Mountain.  It plods along and the characters are predictable and boring.",
    "post_time": "Reviewed in the United States on April 2, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was held captive from the very beginning.  A different perspective on a difficult time in our history. Highly recommend it.",
    "post_time": "Reviewed in the United States on February 11, 2024",
    "pid": "149674070X"
},
{
    "title": "Civil War  From A Strong Woman’s View",
    "rating": "5.0 out of 5 stars",
    "content": "Looking forward to reading it. Sounds great!",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "149674070X"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A truly unique and realistic view of the Civil War from the protagonists eyes and heart. I whole heartedly recommend this book.",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "149674070X"
}
]