[
{
    "name": "  Then She Was Gone: A Novel ",
    "stars": [
        "63%",
        "26%",
        "9%",
        "2%",
        "1%"
    ],
    "pid": "1501154656",
    "ratings": "113,794 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Gone",
    "rating": "5.0 out of 5 stars",
    "content": "So many emotions one goes through reading this book. A nice family with all the dynamics of life.  Emily a typical teenager with a bright future is taken by an unstable woman.  The author explains perfectly what all go through and why some do what they do.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Intriguing all the way through. One can guess some but have to read through to the end for the whole picture.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "1501154656"
},
{
    "title": "Such a great book",
    "rating": "5.0 out of 5 stars",
    "content": "I really love this author and the story sucked me in and didn’t let me go",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Definitely a page turner. I cried a few times too. Read most of it while sitting with a friend at hospital.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "1501154656"
},
{
    "title": "Good read",
    "rating": "5.0 out of 5 stars",
    "content": "I was suggested this book by a friend, I wasn't sure I would enjoy it as I am not a huge fan of 3rd party POV stories.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This turned out to be a mix between 3rd party and 1st person POV reminiscing.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "1501154656"
},
{
    "title": "Heart wrenching",
    "rating": "5.0 out of 5 stars",
    "content": "To say that this story broke my heart would be putting it mildly.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have never sobbed for a thriller but this had me enthralled and I could not out it down.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "1501154656"
},
{
    "title": "Hard To Put Down",
    "rating": "4.0 out of 5 stars",
    "content": "So often we hope for a happy ever after ending, and I suppose we get there but it's just not the ending you truly want.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "That does not detract from the powerful story that this tells and I urge anyone that is interested to fully give this a go, give it the time it deserves, to unravel and wind its way through your mind, to burn its way into your heart.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "1501154656"
},
{
    "title": "Then  she was gone",
    "rating": "5.0 out of 5 stars",
    "content": "This book started out real slow,but as you read on it got way more interesting.  I will definitely read more of her books.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book kept my attention the entire time I was reading it. I couldn’t put it down. I was anxious to find out what happened to that precious child",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "1501154656"
},
{
    "title": "wonderful",
    "rating": "5.0 out of 5 stars",
    "content": "Laurel experiences the unthinkable: her fourteen-year-old child goes missing. Not just her child — it is THE child, the one she favors over her three children. Ellie goes to school one day and never comes back. She’s there one moment, and then she’s gone. Ellie is a smart, carefree girl with a crush on a guy who shares her passion for academics and good grades, so she’s no runaway. The years go by, and just when the police give up, Laurel gets some rather devastating news...",
    "post_time": "Reviewed in the United States on July 20, 2020",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The years pass. Laurel trudges through her days, picking up the pieces of her broken life. She tries to make amends with her daughter Hannah and her son Jake, but they’re all grown now, with their own lives to worry about. Her marriage is long over, her ex now in a steady and loving relationship with a pleasant lady. Laurel's life couldn't be worse if she tried...",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "1501154656"
},
{
    "title": "The perfect beach holiday pick! Harrowing and riveting from beginning to end!",
    "rating": "4.0 out of 5 stars",
    "content": "And then she meets Floyd. It’s a chance encounter, a semi meet-cute at a café. He tells her about his books — academic books about math — and about his #1 fan: his nine-year-old daughter, Poppy. Hope flares for Laurel. Will she find happiness with Floyd? And then she meets his daughter — and it’s like taking a trip to the past. Poppy is almost the splitting image of Ellie. Laurel is floored. How is it possible? This is only the beginning though. She’s opened a Pandora’s Box of disturbing revelations that even she wouldn’t have been able to imagine.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’m not a fan of child abduction thrillers, but THEN SHE WAS GONE is one harrowing and amazing read! I couldn’t put it down. This book was on my TBR pile for over a year. I took it with me for my French Polynesian holiday because, why not? I’m so glad I did. The sea-salt breeze, the hammock, the sunset, this book — sweet memories are made of this! I took three books with me, and this one practically read itself. The writing is amazing, well crafted and riveting, with no over the top twists for shock value. Everything serves a purpose in this book. Many of us will guess the outcome, but that’s beside the point. There are so many surprises — so many “mini twists” — that you’ll love it for the character-driven piece of brilliant suspense that it is. The psychological aspects are amazing. There’s a character with Borderline Personality Disorder in this book, and the author touches on various subjects, like triangulation and toxic enmeshments. It’s all done in an organic, not-in-your-face way, which makes it more appealing. I’ve always loved Lisa Jewell, have loved her since her early “chick lit” days. I’m glad she now gets to write the genre she loves.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "1501154656"
},
{
    "title": "perfect state",
    "rating": "4.0 out of 5 stars",
    "content": "Downsides? Just one. Floyd is a socially awkward mathematician, but he says “Brangelina” at one point. I can’t picture a man — let alone a middle-aged one — saying something like this. I’m surprised the editor didn’t pick up on it. Other than that, I love this novel. One of my favorites this year. Five solid Pecan and Toffee iced lattes, with extra vanilla-flavored oat milk!",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "it’s in perfect state, no scratches or anything, so grateful!!",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "1501154656"
},
{
    "title": "What an Emotional Rollercoaster!",
    "rating": "4.0 out of 5 stars",
    "content": "LOVED this book!  This is the first book I read by Lisa Jewell and it did not disappoint! From the epilogue I was hooked! I loved reading from different character POVs but I know it’s not for everyone but I enjoy jumping around. The only thing I suppose I wish was different is just a bit more pov from certain characters. But I can’t wait to jump to another Lisa Jewell book!",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kept my attention, all the way through.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "1501154656"
},
{
    "title": "Ok",
    "rating": "4.0 out of 5 stars",
    "content": "Good",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Such a good book!  I ordered another Lisa Jewell before I finished this one because her style hooks you.  Ordering another now!",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "1501154656"
},
{
    "title": "This booked started my obsession with Lisa Jewell",
    "rating": "4.0 out of 5 stars",
    "content": "Different points of view along the story. Wish there was more of the story from Ellie's point of view before she was taken. Plot twists along the way. Some you could guess at some you couldn't. Overall a pretty good read.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The book was predictable, hence, why only 4 stars, but the very end is a tidy end to an entertaining book.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "1501154656"
},
{
    "title": "Some spoilers",
    "rating": "5.0 out of 5 stars",
    "content": "Purchased for my daughter",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was the first Lisa Jewell I read but it definitely won’t be the last. It was a page turner. I didn’t want it to end.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "1501154656"
},
{
    "title": "Wow!",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed this book very much.  good character development.  Lisa Jewell has a way with words, did not want to put down the book!",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I loved the book I was a little confused at first but I think that because to many distraction were going on when I first started the book. It was really good",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "1501154656"
},
{
    "title": "Loved it",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book it was so suspenseful and captivating. You never know what was going to happen. It was also sad. I didn’t like the ending.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Worth the read!",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "1501154656"
},
{
    "title": "Then She Was Gone",
    "rating": "4.0 out of 5 stars",
    "content": "I was so excited to have this book but when I finally got it, I was almost in tears to see the bottom of the jacket had a long tear, and the pages were crumpled. Very heartbreaking.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The book got delivered with one of the covers ripped half off.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "1501154656"
},
{
    "title": "Book quality",
    "rating": "5.0 out of 5 stars",
    "content": "Do you want a mystery that really isn't full of detectives and murders?  This is an unusual story of a missing girl and how different characters come together, of course.  But the cast is strange and complicated and difficuuntil they begin to reveal themselves.  Enjoy! ( And I rarely give 5☆.)",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Absolutely loved this book. Couldn’t stop reading it.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "1501154656"
},
{
    "title": "Twisty, Unusual",
    "rating": "5.0 out of 5 stars",
    "content": "Just finished. Still reeling. This will haunt me for weeks, if not months. Glad I chose this book to read!",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great book. Couldn’t put it down !  The author creates the mystery and the way it is solved is crazy… plus you find out more awful events have happened",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "1501154656"
},
{
    "title": "Fantastic Book.",
    "rating": "5.0 out of 5 stars",
    "content": "This is the quickest book that I’ve finished so far. I absolutely love it. I had a hard time putting it down.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was excellent! Kept me guessing the whole way through.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "1501154656"
},
{
    "title": "reeling sadness",
    "rating": "5.0 out of 5 stars",
    "content": "\"Then She Was Gone\" is a novel about a fifteen year old girl named Ellie Mack who disappears in 2005.",
    "post_time": "Reviewed in the United States on November 19, 2018",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Much of the book takes place in 2015, and is told from the point of view of Laurel Mack, the missing girl's mother.  Ellie was Laurel's youngest daughter.  Ellie's remains have finally been found, so maybe the family can now have some closure.  Not that the family unit is still intact. Laurel was so filled with grief over the last ten years  that she had nothing left of herself for her husband or her other children.  Now Laurel is divorced, and is estranged from her older daughter and son.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "1501154656"
},
{
    "title": "D",
    "rating": "5.0 out of 5 stars",
    "content": "Riveting and I am not usually a fan of this genre. Thought provoking. Loved it.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I did not like it in the beginning, it was very confusing but I wanted to know what happened sooo I pushed through and so glad I did because it took me on a ride that just kept getting more wild! 🤯",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "1501154656"
},
{
    "title": "OMG",
    "rating": "5.0 out of 5 stars",
    "content": "Finished reading the novel. Noelle had a very sick mind. Brings out the darkest part of a person . Floyd should  not  have done what he did.  Recommend reading the novel.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "An  gripping  murder mystery, with interesting  people.",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "1501154656"
},
{
    "title": "The author brings out my emotions",
    "rating": "5.0 out of 5 stars",
    "content": "Once I picked this book up I could not put it back down and it quickly became one of my favorite books.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Soo good!!!",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "1501154656"
},
{
    "title": "Then  She was  Gone",
    "rating": "5.0 out of 5 stars",
    "content": "Ten years after her teenage daughter disappears, a woman crosses paths with a charming single father whose young child feels eerily familiar, in this evocative, suspenseful drama from New York Times bestselling author Lisa Jewell—perfect for fans of Paula Hawkins and Liane Moriarty.",
    "post_time": "Reviewed in the United States on October 26, 2017",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "  Ellie Mack was the perfect daughter. She was fifteen, the youngest of three. She was beloved by her parents, friends, and teachers. She and her boyfriend made a teenaged golden couple. She was days away from an idyllic post-exams summer vacation, with her whole life ahead of her.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "1501154656"
},
{
    "title": "Great read",
    "rating": "4.0 out of 5 stars",
    "content": "  And then she was gone.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "  Now, her mother Laurel Mack is trying to put her life back together. It’s been ten years since her daughter disappeared, seven years since her marriage ended, and only months since the last clue in Ellie’s case was unearthed. So when she meets an unexpectedly charming man in a café, no one is more surprised than Laurel at how quickly their flirtation develops into something deeper. Before she knows it, she’s meeting Floyd’s daughters—and his youngest, Poppy, takes Laurel’s breath away.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "1501154656"
},
{
    "title": "Amazing!",
    "rating": "5.0 out of 5 stars",
    "content": "The story will take a grip on you from the very first pages. Constantly as you read you will asking yourself what's happening? What can possible happen next? And you'll be surprised, startled, mystified or confused. The author did a masterful job of tying up all of the threads at the end. It was a bit dark, but nonetheless a brilliant plot.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Read in one day because I couldn’t put it down. I kind of guessed the “mystery” part way through the book but the “actual” woah! 🤯 very good book. Great ending! Recommend.",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "1501154656"
},
{
    "title": "Not a 4 but not a 5. A good read. Gasping guaranteed",
    "rating": "5.0 out of 5 stars",
    "content": "I lost interest about half way through, but I never noticed finish a book I started reading. So glad I finished it!",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is just as described and very fast shipping.. it arrived 2 days after I ordered it.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "1501154656"
},
{
    "title": "don’t give up half way through",
    "rating": "2.0 out of 5 stars",
    "content": "The writing is terrific, though at times it's a little confusing to figure whose point of view the chapter is in, and the time shifts are distracting as well. I didn't find Laurel that nice or interesting. She lets her family fall apart after Ellie disappears. Surely Hanna and Jack picked up on how much she favored \"golden Ellie.\" She seems very self-absorbed and not very kind.",
    "post_time": "Reviewed in the United States on June 7, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "No one seems to go to work regularly. Floyd is an enigmatic figure who claims his mother was \"14 when he was born\"? What relevance does that have to the story? None, it's a red herring. Laurel does find information about him when she googles him. He is too good to be true and their relationship advances too quickly. Laurel hops into bed with him and meets his family too quickly for someone of her negative and closed up personality. Poppy is not cute but rather bratty and annoying.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "1501154656"
},
{
    "title": "Just as described !!! Fast Shipping",
    "rating": "4.0 out of 5 stars",
    "content": "Without giving away too much, the red flags about Noelle are waving often and early. Though I didn't quite expect her to do what she did, I wasn't surprised. She is pure evil and how she accomplishes what she does is not fully explained.  The not-too-subtle clues are dropped conspicuously.",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I found the ending too tidy a wrap up and not much of a surprise at all. Hanna is suddenly sweet and warm, Poppy is embraced by all, Laurel is now sweet and thriving in her new role? Nah, it's all just too much.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "1501154656"
},
{
    "title": "Too many unanswered questions, unlikeable main character and an unsatisfactory ending",
    "rating": "5.0 out of 5 stars",
    "content": "Considering all the rave reviews, I was disappointed in this book.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed this book immensely even though it dragged a very few times.",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "1501154656"
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "Interesting well written hard to stop reading once the book was picked up and started reading.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have never written a book review before but this book was amazing, I will definitely be recommending it.  LOVE IT",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "1501154656"
},
{
    "title": "Amazing read",
    "rating": "5.0 out of 5 stars",
    "content": "My daughter loved the book",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Couldn’t put the book down. Love the short chapters. Makes me want to read all the more.  Lots of twists in this story.  While a tragedy a good ending.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "1501154656"
},
{
    "title": "Book",
    "rating": "5.0 out of 5 stars",
    "content": "I really liked this book! I am sitting here writing this with tears in my eyes, because the ending in the epilogue, I was hoping for that, and I’m glad Lisa gave it to us readers. As a mom this was a hard book to read, because it literally is a nightmare for me as a mom, your daughter who you love, suddenly disappears and there is no trace of her. For years, they tell you that she has probably run away, but you know that couldn’t be the case, there is something wrong. Years and years go by and as the rest of the world and your family move on, even your husband, but you still have a missing piece of your heart, questions left unanswered. I felt all the feelings that Laurel was having. Then when you least expect it, a man enters your life, with a beautiful daughter, and everything changes.",
    "post_time": "Reviewed in the United States on February 13, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This one really gets to you. Touches you in places that bring out all of the feelings under the sun; happiness, sadness, dread, wonder…. I loved it. Absolutely loved it. Read it in less than 2 days!!",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "1501154656"
},
{
    "title": "captivating!",
    "rating": "3.0 out of 5 stars",
    "content": "I just started reading this book so far i like it. it does have alot of big words hard to know what they mean unless i look each one up but there is to many… I wish the font size was bigger to it hurts my head to read to long… but still a good book.. update after reading about 100 pages i just couldn’t keep reading it I couldn’t get into the story so i just looked up the ending instead…",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this book! This was my first time reading anything from this author but I enjoyed it and loved the characters and the outcome. I will have to look for other books from her.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "1501154656"
},
{
    "title": "A mother’s worst nightmare…",
    "rating": "5.0 out of 5 stars",
    "content": "Catching, intriguing, easy to read and follow the story. Nicely written, interesting characters. If you like mystery stories- this one is for you.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "1501154656"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love reading! A good read",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "1501154656"
}
]