[
{
    "name": "  The Quarry Girls: A Thriller ",
    "stars": [
        "51%",
        "33%",
        "12%",
        "2%",
        "1%"
    ],
    "pid": "1542034299",
    "ratings": "57,746 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "fast paced reading",
    "rating": "4.0 out of 5 stars",
    "content": "It was a good book.. I have read so many books about women being abducted it’s frightening.. But. Like this on it’s really sad to think what is really out there and being a woman.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book kept me on the edge of my seat until I got to the last couple of chapters…totally unnecessary blasphemy turned me off…I had to take off one star for that.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "1542034299"
},
{
    "title": "Good book",
    "rating": "5.0 out of 5 stars",
    "content": "couldnt put it down love this book and not a true story/ fiction  person but would reread this again",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "There were three (three!) serial killers in St. Cloud, MN in the '70s. This is a work of fiction, inspired by the victims and the author's own experience growing up in Pantown, St. Cloud.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "1542034299"
},
{
    "title": "great read",
    "rating": "5.0 out of 5 stars",
    "content": "A great book keeps you invested. You don’t want to put it down. With audio you won’t have to looking forward to reading more books of Jess Lourey",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The kind of thriller that makes you anxious to read the next line.  The kind that makes you close the book, walk away, gather your nerves and go back for more. It has characters you actually find yourself rooting for.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "1542034299"
},
{
    "title": "Based on true stories",
    "rating": "4.0 out of 5 stars",
    "content": "Kept me guessing the whole time, even when i had it all mapped out! The drama and thrill are equally matched, this was definitely a page turner!!",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Author Jess Lourey grew up in Saint Cloud, Minnesota at a time when three serial killers stalked the young girls and women in her terror-filled town.  In her Author's Notes preceding the narrative of \"The Quarry Girls,\" Lourey explains that is why she chose to write a book of fiction based loosely on real life events. Lourey places the story in Saint Cloud in 1976 to 1977 and tells the story mainly from the point of view of Heather, a 16-year-old who is struggling with that painful period \"in between\" childhood and adulthood.  A secondary narrator is Beth, an 18-year-old ready to depart the small town for college when she is abducted and held captive in a small room. Beth's disappearance after working a shift at the diner doesn't raise many alarm bells with adults, other than Beth's parents.  The belief was that she just ran away or left for college early.  Heather explains that in her neighborhood, called Pantown, which was named for a failed automotive company that had built housing for workers complete with underground tunnels to make sure workers could arrive on time when it snowed, everyone seemed to mind their own business and look the other way.  Tough issues were ignored, such as one woman's hoarding and Heather's own mom's mental illness. Despite the bright outward appearances that everyone was so desperate to keep up, many dark and dangerous things lurked beneath the surface.  Together with her two best friends, Maureen and Brenda, Heather formed a girls' garage band. They played for fun and for their parents, but as they got older, they started to draw the attention of local teenaged boys, whose change in behavior from children to teenagers Heather found disturbing.  Why couldn't they all just play together like they did when they were kids without the yearnings of adolescence affecting them all? Indeed, they still engaged in some childish games in the tunnels beneath the company housing, which had always seemed safe, but start to become areas of concern.  Heather was sure she witnessed something quite horrific going on in a basement of one of the homes off the beaten path. Soon after, Maureen goes missing, followed in short order by Brenda.  Eventually, two girls are discovered dead, and Beth is still missing. When Heather's 12-year-old sister is targeted, Heather takes matters into her own hands.  Outside help is needed, because as Heather laments on page 260, \"That's when I understood the raw truth of it: the men in charge were looking out for themselves. We were on our own, the girls of Pantown.\"  I've intentionally left out the names and descriptions of some major characters, not wanting to give additional spoilers.  Suffice it to say, I was really disappointed in some of the adults that should have been the good guys. Any book about kidnapping and murder of girls is bound to be depressing, but Lourey makes it suspenseful and serves up some karma to the bad guys.",
    "post_time": "Reviewed in the United States on October 10, 2022",
    "pid": "1542034299"
},
{
    "title": "loved",
    "rating": "4.0 out of 5 stars",
    "content": "3.5 rounded to 4.  As a fellow Minnesotan, Jess Lourey's take on the State and the people is spot on.  I lived in St. Cloud MN for several years, in the Pantown area.  Many locals know the story of the real quarry girl murders.  I wanted to love the book, but I just liked it. It's a good book but had  few too many overt references to the 70's, which brought me out of the story a little bit.  The tunnel aspect was creepy (and interesting).  I will read her other thrillers based on other MN true crimes.  And if you like silly fluff, I enjoyed her Murder of the Month series (probably a little better).  But those are totally different type of book.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was so good! I didn’t want to put it down.  I highly recommend this book and I hope to read more from this author.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "1542034299"
},
{
    "title": "refreshingly great mystery with depth",
    "rating": "5.0 out of 5 stars",
    "content": "This book was very well written.  The prose lifted the mystery to a higher level than your average mystery.  The characters and their experience felt real.  As a 70s child I think the tone captured the 1970 suburbs.  I can’t wait to read Jess Lourey’s next novel.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I liked that it took place in a familiar area. It made it easier to imagine the area and subjects. I like a thriller. It was a little slow to start, but picked up rather nicely…not the ending I expected.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "1542034299"
},
{
    "title": "A slow start…",
    "rating": "5.0 out of 5 stars",
    "content": "Once it got going I couldn’t put it down.  This story revolves mostly about 3 teen aged girls, growing up in an unusual town.  It was built to accommodate the families of a factory in an area with harsh winters. So all the homes had basement access to tunnels that connected to the factory and each other. The kids played in the tunnels and became close friends.",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "  Three young teenager girls are super close and have lots of other friend too.  They live near quarries.  Some are abandoned and some still active.  The kids all like to hang out there and some are brave enough to swim in the deep black holes. They hang out there and as you might expect some smoke weed and drink alcohol.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "1542034299"
},
{
    "title": "This was a great book.",
    "rating": "5.0 out of 5 stars",
    "content": "  One night the kids open a basement door that’s not their own and one of them sees something she shouldn’t.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "  A local girl goes missing then one is found dead in the quarry.  Things get more and more complicated and scarey. Who can they trust and who is dangerous?",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "1542034299"
},
{
    "title": "The Quarry Girls",
    "rating": "4.0 out of 5 stars",
    "content": "  I couldn’t put it down since so much was happening so fast.  I think you like it.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This story brought out all the emotions: anger, pride, sorrow, determination, love.  I enjoyed this novel & will be looking for more from this author.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "1542034299"
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "This audio book made a quick drive to go visit my daughter.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This story was one about childhood friends and growing up. It had mystery, thrills, heartache, death but life. It shocked me that Heather's dad was more involved with the molestation than I thought. But I'm glad he and she sheriff who was involved in the secrets was exposed. Death and secrets no more in this small town was a beautiful ending.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "1542034299"
},
{
    "title": "A menacing, stifling and well written story.",
    "rating": "5.0 out of 5 stars",
    "content": "I started this book late last night after my kids went to bed. I was tired and figured I would fit in a few chapters and go to sleep. Boy was I wrong. Midnight turned to one... before I knew it I checked the time at 4:31 AM.  I had to put my phone down and close my eyes. Only to think about what was going to happen. Only to ponder the veracity of so many women with stolen childhoods.  So here are the thoughts I've gathered after finishing the book this morning. I would definitely recommend reading it if you haven't already.",
    "post_time": "Reviewed in the United States on January 26, 2023",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Quarry girls is a thriller by Jess Lourey, a race to find out why girls in this small Minnesota town are going missing. They are brushed away as runaways, as typical teens by authorities, until one is found dead. Secrets are literally buried in tunnels beneath a town that exudes the illusion of happiness. The plot is a bit predictable as I figured out a few main points half-way through, but it didn't change my level of engagement at all (hence the late hours of the night). There were still more missing pieces that kept me turning pages. Some people accustomed to thrillers may not feel the same, but I wanted to know what happened mainly because I loved the main characters, Heather and her sister Junie and their relationship. I am finding that I am a sucker for sister relationships after losing my own sister. I also have 3 daughters so seeing close sisters makes my heart warm. Another reason would be the themes of the dangers of the hypersexualisation of young girls, and the terrible acts of molestation, and the countless stolen childhoods from men often misusing power that are permitted to sweep it all under a rug. A common reoccurrence, especially during the 70's. There is a similar theme in my debut novel, I Am Because You Were that was also inspired by true events. Child sexual abuse facts are staggering and it continues to occur at every socioeconomic level across ethic and cultural lines. We need stories like these to spread awareness and protect our children.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "1542034299"
},
{
    "title": "A Real Page Turner",
    "rating": "5.0 out of 5 stars",
    "content": " Cons: In the beginning there are a lot of names that make it difficult to keep up. There are also no headings to tell you the POV. That's it, my only two cons.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Overall, I disappeared into this story and found it to be one I would recommend, a menacing, stifling and well written story.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "1542034299"
},
{
    "title": "Must Read!!",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book! The plot, the characters & everything about it. I almost read this in 1 sitting because I couldn't put it down. Definitely going to read more Jess Lourey books!  After I finished it, I definitely had a book-hangover (thats how vested I was in this story). A+ book",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Oh the tangled webs we weave! This book shook me to my core. What a page turner. Read the book!",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "1542034299"
},
{
    "title": "Below average read.",
    "rating": "4.0 out of 5 stars",
    "content": "I’m so surprised it has so many great reviews.  The tunnel town storyline sounded fascinating, that’s what made me pick it up. It was odd that it’s called Quarry Girls but didn’t have much to do with the quarries, seemed like it was going to be about the tunnels but didn’t have much to do with that either. Seems like choosing one or the other would have made the storyline more solid. I liked the main characters and the ending but it was just too slow for me, never caught fire like I expected it to.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "*TRIGGER WARNING: mentions violence against children, kidnapping, emotional abuse, infidelity, mental health abuse, physical abuse**",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "1542034299"
},
{
    "title": "She does it again!",
    "rating": "5.0 out of 5 stars",
    "content": "Something that Jess Lourey does so well with her books is that she can invoke the disturbing and gross icky feeling of these heinous, true crime-influenced stories without ever giving the reader heavily explicit details about what is occurring.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Each time I read a story from her catalog I feel so deeply for the characters because their experiences feel so raw and real. Many true crime stories such as this are told from the perspective of the children, the main protagonists, and their lived experiences. But what this story did was different. It bounced between two perspectives to tell a story. I feel like it helped move the story along because, with the one perspective, we got a glimpse into the side of a character who was an actual victim and the perspective of someone from the outside looking in.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "1542034299"
},
{
    "title": "Better than last few books, definitely!",
    "rating": "5.0 out of 5 stars",
    "content": "It seems to me that Jess Lourey has hit her stride again. I was pretty disappointed in some of her more recent books, so I almost didn’t read this one.  I’m glad I did.",
    "post_time": "Reviewed in the United States on November 19, 2022",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Outside of the -month of the year mystery books- that she writes (Of which I’ve read none) her books tend to run along the same theme with the same “accessories”.  This one also features teen girls in the 1970’s, really messed up adults in their lives, underground…so much of the evil occurs underground in Lourey’s books!  This one is no exception, but all these details are fleshed out and interwoven with skill and talent.  There is also more truth in the details in this book, though I did question a few things.  I am a child of the 70’s, I graduated high school in 1975 and this story takes place in 1977.  I recall exactly NOBODY had green streaks in their hair and would not be able to buy a home kit to put them there.  I also questioned a reference to the movie “The Hills Have Eyes” but I looked it up and sure ‘nuf…the original movie came out in 1977.  I really don’t like to find fault with this woman’s work, because I took an online writing class from her, and she was amazing.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "1542034299"
},
{
    "title": "Great Read",
    "rating": "5.0 out of 5 stars",
    "content": "What made this book stand out as wonderful for me is the way our main girl protagonists found their power.  They found their true core and it empowered them, and others, to shatter the myths their society had foisted upon them, saving themselves in more ways than one.",
    "post_time": "Reviewed in the United States on March 29, 2023",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a novel, yet it rings true.  All the stuff that really matters in this book is definitely true.",
    "post_time": "Reviewed in the United States on July 5, 2023",
    "pid": "1542034299"
},
{
    "title": "Five BIG stars for The Quarry Girls",
    "rating": "4.0 out of 5 stars",
    "content": "Not for the faint of heart.  Some may be triggered. It deals with rape, murder, stalking, and dangerous family dysfunction and betrayal. The scenes themselves are not graphic, but the emotions surrounding the acts are described in a manner that is very, very real.  If you are sensitive to nuances in words, brace yourself - or skip reading these parts.",
    "post_time": "Reviewed in the United States on October 1, 2022",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very well written! So glad this author is back!",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "1542034299"
},
{
    "title": "Dark and nostalgic thriller",
    "rating": "5.0 out of 5 stars",
    "content": "It’s set in the seventies the author really made that decade come to life it’s an incredible book❤️❤️❤️",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Do you ever finish a book, and just stare into space reveling in how good it was? It is so satisfying when you know a book is going to be absolutely fantastic, and it still manages to blow away your expectations.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "1542034299"
},
{
    "title": "A disturbing thriller, based on serial killers in the 1970s",
    "rating": "4.0 out of 5 stars",
    "content": "The Quarry Girls has a lot going on to start. Set in a small town in the 1970s, there are a lot of characters, and everyone knows each other’s business. Nationally, the term “serial killer” is just starting to make waves, but this is the 70’s- everyone hitchhikes, no one locks their doors. Not all is well in Pantown, Minnesota (a real place!) when our story opens with a young woman being kidnapped. Most of the story is told by Heather, 15-going on 30- years old, struggling to keep her family from falling apart, and to keep up with her maturing friend circle. As trouble befalls her friends though, Heather takes on another task- to set things right in a town that, Heather learns, is rotten at the roots.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Especially as she composes shock, grief, disgust, and horror reactions in her characters, Lourey’s writing style is poetic and earnest. The imagery of the scenes the characters operate in bring the story to life, from the sounds and smells of the county fair, to the oppressive heat and judgment in the church pews. Though The Quarry Girls takes place in the past, the feminine rage at the injustice the friends face in this book as they transition from girls to women is timeless.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "1542034299"
},
{
    "title": "Unexpected",
    "rating": "4.0 out of 5 stars",
    "content": "Lots of unexpected things happened in this book about a small towns terrible secrets but it did a great job of summarizing any questions one may have",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "When I started to read this book. I wasn't sure if I would like it. But, I kept reading it and was amazed how intriguing the story line was!  Based in Minnesota during the 70's  and  a small town which they refer to as Pantown  where kids and teenagers hang out in the local quarry  for fun and swimming. A young girl goes missing! In  this small  town where everyone knows each other!  A waitress in a local diner also goes missing as well, and later found dead! The police don't take the missing girls crime seriously! The protagonist in the book named Heather takes it quite seriously because one of the girls missing is her best friend and band mate!",
    "post_time": "Reviewed in the United States on November 20, 2022",
    "pid": "1542034299"
},
{
    "title": "Interesting story! Great thriller and fiction which is based on a true crime!",
    "rating": "5.0 out of 5 stars",
    "content": "I don't want to give too many spoilers but, I can say I definitely enjoyed this book. I couldn't put it down! This is the first time I read this author! I plan to read her other books,  which I hope are as great as this one.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you like reading thrillers , I recommend you try reading this book.",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "1542034299"
},
{
    "title": "well written",
    "rating": "4.0 out of 5 stars",
    "content": "I got it free on (first reads ) since I' m a Prime Member.  You get to pick one free book each month with membership. The books are always new releases by different authors!  Categories vary, some are crime, thrillers, fantasy, true crime, humor, children literature, etc.  One month we were allowed to picked  2 books  for free!  I look forward to picking out a book for free each month.",
    "post_time": "Reviewed in the United States on November 24, 2023",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I really enjoyed the way this story flowed. While it was a story of tragedy it also described a teenage summer, on the verge of your whole world changing.",
    "post_time": "Reviewed in the United States on March 25, 2024",
    "pid": "1542034299"
},
{
    "title": "Excellent!!!  MUST READ!!!",
    "rating": "1.0 out of 5 stars",
    "content": "I couldn’t put this book down!!!  My husband is mad at me for making him wait hours to watch a movie. But this book was everything!  Coming of age, mystery, drama, and comedy. It made me feel good and bad, happy and sad. The best kind of book. I feel like I am a teen again who just stepped out of 1977 and met some cool people and learned a lot. I can’t wait to read more of Jess Lourey. I thank her for two incredible books so far. Her talent is inspiring!!!",
    "post_time": "Reviewed in the United States on November 3, 2022",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was set in a town that I am very familiar with, as I grew up very close by.  While I was unaware of the criminal aspects in this town, I found it interesting how she told this story.  I feel like I would have loved to have a bit more background on each of the friends that she had, but I think that it was written well from a teenagers POV.  I especially loved the idea of playing Hide-and-Seek in underground tunnels that connect all of the houses.  It sounds like it would be absolutely amazing.  This story kept me changing my mind on who did what, but when it all unfolded, it made a lot of sense.  Absolutely recommend this!",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "1542034299"
},
{
    "title": "Interesting",
    "rating": "5.0 out of 5 stars",
    "content": "3.5 🌟 I have conflicting feelings about this book. The story was great and the ending, as well as the message, were so good and so important. However, the bulk of the book was told in a rather unappealing way that almost completely discouraged me from finishing it. I am glad I finished it though, because the ending is great.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "To begin with, despite there being some dark themes in this novel, I would still classify this one as a thriller geared more toward young adults. I just could not understand the logic of our main character Heather. She continues to wander around alone even after girls her age have gone missing (or, in some cases, turned up dead); she removes critical evidence from a home, making it inadmissible as evidence and only thinking she should have called in an anonymous tip after the fact.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "1542034299"
},
{
    "title": "Edge of your seat",
    "rating": "5.0 out of 5 stars",
    "content": "My first book of this author and I have to say it hooked me quickly. Great perspective and characters. Hits square into a huge problem that still exists far too much in this world. Hopefully someday we will be equal.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The author, Jess Loury, introduces the reader, in her author notes, to where and when her fascination with serial killers began - St. Cloud, MN in 1977. I found this an interesting personal note. I like it when author’s do that at either the beginning or at the end of the book. I like getting those insights to the story and the author’s mind and thoughts.",
    "post_time": "Reviewed in the United States on November 11, 2022",
    "pid": "1542034299"
},
{
    "title": "The Quarry Girls",
    "rating": "3.0 out of 5 stars",
    "content": "The book summary lays out the primary storyline: the disappearance of teenaged girls in the summer of 1977 in St Cloud. The story flips back and forth between two MC’s; Beth and Heather. Beth is a 17yr waitress who was abducted as she was leaving work, late one night, which was revealed in the prologue, so this is not a spoiler. Heather is a 16yr old drummer of an all-girl band who is the primary caregiver for her 12yr old sister and her emotionally and mentally absent, manic-depressive, schizophrenic mother who rarely leaves her bed/bedroom. Heather’s father is a workaholic that spends little time at home. There was a triggering incident for the mother’s condition that isn’t revealed until the second half of the story, however, I won't be revealing that spoiler.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It was the comment in the book summary, “she learns that no one in her community is who they seem to be”, that had me suspicious of pretty much everyone from the get-go, especially the male characters, many of whom were drenched in toxic masculinity. By the second half of the story, around the 60% mark, I had settled on two different suspects because I truly believed there were two suspects at work. The end gets pretty scary and intense but, satisfying and fulfilling. A solid 3star rating about the breakdown of a small mid-western town in the 70’s, where the chauvinism and misogyny was so rampant that it nearly silenced one generation of women and set its sights on doing the same to a whole new generation of women/girls.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "1542034299"
},
{
    "title": "So slow and predictable",
    "rating": "3.0 out of 5 stars",
    "content": "One of the best things I’ve enjoyed about being a GR member (besides the humungous database of book recommendations) is following fellow members where I have discovered some really great books. On that note, I want to thank fellow GR member, Thomas, for introducing me to NetGalley. I also want to thank NetGalley and Thomas & Mercer for sending me this eARC.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "@NetGalley @Thomas&Mercer @QuarryGirls",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "1542034299"
},
{
    "title": "Loved the idea",
    "rating": "5.0 out of 5 stars",
    "content": "Overall the story was okay, I read the book in less than half a day. There were a lot of side stories that loosely made sense with the plot that with a bit more detail in them would have made it better. It was an extremely predictable book. Even the ending was lackluster with no real motive behind the murders. Did I enjoy it? It was okay. Would I read it again? No. Would I recommend it? Probably not.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really wanted to love this book, it is such a cool idea. The imagery of the tunnels below the houses, connecting the whole neighborhood. It just didn't make a lot of sense to me in the end. The character writing wasn't great in my option.",
    "post_time": "Reviewed in the United States on October 30, 2023",
    "pid": "1542034299"
},
{
    "title": "3 stars",
    "rating": "5.0 out of 5 stars",
    "content": "This was good! But in my opinion couldn’t be classified as a “Thriller” until the last couple of chapters. Also it wasn’t like your usual mystery because they pretty much pointed right the the perpetrator in the beginning of the book, so it did fall a-little flat, but all in all It was a decent read, not sure where all the hype comes from around it though.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I grew up in the 60’s in a small town that also kept secrets, where everyone pretended and covered up truth. So I know the inner storm these kids struggled with. It hit a very personal spot in my memory.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "1542034299"
},
{
    "title": "Worth the wait",
    "rating": "5.0 out of 5 stars",
    "content": "This book took a minute to get started. I wondered how all the different characters connected, but when they finally did it was dynamic. Every character was needed to make the story work. So glad I didn't DNF this book.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My wife loves the book and thought it was a good read.",
    "post_time": "Reviewed in the United States on May 12, 2024",
    "pid": "1542034299"
},
{
    "title": "Good read",
    "rating": "5.0 out of 5 stars",
    "content": "The plot was truly a thriller. A hard point to live up to",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": " when it's in the title.",
    "post_time": "Reviewed in the United States on February 1, 2023",
    "pid": "1542034299"
},
{
    "title": "Great first read of a new author for me.",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed the deep character development and twists and turns .",
    "post_time": "Reviewed in the United States on November 8, 2022",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'll be looking for other books by this author.",
    "post_time": "Reviewed in the United States on October 2, 2022",
    "pid": "1542034299"
},
{
    "title": "The Quarry Girls",
    "rating": "3.0 out of 5 stars",
    "content": "In some ways, this came across very much like a YA novel - probably because the primary narrative voice is a 15 year old girl, and she’s preoccupied with  transitioning from childhood to womanhood. But make no mistake, this is not and shouldn’t be mistaken for a YA novel. It should only be read with a litany of trigger warnings firmly in place, although happily the author understands how to get her point across without lengthy graphic descriptions of disturbing events. Generally speaking, this was a worthwhile read, if in many places a deeply uncomfortable one (which I imagine is intentional). But I’m not sure splitting narration between Beth and Heather was the way to go. Beth’s pieces were obviously meant to ensure that the reader kept feeling tension and didn’t forget the big picture. But they also muddied the narrative to an extent, drawing focus away from Heather’s story without giving much in return. While I really like Beth as a character, I think simply keeping her off camera until the right moment would have been equally effective and tightened up the rest of the narrative. This book is an emotional rollercoaster for sure, but I'm glad I read it.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Quarry Girls by Jess Lourey was an amazing read.  Set in the Summer of the mid1970s in Pantown, where the elite homes are connected by a series of walk through tunnels so people could get to work even in bad weather.  I loved the originality of this and it definitely added to the story for good and evil.  Pantown seems idyllic, until it doesn't, as that Summer evil comes to town and young girls go missing.  In the process of trying to solve the disappearances and deaths on her own our sweet and innocent protagonist,  peels back the layers of the onion that is her hometown, family, the life she has known and discovers secrets and lies that can tear the town apart.  Will she be able to expose the truth or will she be silenced by those who spun the web of lies?",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "1542034299"
},
{
    "title": "Twisty and Atmospheric",
    "rating": "5.0 out of 5 stars",
    "content": "I felt the characters in this story as well as the setting were extremely well developed.  The only reason I subtracted one star was I felt a bit of disappointment at the ending.  But I'm still thinking about the story so it's still a wonderful read for teens and adults.  Bravo Ms. Lourey",
    "post_time": "Reviewed in the United States on January 27, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Another amazing book from favorite author Jess Lourey is hitting the shelves and this reader is excited. Take my word for it --she just keeps getting better and better.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "1542034299"
},
{
    "title": "amazing and riveting story",
    "rating": "5.0 out of 5 stars",
    "content": "For the first time since the last Outlander Book I was glued to this book, can’t really explain it but it definitely resonated with me.  The scary part is that the scenario through most of the book is real and active in todays society and the author did a fabulous job taking us from fear to joy at the end",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Its so sad how twisted our world has become... This book makes you take a hard look at what might be going on right under your own roof that you are not aware of. Also how twisted and corrupt some of our government and law enforcement can be. The men in this book were abusing their power and sexual assaulting underage teens. It hurts my soul knowing that this happens everywhere in the world. We should b protecting our youth and letting them be kids for as long as possible.",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "1542034299"
},
{
    "title": "A need to read",
    "rating": "5.0 out of 5 stars",
    "content": "The Quarry Girls: A Thriller by Jess Lourey is indeed a thriller. There is no pussy footing around it. On Page 1, I wrote myself a note: I’m horrified. I want to put the book down, but much the same way a moth is drawn to the flame, I cannot.",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Behind a screen of tension and conflict, Lourey develops her characters so well that, at times, I walked in their shoes. She will take you into and through strange scenes where the settings come alive.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "1542034299"
},
{
    "title": "Characters and Relationships will surprise the reader",
    "rating": "4.0 out of 5 stars",
    "content": "Lourey’s descriptions are, at times, so plain they take your breath away. How does she do that?",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": " When reading her tale, you will experience and enjoy the simple things in life that are not so simple.",
    "post_time": "Reviewed in the United States on October 4, 2022",
    "pid": "1542034299"
},
{
    "title": "Could hardly put it down",
    "rating": "4.0 out of 5 stars",
    "content": "Evil is present in many of her characters. I came to admire those who proved to be there for the protagonist. I despised many, especially as Lourey’s subtle hints reached my subconscious.",
    "post_time": "Reviewed in the United States on November 4, 2022",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This was my first Jess Lourey read. It won’t be the last.",
    "post_time": "Reviewed in the United States on November 22, 2022",
    "pid": "1542034299"
},
{
    "title": "Bravo, Jess!",
    "rating": "5.0 out of 5 stars",
    "content": "This book was really good. I loved the characters and the suspenseful story line. When we're young we trust those closest to us so easily. Sometimes, that's not the best thing. A very good book.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I liked Jess Lourey’s other books of a similar style, but The Quarry Girls definitely feels like her step-up novel. The storytelling was excellent, the suspense left you wondering and guessing and the emotions were heavy. I’ll continue to read more from her! Good audio/narrator, as always with her novels.",
    "post_time": "Reviewed in the United States on February 22, 2024",
    "pid": "1542034299"
},
{
    "title": "very good read",
    "rating": "5.0 out of 5 stars",
    "content": "It’s hard for a book to be both poignant and suspenseful, yet this one is.  Nostalgia abounds for those who were around in the 1970’s and 1980’s.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed this read thoroughly. It really captures the awkwardness of traversing the threshold between girlhood and womanhood and the struggles that are often overlooked.",
    "post_time": "Reviewed in the United States on March 23, 2024",
    "pid": "1542034299"
},
{
    "title": "Good read",
    "rating": "2.0 out of 5 stars",
    "content": "I'm beginning to feel I'm cursed. February was a really bad reading month for me, and this ended up being another unpopular opinion. I love the premise of this novel and was intrigued by the very chilling opening note, but I ended up struggling a lot. I kept wondering if everyone was reading the same novel.",
    "post_time": "Reviewed in the United States on March 9, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I get it—it's a different time with different opinions than 2024. The author handles the themes of the 70s/80s (i.e., feminism, mental health) poorly. Every. single. male. character is made out to be some kind of monster or just \"wrong.\" And, the young main character's mom is struggling with mental health problems, leading her to be extremely neglectful of her kids. She rarely leaves her room, but when she does, everyone walks on eggshells around her--waiting for her to snap. The way she handled these themes irked me.",
    "post_time": "Reviewed in the United States on October 12, 2022",
    "pid": "1542034299"
},
{
    "title": "Am I reading the same book?",
    "rating": "5.0 out of 5 stars",
    "content": "Despite this having some dark themes, I feel it is still geared more towards young adults. The characters are young kids and do everything illogically, following the common niches of \"what not to do.\" Like, go alone to dark places with a serial killer on the loose. It gets extremely frustrating, especially when the characters begin to understand how serious the situation is. None of the characters were necessarily likable to me, making it extremely difficult to want to pick up.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It has a lot of 70s/80s pop culture references, but as someone born in the 2000s, I didn't necessarily relate to them or care.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "1542034299"
},
{
    "title": "Compelling Characters",
    "rating": "4.0 out of 5 stars",
    "content": "At the end of the day, I don't think I will go back to this author for a while. The writing and plot were just dry.",
    "post_time": "Reviewed in the United States on February 28, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The story is told primarily from the perspective of 16-year-old Heather, who together with her best friends, Maureen, and Brenda, play in a band.  One night Brenda and Heather see Maureen in a room with several adults doing inappropriate things with them.  Even worse, they think they recognize at least one of the adults.  Do they tell anyone?  If so, whom do they tell?  The adults in the town all seem to have something wrong with them, whether it’s severe depression like Heather’s mom or hording like Brenda’s mom.",
    "post_time": "Reviewed in the United States on February 16, 2024",
    "pid": "1542034299"
},
{
    "title": "Great thriller",
    "rating": "5.0 out of 5 stars",
    "content": "Interestingly, there was only one decent major male character in the book (Claude); everyone else was either looking to take advantage of the girls, or was an actual rapist or pedophile.  The female characters by contrast were quite compelling and interesting.  I especially liked Beth’s never-give-up attitude, despite the horrors she experienced.  I also really liked the realistic depiction of Heather coming to terms with all that happened to her and her friends.",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "1542034299"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Really enjoyed this one thanks to my Amazon first reads. I couldn’t put it down and loved the main character and her strength throughout the book.",
    "post_time": "Reviewed in the United States on October 13, 2022",
    "pid": "1542034299"
}
]