[
{
    "name": "  In Five Years: A Novel ",
    "stars": [
        "53%",
        "30%",
        "13%",
        "3%",
        "1%"
    ],
    "pid": "1982137452",
    "ratings": "67,107 ratings",
    "other_info": {},
    "discount_price": "$ 7.41",
    "normal_price": "$17.00",
    "about_this_item": []
},
{
    "title": "Very disappointing...",
    "rating": "3.0 out of 5 stars",
    "content": "Spoiler alert: this review may ruin the book for you... if you plan to read it. But I highly discourage you from buying it;",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": " unless you are unphazed by a narcissistic protagonist who betrays her two closest friends. This is book framed as mystical, but that's a minor and not believable part of the book. The major theme is betrayal. Read at your own risk.  I know there are people like this in the world, but I wouldn't invite them to share a few hours of my life. I found it very sad and disappointing.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "1982137452"
},
{
    "title": "Quick read",
    "rating": "5.0 out of 5 stars",
    "content": "loved this book and used copy was in great condition",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was one of my favorite books ever! I feel it’s for a young adult audience but, the story is beautiful! I’ve passed it on to a friend and sharing with family and friends. Everyone has loved it!",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "1982137452"
},
{
    "title": "Awesome book and easy read",
    "rating": "4.0 out of 5 stars",
    "content": "This is the first time I've read a book by Rebecca Seems and have become an instant fan. The characters are wonderful even in their flaws. The story grabs onto you, ensuring that you will continue the ride toward the finale where one is surprised but also not.  The ending brings joy, sadness, and complete understanding.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I devoured this book bjt the end left me wanting",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "1982137452"
},
{
    "title": "Amazing",
    "rating": "5.0 out of 5 stars",
    "content": "Dannie and Bellas friendship is beautiful and forgiving, which is rare these days. Dannie finally becomes true to herself. The book went in a different direction than I thought and ending peacefully",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Well written story with a very surprising twist. I like that the characters change and grow.  The ending leaves you wondering what next?",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "1982137452"
},
{
    "title": "Great Read",
    "rating": "4.0 out of 5 stars",
    "content": "10/10. One of my favorite books I have read!!",
    "post_time": "Reviewed in the United States on March 19, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I really enjoyed In Five Years by Rebecca Serle!",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "1982137452"
},
{
    "title": "Not a time-leap pingpong novel...keep reading",
    "rating": "4.0 out of 5 stars",
    "content": "You think you know how this is going but you don't.  The thrill of the \"ride\" isn't even just how she gets from point A (back) to point B but the unexpected twists along the way.  I'm not usually a binge reader but I couldn't put it down.  I nearly didn't stick with it because she took so long getting to the first conflict point and I thought oh this is just going to ping pong between alternate realities, falling asleep in one and waking in the other.  I was wrong -- what she did was sooo much more interesting.  Fantastic story telling.  Even the ending was a surprise.  And I like she kept the cast of characters small.  Some books I have to keep a cheat sheet going to keep it straight.",
    "post_time": "Reviewed in the United States on February 24, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I thought I knew where this book was going but it surprised me at many turns. The twist at the end was particularly rewarding I thought. It was also touching. Not a fan of touching.  But this was adroitly done. Good characters. Fine plot. A worthy read.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "1982137452"
},
{
    "title": "Good Twist",
    "rating": "5.0 out of 5 stars",
    "content": "This book was such a fantastic read. I originally listened to the audiobook and then bought this. Some of the contents of this story I did not expect. The emotion it made me feel I did not expect nor a couple of the twists and turns. More than meets the eye.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Incredible story! I’m not one to cry at a book, but this one broke me. Gorgeous story of friendship, love, life, and loss.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "1982137452"
},
{
    "title": "Unexpected",
    "rating": "4.0 out of 5 stars",
    "content": "I read this book in one day…. I was impressed and captivated in the beginning of the book.. I loved how the characters started off. Can say I feel the same that after everything Dannie does not end up with Aaron. Other that the ending I would honestly recommend this book!",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It took forever to get into this book by the time I was ready to ditch it I was too far in and wanted to finish it. It actually did come together in the last half so persevere.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "1982137452"
},
{
    "title": "This one broke me…",
    "rating": "4.0 out of 5 stars",
    "content": "Finished it in two days!",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely fell in love with this book. You will love every character.  You will laugh, you will cry, you will have every feeling imaginable! By far one of my absolute favorites of all time! I tell anyone and everyone to read this book!!",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "1982137452"
},
{
    "title": "In Five Years",
    "rating": "4.0 out of 5 stars",
    "content": "Wow, where to begin?  This is a story of love and friendship between two bestfriends, Danielle \"Dannie\" and Bella who are loyal to one another and no matter the situation, always having the other's back.  Everything was ok until it wasn't.  So moving.  Dannie is a lawyer who has always known what she wants and how to get there with her career, her friends, her fiance and her life.  Bella is the artist and seemingly flighty, loving quick and often and moving from project to project without completion, but the two get each other best friends since 7 years old.  Dannie has her life planned out until she has a dream that seems more like a vision that take her 5 years into the future with a different man and apartment on December 15, 2025.  When waking from her dream which doesn't seem like a dream to Dannie back to December 15, 2020 but she doesn't tell Bella or anyone about it for fear of being thought crazy.  Well of course the guy from the future she meets, but without spoiling it, everything is turned upside down.  I was kind of happy with the first realization and the end of the book of the situation of Dannie and her guy in the dream, but the final ending was just anti-climatic and kind of, \"huh\".",
    "post_time": "Reviewed in the United States on November 27, 2022",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "At first glance, you think this is just another romantic novel, but it’s so much more than that. It’s about finding something to hang onto in the midst of tragedy. You ever see those flowers and plants that somehow sneak through the crack in a sidewalk? This is the book version. I don’t know if I can explain it.",
    "post_time": "Reviewed in the United States on January 25, 2024",
    "pid": "1982137452"
},
{
    "title": "⭐️⭐️⭐️⭐️",
    "rating": "4.0 out of 5 stars",
    "content": "I couldn’t put this one down. Four stars for an interesting — albeit predictable— plot line. Easy to read. Happy but sad ending.",
    "post_time": "Reviewed in the United States on May 12, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Many times you wonder about the future.  What if you get a glimpse of it?  Dannie is young and starting to build her life and in one of the most important nights of her life she gets a glimpse into her future.  You see Dannie’s life play out for the next five years and as we know life takes turns where we would never expect.  Definitely recommend!",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "1982137452"
},
{
    "title": "Good book",
    "rating": "4.0 out of 5 stars",
    "content": "Great summer read.  Written really well and takes you on an intetesting trip",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Cover 4/5 (plain but the gold detailing is beautiful)",
    "post_time": "Reviewed in the United States on September 27, 2023",
    "pid": "1982137452"
},
{
    "title": "Great read with lots of twists",
    "rating": "5.0 out of 5 stars",
    "content": "Characters 5/5",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Plot 4.5/5",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "1982137452"
},
{
    "title": "This book made me ugly cry",
    "rating": "4.0 out of 5 stars",
    "content": "THE PLOT TURNING POINT-destroyed me/5",
    "post_time": "Reviewed in the United States on May 19, 2020",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book absolutely destroyed me. I had NO IDEA what I was getting myself into, literally just chose it because it was a short book we could try to read quickly for book club.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "1982137452"
},
{
    "title": "Highly recommended",
    "rating": "4.0 out of 5 stars",
    "content": "Dannie reminds me a lot of me. Stubborn, number-oriented, by the book, very very rational.",
    "post_time": "Reviewed in the United States on April 13, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Bella reminded me of my best friend. Fun. Spontaneous. Adventurous. Artistic.",
    "post_time": "Reviewed in the United States on February 1, 2024",
    "pid": "1982137452"
},
{
    "title": "Very good!",
    "rating": "4.0 out of 5 stars",
    "content": "This book was great, easily a 5+ star read. The reason I won’t give it 5 stars is because I think the author has a helluva lotta nerve charging $12.99 for an ebook! Way to rake  your readers over the coals 🤦‍♀️.  Not cool.",
    "post_time": "Reviewed in the United States on December 15, 2023",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Also, I don’t understand why Dannie didn’t just google Aaron after waking up. Certainly in this age of social media a simple google search early on could have found him easily.",
    "post_time": "Reviewed in the United States on January 31, 2024",
    "pid": "1982137452"
},
{
    "title": "Friendships can be enduring",
    "rating": "5.0 out of 5 stars",
    "content": "Nonetheless I enjoyed the story.",
    "post_time": "Reviewed in the United States on February 7, 2023",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "You might see yourself when you read this book of choices and events that occur in life.  You'll keep reading to find out how the story ends.  The main characters are distinctly written and the chapters turn rapidly so you won't realize how fast  five years pass.  Friendships can be enduring as this story shows.",
    "post_time": "Reviewed in the United States on October 10, 2021",
    "pid": "1982137452"
},
{
    "title": "Where do you see yourself in five years?",
    "rating": "4.0 out of 5 stars",
    "content": "Dannie Kohen has rules and plans laid out for every aspect of her life. She interviews for her dream job that she’s certain she has in the bag. She also anticipates the proposal of marriage that evening at the celebratory dinner. All of this is aligned with her five year plan. They return to their shared apartment after dinner and she falls asleep on the couch.",
    "post_time": "Reviewed in the United States on January 22, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "She awakens in another time and space, literally. She’s in a different apartment, with a differing ring on her finger, with a different man FIVE years in the future. She’s roused from sleep realizing only an hour has truly passed. But what does this mean? Why does life appear to stray so far from her plan. She goes to therapy in an attempt to rationalize things, telling no one in her life of the dream, not even best friend Bella.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "1982137452"
},
{
    "title": "Quick Read, BUT SAD..Spoilers",
    "rating": "4.0 out of 5 stars",
    "content": "Despite the distractions of life and immersing herself in work, she can’t seem to shake the dream she’s had. Was it a dream even as it felt like a premonition. Dannie’s life rotates on its axis as she is summoned to meet best friend Bella’s new beau and looks into the face of the man from her dream. What does all it mean?",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book took me places that I hadn’t at all anticipated as I’d gone into the read blind. It’s such a beautiful surprise! That gave all the feels?",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "1982137452"
},
{
    "title": "predictable but…not exactly.",
    "rating": "4.0 out of 5 stars",
    "content": "I loved this book, but also struggled with the ending...I loved the idea behind it and the premonition/dream and look into the future...I loved the friendship between Danni and Bella as well..It did seem like Danni and David's relationship was just kinda there more out of convenience and her idea of planning which is made pretty obvious, which sucked for  David..",
    "post_time": "Reviewed in the United States on February 8, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "What truly bothered me was the cancer parts... It was a bit disturbing..knowing a close loved one myself that went through it all and fortunately survived; but hard to read about it and then see 2 people bond or \"grieve\" over it. I am not saying it can't happen, but it just seemed a bit tacky for the end. There could have been other ways to have it end rather than have Bella die from cancer. Perhaps she could have told Danni something like \"I want you to be with Aaron/Greg if something happens to me\" , that would have been much more romantic and guilt free, since Bella always knew that Danni deserved love and didn't feel that way with David. I also that they way things ended with David were way too abrupt.",
    "post_time": "Reviewed in the United States on March 9, 2024",
    "pid": "1982137452"
},
{
    "title": "I ugly cried. A lot.",
    "rating": "4.0 out of 5 stars",
    "content": "Accountant Dannie Kohan has the perfectly planned controlled outlook on life that only the young can afford. She has everything planned out, especially the next five years. On the night of her by the book marriage proposal she falls asleep only to wake up in the future lying in another man’s bed with a wedding ring on. Shook by the vision, she forgets about it until she runs into the man four years later.",
    "post_time": "Reviewed in the United States on October 19, 2020",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really like Dannie, our number loving main character.  She is an authentic and clever protagonist for this brilliantly crafted story. Fantastical but believable, I was hooked immediately! Dannie believes one must sacrifice to achieve their dreams. Refreshingly, her best friend Bella is the opposite of Dannie’s non carefree existence. Bella is spontaneous, fluid, carefree, artsy, wide open. Serle beautifully and descriptively captures big emotions – “I feel as if all the air on the sidewalk has been sucked back into the sky. We’re going to suffocate out here.” And this book is full of big emotions. Heartbreaking and physically moving, this book wrecked me. I had to put sunglasses on to hide my tears.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "1982137452"
},
{
    "title": "Loved this book",
    "rating": "5.0 out of 5 stars",
    "content": "In Five Years is NYC in a book. There are such vivid descriptions of NYC; especially all the super fun restaurants and their delicious entrees. I can’t wait to recreate some of the dishes mentioned!",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I wished that there had been more development for supporting characters. I felt attached to Dannie and no one else in a very egotistical way.",
    "post_time": "Reviewed in the United States on March 10, 2024",
    "pid": "1982137452"
},
{
    "title": "Unexpected ..... Beautiful *****",
    "rating": "4.0 out of 5 stars",
    "content": "Thanks to Libro.fm for my ALC. I give my honest review in return.",
    "post_time": "Reviewed in the United States on January 21, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A sweet story filled turns and twists.  Contains a great plot.",
    "post_time": "Reviewed in the United States on February 6, 2024",
    "pid": "1982137452"
},
{
    "title": "Great read!",
    "rating": "4.0 out of 5 stars",
    "content": "The story was beautiful, poignant and moving. Everyone in New York should read it. And everyone else. Definitely more a girls type of book.",
    "post_time": "Reviewed in the United States on February 15, 2023",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": " I loved it. Made me wish I'd had a friend that close.",
    "post_time": "Reviewed in the United States on February 23, 2024",
    "pid": "1982137452"
},
{
    "title": "In Five Years",
    "rating": "5.0 out of 5 stars",
    "content": "This was a great read! The only thing disappointing was that it left me wanting to know \"the rest of the story\".",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Dannie has a premonition of what will happen in her life five years from now. It is not in her carefully planned life, and she tries her best to keep it from happening. This is a well written book that I could not put down.",
    "post_time": "Reviewed in the United States on December 31, 2023",
    "pid": "1982137452"
},
{
    "title": "It Was Awesome & Inspiring",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this story.  Its an epic tale of great love between two friends that transcends time and heartache.  Awesome read!",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "The main character, Dannie, cares about nothing but her career and her best friend, Bella. Bella cares about Dannie, her endless string of boyfriends, and (spoiler alert) the baby she thinks that she's pregnant with when she meets the 'right' guy, at the 'right' age, to be pregnant, but not at all about the baby she aborted in her twenties---because babies, or 'fetuses,' only have value when when the guy is hot and perfect with a good job and the pregnancy happens in one's thirties. I found Bella's eagerness to decorate a nursery and buy baby clothes within a couple of days after a positive pregnancy test to be quite disturbing when contrasted with the implied abortion. It's not like the uber-wealthy Bella could not have afforded a child in her twenties. But at least Bella, with her cold, uncaring parents, has reasons to be morally skewed. Dannie is just a selfish workaholic married to her career ambitions.  She wasted seven years of David's life (the one decent character), and she seems to feel very little remorse about just how bad she screwed him over. In an imagined future with her final love interest, the doctor, I hope that he, who is at least devoted to a career that matters unlike Dannie's oh-so-important corporate mergers, runs far, far away from Dannie before they pop out a kid or two that neither has the time, and in Dannie's case, the nurture factor, to raise. I find it funny that  Dannie would probably be as bad or even worse than Bella's mother at parenting. Yuck!!! Poor David! Or maybe lucky-escape David?",
    "post_time": "Reviewed in the United States on January 9, 2024",
    "pid": "1982137452"
},
{
    "title": "Selfish, unlikable characters",
    "rating": "4.0 out of 5 stars",
    "content": "This was a good read. Not overly amazing, but definitely interesting. Worth the read",
    "post_time": "Reviewed in the United States on March 25, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My first read by this author was not disappointing. However, the early plot twist got me hooked, and I finished it the same day. Something I did not expect to do.",
    "post_time": "Reviewed in the United States on March 17, 2020",
    "pid": "1982137452"
},
{
    "title": "Good book",
    "rating": "4.0 out of 5 stars",
    "content": "The reviews were compelling and surprisingly accurate, although the reading journey came with many plot twists and unexpected results. The unique story and beginning sets the stage for this lively first-person storytelling that begins in a world of well-planned certainly of a young, successful woman, Dannie, an attorney, and dedicated New Yorker, having her own way. Then things change, or truly she changes. This story is about discovering who she really is, against all her better judgment, guided by a childhood friend, Bella, whose artistic and bohemian lifestyle often seems at odds with Dannie's buttoned-up and logical approach to life.",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This introspective narrative engages the reader in a personal quest for meaning amid all the false rewards of professional success. The author's canny storyline exposes the lies we tell ourselves about life, while never really living.",
    "post_time": "Reviewed in the United States on July 15, 2023",
    "pid": "1982137452"
},
{
    "title": "Life's Predictable, Until It Isn't!",
    "rating": "4.0 out of 5 stars",
    "content": "This is a compelling read, even for the non-New Yorker, of what true friendship is and endures, while waiting for the elusive \"love\" that never seems to come.",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Although the book did not end the way I wanted, it was still an enjoyable read and satisfying finish. The Audible narration added dramatic pacing and emphasis that enlivened the depth of the story and plot.",
    "post_time": "Reviewed in the United States on February 6, 2024",
    "pid": "1982137452"
},
{
    "title": "beautiful love story",
    "rating": "4.0 out of 5 stars",
    "content": "The Kindle version also included supplemental book club questions and notes, along with some additional Q&A comments by the author.",
    "post_time": "Reviewed in the United States on March 1, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Although I found the book interesting and extremely well written, I wished the author had developed the ending and the final resolution more completely.",
    "post_time": "Reviewed in the United States on February 17, 2024",
    "pid": "1982137452"
},
{
    "title": "When Life's Plans Go Awry",
    "rating": "3.0 out of 5 stars",
    "content": "If you or someone you know likes to plan life by the milestones, you will enjoy this book.  Protagonist Dannie Kohan is the kind of young woman who always has the perfect answer (and it is genuine, not faked) to that ubiquitous job interview question, \"Where do you see yourself in five years?\" Dannie has rules for how long to date someone before moving in together, how old you should be when you get engaged, what age you should get married, when should you land your perfect job, etc.  She is well on her way to achieving her wildest aspirations when she is gobsmacked by a powerful dream, in which she sees herself in an intensely erotic situation with a man she has never met instead of her fiancé David. She is so shaken she goes to a therapist for advice.  She tries to put the incident behind her, because everything else is happening according to her life's plan. I'd have to give a spoiler to say how Dannie meets the man about whom she dreamed or what happened afterwards, but don't assume a book will turn out a certain way.  Read it to find out.",
    "post_time": "Reviewed in the United States on July 12, 2023",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Who betrays their friend like that? Even after a tragedy and if both parties are mourning. Was a pretty gross plot.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "1982137452"
},
{
    "title": "Left me feeling grossed out",
    "rating": "5.0 out of 5 stars",
    "content": "Excited to finish reading this one, so far so good!",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The ending was just so disappointing. All that buildup and then nothing. The author must of had a deadline to reach 🙄",
    "post_time": "Reviewed in the United States on February 16, 2024",
    "pid": "1982137452"
},
{
    "title": "Excited",
    "rating": "4.0 out of 5 stars",
    "content": "4. 5 stars. I usually don’t read romance. I was interested in the concept of seeing what will happen in five years and the aftermath of that experience. It was melodramatic but the twist was excellent.",
    "post_time": "Reviewed in the United States on January 6, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was the first book I have read from this author. It was so emotional and tragic and freeing. This was a love story but not one that you would think about normally. It was about destiny and friendship and love.",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "1982137452"
},
{
    "title": "Almost loved it",
    "rating": "4.0 out of 5 stars",
    "content": "Geez, I read this in one sitting and I have never wanted a friend so much. Beautiful story of friendship and incredible loss.",
    "post_time": "Reviewed in the United States on February 5, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Well written. Story flows well. Disappointed with the ending though.",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "1982137452"
},
{
    "title": "Love between two friends",
    "rating": "5.0 out of 5 stars",
    "content": "  Good character development and I could actually picture each of them",
    "post_time": "Reviewed in the United States on March 10, 2020",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Can I just say I have mixed feelings?",
    "post_time": "Reviewed in the United States on February 1, 2024",
    "pid": "1982137452"
},
{
    "title": "Real-Life Love Story",
    "rating": "5.0 out of 5 stars",
    "content": "I’m officially a Rebecca Serle fan and I’ll read anything new she writes. “In Five Years” has been on my TBR list (to be read) for over a year. I’ve put it off many times because the reviews are polarizing:  some readers LOVED it and others strongly disliked it. I fall firmly in the “LOVED IT” camp.",
    "post_time": "Reviewed in the United States on June 4, 2022",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The story, while not light-hearted, has an engrossing and interesting plot line with solid characters. It’s a work of fiction, but employs a very realistic/real-life approach (which I love). This book is more of a “story” as opposed to a heavy “character study.” I prefer this simple style for my summer reading.",
    "post_time": "Reviewed in the United States on January 29, 2024",
    "pid": "1982137452"
},
{
    "title": "Thought provoking",
    "rating": "4.0 out of 5 stars",
    "content": "Thanks to an annoying bout of insomnia, I read this book in one sitting. This page-turner heavily contributed to my inability to sleep because I was simply unwilling to put it down.  It’s well-written and concentrates on a heavy subject matter without bogging the reader down in sadness. You will undoubtedly cry but you’ll also feel strangely uplifted at the end.",
    "post_time": "Reviewed in the United States on January 13, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I highly recommend to all. However, if you are triggered by illness of a loved one, please proceed with caution.",
    "post_time": "Reviewed in the United States on January 31, 2024",
    "pid": "1982137452"
},
{
    "title": "one sit reading",
    "rating": "5.0 out of 5 stars",
    "content": "It's not a cliche novel, but thoughtful and interesting. The end has you hanging but something to munch on after the closing paragraphs.",
    "post_time": "Reviewed in the United States on February 22, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I don’t usually read fiction, but I really enjoyed this one. Had me guessing ! Maybe I’ll start more fiction reading, who knows? Good book.",
    "post_time": "Reviewed in the United States on February 17, 2024",
    "pid": "1982137452"
},
{
    "title": "Beautifully Special",
    "rating": "5.0 out of 5 stars",
    "content": "I have to say, this book is really extra special. I loved the writing and the characters and the friendship and loves. All of them. There is an element of magical realism but mostly it is just about love and life. I just finished it and I feel like I had my heart torn out! Everything was so well thought out and executed. I strongly recommend this book. I think you will love it too.",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the first book I read by Rebecca Serle. I don't know why the description I read made me think it was a Sci-fi story. However, it turned out to be about relationships and the bond between friends. The story was not what I expected but it drew me in and although it made me cry, I enjoyed it.",
    "post_time": "Reviewed in the United States on January 14, 2024",
    "pid": "1982137452"
},
{
    "title": "I recommend it",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed this book very much. It was touching, romantic, yet realistic. The characters are all very intelligent and the way they were described brought them to life. The ending was a little surprising, but not in a bad way. I will certainly read more books by this author.",
    "post_time": "Reviewed in the United States on May 14, 2022",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Many have been raving about this book, so I picked it up…then realized I read it before.  Still, I could not put it down. I read it again.  I fell in love with the characters. I cried. I laughed. I burned. Such a good book.",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "1982137452"
},
{
    "title": "so very unexpected",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this book based on the description of a woman who spends an hour, five years into her future. I was totally blown away by the full story. I won’t spoil it for anyone but I wish someone had warned me that I would need a lot of tissue close at hand. Still crying as I write this. By the way, I rarely give any book five stars except, of course, Jane Austen.",
    "post_time": "Reviewed in the United States on January 27, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is “Something Borrowed” meets “Beaches”.  Surely this will become a movie at some point?  It’s a well-written story of two seemingly opposite best friends.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "1982137452"
},
{
    "title": "A fun read that kept me guessing what the title meant.",
    "rating": "5.0 out of 5 stars",
    "content": "Dannie is a buttoned-up, hard-driving lawyer who believes that success and happiness are merely a series of well-planned, perfectly-executed, consecutive steps, checking off all the boxes of a well-managed life.  Bella is artistic, mercurial, spontaneous and free-spirited. The two forge a friendship from childhood that flourishes into their adult years, despite their differences.  Dannie is happily engaged to David, and she appears to be solidly on track toward her expected future.  Then, she has an odd dream that she cannot shake.  In any other book, this plot twist might seem cheesy or contrived, but here, at least for me, it worked.",
    "post_time": "Reviewed in the United States on March 14, 2020",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Suddenly, Dannie’s comfortable world takes some unanticipated detours, as she grapples with circumstances that she can no longer  control.  Then, the complicated, long-standing friendship between Dannie and Bella is tested.  The easy laughter and shared experiences shift to more serious terrain.",
    "post_time": "Reviewed in the United States on November 22, 2023",
    "pid": "1982137452"
},
{
    "title": "Sad, Redemptive and Hopeful",
    "rating": "2.0 out of 5 stars",
    "content": "I believed in their friendship, but when it  veered into the parent-child dynamic however, it was somewhat cloying.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The bond between  Dannie and Aaron, Bella’s boyfriend, was much more believable to me.  That tie was strong, realistic, current, and not based on the past.  The story pulls the reader in effortlessly, and one is caught up in the lives of Dannie, David, Bella and Aaron.",
    "post_time": "Reviewed in the United States on January 25, 2024",
    "pid": "1982137452"
},
{
    "title": "Loved it!",
    "rating": "5.0 out of 5 stars",
    "content": "I could see how it would end, but it was still worth the journey.",
    "post_time": "Reviewed in the United States on January 19, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I devoured this book. I loved the writing- so often, the lines seemed just so poetic and I had to stop and re read a sentence or 2. I adored the love between Danni and Bella, and I was so glad the story didn't take us where I thought it might, when I started the book. I loved all the details- from what someone was wearing, to the building across the NY neighborhood, I really could \"see\" where we were going and I felt very connected to the setting. This book will be a keeper and I'm sure I will revisit.",
    "post_time": "Reviewed in the United States on January 27, 2024",
    "pid": "1982137452"
},
{
    "title": "love the author, not the novel",
    "rating": "5.0 out of 5 stars",
    "content": "This book was incredibly well written. If you seek quality writing, Serle is your girl. Despite this, I did not like the main character. She’s incredibly arrogant and dismissive of those around her. She does not know how to keep her hands to herself and the possessiveness she has over her best friend is concerning. I will continue to read more books from this author, but am disappointed to see cheating as a pattern in her stories.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "1982137452"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are people you will care about.  A wonderful, loving friendship between Dannie and Bella, two women who could not have less in common.  But this friendship is so well written that it all makes sense.  The premise of a dream of a different life five years hence is intriguing and moves the  plot along.  A delightful read!",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "1982137452"
}
]