[
{
    "name": "  The Book of Lost Friends: A Novel ",
    "stars": [
        "64%",
        "25%",
        "8%",
        "2%",
        "1%"
    ],
    "pid": "1984819909",
    "ratings": "24,275 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Happily surprised",
    "rating": "5.0 out of 5 stars",
    "content": "Her writing is fabulous. I especially love how she describes things as they are happening to someone.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Like",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "1984819909"
},
{
    "title": "That you care to make sure I was right person",
    "rating": "5.0 out of 5 stars",
    "content": "As someone ‘addicted’ to family genealogy, I loved how this novel was written and ‘unwound’.  Slavery was a dark stain on our history, but this book spoke about both the interconnections we all have and the importance of knowing from whence we came.  I enjoyed it very much.",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm a lover of historical fiction, but so much of what is available has to do with wars, WWII in particular. While I still enjoy those, it was refreshing to branch out to this book about former slaves during Reconstruction, and about their search for the friends and loved ones who were ripped from their lives. I liked it enough that I bought it for my mom, as well. I have read and value other books by Lisa Wingate, as well. She does her research and teaches me so much!",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "1984819909"
},
{
    "title": "Well-Done!",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent book (both heartbreaking & heartwarming in parts )",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved the 2 different time period settings",
    "post_time": "Reviewed in the United States on May 14, 2020",
    "pid": "1984819909"
},
{
    "title": "One of my favorites!",
    "rating": "5.0 out of 5 stars",
    "content": "1875 & 1987",
    "post_time": "Reviewed in the United States on February 10, 2021",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Lisa Wingate has become one of my new favorite authors",
    "post_time": "Reviewed in the United States on January 28, 2024",
    "pid": "1984819909"
},
{
    "title": "Riveting read hard to put down",
    "rating": "5.0 out of 5 stars",
    "content": "This book took me on a journey of goodness and evil - and the goodness won. Strong women who take control of their destinies are my new favorite character. Thanks for a satisfying story.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The book is from the author of ‘Before We Were Yours’ and it tells an important story based on real life mostly long forgotten. The stories hook you from the first sentence. And then it takes you on a ride you won’t soon forget. Chapters switch between the voices of two strong women who live in a world more than a century apart – with cliffhangers to urge you on to the next part.",
    "post_time": "Reviewed in the United States on August 23, 2023",
    "pid": "1984819909"
},
{
    "title": "wow",
    "rating": "5.0 out of 5 stars",
    "content": "This story was unexpected and touching. Told from two point of view, it simultaneously tells the tale of a young teacher helping her students discover their past history and special worth, and the tale of a brave young girl woman born into slavery and determined to make a difference. Interesting and inspiring.",
    "post_time": "Reviewed in the United States on March 15, 2024",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Amazing is the only word to describe this book. It takes you on a journey that is life changing in a loving way.",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "1984819909"
},
{
    "title": "Amazing !",
    "rating": "3.0 out of 5 stars",
    "content": "I grew up in the South and I enjoy historical fiction, so I was excited to learn that my book club would be reading a historical novel about the period when former slaves became land owners.  I found the Lost Friends ads interesting - I wish the book had been more about that than about Bennie’s teaching adventures and budding relationship with Nathan.  The switching between stories was annoying.",
    "post_time": "Reviewed in the United States on November 14, 2023",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wanted the school children to find their own “lost friend” connections, which might have helped bring the two stories together.  But that thread never went further than a class project.",
    "post_time": "Reviewed in the United States on May 8, 2020",
    "pid": "1984819909"
},
{
    "title": "One Story Too Many",
    "rating": "5.0 out of 5 stars",
    "content": "The ending was very odd.  Where did the baby come from — and what did Wingate think that would add to her novel?",
    "post_time": "Reviewed in the United States on August 25, 2020",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I was so excited to get this book when it recently came out. I was moved by “Before We Were Yours”, and knew this had the potential to be just as powerful. Lisa Wingate has a gift and talent for taking seemingly obscure, yet important history and weaving it into a tale that connects the past with modern times.",
    "post_time": "Reviewed in the United States on October 14, 2021",
    "pid": "1984819909"
},
{
    "title": "A story connecting centuries",
    "rating": "1.0 out of 5 stars",
    "content": "This is the story of two women Hannie, a freed slave, and Benny, a first year high school English teacher. The story centers around the need to find “our people”. Hannie does that while on an adventure risking her life to find the family that was separated from her through slave sales.  She becomes the keeper of the Book of Lost Friends - actual newspaper articles from post Civil War times of freed slaves searching for information about separated family members.  Benny begins her teaching career in a poor Louisiana school trying to reach students through the importance of stories. She enlists the help of community members to share the past with her students. This ignites a fire in her students and the research begins. The reader soon realizes everything for both characters is connected to Goswood Grove Plantation in their small town in Louisiana.",
    "post_time": "Reviewed in the United States on February 15, 2022",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Each chapter pulled me in deeper and deeper. I had to know what happened and how the two stories would collide. I will admit it took a few chapters to get into the rhythm of the story, but once I got it there was no putting it down. This is another powerful story told by a master storyteller!",
    "post_time": "Reviewed in the United States on August 15, 2023",
    "pid": "1984819909"
},
{
    "title": "One of my Favorite Books of All Time",
    "rating": "5.0 out of 5 stars",
    "content": "I was introduced to Lisa Wingate by a friend who recommended Before We Were Yours, which I loved. That led me to Lisa's other books and I started with The Book of Lost Friends.",
    "post_time": "Reviewed in the United States on January 14, 2021",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I just cannot say enough positive things about this book. I've read fiction my whole life and have always enjoyed historical fiction. This book is easily one of my favorites of all time. I have long thought that writing fiction takes incredible talent. Writing historical fiction is an art form in and of itself. From the research necessary to frame the story accurately to the intentional use of language to suit time periods, historical fiction is just another level of writing. Lisa takes us to another time and puts us in the same air as the characters in the book as we learn things now known before or, in my case, not fully appreciated before. As is the case with all wonderful books, I was sad when it ended and found myself hoping to learn more as I shall now that I know where to start.  I've recommended this book to many friends and contacts as I very much look forward to Lisa's future labors of love as she transports us to other times with other people from whom we learn.",
    "post_time": "Reviewed in the United States on July 18, 2020",
    "pid": "1984819909"
},
{
    "title": "Touching and Heartwarming",
    "rating": "5.0 out of 5 stars",
    "content": "What I didn’t like at first was the way the book went back and forth between stories and characters. Once I got it straightened out I began to immerse myself in the historical nature of the book along with the lives of the characters. Lisa Wingate is one of my favorite authors. I have read every one of her books. She never disappoints. This is a beautifully written book of lives lived, hopes and dreams shattered but triumphant nonetheless.",
    "post_time": "Reviewed in the United States on October 17, 2023",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Book of Lost Friends is a moving story of people in two different time lines who live both inside their own “ time constraints “ and overlap in the reader’s mind. The characters are well developed and interesting.  The author’s research into the time periods is obvious and enhances the story.  The stories are told in chapters that flip back and forth in time.  I especially enjoyed that the return to the previous time period never smoothly segued but jumped or jolted into the action making me have to make up some of what I perceived as missing pieces in my own mind.  It seemed like a sense of trust that the author gave the reader.  Ms Wingate wrote so skillfully with enough material in each chapter about the characters and their story that it was obvious what was happening without cluttering their story with unnecessary descriptions.  I thoroughly appreciated this author’s talent.  Thank you for your contribution to literature, Ms Wingate.",
    "post_time": "Reviewed in the United States on December 3, 2021",
    "pid": "1984819909"
},
{
    "title": "The Book of Lost Friends",
    "rating": "5.0 out of 5 stars",
    "content": "The book was delivered in great condition. That’s what the 4 stars are for. The story not so much. I’m not enjoying it. It keeps me going for one part of the story. That is a book is found and it’ll unravel past and present. This book flips 1875 and the present. I like books that do that but past chapters here are confusing. I’m not keeping this book to read again in the future.",
    "post_time": "Reviewed in the United States on October 14, 2023",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Remember when you first read Possession of Middle Passage or Bel Canto? How you wanted to stop.people on the street and say: Read this book!  That's how I feel about this book. It goes back and forth between the Gossett girls (Hannie,, a slave freed by the Emancipation Proclamation in 1865, Juneau-Jane , a free woman with a Creole mixed race mother, mistress to her father the slave owning planter Marse Gossett and Lavinia, the white legitimate daughter of Godsett and his white wife the old Missie) and the contemporary (1987) public school.teacher Benny Silva and the  progeny of the Gossett line Nathan, and the descendents of Hannie and others like her LaJuna, Granny T, Aunt Sarge, Aunt Dill.",
    "post_time": "Reviewed in the United States on December 31, 2020",
    "pid": "1984819909"
},
{
    "title": "Condition of book",
    "rating": "5.0 out of 5 stars",
    "content": "Benny thinks at first there is no way she can beat to spend five years in the depressed Louisiana public school teaching uncontrollable black, mixed and poor white trash kids who make up the student population of her crowded English classes. But gradually Benny learns along with her class what the town's history has to teach them. Based on a true historical artifact, a book of ads published during Reconstruction and thereafter of former slaves ?",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I loved the way the storyteller combined arts of history.",
    "post_time": "Reviewed in the United States on September 4, 2023",
    "pid": "1984819909"
},
{
    "title": "This is a book you will want to give your friends and family",
    "rating": "5.0 out of 5 stars",
    "content": "I love when books are written from the perspective of different time periods and then everything comes together. This is a great book that does that wonderfully!",
    "post_time": "Reviewed in the United States on February 6, 2021",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Wingate has once again delivered a powerful tale; this time a work depicting the realities surrounding freed slaves, scattered through the deep south, trying to survive and reconnect with their loved ones during the post-civil war era.  In a juxtaposition of present-day narration, Miss Silva, a first-year teacher hiding painful memories and a dark secret from her past, alternates with flashback chapters one hundred years prior; the young heroine, Hannie- a slave freed as a result of the civil war, setting out on a journey to protect the promise of a livelihood after hard years’ of share cropping.  The two stories weave together while heightening the connection between the two eras, exposing the prejudice in both our past and those which continue to cling to present-day society.  Historical fact combines with richly vivid characters created by the author.  Having a ‘so pleased to have found this book’ feeling, my recommendation for you to read it couldn't be stronger! I view this novel as a wonderful choice for book clubs.  It just begs to be discussed, digested and reflected upon!",
    "post_time": "Reviewed in the United States on July 1, 2023",
    "pid": "1984819909"
},
{
    "title": "Love the history!",
    "rating": "5.0 out of 5 stars",
    "content": "Sad and very sweet at the same time. A book about a very sad time in American history, during and post slavery. The author did a really good job with character development while staying true to history.",
    "post_time": "Reviewed in the United States on December 16, 2023",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Tough history but told in a beautiful way.  Some books I wish that I could have the hours spent reading them back but this book I’m forever grateful to have spent the time reading.",
    "post_time": "Reviewed in the United States on September 12, 2020",
    "pid": "1984819909"
},
{
    "title": "Excellent",
    "rating": "5.0 out of 5 stars",
    "content": "This is the best book I've read that tells a truth the world still needs to remember. This should be required reading in schools as part of American history class.",
    "post_time": "Reviewed in the United States on December 20, 2023",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Such a great and sad story, told from 2 perspectives and voices. Wish the ending was a little more different.",
    "post_time": "Reviewed in the United States on January 24, 2024",
    "pid": "1984819909"
},
{
    "title": "breathtaking",
    "rating": "4.0 out of 5 stars",
    "content": "Two story lines are entwined teaching us about post civil war history.  There’s the story of a slave named Hannie, who lost her family to the slave trade, and searches to find them.  She comes across a newspaper, which publishes stories of freed slaves, who are desperate to find their loved ones, hence the Book of Lost Friends.  I knew little about this time period and the struggles the freed slaves continued to have.  Life was difficult and horrible things happened.  Benny is a young, inexperienced teacher at an improvised school in Louisiana in today’s world. She’s desperate to connect with her students and eventually is able to engage them in the history of their town and the people that were buried there.  I had a hard time getting into this book, but am so glad I stuck with it!",
    "post_time": "Reviewed in the United States on December 26, 2020",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "There is a story here, so sad, so interesting, so amazing what the African Americans went through because of their skin color. I feel for these Lost Friends, it’s hard to believe what can happen to a human being. Even today, watching the news, I realize the color of your skin can make your life easier or more difficult.  With that said, this story confused me many times.  I did not love the book. I found it hard to separate the characters, who was who and why they were together.  I will say that I read it during the Covid 19 stay at home pandemic, so perhaps my concentration wasn’t what it should’ve been.  No matter, it was hard for me to get through, I did not look forward to picking it up to read. At 76% I almost quit but it’s not my style - I always finish. The characters weren’t developed enough for me. I thought they were all over the place. This novel was two separate stories that I couldn’t always place together. Throughout, there were hints about Benny’s past (the modern day main character) her mother, and as it turns out something big, but the reader did not find this out until the very end. The end was just eh as well.  I think I may have enjoyed it more if the world wasn’t crashing in around us right now in May 2020. I can’t recommend this book. CH",
    "post_time": "Reviewed in the United States on May 27, 2020",
    "pid": "1984819909"
},
{
    "title": "History worth learning",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed reading this book. It is probably more true to life than most people realize.",
    "post_time": "Reviewed in the United States on January 26, 2024",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I really enjoy historical fiction, especially when the book teaches you new information about something. It is difficult to find new windows of history that haven't been explored in a fictional format and this is one of those rare books that does just that. The Book of Lost Friends was a slave's handwritten journal that contained names of the slaves separated from their families by being sold. Post Civil War, the slaves were searching for their lost family members and friends. Advertisements were placed in the newspaper and then read in churches on Sundays. With so much social media and technology today, it may be hard to imagine having to use such a slow and seemingly impossible method. But as the story shows, where there is a strong will, there will be a way. I found this to be a very interesting and touching story. I highly recommend it!",
    "post_time": "Reviewed in the United States on November 11, 2020",
    "pid": "1984819909"
},
{
    "title": "Did Not Compare to Before We Were Yours",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book and I learned from it.  With people about whom I cared and adventures that drew me in, I learned what the Reconstruction period was really like in the South and especially for Black people.  they'd been freed and abandoned to fend for themselves in lawless territories.  As freed slave Hannie Gossett travels through Texas searching for her former master and her family members pulled from her at slave auctions, we learn of the cruelty, brutality, danger, and terror of freed slaves with no money, land, or family to which to cling.  The modern day descendants of those slaves and some of their white neighbors delve into their forebears' stories at the direction of Benny Silva, their teacher in 1987 Louisiana.  We learn as they do.  This is a fascinating book that has opened a window for me that I hadn't known was closed.  It's a great , absorbing read and I highly recommend it.",
    "post_time": "Reviewed in the United States on February 15, 2021",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I thoroughly enjoyed this book.  I'm not always a fan of books that jump between time frames, but I thought this was very well done.  Both stories were so engaging that I looked forward to getting back to them as I finished each chapter.  I thought they came together beautifully, quite masterfully, in tying up the details of both stories.  While I was aware that many slave families were separated from each other, I did not know of the efforts they later made to find each other after slavery was abolished.  This book did such an excellent job of illustrating how that was done while highlighting the emotion and trauma endured by families torn apart.  The subject matter of both stories in this book is sensitive but relevant and the author does a superb job of demonstrating many of the challenges in the slow process of recovering from the evils of slavery.",
    "post_time": "Reviewed in the United States on April 16, 2021",
    "pid": "1984819909"
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "The intertwined stories of post emancipation and 1987 small southern plantation town mixed with the pleas of people trying to find lost family members had me riveted from the beginning of the book. The beauty of a teacher trying to engage an unruly classroom with real life “history” and active learning brings to light what is so missing in our education system. Set in a small Louisiana town with deep roots, Wingate’s description of the town, plantation and community made the setting easy to visualize and her characters drew you in immediately. Hannie was a rockstar, tough as nails, compassionate character with grit and incredible values. Miss Silva was passionate and vulnerable. The suspense from chapter to chapter kept me reading long into the night.",
    "post_time": "Reviewed in the United States on February 21, 2022",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is so hard to put down. It drew me in from the first page and carried me through out its entirety! I found myself not wanting it to end. I wanted to savor every word! You must read this book!",
    "post_time": "Reviewed in the United States on October 8, 2023",
    "pid": "1984819909"
},
{
    "title": "Lisa Winngate Never Disappoints",
    "rating": "5.0 out of 5 stars",
    "content": "I could hardly put this book down!  The author follows the lives of two women, one a former slave from post Civil War times and her journey from Louisianna into the still unsettled Texas to  find her missing master with two unlikely companions, a woman who she once was the personal slave to as a child, and the daughter of the \"master,\" conceived with a one of the slaves and supported secretly by the the master. The other is a Bennie  a first year teacher in a  poor small high school in the 1080s in Louisianna.  The stories soon begin to intertwine when Bennie, the teacher, challenges her students to learn the history of the people in their town.  Students soon learn why both blacks and whites in their community have the same last names.  Lost Friends was an actual newspaper column where freed slaves searched for their families that had been sold off to different \"masters.\"  A unique story for anyone who enjoys historical fiction!",
    "post_time": "Reviewed in the United States on June 5, 2020",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you enjoyed ‘Before We Were Yours’ you will like this book. I consider myself well read, however, I had never heard about the ‘Book of Lost Friends’ before.",
    "post_time": "Reviewed in the United States on June 8, 2020",
    "pid": "1984819909"
},
{
    "title": "Excellent read",
    "rating": "5.0 out of 5 stars",
    "content": "Maybe, because I lived mostly in the West and Northeast and am not of color. Many of my heritage learned of those before them verbally as well. This should be a mandatory book read for all students nationwide.",
    "post_time": "Reviewed in the United States on June 8, 2020",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kudos to Lisa Wingate for a spectacular read.",
    "post_time": "Reviewed in the United States on December 9, 2023",
    "pid": "1984819909"
},
{
    "title": "Love all of her books",
    "rating": "5.0 out of 5 stars",
    "content": "I always wondered if people who had been enslaved were able to find family.",
    "post_time": "Reviewed in the United States on February 11, 2024",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Many think that if you are illiterate you are ignorant which isn’t the same. My grandparents came to the USA both illiterate and didn’t speak English. My grandfather could write his name and numbers only. He was an intelligent man who could build anything and knew his numbers like nobody’s business.",
    "post_time": "Reviewed in the United States on November 3, 2023",
    "pid": "1984819909"
},
{
    "title": "Inspiring",
    "rating": "5.0 out of 5 stars",
    "content": "Verbally teaching your children of their family members and dates, places and names makes absolute sense. I won’t spoil anything major. Truly appreciate this. My eyes have been further opened.",
    "post_time": "Reviewed in the United States on February 2, 2023",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I started reading Lisa Wingate books when I purchased \"Before We Were Yours\" and got several friends interested in them.  I have now purchased \"Before and After\" and this one and share them with lots of friends.  An older friend has purchased many of her older books on a discount site and we keep trading back and forth.  This one was slow at first but then I didn't want to put it down after about chapter 4 or 5.  Many of her books have chapters that alternate between the two main characters and this one alternates between 1875 and 1987.  Especially liked the end of some chapters that had 1881 submissions from the Lost Friends letters that were published in the Southwestern newspaper. She has excellent depictions of historical situations and in some of her descriptions, I felt like I was there, hearing, seeing and smelling the surroundings.  Also appreciated it taking place in Texas and Louisiana where I've lived for many years.",
    "post_time": "Reviewed in the United States on May 22, 2020",
    "pid": "1984819909"
},
{
    "title": "A important book about the  South A must read",
    "rating": "5.0 out of 5 stars",
    "content": "Great story!  Love the writing- you're truly immersed in the feeling of the narrator.  I've enjoyed many books from Wingate!",
    "post_time": "Reviewed in the United States on July 8, 2020",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I loved this book,a great read.",
    "post_time": "Reviewed in the United States on December 25, 2022",
    "pid": "1984819909"
},
{
    "title": "A real eye opener!",
    "rating": "5.0 out of 5 stars",
    "content": "Wow, I had read stories similar to the problem of the slaves in the South, but never to the extent that Lisa has shown! I will never look at the terrors of the slaves the same way again. Lisa helped me to see these people as “real” - their hurts, years of suffering, children being ripped from their mother s arms - I felt as if I was there. Then the future - oh my! I did not want this book to end! My mind is still reeling. People still are treated differently, and people want to keep the reality of what happened hidden. Yes I know this to be true yet today in 2020. I have dear friends who live in the south who can vouch for this! I highly recommend this book. I thank Lisa Wingate for a much needed eye opener and well written book!",
    "post_time": "Reviewed in the United States on October 7, 2020",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Enjoyable story that goes between two main characters set in different time periods. We alternate between the story of Hannie Gossett set in 1875 and Benny Silva set in 1987. Both stories were interesting to read but Hannie's was so much more. I flew through her chapters but not so much on Benny's. We didn't have the suspense and action that was set in Hannie's stories and also a lot of times in Benny's chapters, she would wander off on a tangent and it would tend to bore me. Most of the time it didn't seem necessary to do that but she did it often. Other than that, it was a good story to tell and even better one to learn about.",
    "post_time": "Reviewed in the United States on June 22, 2020",
    "pid": "1984819909"
},
{
    "title": "Fascinating story",
    "rating": "5.0 out of 5 stars",
    "content": "This is an excellent read. I was captured by the compelling story from page 1. As a teacher who has also worked in some impoverished areas of the country, I related to the challenges Benny faced in the classroom. I was also told to be careful about a simple project I used in an elementary classroom setting,about digging  deeply into the student's ancestry.",
    "post_time": "Reviewed in the United States on December 30, 2020",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I was enthralled with this story throughout the entire book and was not familiar with the newspaper advertisements used to track scattered families who were separated after siblings and parents were sold during slavery. Thank you for opening my eyes to these advertisements and reminding me of the chaos ensued in families trying to find each other after the end of the Civil War. The similarities between Benny and Hannie's stories show that families are complex in every time in history.",
    "post_time": "Reviewed in the United States on July 31, 2020",
    "pid": "1984819909"
},
{
    "title": "An Eye Opener",
    "rating": "5.0 out of 5 stars",
    "content": "A bit pollyanish but I liked the bits of history about how former slaves used a newspaper distributed to churches to find family members who had been sold off and separated.  Also interesting to know that many plantations had detailed written records about their 'property' and who were black offspring of the white members of the family and that some of these original records have been preserved in local libraries and historical societies. In fact I have a book written using some detailed records from my husband's family in South Carolina that show such a history, much of it gleaned from old records. If people want to explore their ancestry, this book gives good hints about how you might do that.",
    "post_time": "Reviewed in the United States on November 1, 2021",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "From start to finish I couldn’t put it down. Started out reading it and decided to download the audio version. So glad that I did. The characters were so rich and getting to hear them with the dialect made it even better. For much of the book I read and listened to it at the same time. I enjoyed actually reading the newspaper clippings. Lisa Wingate’s ability to describe a scene is amazing. It’s like you see and hear it as if you were there. I love the way she can pull you from the past to the present and back again. One of the best books I’ve read in a long time.",
    "post_time": "Reviewed in the United States on March 23, 2022",
    "pid": "1984819909"
},
{
    "title": "Sweet story",
    "rating": "5.0 out of 5 stars",
    "content": "I bought a hard copy of this book for my granddaughter after reading it for my book club. It is well researched and historically accurate. It presents an insight to one of the myths of human chattel slavery. Many bigots claim that the enslaved people did not have families or form strong family bonds. This book shows they loved their partners and their children just as those who enslaved them loved their own. It is an excellently written book with vivid descriptions. As both certified American History and English language teacher, I highly recommend it.",
    "post_time": "Reviewed in the United States on November 23, 2022",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Meticulously crafted story weaving characters a century apart into an unforgettable saga of friendship humanity and hope.",
    "post_time": "Reviewed in the United States on April 18, 2022",
    "pid": "1984819909"
},
{
    "title": "A glimpse of history with all its beauty and pain",
    "rating": "3.0 out of 5 stars",
    "content": "A gut wrenching look at slavery and its ugly legacy  and yet it leaves the reader with a sense of optimism as we try to move forward to a place in which everyone recognizes that we are all interconnected and when one rises, we all rise together.",
    "post_time": "Reviewed in the United States on March 17, 2023",
    "pid": "1984819909"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The \"Book of Lost Friends\" was a natural for me after reading \"Before We Were Yours\" and \"Before and After.\"  While the book centers mostly on two key characters' journey and experiences during their search for their family members, it represents many, many families who hoped to find loved ones following their separation from each other via the publication \"Lost Friends\", the inspiration for the book. The setting is historical but the depth of yearning for one's family and friends is timeless. I hope you will enjoy it as much as I did.",
    "post_time": "Reviewed in the United States on August 25, 2023",
    "pid": "1984819909"
}
]