[
{
    "name": "        Breville BJE200XL Juicer, 10\" x 10.5\" x 16\", Silver       ",
    "stars": [
        "77%",
        "12%",
        "5%",
        "3%",
        "3%"
    ],
    "pid": "B000MDHH06",
    "ratings": "12,464 ratings",
    "other_info": {
        "Brand": "Breville",
        "Color": "Silver",
        "Special Feature": "Cord Storage",
        "Product Dimensions": "9.84\"D x 9.06\"W x 15.75\"H",
        "Finish Type": "Glass,Silver,Steel"
    },
    "discount_price": "$ 79.95",
    "normal_price": "$5.00",
    "about_this_item": [
        " The Breville Juice Fountain Compact may be small but it is packed with power. The compact electric juicer features a 3 inch wide chute allowing you to juice whole fruits and vegetables and conveniently collects pulp within the footprint of the unit to conserve counter space  ",
        " UNIQUE EXTRACTION SYSTEM: The compact centrifugal juicers titanium reinforced disc and Italian-made micro mesh filter basket are made out of stainless steel and together are designed for optimum juice and nutrient extraction  ",
        " SHORT PREP TIME: The Breville juicer machines unique 3 inch extra wide chute feed allows you to juice whole fruits and vegetables without pre-cutting  ",
        " BUILT-IN FROTH SEPARATOR: Certain fruits or vegetables create froth when juiced; The juice jug features an integrated froth separator to pour more juice, less froth into the glass  ",
        " COMPACT DESIGN & CONVENIENT STORAGE: The Juice Fountains compact design makes it suitable to store in small spaces and the power cord wraps around under the base making storage neat and simple  ",
        " INCLUDED ACCESSORIES: 25 fl oz Juice Jug with Froth Separator and Cleaning Brush  ",
        " CAPACITY: 25 fl oz Juice Jug and 1.6 qt Pulp Container  ",
        " WARRANTY: 1 Year Limited Product Warranty; Power: 700 Watts; Voltage: 110 to 120 Volts  "
    ]
},
{
    "title": "Love it!! Compact, works well, easy to clean!",
    "rating": "5.0 out of 5 stars",
    "content": "Love it! Compact, easy to use, works great, inexpensive, easy to clean!",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Don’t be put off by bad reviews… this is a great personal juicer! After seeing some  reviews that say it can’t handle greens, I almost didn’t purchase this model, but I’m glad I did.",
    "post_time": "Reviewed in the United States on December 25, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "This Breville juicer is affordable, works great, and is an excellent investment toward healthy living ...",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this to make juice daily for my husband and me. I wanted something that worked well, especially on greens and beets (I wanted to make beet juice to lower my husband’s blood pressure) and I wanted something inexpensive (my husband thought it was a fad and doubted how often we would use it).",
    "post_time": "Reviewed in the United States on February 28, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It’s not a commercial juicer. It’s not a macerating juicer (those extract more- they’re also more expensive). If you want a macerating commercial juicer, buy something else.",
    "post_time": "Reviewed in the United States on April 5, 2011",
    "pid": "B000MDHH06"
},
{
    "title": "Works great, and the price is right!",
    "rating": "5.0 out of 5 stars",
    "content": "This is an inexpensive, compact (great for my small kitchen), durable, easy to use, easy to clean juicer. It works great- handles kale, watercress, carrots, beets, oranges, apples, ginger, and turmeric with ease. All you have to do is follow the directions (if you go slow, you get more juice). We love it and use it pretty much every day- and my husband lowered his blood pressure and got off his medication. I highly recommend it!",
    "post_time": "Reviewed in the United States on September 9, 2011",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you've ever seen the movie",
    "post_time": "Reviewed in the United States on March 23, 2014",
    "pid": "B000MDHH06"
},
{
    "title": "Works well for the cost, but not perfect",
    "rating": "5.0 out of 5 stars",
    "content": ", you probably immediately put the Breville on your wish list.  I saw the movie and on it went.  No, I'm not fat, but have always tried to eat as healthy as possible.  Although Joe Cross purchased a heavier duty Breville, this one definitely suits my needs for now and was affordable.  Not much if anything to say negative about a product I carefully thought out before purchasing, but I'll set out a comparison \"chart\" of all the Brevilles so you can take a look.  I snagged these from Breville.  Cut, paste, and print them out for side-by-side comparison.  I've also added a few books you might wish to take a look at.",
    "post_time": "Reviewed in the United States on January 24, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You don't just get a little pamphlet that is passed off as a user guide, you actually get something more in line with a book (English, Spanish, and French).  It includes everything you need to know, especially tips on juicing and a trouble guide.  It even includes several recipes under the categories fresh starts, vitamin boosters, liquid lunches, icy coolers, spirited juices, energy fuel, and fiber favorites.  After using this juicer, the verdict?  It's affordable, works great, and is an excellent investment toward healthy living.",
    "post_time": "Reviewed in the United States on May 8, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Awesome Juicer.... love it!",
    "rating": "5.0 out of 5 stars",
    "content": "POPULAR JUICING BOOKS:",
    "post_time": "Reviewed in the United States on March 18, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "BREVILLE JUICERS:",
    "post_time": "Reviewed in the United States on May 19, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Works but is a bit messy and small chamber",
    "rating": "4.0 out of 5 stars",
    "content": "First time juicer here I will say if you’re planning on making small batches of juice for yourself this works great if you are planning on bottling and storing juice a weeks worth, I do not recommend this juicer as you will have to turn off the unit and take out all of the pulp as the chamber is small and it fills up fast regularly, it is very easy to clean and take apart however. Overall great juicer, very powerful. The only downside to this is the feeding shoot once the vegetables are fruit are being juiced, the residue and airflow content pushes Some of the food particles up and out of the unit when your trying to push some in, it is a messy process using this unit. Make sure to do this somewhere where it’s easy to clean as it will spit out remnants of food once it starts getting too full. Broccoli and kale was a nightmare as they are very leafy.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "2 months ago after seeing an infomercial at 3am I bought a Bella Nutripro cold press juicer. Loved it. I was extremely careful with the juicer. I only used it for veggies and cut up the pieces to 1-1/2\" so Bella wouldn't be stressed.",
    "post_time": "Reviewed in the United States on October 24, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "OMG!! I'm In Love With This Juicer! Please Read, Need Feedback.",
    "rating": "5.0 out of 5 stars",
    "content": "One day about 3 weeks after getting my juicer I was juicing carrots (small pieces at a time, trust me) and Bella up and died!! The motor groaned and stopped. I hit the Reverse button as the instructions stated and nothing. I opened the juicer to find the auger stuck inside the yellow filter with tiny pieces of carrots squeezed in between, making it impossible to separate the 2 pieces. Customer service said to soak the pieces in soapy water for an hour. Didn't work. Customer service then said to wait for the return ticket and send the unit back. Once received they would send me a new unit. It took a full week and a half to get the return ticket and another week for them to ship out the new unit. Customer service assured me it was a fluke and wouldn't happen again.",
    "post_time": "Reviewed in the United States on January 12, 2016",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A few weeks after receiving the new juicer the exact thing happened except I wasn't juicing carrots. This time I was juicing kale and cucumbers. Needless to say I was shocked. I had paid $200 for the Bella Nutripro. This time customer service offered me the option of getting yet a third unit or a full refund. I chose the refund, hung up and went to Amazon to check my options.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Better than my previous Jack LaLanne juicer.",
    "rating": "4.0 out of 5 stars",
    "content": "I spent a day and a half reading reviews before choosing the Breville BJE200XL. I was concerned about the difference between masticating and centrifugal. I had read that my experience with the Nutrapro was common problem with masticating juicers. What sold me on the Breville was a note on their website that says: Breville's juicing system extracts more juice and transfers less than 1.8 degree F of heat to maximize nutrients, enzyme and vitamin yield in it's natural form. There's a link to some test results conducted by the Australian Government National Measurements Institute verifying these results.",
    "post_time": "Reviewed in the United States on December 4, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "DID MY FIRST JUICE TONIGHT. The ingredients were organic: kale, spinach, cucumber, celery, green apples, lemon. Here are my thoughts on the differences between the Bella Nutripro and the Breville:",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "We are happy with this juicer.",
    "rating": "5.0 out of 5 stars",
    "content": "Both were delicious. The juice from the Breville was thinner. There was less 'stuff' in the juice. I read that 90% of the good stuff is in the juice and not the pulp. If this is true thinner is fine. Prep for the Breville was 1/4 the amount of time I spent prepping for the Nutripro, because I was cutting everything up in such tiny pieces. **BY THE WAY, by the time I got to actually juicing with the Nutripro the apple slices were turning brown. Since such a huge amount of prep work is involved with masticating juicers, and the fruit starts to oxidize on the cutting board doesn't that defeat the purpose of a masticating juicer?",
    "post_time": "Reviewed in the United States on September 29, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Another thought. The juice collection jug for the Nutripro is open so the juice is exposed to the air while juicing. Again, doesn't that defeat the purpose? The juice jug on the Breville is closed.",
    "post_time": "Reviewed in the United States on February 26, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "4 days of using it, and its a really good value",
    "rating": "5.0 out of 5 stars",
    "content": "With the Breville there definitely was splatter, but there was also splatter, although less, with the Nutripro. But I have used a wok and other cooking methods and there is always something to clean up, so a little splatter is nothing.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Which brings me to clean up. An absolute breeze with the Breville and much longer with the Nutrapro. The Nutripro filter took forever, and lots and lots of water.",
    "post_time": "Reviewed in the United States on December 10, 2011",
    "pid": "B000MDHH06"
},
{
    "title": "Love this Breville Compact Juicer - best juicer I've ever had!",
    "rating": "5.0 out of 5 stars",
    "content": "Compared to my old Jack LaLanne Power Juicer, this Breville Compact juicer is far superior.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It is way more powerful, faster, quieter and lighter.  It is also very easy to assemble and clean.",
    "post_time": "Reviewed in the United States on April 7, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Excellent, well built juicer for the money!",
    "rating": "5.0 out of 5 stars",
    "content": "What a nice surprise.  Highly recommend this juicer to all.  Thank you Breville.",
    "post_time": "Reviewed in the United States on November 26, 2015",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I've owned this juicer for roughly a week now.  I bought it the morning after watching \"Fat, Sick and Nearly Dead\".  That is a highly motivational film, if you haven't seen it.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Excellent yet affordable juicer!",
    "rating": "5.0 out of 5 stars",
    "content": "My wife and I have both wanted to drop 20-ish pounds which have magically appeared over the past several years.  We've tried a lot of things -- gym memberships (went inconsistently), P90X (which is absolutely fantastic, and I would recommend to anyone, but requires a tremendous amount of will-power to stick to it; definitely not for the faint of heart), and the BodyMedia armbands (from Costco) that measure daily caloric burn and help you measure your meals (via website and diligence).  The BodyMedia bands are great as well, but we both always felt hungry, and got tired of focusing on the caloric deficit, meal tracking, etc.  In the end, the core issue wasn't the calories (although they've proven the key to weight loss is caloric deficit).  It was the type of food we were consuming, and wanting to consume.  \"Fat, Sick and Nearly Dead\" brings a lot of this to light.  Which is why I promptly purchased a juicer afterwards.",
    "post_time": "Reviewed in the United States on November 26, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Now, this is the third juicer I've owned, and for the money, I highly recommend it.  The first, I had on loan, was a Cuisinart, and eventually had to give back.  It was decent, but very basic, and a pain to clean.  The second one, (I don't recall the brand) at about a month in, the parts melted in the dishwasher, and would no longer fit together, making it useless.  Oops.  That juicer was a decent juicer, but was extremely loud, always smelled like petroleum (maybe unsealed motor bearings or plastic used, who knows) and the spin rpm was no where as fast as the Breville.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Love it!",
    "rating": "5.0 out of 5 stars",
    "content": "Fast forward to today.  I've been using the Breville daily since it arrived, sometimes twice daily.  While it isn't perfect, there are a lot of things that make it great -- the two biggest being the ease of cleanup, and the overall quality of engineering (except the a couple of things that seem like oversights).  The only real negative I see is the design of the chute -- it's directly located over the center of the blade, and for some reason, this juicer likes to float bits of pulp back up the chute, and out the top.  So, you always have to keep one hand over the opening when putting ingredients down the chute.",
    "post_time": "Reviewed in the United States on March 18, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Some other observations :",
    "post_time": "Reviewed in the United States on January 28, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Great juicer at a reasonable price.",
    "rating": "4.0 out of 5 stars",
    "content": "- The pulp output from this isn't nearly as wet as some people claim, so i don't feel like it's wasting juice, and we've juiced pineapple, carrots, apples, celery, pears, broccoli, lemon, beets, strawberries, among other things that are traditionally full of liquid.",
    "post_time": "Reviewed in the United States on August 6, 2011",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "- The blade is unbelievably sharp.  Be very careful while cleaning.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Great so far, although it's already starting to leave chunks",
    "rating": "4.0 out of 5 stars",
    "content": "I'm brand-new to juicing. I bought this here just under two weeks ago, and have been using it for lunch every day since. Roughly 12 uses, 2 times through the dishwasher, and I've been rinsing and cleaning with the little scrubber after every use.",
    "post_time": "Reviewed in the United States on May 9, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First use, it was amazing to me how well and how QUICKLY it worked! I was elated. It very-quickly turned my ingredients into 8 ounces of juice and easily collected very-dry pulp in the sides. I didn't really have to do any prep at all, other than cleaning the veggies and cutting the apples in half. Cleanup was easy (I'd been forewarned in the reviews on here about how food shoots straight up, so I always make sure that the pusher is above the veggies, even if it's not strictly needed. Because I block the veggies from shooting straight up with the pusher, veggies shooting straight up was never a problem for me. I also make a point of always, ALWAYS, using the provided jug lid). It's worth noting, though, that there's always a tiny amount of juice left over in the bin that you'll want to tilt into the jug before lifting off the base, or it'll drip all over. But other than that... I'm amazed at how well everything but the cutting thing just rinses off. And it takes up so little counter space... a very important consideration in my tiny kitchen.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Quick, easy cleanup",
    "rating": "5.0 out of 5 stars",
    "content": "Lately, it's been starting to consider entire pieces of food to be pulp, but it's still yielding a pretty-good amount of juice.",
    "post_time": "Reviewed in the United States on June 21, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So, the juicer itself is fantastic. Very compact, very simple to clean, VERY easy to prep (at least, if you buy organic and therefore don't have to peel things)... and I'm feeling so much better, and sleeping so much better than I did before, even with it just replacing one meal a day (I dare not do more than one, because I haven't been medically cleared and I think there's something to be said for having SOME complex carbs, fats, and proteins in your diet!)",
    "post_time": "Reviewed in the United States on September 20, 2010",
    "pid": "B000MDHH06"
},
{
    "title": "Breville BJE200XL - Review from a \"Junior\" Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "I just have one, little, complaint, or rather a rant... not so much about the juicer as about the recipes included with the juicer. One recipe in particular.",
    "post_time": "Reviewed in the United States on May 11, 2018",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So, there are recipes included with the juicer. These recipes, presumably, are for people who are, like myself, brand new to juicing. One recipe is in a little booklet attached to the juicer, and it calls for, \"4 stalks of celery, 1 apple, 3 inches of fresh ginger, and 3 carrots.\"",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Almost perfect",
    "rating": "4.0 out of 5 stars",
    "content": "So I, being new to juicing, looked at this recipe that was presumably written for people who are new to juicing, and dutifully put in 4 stalks of celery, 1 apple, 3 carrots, and then I looked at the \"3 inches of fresh ginger.\" I thought, \"3 inches? What does that mean? Ummm...\" and then I did the only thing I could think of... I broke off 3 inch-long pieces of fresh ginger and put them in the juicer, thinking that ginger must have an awful lot of pulp to require that much for a single serving of juice.",
    "post_time": "Reviewed in the United States on January 7, 2016",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "...It woke me up; I'll say that much. :) But here's the kicker... I later asked my father, who's been a very good amateur cook for over 40 years, but has never juiced, what HE thought, \"3 inches of ginger\" was supposed to mean. He had no idea either. I found out today... TODAY... that apparently it meant 3 inches diameter! Ok, first of all, why didn't the recipe, written for beginners, SAY that? And second, what kind of recipe uses \"diameter\" as a unit of measurement for ingredients? How are we even supposed to use that... is ginger supposed to be naturally spherical? 'Cause it isn't... Why doesn't it just use ounces, like every other kind of recipe that asks for raw, ungrated ginger?",
    "post_time": "Reviewed in the United States on August 15, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "So glad I made this investment in my health :)",
    "rating": "3.0 out of 5 stars",
    "content": "*sigh* So, I've recovered from the little practical joke that Breville played on us gullible beginners. Almost. :\\",
    "post_time": "Reviewed in the United States on January 20, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Anyway, great juicer, great convenience, sucky recipes. :)",
    "post_time": "Reviewed in the United States on April 8, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Quick set up and cleaning",
    "rating": "5.0 out of 5 stars",
    "content": "Love that it came with its own brush,  love that it doesn’t have a bunch of pieces so it comes apart and assembles easy! Has a great little pitcher with a fitting whole so there’s no splashing on the counter of what you’re juicing. Great buy for the money.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is perfect for my needs.  Easily creates fruit/vegetable juices and best part of all is that it is easy to clean.  Highly recommend this juicer.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "love this juicer",
    "rating": "4.0 out of 5 stars",
    "content": "This is my first juicer and I've been using for 3 months now.",
    "post_time": "Reviewed in the United States on April 10, 2009",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Construction - well built and sturdy plastic container.  Metal juicing basket with blades is rigid and not flimsy in the slightest.  Pieces fit together snugly and there are plenty of visual cues to make it easy for any one to assemble.",
    "post_time": "Reviewed in the United States on June 13, 2015",
    "pid": "B000MDHH06"
},
{
    "title": "A solid juicer for the price",
    "rating": "4.0 out of 5 stars",
    "content": "Downside - over time there has gotten to be a little fruit residue in the seams of the plastic with no way to clean.  It gets washed well each time, and since its in the catch area I'm too worried.",
    "post_time": "Reviewed in the United States on August 15, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Use - The noise the motor makes seems reasonable - there is a motor going a couple hundred rpm what do you expect?  The chute is in the center and fits most things I toss at it.  May have to cut some apples in half or break up a grapefruit but thats about it.",
    "post_time": "Reviewed in the United States on April 7, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Go-go juicer is a real winner!",
    "rating": "4.0 out of 5 stars",
    "content": "Downsides - Don't use this unit under a cabinet or at least pull it forward.  When moving the plunger up the chute for the next piece of fruit air flows up and can carry drops of juice or small splatters of pulp.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you are doing a large amount of fruit, the enclosed catch basin can be a pain.  I can juice 4-5 pounds of oranges without stopping but anything more then that and I have to stop and empty it out.  I get an average of a quart or so of juice from 2.5# bag of oranges.",
    "post_time": "Reviewed in the United States on February 12, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "looks nicer on the counter than the old one",
    "rating": "5.0 out of 5 stars",
    "content": "Cleanup - pretty much a couple minutes and its good to go.  I've always cleaned the metal mesh basket right away and have had no problems.",
    "post_time": "Reviewed in the United States on February 16, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Experience - Over all I like the juicer and its worked well for me.  After about a month I stopped making OJ by the glass and would make a half pitcher or so to last us a few days to save time and cleanup.",
    "post_time": "Reviewed in the United States on February 11, 2014",
    "pid": "B000MDHH06"
},
{
    "title": "Great juicer with issues",
    "rating": "4.0 out of 5 stars",
    "content": "This is a great juicer with power and is easy to clan with 7 parts.  But I hve two issues which have to do with it making a mess.",
    "post_time": "Reviewed in the United States on August 27, 2023",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "1. The food shoots out of the chute when it is open, which is when you are inserting the food...putting your hand over the chute is the best bet to keep a mess to a minimum.",
    "post_time": "Reviewed in the United States on November 18, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Some good, some bad, some ideas...",
    "rating": "4.0 out of 5 stars",
    "content": "2.  The lid on the dispenser falls off when pouring.  Solution - make a twist top that won't fall out.",
    "post_time": "Reviewed in the United States on November 9, 2011",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have also purchased a $49 masticating juicer attachment for my KitchenAid and will compare it with this juicer.  This centrifugal juicer is fast, which is a plus..I juiced four oz of carrot juice and put the pulp through the kitchen aid and got another ounce...worth it, I guess it's up to you to decide.  The result is a little more to clean for a little more juice.  For hard items the Breville juicer is best as the strong motor really cuts up the food.",
    "post_time": "Reviewed in the United States on March 16, 2014",
    "pid": "B000MDHH06"
},
{
    "title": "A zippy juicer!",
    "rating": "4.0 out of 5 stars",
    "content": "I'm not a juice fanatic or claim to know a lot about juicing or juicers, but I was expecting a little more considering all the great reviews. Granted the only other juicer I've really ever used was my mom's old champion. I chose not to get a champion or similar unit for several reasons, and this one seemed a better choice considering:",
    "post_time": "Reviewed in the United States on October 6, 2011",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "1. Size - I have a tiny apartment now and have 0 space.",
    "post_time": "Reviewed in the United States on February 13, 2014",
    "pid": "B000MDHH06"
},
{
    "title": "Buy the next level up! Please!",
    "rating": "5.0 out of 5 stars",
    "content": "2. Weight - when I bought this I was looking at a job that would have had me moving overseas. Didn't want to ship.",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "3. Cost - self explanatory. First, I bought this one refurbished on amazon. I know myself well enough to know I would use it quite a bit at first, then would quickly taper off to something I use seldom to rarely. I was right and am still glad I didn't spend 3 or 4 times as much on something fancy.",
    "post_time": "Reviewed in the United States on October 11, 2023",
    "pid": "B000MDHH06"
},
{
    "title": "Amazing piece of equipment!",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this primarily for making carrot juice and it works fairly well for that. Good amount of juice, not too much foam, and the pulp was \"reasonably dry\".",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The other day I got the bright idea to do a \"juice cleanse\" so I started running a bunch of other things through. Though it's not a bad product I found several things I didn't like. Also came up with some ideas to make it a little better.",
    "post_time": "Reviewed in the United States on March 7, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "I've Finally Found A Good Working Juicer 😁",
    "rating": "5.0 out of 5 stars",
    "content": "I am a Senior Citizen who's had Heart Surgery with many other life threatening issues that has made me want to start a Healthier lifestyle So after purchasing my first juicer which was a Hamilton Beach Big Mouth which I kept smelling a burning smell every time I used it.  I returned and almost gave up on finding a decent juicer Then i did more research and decided to try this one. The first time I used it everything juice very well except for the oranges at the end, and it made my juicer leak from around the hinges but I remembered the oranges were starting to get soft as I had them for a while then thought I like this juicer, it juices everything else and it's doesn't have a burning smell and much quieter, so maybe the oranges were the problem. So I went to the Produce Market and loaded up again, this time with fresh, solid Oranges and started juicing again with the beats and harder fruits and vegetables first and at the end I did my oranges and Boy was i Happy to not see any leaking!!!.. Now I can finally say that I have a good juicer that juices everything and is not smoking, leaking, burning or showing any sign of defects. It also doesn't make a Mess!!! And Extremely Easy To Clean!!!.. Thank You So Much Breville!!! 😁🙏",
    "post_time": "Reviewed in the United States on July 3, 2023",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is amazing. I am a first time owner of a juicer and I could not be happier. I was looking for something that was inexpensive, but still gave me quality results. The Breville does just that. The size is small enough to leave on the counter, only because I use it everyday. Otherwise, I'm sure it would be a little difficult to find a space in a cabinet.",
    "post_time": "Reviewed in the United States on March 14, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Liquid energy",
    "rating": "4.0 out of 5 stars",
    "content": "Performance is exceptional. The chute is big enough to put in a small apple without cutting it. Other fruits such as bigger oranges and pineapple halves need to be cut in half but other than that there is little cutting involved. It gives you clean, smooth juice with no pulp. The pitcher it comes with strains or \"holds\" the froth that is produced by the fruits and veggies when you pour your drink.",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One huge plus about this machine is the easy clean up. After I juice in the morning, I immediately disassemble the juicer, discard the pulp, and simply rinse out the parts with water! Since it is used more than once per day I usually only use soap when I know it will be the last time I am using the juicer for the day. If I use dark pigmented produce that leaves a residue, I will use soap immediately so it doesn't stain. The basket/strainer that catches the pulp needs a little more time to clean. It comes with a brush that you use to scrub off the remaining pulp. Very easy. Total clean up is probably 7 minutes.",
    "post_time": "Reviewed in the United States on August 10, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "So far so good",
    "rating": "4.0 out of 5 stars",
    "content": "My ONLY complaint is the size of the pitcher that comes with the juicer. I notice that when I use a large amount of produce, it fills up quickly and I have to pour some of the juice into another glass and continue juicing afterwards. When I'm done I pour all the juice into a large pitcher and mix it together. I can't simply use the large pitcher in the beginning because the size of the pitcher given to you fits perfectly under the nozzle where your juice comes out. And the pitcher comes with a lid so the juice doesn't splash all over the place. Other than a small inconvenience that is tolerable, I am happy!!",
    "post_time": "Reviewed in the United States on February 9, 2014",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I am very very pleased with my purchase. Juicing fresh fruits and veggies in the morning has helped me ELIMINATE coffee! That is huge for me. It has given me an overall increase in my daily energy. And many other health benefits I am noticing each day.",
    "post_time": "Reviewed in the United States on July 14, 2011",
    "pid": "B000MDHH06"
},
{
    "title": "So far so good for my first juicer.",
    "rating": "5.0 out of 5 stars",
    "content": "If you are thinking about purchasing a juicer.... don't wait!! Let this juicer change your life!",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve been using this juicer for one week and it’s super easy to use and clean! I’ll be updating this on a few months depending on how the motor is running lol",
    "post_time": "Reviewed in the United States on March 1, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "hard to clean, pulp gets wetter as it gets older",
    "rating": "5.0 out of 5 stars",
    "content": "I've been using for two weeks straight everyday about, and its run like a champ.  I've read all these reviews before purchase and took the necessary step that you must clean after usage.  Cleaning takes about 3-5 minutes, easy.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "One warning following recipes, EASY ON THE GINGER!!!  Goodness that stuff blew my mind when i used root, burned my eyes when juicing as well.",
    "post_time": "Reviewed in the United States on October 1, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Better than the JE98XL!",
    "rating": "5.0 out of 5 stars",
    "content": "I LOVE this juicer!  I wanted to get into juicing, wanting to get healthier, thinking I would like it, so I did my research on amazon and ultimately ended up with the BJE200XL Juice Fountain Compact due to reviews/price.  I was considering getting one of the higher end/more expensive Breville models, but ultimately decided on this one...and I am very happy that I did.  It is compact, it is powerful, and it is relatively easy to clean (which cannot be said for all juicers).  I basically just \"rinse\" my juicer parts rather than thoroughly wash them, as it gets all the vegetables off, and I'm always using it for the same purpose every time!  I read somewhere that a quality juicer should have a minimum of 400 Watt motor, so the 700 Watt motor on this juice fountain is more than adequate.",
    "post_time": "Reviewed in the United States on April 27, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My mother purchased the one step up Juice Fountain Plus JE98XL, and while I was home over Thanksgiving I gave it a try, and believe it or not I prefer my Compact Juice Fountain much more.  While the Juice Fountain Plus has 2 speeds, 150 more Watts, and a slightly larger vegetable waste capacity, it is significantly more difficult to clean with more pieces, it isn't as compact, and the pieces don't fit together as nicely...it leaked slightly!  It just doesn't seem as sound of a design as the Juice Fountain Compact, and wouldn't recommend it personally.",
    "post_time": "Reviewed in the United States on July 18, 2017",
    "pid": "B000MDHH06"
},
{
    "title": "Good enough",
    "rating": "4.0 out of 5 stars",
    "content": "I've used my machine well over 100 times by now, and my only complaints are that the container for the juice could be slightly larger...when I juice I like to make enough for now, and then 1 or 2 cups to store in the fridge for later or the following morning.  So if I'm making a large batch of juice, I may have to stop in the middle, empty the containers contents into the glass pitcher I'm going to store it in, and then continue, and add the second batch in the same pitcher for storage.  Not a huge deal, just an inconvenience.  Additionally there is a rubber nozzle piece on the spout where the juice flows from, and it fell of after my third or fourth time juicing, and I lost it.  It hasn't compromised the use of the machine at all, and won't stop me from highly recommending this machine.",
    "post_time": "Reviewed in the United States on April 28, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My goto power juice has been celery, cucumber, kale, carrot, green apple, beet, lemon, ginger.  It's delicious.",
    "post_time": "Reviewed in the United States on July 19, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Makes Juice and Noise",
    "rating": "5.0 out of 5 stars",
    "content": "I'm a juicing advocate from way back so I wanted to write as accurate a revue as possible. First this juicer is not compact. It's slightly smaller as my old LaLane. Just doesn't have the catch all container on the outside. It is very quite for a juicer. My old Champion could wake the dead. I'd compare it to my Omega. This jucier is easy to clean and assemble. Cleaning took me under 3 minutes. I timed it. Then less than 1 minute to put it back together. Timed that too. The catch all canal is narrow. I have small hands so I was able to scoop up the pulp but I can see why people would have a hard time. Just use a flexible spatula. The first run I juiced 1 medium red delicious, one large cucumber, 3 smaller celery stocks, and 3 thin carrots. That made 10 oz of juice. The catch all was 3/4 full. The pulp was on the wet side. I squeezed out 3 T. Out of 10 oz if that's too much juice to loose just get a bit of cheese cloth or use your hand. I make my dog's food so safe veg and fruit pulp go into it. The rest the soil gets. The foam, using the cup provided was 1/3\" high. After stiring it was about 1/8\". The juice is clean, no sludge. This jucier is a grater not a smusher. I've read several reviews saying graters will kill your juice because of temperature. Old research says enzymes are rendered inactive at 110 degrees. The latest I've read is 140. I didn't take the juice's temp but I do know it was quite cool. I'd say if the second it takes for the produce to run over the blades, if that heats your juice to even 110, you better unplug that machine quick. I do recommend this machine for single glasses of juice. Or if you're not an anal prefectionist. I've had 5 juicers. High end smushers to mid-priced graters, there's something wrong with all of them. The one I do want, that anyone giving you a hard time about their stellar jucier compaired to your little compact, you can throw this at them... a $2k hydrolic press. It presses the produce breaking the cell walls. If someone doesn't have that kind, they have no room to crisis. Which they shouldnt do anyway but there are too many juicing \"purists\" who need to get over themselves.",
    "post_time": "Reviewed in the United States on January 1, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I used this to make a variety of juices involving carrots, oranges, beets, kale, celery, cucumbers, lemons, apples, etc. I sometimes felt like if I didn't get the pushing tool in fast enough the juicer would throw large chunks of food out into the pulp bowl, which was somewhat disconcerting. I tried a couple of times to rejuice the pulp just in case I was missing out on something, but I wasn't, so the juicer was doing its job.",
    "post_time": "Reviewed in the United States on December 21, 2023",
    "pid": "B000MDHH06"
},
{
    "title": "Amazing Product, Outstanding Customer Service",
    "rating": "5.0 out of 5 stars",
    "content": "I did have a few items try to come flying back out at me. Leafy greens will work in this, but you have to bunch them up.",
    "post_time": "Reviewed in the United States on October 6, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It is somewhat noisy because the thing is spinning at something like 14,000 RPM. I'm not saying the noise was unbearable, but be mindful if you have anyone in your home sleeping nearby (especially in an apartment).",
    "post_time": "Reviewed in the United States on February 11, 2021",
    "pid": "B000MDHH06"
},
{
    "title": "Awesome juicer as long as you understand it's limits",
    "rating": "5.0 out of 5 stars",
    "content": "Cleanup is fairly easy. Not too many parts to get it clean. The juicer includes a spatula/brush tool that works perfectly for scraping out the pulp bowl. The brush is meant for the filter basket. I did find scrubbing that thing to be somewhat irritating because of how fine the mesh is, but it has to be to do its job correctly. I did not find putting the filter basket in the dishwasher to be helpful at all. If you use this regularly just rinse everything out thoroughly in hot water and that should be adequate. Don't let any of the pulp sit for long or else you will be using a washcloth every time. I would typically put it in the dishwasher once every few days to get a more thorough cleaning.",
    "post_time": "Reviewed in the United States on January 26, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The juice cup is adequate for a single person such as myself.",
    "post_time": "Reviewed in the United States on November 10, 2014",
    "pid": "B000MDHH06"
},
{
    "title": "Exactly what I expected",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first juicer. If you have done any research you will know that this is a great price for a serious juicer. I checked many stores both online and on location and its hard to find this kind of machine for this price. Some go for as high as $500! Way out of my price range for a juicer. Not sure what a $500 juicer does that this juicer doesnt do. Maybe you can stuff an entire apple tree into it without a hiccup. Who knows.",
    "post_time": "Reviewed in the United States on November 1, 2011",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Right out of the box the Breville Juicer is easily assembled and ready to whip up some fresh juice. It helps to read up on tips on how to prep the fruits and vegetable prior to juicing. Operation is simple. Turn it on and go. No fiddling with speeds or power level. The strength of the juicer has been sufficient to grind up everything I have put in there. Carrots, celery, and radish are easily handled. Not sure if there are any harder produce that I would be testing. So its power is perfect for what I use it for.",
    "post_time": "Reviewed in the United States on August 24, 2007",
    "pid": "B000MDHH06"
},
{
    "title": "WOW - Way better than expected - XLNT daily juicer",
    "rating": "4.0 out of 5 stars",
    "content": "The sound level is moderate. I very much dislike loud appliances. All this technology and we cant make a quite vacuum cleaner! The juicer however isnt too loud at all. Comparable to a average blender. It is at its loudest when tackling carrots and such - but it makes such quick work that you dont even notice. The only gripe I have is the design of the spout and juicer cup. When pushed right up against base of the juicer the cup handle gets in the way of the ON/OFF switch. Unfortunately the cup only goes on one way. The cup lid design prevents you from facing it any other way.",
    "post_time": "Reviewed in the United States on August 9, 2020",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One thing I strongly recommend to extend the life of the juicer is to clean it straight away after each use. Cleaning is a breeze. All the parts that get dirty come apart from the base. A quick run through the sink easily washes off the pulp. The hardest part is scrubbing off the mesh filter. This is made easier with the brush that comes with the juicer.",
    "post_time": "Reviewed in the United States on June 28, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "This thing is amazing - So much better than the other type of juicers!",
    "rating": "4.0 out of 5 stars",
    "content": "Very happy with my purchase of my first juicer. Compared to the prices of others I strongly feel that the Breville BJE200XL is a great value for its capability.",
    "post_time": "Reviewed in the United States on January 14, 2015",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I juice at least once a day as I primarily eat raw foods.",
    "post_time": "Reviewed in the United States on August 13, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Great first juicer!",
    "rating": "5.0 out of 5 stars",
    "content": "My Jack LaLane juicer finally wore out after 2.5 years of daily use. I was tempted to buy another - but I liked the way everything including the pulp catcher is all in one unit. So glad I got the Breville.",
    "post_time": "Reviewed in the United States on December 7, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This thing is POWERFUL, especially compared to \"Jack LaLanne\". It is so powerful I usually don't even use the pusher except to cover the top so your ceiling doesn't get covered with stuff. Other reviewers have mentioned that tendency. What wasn't mentioned is that the reason it does that is because the motor is so beefy that stuff will shoot straight up.",
    "post_time": "Reviewed in the United States on May 30, 2023",
    "pid": "B000MDHH06"
},
{
    "title": "Breville Juice Fountain Plus is Better",
    "rating": "4.0 out of 5 stars",
    "content": "When juicing soft stuff I immediately cover the top with my hand.",
    "post_time": "Reviewed in the United States on July 22, 2011",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The design of this thing is absolutely first rate. Even down to the plug, which has a moulded loop so that it is easy to unplug and plug in! No tool is required to remove the basket, as in most other juicers. Breville uses a combo of ingenious design and magnets to hold it in place!",
    "post_time": "Reviewed in the United States on July 31, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Compared to Jack LaLane",
    "rating": "5.0 out of 5 stars",
    "content": "After watching and reading numerous reviews, I decided to buy the Breville juicer over the Jack LaLane (JLaL) juicer. I absolutely love my Breville! I loved it so much that when I went to visit my parents, I convinced them they, too, needed a juicer. Unfortunately, the JLaL was the only juicer available at the time. It was about $20 more than the Breville, so I decided it had to be a pretty good competitor. I do like the JLaL, however, I LOVE my Breville!",
    "post_time": "Reviewed in the United States on June 9, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Breville pros:",
    "post_time": "Reviewed in the United States on December 12, 2019",
    "pid": "B000MDHH06"
},
{
    "title": "Overall a Great Jucer",
    "rating": "5.0 out of 5 stars",
    "content": "*The storage container is much bigger and more practical.  Since the collector is on the side of the JLaL, the pulp comes into the spinning part of the machine making it harder to clean and overall just messy.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "*Easy to assemble with three parts.",
    "post_time": "Reviewed in the United States on July 11, 2023",
    "pid": "B000MDHH06"
},
{
    "title": "Perfect",
    "rating": "4.0 out of 5 stars",
    "content": "*It's less messy. The pulp doesn't come out of the collector into the machine like the JLaL.",
    "post_time": "Reviewed in the United States on December 7, 2009",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "*The pulp is drier = more juice.",
    "post_time": "Reviewed in the United States on March 17, 2013",
    "pid": "B000MDHH06"
},
{
    "title": "I would highly recommend this powerful juicer!",
    "rating": "5.0 out of 5 stars",
    "content": "*More powerful (or at least it appears to be)",
    "post_time": "Reviewed in the United States on October 31, 2010",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "*No drip spout (LOVE... one less mess I have to clean!!)",
    "post_time": "Reviewed in the United States on December 29, 2012",
    "pid": "B000MDHH06"
},
{
    "title": "Tim Taylor Approved",
    "rating": "4.0 out of 5 stars",
    "content": "*I like that it comes with the juice catcher container. (One less thing I have to prepare!!)",
    "post_time": "Reviewed in the United States on December 14, 2017",
    "pid": "B000MDHH06"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "*It eats through my vegetables and fruit like butter.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B000MDHH06"
}
]