[
{
    "name": "        Conair Ceramic Hot Rollers for Long, Medium, and All Hair- Hair Curler - Hair Roller Clips Included - 1 1/2-inch and 1 3/4-inch Rollers - Amazon Exclusive       ",
    "stars": [
        "56%",
        "15%",
        "12%",
        "6%",
        "10%"
    ],
    "pid": "B007S69QAY",
    "ratings": "26,568 ratings",
    "other_info": {
        "Item Form": "Clip",
        "Hair Type": "Curly",
        "Number of Items": "1",
        "Material": "Ceramic",
        "Size": "1 Count (Pack of 1)"
    },
    "discount_price": "$ 38.83",
    "normal_price": "$37.83",
    "about_this_item": [
        " Ceramic Hot Rollers For Voluminous Curls: The ceramic flocked jumbo and super jumbo rollers in this 12 piece hairsetter heat quickly for a natural, high powered shine and voluminous curls and waves  ",
        " Easy To Use: These rollers use Ceramic technology to provide consistently even heat transfer for long lasting curls; They heat up quickly and evenly in 85 seconds; Velvety covering on the rollers helps protect hair from heat damage.Clean the unit and the heating strips with a cloth  ",
        " Full Set: Includes 12 ceramic flocked rollers of two different sizes; Four 1.75 inch super jumbo rollers and eight 1.5 inch jumbo rollers; This special set includes 12 super clips to hold the rollers in place  ",
        " Gorgeous Curls of All Types: Check out our rollers for the big, bouncy curls, voluminous waves and fullness that only hot rollers can deliver; Just roll ‘em, apply makeup, get dressed, unroll and go  ",
        " Conair Hair Care: Since 1959, we have made innovative small appliances, hair styling tools, and more; Our hair care line includes high quality hair dryers, brushes, styling tools, and hair accessories  ",
        " Note : Hot Roller Set should be placed on hard, flat surface (ie: bathroom counter), Lid must remain closed tightly to ensure proper heat up, If too much hair is put around 1 roller, clip will not hold in place as roller is too heavy  "
    ]
},
{
    "title": "Exactly as remembered",
    "rating": "5.0 out of 5 stars",
    "content": "I used to use hot rollers years and years ago. My old set had gotten nasty after 10+ years of regular use. They got tossed during a move and when I tried to get new ones, no one carried them anymore. Fast forward to an Amazon search a couple of days ago.... Perfect, exactly as remembered!! Except for the clips. After reading reviews, I ordered some of those wire ones but they haven't arrived yet. To be honest, the pinch clips weren't as bad as I was expecting, but I do think the older wire ones worked better.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What I like: Put the rollers in and go about the rest of morning prep for the day with them in place. My hair is a bit resistant to curling, and being able to leave these in until they cool creates big soft curls while eliminating the need for super high heat to get the same results with a curling vs flat iron. The curls tend to last a couple of days, with only a little bed head touch-up required on day 2. Happy to be able to use these again.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Clips to hold",
    "rating": "4.0 out of 5 stars",
    "content": "Seller delivered quickly and in new condition. It was a little surprising that they came with no other box or wrapping, but it was all intact. One less Amazon box to recycle I guess. Would definitely buy again.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Love the rollers but clips do not hold.  Purchased the big hair clips once used to  hold back twisted hair. Maybe banana clips?  The big ones hold these in very well. The rollers are great for smooth, not curly.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Great volume",
    "rating": "5.0 out of 5 stars",
    "content": "The rollers work great, however, the clips are terrible. They do not really hold the rollers in well at all. Your hair really needs to be at least should length to use these rollers for the hair to fit around the roller.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These rollers themselves are great, but they must have gotten a boy involved in the decision making for how frustrating these are now. First, 12 rollers is never enough to properly section your head, but that was fine because you could over section and the j hooks would hold them.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Used to be 5 stars",
    "rating": "5.0 out of 5 stars",
    "content": "Now, these don’t come with j hooks anymore. They come with those plastic clips that dent your hair, don’t grip to begin with, and don’t even fit around the 4 1.75 in rollers. This product is now so dysfunctional.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "You’re better off getting velvet rollers that come with j hooks from literally any other brand since the basic hair science of hot rollers (get the hair hot and let it cool in a curly shape) is the same across all roller sets.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Heats up fast!",
    "rating": "4.0 out of 5 stars",
    "content": "If they ever get rid of the clips or at least bring back the j hooks these would be back to 5 stars",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is the second set I have bought! It takes two sets",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Rollers",
    "rating": "4.0 out of 5 stars",
    "content": "I love them other than they don’t heat up enough for my fuzzy hair so the curl doesn’t hold.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Starting off, these rollers impressed me with how quickly they heat up, allowing me to jump right into styling within 5-10 minutes of plugging in (first drawback – no automatic shutoff, you must remember to unplug). Given they are a larger size than standard rollers, I was able to complete my whole head with a few rollers left over. I have thick hair just past my shoulders, so this was a big bonus for me as I have run out rollers with other sets in the past. In my opinion, these rollers will help you achieve a more voluminous, bouncy look vs a true spiral “curl”. See my photo for reference.",
    "post_time": "Reviewed in the United States on March 31, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Good Overall Value For Achieving Voluminous, Bouncy Curls With Just a Few Minor Drawbacks",
    "rating": "4.0 out of 5 stars",
    "content": "While I generally love the overall results, there are a few things to keep in mind. First, these rollers get seriously hot! Be cautious, especially near the neck area. I’ve also noticed the included claw clips to hold rollers in place left slight dents and creases in my hair – for a smoother finish, I recommend purchasing more traditional U-shaped securing pins to hold rollers in place. You can get on Amazon as well. Finally, for long-lasting curls, make sure to leave the rollers in for an appropriate amount of time (minimum 15-20 minutes works best for me after some trial and error) and let them cool completely before removing them from your hair for longer lasting results. To speed up cooling if I'm in a hurry, I either step outside, stick my head in the freezer for a few seconds (lol) or do a cool shot with a diffuser. Don’t use a regular blow-dryer setting or it will just blow the hair around/out of the roller.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Despite the minor drawbacks, I would still recommend the Conair Ceramic Hot Rollers, especially considering the price point and overall value. They're a great option for achieving voluminous waves in relatively minimal time. Just be mindful of the heat against your bare skin, make sure to unplug after use and invest in some traditional pins to avoid unwanted dents for a flawless finish.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Large Set of Rollers Create Beautiful Curls and Volume",
    "rating": "3.0 out of 5 stars",
    "content": "These hot rollers are hot! A word of caution, when you unpack this set, for some reason there is small cardboard dividers between rows of rollers. The problem is they are easy to miss. I did plug it in and then noticed the cardboard thankfully. The clips do work, just anchor them by clipping a small amount of hair above or below the rolled hair and they will stay put.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Does the job! I love having the option to reheat rollers and reuse them",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "These are really nice",
    "rating": "3.0 out of 5 stars",
    "content": "I have been looking for hot rollers that are all large. I finally found this. I wish there were a couple more rollers to accommodate my hair. Some people complained that they did not curl their hair. The purpose of large rollers is to add fullness and smoothness to the hair, not curl. So, if you are looking for curl, do not buy.  My natural gray hair is long and straight. I needed something to give it a finished look without damaging like flat irons and curling irons cause.  These do the trick. The biggest issue I have which resulted in only 3 stars is the terrible flimsy clips that came with them. They do not hold. The hair easily slips out because of the weight of the roller and 2 tiny and bendable claws meant to hold it. I ordered larger claw clips which work fairly well but sometimes can leave a little imprint. I use these rollers but wish they would have thought through the clip issue. Another solution to the problem may be to order large wire clips and place 2 clips per roller if you don't like risking imprint from claw clips. This to me is not a deal breaker since I am happy to finally find rollers that are all large and do not result in heat damage.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love the size of these rollers. I have medium-length thick hair and most of my hair fits in this set. They heat quickly and provide the volume I was looking for. The problem is with the clips that were included with them. They are absolutely useless. I’ve tried securing them several different ways and each time they fall out quickly, heaven forbid you move at all or try to put makeup on with them. I’m disappointed and tempted to lower my rating to two stars, but the rollers are the perfect size for my long hair and do work well. I’m just annoyed that now I have to find another way to hold them in place because they weren’t cheap to begin with and these are the only ones I’ve found with a 2” barrel.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Clips do not work well but there are workarounds",
    "rating": "4.0 out of 5 stars",
    "content": "These rollers give 45 minute blowout results in like 45 seconds…. If you can get them to stay in at least. These flimsy clips are so dumb. It’s a frustrating issue that becomes infuriating as you get the perfect roll and then they all come crashing down. I’ve tried everything to keep these in. I’ve had conair rollers before with metal u shaped slide clips that worked amazingly. I don’t know why you would sell a product that requires bending the rules of physics in order to use properly. Idk maybe if I order 8 large cheap regular claw clips that will work? Anyways sitting here with my bouncy hair that took basically doing one section at a time which defeats the time-saving purpose of these rollers. /rant",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The rollers work really well the material that's on the roller helps to hold the hair in place as you roll it and there's enough heat to give it a nice wave or slight curl, I love the 2 inch rollers. That's what I wanted all large rollers, but as some others have said the clips do not work. I knew that before I bought the rollers so I ordered different clips. They have a lot more prongs and work much better but still not great, need to find a clip that really works well to hold the hair in and in place, but the rollers are great",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Huge rollers",
    "rating": "4.0 out of 5 stars",
    "content": "The rollers were a lot larger than what they appeared online so I returned them. Other than that, the roller unit was nice. Good quality rollers.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love these hot rollers  They work exactly as described. The two sizes are perfect, not too small and large enough to make soft curls. Heat up quickly, the included clips are great, much preferred over J-clips.  The price point is just right and the value is excellent. Highly recommend.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Love these hot rollers",
    "rating": "4.0 out of 5 stars",
    "content": "These get hot fast but you can't always read the dot that tell you when it is hot.  Also, the clips don't always work well to hold the rollers in my hair.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I think that Conair makes the top hot rollers.  They warm quickly, last forever, travel nicely, are compact and neat, etc etc etc.  I wish they would offer the their curler clips again because they travel much easier that the claw clips that have replaced them.  I also do not think the claw clips work very well.  Conair had the best curler clips because they worked and did not become too hot.  You can buy the clips from outside sources on Amazon but my experience after trying many is they get burning hot and don't hold the curlers and hair very well.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Get hot fast but the clips don't hold the rollers as well as I would like",
    "rating": "5.0 out of 5 stars",
    "content": "I liked that there are plenty of rollers even for use in my thick, long hair. I also like the types of clips used with these and the ease of using them. I was looking for curls that were loose towards the end of my hair and would give it volume at the top and these did the job. Heated up quickly, and stayed warm on my hair close to 10 minutes while I let them stay on my hair to make a longer lasting curl. I slept on the curls the first night (NOT THE ROLLERS)and the curls were still there when I woke up! I am very pleased with this set of heat rollers. I plan to use them often because they are faster than using a curling iron for me.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Not too much to say they’re hot rollers they do the job and I really like my hair after using them. I haven’t had a set in years and I was pleasantly surprised about the sizes and the results I would definitely buy them again.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "I have used hot rollers for over 30 years now...",
    "rating": "5.0 out of 5 stars",
    "content": "I currently use a 1.5 inch curling iron and bought these hot rollers to to reduce the amount of damage to my hair. My hair is shoulder length, fine and straight with no curl.  I haven't used hot rollers in years but I remember they made a very tight curl, which is not what I want. I thought using the same size hot rollers as my iron would work, but it didn't. There was almost no curl even after leaving them in until they cooled.  So even though they didn't work for me, I believe they would work well for someone with longer hair so I gave the product 5 stars.  The product heated up very quickly and was easy to use. I have used Conair products in the past and they have been reliable.  BTW...this product does not come with the metal wire holders which I had used in the past and which worked well.  Because the reviews indicated that the plastic comb-type clips left a dent in the hair, I purchased a no-name brand of wire holders along with the hot rollers. They didn't fit well at all.  If you want metal wire holders that fit, I recommend ordering them from the same company as the hot rollers or order hot rollers that have the metal holders included in the description.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I have long, thick hair so that may be a factor in my issue with this product.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Love these  rollers!",
    "rating": "3.0 out of 5 stars",
    "content": "The rollers are nice. They heat quickly, the felt covering protects and helps with a tight roll-up. The set itself is attractive.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The clips are almost useless. The vertical, side roll, held fairly well with the clip, but didn't remain in a tight roll. The horizontal, top or crown roll, didn't hold at all. I tried repositioning the cilp toward the front or back of the roller, it didn't help. Like I mentioned, my hair is long, thick, and it must be too heavy. I ended up using large claw type hair clips to hold most of the rollers.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "Heats quickly, clips are easy to use.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Purchased for my mom a while ago.  She's fairly happy with them.  I think her only complaint is she wishes there were more smaller curlers and less big ones.  They heat up quickly and are held in place well with the clips.  The storage is compact and light weight.  She has traveled with them a few times.  They are easy to organize and clean.  She likes them aloy and uses them daily to curl her hair.  Definitely worth the price.  Would buy again.",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Purchase for my mom",
    "rating": "5.0 out of 5 stars",
    "content": "Great set of rollers got the smaller set also because they were needed.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I've used a number of different Conair hot roller sets over the years, and they were always long-lasting products that were reliable. I regrettably got rid of my last set of flocked rollers, primarily because my hair style had changed from curly, bouncy medium-length hair to sleeker, smoother shoulder-length hair, and that set simply had been taking up space under the vanity because I used other styling tools to get \"my look.\" However, when I found these larger rollers, much larger than my old set, I knew I had to try them. Although it's good set, it's not great.",
    "post_time": "Reviewed in the United States on June 7, 2013",
    "pid": "B007S69QAY"
},
{
    "title": "Great Set",
    "rating": "4.0 out of 5 stars",
    "content": "For my hair's length, style & texture, ideally I need a set of Super Jumbos Rollers (1.75\") to smooth, style, & add shine, This set has 4 of this size, so that's better than nothing, I guess. However, it's very difficult for me to get the look that I want. I do my crown first with the Super Jumbos, then move to the lower layers with the purple Jumbos (1.5\"). The lower layers are still get too much curl and I am still working on the best timing & set. Right now, I basically have two different set times - some time for the Jumbo on my lower hair, and triple the time for the Super Jumbo on my crown.",
    "post_time": "Reviewed in the United States on March 26, 2022",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Conair also makes a Mega Jumbo (2\") set of 5 rollers branded as Infiniti Pro, which I picked up at wally world. I suspect I will end up transitioning to using the Mega Jumbos on the Crown and Super Jumbo on the lower layers. Unfortunately, this means 2 sets on the vanity, plugged in & using all that electricity. I still would prefer Super Jumbo on the crown. Life could be worse but I really wish there was a better solution than using 2 tools to get the style that I want.",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Good because of size but far from perfect",
    "rating": "4.0 out of 5 stars",
    "content": "Compared to my previous Conair models, this set does not seem to heat up as much. The Jumbos seem to get hot enough, but the Super Jumbos and Mega Jumbos need to get hotter. Perhaps this is a feature of these larger rollers, that they can't retain heat or lose it quicker? Regardless, the biggest rollers are not hot enough. I deducted 1 star for the low heat in the largest rollers.",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Lastly, like others have stated, the clips are the pits - just terrible. They leave bumps and marks, and I actually have to go back with a curling iron on top layers. Give me the metal pins of torture any day - those worked and didn't crimp hair. As a side note, the Mega Jumbo clips are designed differently, with out as many combs, and they don't crimp the hair. So, Conair already has a better clip design in one of its products. I deducted 1 star for bad clips in this product.",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "variety of  jumbo curlers but loads of design flaws",
    "rating": "3.0 out of 5 stars",
    "content": "Regardless, these rollers do what they should - create a smooth style with shine & body. Conair already makes a set of 12 purple Jumbo rollers (1.5\"). If Conair would make a set of 8 to 10 Super Jumbo rollers (1.75\") that gets hot enough and uses an improved clip design, I would pay $40 to $50 for it. I bet others would too.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The actual curlers are great.  4 super jumbo with the rest are jumbo size.  They heat quickly, however there's no light or signal that they are heated and ready to use. (Some others I have used in the past have a light change when fully hot)  I'm very disappointed with the clips.  They just will not stay in.  The clips continue to frustrate me and although I have even tried  using 2 clips with little success.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Heats up quickly, clips are weak and cheap",
    "rating": "4.0 out of 5 stars",
    "content": "Love the 2\" barrel, largest I had was 1 3/4\" and my hair in areas needed wider.  These heat up nice and fast, the flocking protects my fingers, but the \"clips\" are very cheaply made and don't hold well.  They seem about the right size for the curlers, but they are cheap, bendy plastic that don't quite do the job.",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This makes for good curls and is easy to use; however, if you have thick hair, the clips that are provided tend to fall out due to the thickness of the hair. They heat up super-fast and are hot to the touch despite the soft velvety texture of the curler. I don't find it easy for travel because they are bulky, and the lid does not secure shut. It comes with plenty of clips; however, they don't always hold the curler if you have thick hair. The clips are made of good plastic, and this is my second set of curlers. I still have all of the original clips from the first set, so they last a very long time even if the curlers themselves don't.",
    "post_time": "Reviewed in the United States on January 12, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Makes good curls but clips can fall out",
    "rating": "4.0 out of 5 stars",
    "content": "I love these classic hot rollers since they really do give your hair more volume and body than using a regular curling iron would. there are 4 larger rollers and the rest are a bit smaller- you do have to play around with finding the best way to do your hair how you like it best. there isn't a heat setting- you plug the product in and the rollers begin to heat up. wait a few minutes until they're hot and then you can start doing your hair. my only downside to these rollers are that the clips are flimsy and barely fit the rollers and easily slip. other than that pretty good product that i use often!",
    "post_time": "Reviewed in the United States on January 31, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It's okay.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "classic hot rollers!",
    "rating": "3.0 out of 5 stars",
    "content": "Rollers are good, cheap clips that don’t hold the weight of the curlers.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love them perfect size gives me body just what I wanted. Thank you, Amazon.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Good product.",
    "rating": "4.0 out of 5 stars",
    "content": "The curlers",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Themselves heat up fast and work well on my hair but the clips are not good at securing the rollers in place. I’m in the hunt for new clips.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Clips are cheap",
    "rating": "5.0 out of 5 stars",
    "content": "I'm just unable to hold a curling iron type devices for duration of a style session.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Works perfectly",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Great Hot Rollers/Not so great clips",
    "rating": "4.0 out of 5 stars",
    "content": "The hot rollers are wonderful. I give the rollers a 5 star and the clips.... not so much.  After reading other reviews, I ordered a regular set of hot roller clips at the same time.  The ones that come with the set will not hold the hot roller in my hair at all.  I tried several times, and threw them away.  I used the other clips and they are great.  Overall, a great set of hot rollers.  You just need another set of clips.",
    "post_time": "Reviewed in the United States on March 13, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "While these rollers are great, the purple claw clips leave dents in the hair that don't brush out. Metal replacement clips don't hold the rollers in place. I wasted money on these rollers because I cannot use them.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Rollers are great, clips leave a dent in the hair",
    "rating": "4.0 out of 5 stars",
    "content": "Works good.",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love these curlers. I have fine hair, but have a lot of it. If I just blow dry my hair it doesn't hold and gets frizzy looking quickly. If I use a curling iron it burns my hair and does not hold a curl. I love these because I can put them in while I finish getting ready and it gives me big curls and volume which is what I am looking for. I get compliments all the time on how full and healthy my hair looks and no one can ever believe that it's from hot rollers. I know it's a dated technology but it's the only thing that works for my hair. And my hair never looks frizzy after I use these. I recommend for anyone with fine hair. And contrary to other reviews I have no issues with the clips that come with them; they hold the curlers in fine for me. Also regarding the red light not turning off - I didn't even know it was supposed to go off LOL. I just wait a few minutes till I assume they've heated up and put them in I don't see that as an issue",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Was as advertised.",
    "rating": "5.0 out of 5 stars",
    "content": "These rollers are perfect for me.  I have long hair, past my shoulder blades, with slight layering and long bangs.  My hair is curly, but not kinky and it gets frizzy/poofy with humidity.  It's thick, but only b/c I have lots of fine hair.  I can wear it curly or straight.  (People think that sounds heavenly, but it can be a curse with humidity, especially when I want it straight.)  In the summer I let it air dry, but usually have to dry and curl it in the winter and when it's chilly outside.",
    "post_time": "Reviewed in the United States on February 28, 2014",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love hot rollers for the ease of them, but until I found this set, they have always been too small for me.  Since my hair curls really easily, I end up with too tight of curls with smaller rollers, even the 1 1/4\" rollers that some would consider big.  Through the years, every time I saw hot rollers with a bit bigger roller, I would buy them.  Most of the time I would end up using my large barrel curling iron to get a softer curl.",
    "post_time": "Reviewed in the United States on December 18, 2022",
    "pid": "B007S69QAY"
},
{
    "title": "Great 2\" hot rollers",
    "rating": "5.0 out of 5 stars",
    "content": "I'm am so happy with these.  I just got them and I've used them three times so far.  Once with slightly damp hair and the other two times on dry hair.  My hair came out fuller when it was 100% dry first.  The curls I get are soft, more like waves.  I couldn't be happier, exactly what I wanted, a bit more body than what the curling iron gave me.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "If you're looking for curly hair with these, then get a different set with smaller rollers.  If your hair is fine and straighter, I would imagine that these would do nothing for you.  Straight/fine hair would probably slip right off of these rollers.  If you're looking to soften your curl like I was, then get these!",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "I've been waiting so long for someone to make hot rollers this large",
    "rating": "4.0 out of 5 stars",
    "content": "I use all eight, four on top and four on the bottom.  I'm not a huge fan of the clips, but they do work for most of the rolls.  The last roller closer to my forehead, flips forward b/c the clip doesn't hold it in place, so I hold it there for a few seconds.  That is for my bangs, so I don't mind a little less curl with those and do that one last.  I tried the clips from my other roller set, but they didn't work.",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I cut my hair curling time in half with hot rollers b/c you roll each one and by the time you get to the last one, you're ready to take off the first one.  Not like a curling iron b/c you have to hold it on each spot before you move to the next.  I use a little bit of aniti-frizz gel and I have body all day with these.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Doesn't work with my hair",
    "rating": "3.0 out of 5 stars",
    "content": "Had to return them but didn't hate them. Probably more of a user error but they got hot super quick, which is a good thing but it got too hot for me to hold. I could've bought gloves but felt like a hassle. My hair is about medium thickness and wavy but wouldn't hold curls very well. But that doesn't have anything to do with the product. Overall good product just wasn't for me.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "UPDATE:  12/23/2013",
    "post_time": "Reviewed in the United States on December 7, 2013",
    "pid": "B007S69QAY"
},
{
    "title": "GOOD for medium to long hair and Goodt rollers & clips.  A great price @ $30 w/ shipping as this is $50 in stores!!",
    "rating": "5.0 out of 5 stars",
    "content": "While these are good rollers, I have taken then down to 3 stars versus 5 because now that I have used them a couple of times there are a couple of things that could improve.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "1.  the roller clips are kind of flimsy and if they were made of better plastic they would hold the curlers in place.  It needs to be thicker and less bendable, the rollers slip out of shorter hair.",
    "post_time": "Reviewed in the United States on April 15, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Hot fast!",
    "rating": "5.0 out of 5 stars",
    "content": "2.  These are for longer hair, I have a long shag, hair below shoulders, and cannot use these in the crown.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "3.  Hair seems to be slippery when rolling, do not know if it is the coating or what but you need to be able to wind you hair around it at least twice for a good hold.",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Great for quick smooth curcles",
    "rating": "3.0 out of 5 stars",
    "content": "GOOD:",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "1.  It heats up really fast",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Body+",
    "rating": "4.0 out of 5 stars",
    "content": "2.  Stays hot",
    "post_time": "Reviewed in the United States on July 12, 2021",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "3.  Roller clamps are a better way to hold the roller in place than other ones, they are like a clamp/jaws",
    "post_time": "Reviewed in the United States on June 7, 2023",
    "pid": "B007S69QAY"
},
{
    "title": "Not a fan",
    "rating": "3.0 out of 5 stars",
    "content": "These hot rollers are very frustrating to use. The clips do not hold the curlers in place and they don’t get hot enough to make a really nice curl.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These hot rollers are the perfect rollers for smooth volume.  They heat up quickly and are easy to use.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Perfect for Volume",
    "rating": "3.0 out of 5 stars",
    "content": "I have very long medium thickness, naturally straight hair w/ some wave, down to almost my waist. I prepped my hair, used highest heat setting, let them sit for 20-30 minutes until completely cooled before removing. What curls I did have were completely gone within an hour. I just dont think these type of curlers are made for people with very long/straight hair. I tried another set with different sizes and same result. A high heat curling wand is the only thing that can curl my hair these days. So sadly I returned these.",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "After finally figuring out how to roll and secure them I was excited. But when I removed the rollers my hair was full of static. This is not something that ever happens to my hair so I’m guessing it’s the fleece on the rollers. Also the clips are pretty worthless. And lastly it kinda stinks that there is no where to store the clips. I’ve got brand new rollers and a ziploc bag holding the clips. Get what you pay for?",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Didn’t work for me",
    "rating": "3.0 out of 5 stars",
    "content": "I liked the speedy delivery  of the hot rollers but it was missing the roller CLIPS. I cannot use the hot rollers without the clips. Hope clips will be sent in a speedy manner as well.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Idk if it was my hair but I tried a couple times and it did not curl my hair at all I have very straight fine hair.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Pretty frustrating",
    "rating": "4.0 out of 5 stars",
    "content": "Okay, here’s my experience with these rollers:",
    "post_time": "Reviewed in the United States on July 3, 2019",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Space - the device needs a lot of counter or storage space.  I have a small bathroom and counter, and this thing takes up a huge amount of space.  It’s 11.5” in length x 6” in width x 4.5” in height.  It doesn’t fit in my small bathroom drawers.  When you add in the storage needed for the super clips, which also take up a lot of space for the 12 of them, well, you need space!",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Conair Infinipro Jumbo Roller Clips",
    "rating": "5.0 out of 5 stars",
    "content": "Heat - the container itself gets hot.  The plastic cover is quite hot to the touch.  The rollers get hot, so hot that they can feel too hot on my scalp.  I usually wad up Kleenex under some of the rollers to keep them off my scalp.  You won’t want your kids touching the device or the rollers.  The ends of the rollers are cool; there’s no problem rolling up the hair.",
    "post_time": "Reviewed in the United States on April 18, 2014",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Safety - there is no on/off button or auto-off.  You have to remember to unplug it.  That doesn’t seem very safe to me.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Waves stayed for 30 mins",
    "rating": "3.0 out of 5 stars",
    "content": "Let them heat up extra long. Left them in extra long. Hair stayed bouncy 30 mins. Really disappointed",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Like another review I saw, my rollers never fully turned on. The light went red and never turned white. They were hot, but clearly not as hot as they should be. Still, I tried to curl my hair anyway. The reviews are right about the clips — they’re awful and you definitely need stronger ones to hold the roller where you want it to be. My hair barely got a wave and I left them in for over 10 minutes. Granted I don’t think mine even heated up all the way. Returning…",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Mine didn’t even work",
    "rating": "3.0 out of 5 stars",
    "content": "The curlers do give a smooth curl for long hair but are EXTREMELY difficult to hold in your hair with the clips provided.  I am in the process of ordering the u-clips in hopes that it will help.  If you have no intention of moving after setting your hair you may be okay but I don't have that luxury.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I used hot curlers years ago and loved them. I thought these would be perfect since they’re larger and wouldn’t give a super tight curl. Nope. Volume and curl held for about 30 min after taking them out. Yes, I let them heat 30 min, left them in 30 min even though they were totally cooled by 20, and still barely worked. My hair is thick, but the individual strands are fine, so I think if I had 2 sets, it’d go better, but who wants to buy and store 2 full sets of curlers… also annoying the clips have no storage bag or compartment in the base, so I could losing them easily. Curling iron is much faster for me. Returned it.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "hard to hold",
    "rating": "4.0 out of 5 stars",
    "content": "Just to throw this out there, because I know some people think that the T3s offer something really unique or superior, but in my opinion, they function the exact same as these.  I have completely straight hair and have used traditional hot rollers for years (still have a set I purchased in college 20 years ago that provide a tighter curl).  I had big hopes and visions for these jumbo rollers yielding gorgeous, huge, soft, 90s era Victoria's Secret model hair and....not so much.  Maybe for someone with a natural wave or curl.  Both these and the T3 do give soft, subtle volume but my crown gets \"piecey\" and you can see each division of where I rolled a section; these yield a much better nice, natural curl to my very long hair (almost to my natural waist), mostly just a light curl at the ends.  Each time I roll it I get a little better at it and get better results.  But overall, I like these so much, and they are every bit as good if not better than the ones that cost 4 times as much.",
    "post_time": "Reviewed in the United States on February 18, 2022",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Too many small rollers. I needed the bigger rollers.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "I just couldn’t get them to work right",
    "rating": "4.0 out of 5 stars",
    "content": "This is my first time trying hot rollers so I wasn't sure what to expect, and I've had to play around for a while. I ordered some alternative pins because the clips were accomplishing nothing at all, but then I cancelled my order because after some practice, I realized it was user error. The clips shouldn't be a problem if you use all of the rollers and try to layer them tightly, starting with the lowest sections. That way each roll can sort of bear the weight of the one above it, especially if you angle the clips so that the butterfly part (I don't know words, I'm sorry) is pressed against your head. As far as performance goes, I'm still playing around with how long to heat them up before using, and how long to leave them in. They don't get hot enough to hurt my fingers when handling, and I have very fine hair, so I might need to use more product to have lasting volume. This won't give your ringlets but if you want to look like the mom-who-is-also-a-lawyer in a 90's kid movie, this is perfect.",
    "post_time": "Reviewed in the United States on May 20, 2022",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This rollers in this set was the perfect size for what I wanted for my long hair (almost to elbows) and thick, frizzy hair. It heated quickly, and the clips were easy to use. The large curls/waves were nice but didn’t last long- I used gel and hairspray. But the look was nice!",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Work as well as $130 luxury rollers, stick-straight hair review",
    "rating": "4.0 out of 5 stars",
    "content": "Wife bought this to replace an older model which finally gave up after 8 years.  Works great for her purposes.",
    "post_time": "Reviewed in the United States on May 1, 2013",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "She uses it to smooth out her wavy, almost shoulder-length hair, which has a tendency to frizz, and to give it volume.  The jumbo and super jumbo rollers (and large rollers, if you have some) work well for this purpose, necessary in hot humid Florida.  (Don't need those wimpy medium and small rollers you find on other hair setters.)  It doesn't have enough rollers (12) so she adds extra rollers (6 more) as she uses the hot ones.  (Always save your old setter's rollers and clips for this reason.)  This works out because the setter heats so quickly.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Clips need more prongs to hold hair",
    "rating": "3.0 out of 5 stars",
    "content": "I was looking for large electric rollers for my below shoulder length straight hair. My last set from this brand had clips that had 4 “fingers” or prongs to hold the rollers in place. These only had two and would not hold the heavier larger curlers on my straight hair so unfortunately I had to send it back.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I find the clips are difficult to use",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Electric rollers",
    "rating": "4.0 out of 5 stars",
    "content": "I am so disappointed with the holding power of the clasps  for the curlers.  Used them once .  they are not a tight hold and  the rollers  can fall out or droop.  If I had not thrown the box away  I would return  them.",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I've never used hot rollers before but these rollers are cute and convenient. These rollers always make my hair so bouncy and I love that there is a variety of sizes. When I went to Ulta to look for these, they only had one size or the other. The amount of rollers it comes with is not enough to do all of my hair ( have very thin hair but alot of it) in one go, but I normally do it by sections and it works fine. These curls also do hold long too, I never use hairspray or hair products really and my curls hold. I will say though, these rollers do get pretty hot if you let them sit in there too long before use. These also come with roller clips, which I will say are a bit flimsy but work. I probably will buy something different in the future for the clips. Overall great product.",
    "post_time": "Reviewed in the United States on January 7, 2023",
    "pid": "B007S69QAY"
},
{
    "title": "Need to improve on clasps",
    "rating": "4.0 out of 5 stars",
    "content": "These rollers work fine and add body to my hair. However, the curl is not very lasting so they give my hair decent body but not much curl.  I went to non-heated rollers to get more curl and they work better on my hard-to-hold-curl hair.  The rollers heat up fast and are easy to use.",
    "post_time": "Reviewed in the United States on January 1, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Rollers heat up very well and work really great with curling my hair. The pins that come with it absolutely suck and do not hold them in place. So I had to use some other types of clips that I have. If your wanting to buy this buy the separate metal pins for it.",
    "post_time": "Reviewed in the United States on January 12, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Gets pretty warm",
    "rating": "3.0 out of 5 stars",
    "content": "Who creates an electrical product and doesn't put an on/off switch on it? I have to plug and unplug this every time I use it. Not convenient when its on a dresser and I have to pull the dresser out from the wall or go plug the curlers into a socket in the kitchen or hall! Never even thought to look in the description because in the 30 years I've used electric curlers, there's always been an on/off switch.",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Thank God they came out with just jumbo and super size rollers!.I have wasted so money on these units because they always had too many small and medium roller and only one or two jumbos. Companies took FOREVER to think of us long hair stylers and made too many smaller sizes. Only recently did I find them at my favorite place...AMAZON!. My one COMPLAINT/problem is I hate those plastic clips that fall out 100 times before you finish rolling your entire head.I like the old wire ones that stick around the roller to hold them in place but they sell them plastic breakable clip, (most manufacturers at least) for a fortune  and, once again, you don't have enough clips for the curlers, all small and smaller by the bulk after buying so many sets, and the bigger ones aren't enough to wrap around the  newborn's one curl at the top of their head.I guess no one told the manufactures that big ones also helped pull the friz out of those of us that have hair that frizzing to their nap of their NECK.  Personally I like two wire holders for each curlers. The plastic ones always slip and pop off in the toilet where you have to fish it out with a hanger and throw it away. One less clip! I think I GOT OFF THE SUBJECT, Conair thank you for finally giving us sets in different sizes and at prices that are affordable to go and buy two sets of clips to finish a style. Don't skimp on your quality though, you are the best. You have the perfect flocking, perfect heat and with a few wire clips they wont fall out ! And for that matter they are priced just right. Good job conair!",
    "post_time": "Reviewed in the United States on December 3, 2015",
    "pid": "B007S69QAY"
},
{
    "title": "Work Well",
    "rating": "3.0 out of 5 stars",
    "content": "Good quality material on the rollers. Clips are to soft and combs are too short for the weight and width of the roller.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B007S69QAY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The rollers are the perfect size for hair volume. The clips are horrible! The rollers are large and heavy; the clips don’t support them. I have watched the videos showing how to secure the rollers, but I still can’t make it work properly. I have been using hot rollers since the 1980’s. These are definitely the worst clips I have ever encountered. Be prepared to stay very still for the length of time you leave these rollers in your hair. The good news is your hair will look great!",
    "post_time": "Reviewed in the United States on February 17, 2024",
    "pid": "B007S69QAY"
}
]