[
{
    "name": "        Remington Ionic Conditioning Hair Setter, 20 Velvet Hair Rollers, 6 Large (1¼”), 10 Medium (1\"), 4 Small (¾”), Blowout Style Hair Curlers       ",
    "stars": [
        "64%",
        "16%",
        "9%",
        "4%",
        "7%"
    ],
    "pid": "B00J8IXT58",
    "ratings": "28,234 ratings",
    "other_info": {
        "Item Form": "Clip",
        "Hair Type": "Curly",
        "Number of Items": "1",
        "Material": "Ceramic",
        "Size": "1 Count (Pack of 1)"
    },
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": [
        " UNLEASH LONG-LASTING CURLS: Experience the power of our exclusive Thermal Wax Core with Remington's Roller Set. This cutting-edge technology retains high heat longer, ensuring your curls stay beautifully intact and voluminous.  ",
        " SHINE BRIGHT WITH IONIC CONDITIONING: Say goodbye to frizz and hello to dazzling shine with Remington's Electric Hair Rollers. Ionic Conditioning on each roller creates a silky, frizz-free finish, enhancing the radiance of your curls.  ",
        " VERSATILE CURLING MASTERY: Tailor your curls and create your perfect style with 20 velvety heated rollers in different sizes - 6 Pink Large for Longer Hair, 10 Purple Medium for Medium Hair, and 4 White Small for Short Hair.  ",
        " EFFORTLESS CREASE-FREE HOLD: Achieve a flawless look with our Color-Coded J Clips and Hot Rollers. These specially designed clips ensure your curls are held securely with minimal creasing, so you look your best.  ",
        " GLAM WITH CERAMIC ROLLERS: Simplify your curl-setting routine with Remington's Ceramic-Coated Electric Rollers. These rollers make achieving stunning results an absolute breeze, and the cool touch ends make the rollers comfortable to use.  "
    ]
},
{
    "title": "Close to perfect rollers",
    "rating": "4.0 out of 5 stars",
    "content": "I really like these rollers,perfect sizes for me. The only complaint I have,is that when they are hot,the end caps come off inside the heating element or in my fingers while rolling my hair. It is quite frustrating,but I still use them. I've thought of finding a heat resistant adhesive to glue them on for good. Wish they didn't do that.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fantastic Hot Curlers They warm up Fast they are Easy-to-use and Work Extremely well Great Quality and Great Price",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Remingtoń Hot Curlers",
    "rating": "5.0 out of 5 stars",
    "content": "Good product but just not for me.  Rolls need to be left in hair for a period of time unlike a curling iron which is instant curl.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love the curlers but I was missing two clips for the big rollers",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Good product - just no for me",
    "rating": "4.0 out of 5 stars",
    "content": "Works effectively, efficiently.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Easy to use . Satisfaction with this purchase",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Hot rollers",
    "rating": "5.0 out of 5 stars",
    "content": "I use to give body to my thin, fine straight hair. Must dampen ends to stay in place while rolling .",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Does work and has enough medium and smaller sized rollers for my hair. The other electric rollers I love no longer come in large enough set to have enough smaller rollers.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "These rollers are easy to use and I always get compliments when I use them. It also saves time because I can put these in and go about my morning while they work.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They get warm quick. Very nice rollers. Love the variety of different sizes. Cute little holder and love pink and purple.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Works as advertised",
    "rating": "5.0 out of 5 stars",
    "content": "I like having a choice of roller sizes.  Doesn’t burn your fingers and is gentle on the hair.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "These curlers give a good curl but they get way too hot for my fingers. I have to wear gloves to put them in my hair and if close to my ear they will burn it too. They need gripping ends that don’t get hot. Also there is no storage for the clips, not even a pouch to put them in.  For these reasons I can only rate 3*.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Good curl but…",
    "rating": "5.0 out of 5 stars",
    "content": "Wal-Mart didn't have these so I told my mom we will look on Amazon she was happy n loves them I love that u can go Amazon find things that stores no longer sells",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They have three different sizes for your hair and that is definitely a plus! Curls hold longer intact and air look voluminous with shine.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Rollers",
    "rating": "5.0 out of 5 stars",
    "content": "Thus has worked perfectly for doing my daughter's pageant hair. The rollers get hot, but cool down enough to be on her hair. The velvet texture on the rollers grips fine hair very well, making rolling easy. I used all but 4 rollers on her head (2 years old, medium thickness, fine textured hair) for thicker density hair, you will probably want to order two.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good rollers but not as sturdy as my old ones. They do get really hot.",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Different Sizes",
    "rating": "5.0 out of 5 stars",
    "content": "I have pretty fine hair, I use it after shower with curl hair lotion and oil. After drying my hair, I’ll power up this set and start to work on curl my hair one by one.",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I unplug the set when I feel the curler is too hot to hold, keep the lid close so it will keep the temperature in the container for awhile.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Just what we needed!",
    "rating": "4.0 out of 5 stars",
    "content": "From my first curler to last one it takes around 15-20 min cuz I am new to this.",
    "post_time": "Reviewed in the United States on December 10, 2023",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I remove them when it’s not warm. It’s also around 15-20 min. The result is really effective and the curl last to next day til I take shower.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Great curls",
    "rating": "4.0 out of 5 stars",
    "content": "Quality of case is nice. Rollers heat up very fast. Clips are sturdy. If you have thick hair you may need a larger set. I do & although clips work, you can’t overload the roller with yo much hair or the clip won’t hold it. Fabric is a bit thin on the roller so be careful not to let rollers get too hot or you will get burned.",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wish they would heat a little hotter. They don’t hold my hair well.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Roll",
    "rating": "4.0 out of 5 stars",
    "content": "My hair is thin and falls to a couple inches past my shoulders.  The Remington Hair Setter gives me long lasting curls and waves.  I wish the color coding at the ends of the pins would be more pronounced.  With so little color on the tips, it is sometimes hard to distinguish which pins go with which rollers.  No problems with the pins staying in place.  Just insert them diagonally across the roller.  As for the heat indicator, it is a waste of time.  I really cannot tell any color difference on that dot no matter how long the rollers are heated up.  What works best for me is to plug the unit it for 5-7 minutes; then leave the rollers in for 10-15 minutes.  The rollers are easy to use.  And the unit is compact and stores easily.",
    "post_time": "Reviewed in the United States on January 25, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I had been wanting one of these awhile.  The last set I had was a steam set that one had to add a TBSP or 3 of water to the bottom tray.  (Back in the 1900's) This one seems to have liquid inside the rollers.  No steam but perhaps that's the \"Ionic\" stated in the title.  I don't remember the description at this time, only my experience with the product.  I knew it was ready because I had plugged it in and left it way longer than I needed to. The little dot on the roller had turned from a reddish color to a solid white.  The side of the rollers where hot to the touch. Hot enough I was a little concerned my hair might burn, so I unplugged the unit, and began curling my hair.  It cooled in my hair about 30 minutes, but left in for an hours because I could.  Was concerned it wouldn't be curly enough because, when I unplugged it, I wasn't sure that the last ones I put in my hair were hot enough.  It was able to touch the rollers enough to roll my hair in them however.  I think next time I might unplug it a few minutes, then plug it back in until finished rolling.  I have very long hair and had to wrap the ends around first until I could roll up from a straight arm to my head and clip.  The clips work well! Hair turned out very curly from the shoulders down, but enough volume above that point to make it look nice.  Didn't last long, but with use a mousse next time, or just washed and almost dry hair.",
    "post_time": "Reviewed in the United States on June 10, 2023",
    "pid": "B00J8IXT58"
},
{
    "title": "Works well on fine hair",
    "rating": "5.0 out of 5 stars",
    "content": "Hot rollers give me a much better and easier style than a curling iron",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is my second set in 5 years.. They are lightweight and the rollers offer 3 sizes that I need for my hair.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "It does burn your fingers if left on too long.",
    "rating": "3.0 out of 5 stars",
    "content": "How does one use these rollers when they don’t come with clips!  Very disappointing.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So originally I did not plan on leaving a review for the product.",
    "post_time": "Reviewed in the United States on May 31, 2020",
    "pid": "B00J8IXT58"
},
{
    "title": "Good purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Not because I had any problems, but more so because I didn't- and it's only been about a week and I've used it three times as of today.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "HOWEVER,",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Not for all hair types",
    "rating": "3.0 out of 5 stars",
    "content": "What I like about this product? Yes, the rollers do achieve a good curl. They heat well; about 10-20 minutes for full heat.  The case is convenient for travel.  I liked that the pamphlet provided tips on how to roll for a specific style.",
    "post_time": "Reviewed in the United States on January 5, 2023",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I did Amazon pickup and the process to pickup was flawless. Just wish there was a closer pickup location to my residence.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Curls great",
    "rating": "5.0 out of 5 stars",
    "content": "What I don't like about this product?  It is not feasible for women with thick, coarse hair; especially black women.  I have thick, coarse hair so to achieve a good silky curl, I had to straighten my hair (includes blow drying AND using my Chi iron) then roll. That is a lot of heat for one setting. Also, with my hair being so thick, I had to roll in sections because there are not enough rollers to roll my entire head in one sitting. Once the rollers cooled, I removed them & put them back to heat again (another 10-20 minutes) before I could start the next section. This is time consuming to achieve curls. It would be better if there was a larger unit with more rollers to accommodate those with thick, long hair.  This way we could roll our entire head in one sitting.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The instructions say NOTHING about how to clip the color coded wire roller pins. *TIP:  DO NOT attach the wire roller pin with the longer side facing your scalp because the heat from the roller heats the wire pin and WILL burn your scalp. Yep, I burned my scalp!! Thanks for including clear instructions; NOT.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Easy and comfortable to use.",
    "rating": "5.0 out of 5 stars",
    "content": "Also, it states the roller has cool touch ends; not true. You do feel the heat on the ends so you better be quick about rolling & pinning.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Would I buy again or recommend? Only if  there was a larger unit with more rollers.  For all I had to do to achieve a curl, I was better off using flex rods and sitting under a dryer.  This product is more for needing a quick refresh, IMO.",
    "post_time": "Reviewed in the United States on January 27, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "These work well",
    "rating": "3.0 out of 5 stars",
    "content": "This curler set curls great. It heats up quickly.  It has ten medium rollers which is enough to curl my hair.",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "They are comfortable.  The pins to hold them in place work well.",
    "post_time": "Reviewed in the United States on November 17, 2023",
    "pid": "B00J8IXT58"
},
{
    "title": "Hot rollers",
    "rating": "5.0 out of 5 stars",
    "content": "My hair looks shiny and curly.  I recommend this set.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B00J8IXT58"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My wife needed a new set and these were perfect!",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B00J8IXT58"
}
]