[
{
    "name": "        Jergens Natural Glow Instant Sun Body Mousse, Self Tanner for Light Bronze Tan, Sunless Tanning Body Bronzer, Fake Tan for Fair to Medium Skin, 6 Ounce       ",
    "stars": [
        "69%",
        "15%",
        "8%",
        "3%",
        "4%"
    ],
    "pid": "B00Q23KDOM",
    "ratings": "30,141 ratings",
    "other_info": {
        "Item Form": "Mousse",
        "Skin Type": "All, Combination, Normal",
        "Material Type Free": "Silicone Free, Paraben Free",
        "Brand": "Jergens",
        "Product Benefits": "Radiant Tan, Moisturizing, Smoothening"
    },
    "discount_price": "$ 11.50",
    "normal_price": "$1.92",
    "about_this_item": [
        " FLAWLESS SELF TANNER - Create a flawless, quick tan with gradual, natural-looking color for gorgeous skin and blended color for fair to medium skin.  ",
        " INSTANT SUNLESS TANNING - Lightweight, airy tanning mousse enhances your natural skin tone to mimic results from the sun.  ",
        " NATURAL BODY BRONZER - Develop your tone instantly, and watch it deepen within hours of application for steak-free results. Use the next day for deeper color.  ",
        " TROPICAL, FRUITY SCENT - Jergens Natural Glow Mousse gives you an island escape with its tropical, fruity fragrance.  ",
        " EASY, FAST-DRYING APPLICATION - Applied by hand or sunless tanning mitt, our self tanning mousse is tinted for precise application, and it dries in just 60 seconds.  "
    ]
},
{
    "title": "The best!!",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried other self tanners, but there is always something wrong with them. This is now my go to. It doesn’t smell funky and gives a nice tan color!",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Jergens self-tanning deep colored mousse is a great way to get a nice looking natural looking tan for a fraction of the cost of going to tanning beds. It goes on very smoothly with a pleasant fragrance and the tan last for about 1 week. I highly recommend this product for anyone that would like a natural looking tan.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Jergens self-tanning mouse. Deep color.",
    "rating": "5.0 out of 5 stars",
    "content": "Be sure to read somewhere about how to keep from getting big brown spots. Put it on in daylight, so you don’t over do it. Exfoliate!! Put body cream on dry spots so knees, etc , don’t over-tan. Takes. Some practice. Doesn’t smell. If you put On a ton, it will come off on your clothes.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love this. I use it all summer long. It gives a nice golden tan in about a half an hour. And drys very quickly. Works best if you use a tanning mitt.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Really works",
    "rating": "5.0 out of 5 stars",
    "content": "Love this product!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Second bottle of this.  My skin is quite pale, so I like to use it on my legs. You need to be careful so you don't end up with orange skin. One coat for me is enough to hide the \"pale\"!",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Very natural looking",
    "rating": "5.0 out of 5 stars",
    "content": "Natural looking tan but you will have orange Palms if you do not apply with gloves. Next time I'll follow the instructions LOL",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good product which is easily applied and produces a more natural looking tan than any other product we have tried.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Great Price",
    "rating": "5.0 out of 5 stars",
    "content": "Love it this is easy and simple use and Instant tanning item that won't stain your clothes. I’ll continue buy it.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve used this tanner for years now and absolutely love it. It applies well and the tan processes quickly! I don’t love the smell after applying the tan, but that’s the same for all other tanners I’ve tried. If you’re looking for a quick and non streaky tan, this is the one!",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Great Product",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect tan.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I liked it. Put it on my face with a blush brush lightly in circular motion. It can wash off.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Sunless tanning",
    "rating": "4.0 out of 5 stars",
    "content": "it works well. after applying it at first u might not see that much of a difference, but the day after it shows so don’t go crazy while applying it onto ur skin",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I used this product as other reviewers have suggested. I shaved the day before and exfoliated. I applied with a mitt. I only used on my legs because they are extremely pale. I did not have any problems with streaking or discoloration. I could see results after leaving it on overnight and showering in the morning. I was also able to use this product several days in a row to achieve the color I wanted. It does not give an orange fake coloration as some other tanners have. Definitely recommend this product to others.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "it works very well",
    "rating": "5.0 out of 5 stars",
    "content": "Es muy bueno,deja un color hermoso,fácil de aplicar sigue las instrucciones  y te dejará un bronceado muy lindo ...",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loooove this stuff. I put mine on with a mit, that way there's no streaking at all and I get awesome coverage. Love that it immediately gives you a nice glow and the foam is easy to spread. I keep this stuff on hand year round! But don't wear light colors (especially white) unless you've showered first!",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Works well",
    "rating": "4.0 out of 5 stars",
    "content": "Love it works great",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect tan on pale skin. Blends nicely. Never orange or streaky . Applies best with a tanning mit",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Bueno",
    "rating": "4.0 out of 5 stars",
    "content": "but this is so much better than being orange lol. didn’t make my skin dry like the other tanning lotion",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "UPDATE:  I bought the dark bronze and I am so happy with the color. I have been a sun goddess for many years so I’m used to being dark. The light bronze is a good place to start so that you can get used to using a self tanner but if you want a lot of color then the dark bronze is for you. I love this product.",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Give it a little time and it works!",
    "rating": "5.0 out of 5 stars",
    "content": "I was skeptical because I didn't see a single change after putting this stuff on, but left it overnight and woke up with the best tan I've had in my life. I am VERY pasty pale and this was an amazing transformation. Make sure to apply evenly and give it a little time. It works!",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The first time I used this product, I was careful and had no issues. It lasted about 3 days before starting to wear off. The second time, I wasn’t as careful and ended up with darker spots around ankles, feet, knees. Just be sure you apply with care. I didn’t notice that tanless product smell the first day, but did the second day, but I think we’ve all come to expect that distinctive smell with most self tanners. I’m overall happy with it and the price is right. Would buy again.",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Works fine",
    "rating": "5.0 out of 5 stars",
    "content": "Love this!!",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Pretty easy to get a good even tan if you use a mitt. It dries in about 2-3 minutes but does feel a bit sticky. The smell is pretty bad. I’m not sure how to describe it. I would usually apply at night and then shower in the morning and the smell would linger. In the summer it would REALLY exacerbate any body odor from sweating. I could smell myself so strongly at times. 3 stars because the tan itself is great but unfortunately the smell overpowers it for me.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Great smell",
    "rating": "5.0 out of 5 stars",
    "content": "I use this stuff everyday and it works so well! I always get compliments about looking tan, and it doesnt look fake. It goes on pretty smooth and doesnt stain hands like other brands",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was skeptical because of price,,,, but this is great product!!!  I have spray tanned in past  and always worried  about having it sprayed in eyes and inside nose.  So I took a chance not expecting much from this.  But it is amazing!  It goes on foamy smoothe, even color.  It does not have smell!  Dries quickly.  I use it after hot shower then let it dry as I dry my hair.  Does not stain clothing.  Next time I will order darker color as I do like just a little darker.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Great color, bad smell",
    "rating": "5.0 out of 5 stars",
    "content": "Great product to put on wet hair takes out rankles and gives lots of body also leaves a fabulous shine in your hair after it’s dry!! Must have",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "arrived on time",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "I use it everyday!",
    "rating": "4.0 out of 5 stars",
    "content": "Goes on smoothly without streaks",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have rebought this multiple times!! I love the color it gives me (fair tone) it looks beautiful. Doesn’t stain or leave you feeling sticky!!",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "It’s average",
    "rating": "4.0 out of 5 stars",
    "content": "Not bad. Used it mainly for evening out my feet since I golf and have really bad tan lines. It’s a smidge orangey/bronzy looking but not terrible. It does leave your skin tacky afterwards which I’m not a fan of because I feel like it’s just going to rub off but I haven’t noticed any transfer onto clothes. Overall not bad for the price and does the job decently.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is by far one of the best self tanners I have ever used, and I’ve used a lot of them!  It provided a really nice glow in a very short amount of time. I still felt a little sticky as I always do with myself tanners, but once I showered, I felt great and my tan was beautiful. I would say it also still has that self tanner smell, but I have not found one yet that doesn’t. I do not have one streak and am very happy with my tan.  Will definitely be buying this from now on!",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Beautiful glow and fast!",
    "rating": "4.0 out of 5 stars",
    "content": "i think that this is a really good product. just make sure that you use a tanning glove to avoid streaks. i've used a lot of different self tanners, and this is my favorite one",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product and will continue to use. It gives your legs the right amount of color without looking fake. Once rubbed in, it doesn’t come off on sheets etc. (I often apply after my evening showing and then go to bed shortly after). It does have a slight smell but it’s not overpowering and doesn’t bother me.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "just make sure you use a tanning glove",
    "rating": "5.0 out of 5 stars",
    "content": "I am fair-light skin with cool undertones, and have never been successful in finding a self-tanner that didn’t turn orange and streak really bad. But THIS! It works! And it’s buildable, so you can use it daily or often enough to get good color. I used it before and during our trip to Punta Cana and actually felt like I was “tan!” If you’re fair/light skin you know how huge that is!",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Be sure to exfoliate really well the first time and at least once a week, moisturize before applying, use a tanning glove, and apply with circular motions.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Nice glow!",
    "rating": "5.0 out of 5 stars",
    "content": "Side note: I do have very sensitize skin, but no adverse effects!! I did buy the Jergens facial self-tanner with SPF and had a horrible reaction to it (basically like a chemical burn). This product from the neck down has been fine",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m light so this gives me a nice dark deep tan. Just needs applied evenly and equally and it turns out sooo nice. I leave mine over night for BEST, Non washable/ streaky results. Lasts longer when left lover also",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "I can’t believe I finally found a product that works for me!",
    "rating": "5.0 out of 5 stars",
    "content": "10 out of 10!!!!  No scent, no orange, great coverage!!!  Love this stuff!!  My co-worker found a tanner on line for $60 … I could/would never spend that.  Decided to try this since I already really liked Jergens products.  Can’t rave enough about it!!!  And the mousse texture as opposed to a lotion seems MUCH easier (even) to apply.  Color looks totally natural.  <3",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First time I ever used sunless tan lotion. It is foam and very easy to apply. I bought the mitt to apply it and I strongly recommend using one. Didn't have any streaks and that's what concern me. Glad I tried it.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "This WORKS!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I usually don't leave reviews unless a product blows me away and this one does!  You see results almost instantly and by the end of the day, it looks like you were in the sun for hours.  There is a SLIGHT, and I mean a SLIGHT smell, but NOTHING like your traditional self-tanner.  For the price??  This is amazing!!",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I see a lot of reviews saying it made them orange and it streaked but for me (I am really pale witb cool undertones) It had the most beautiful perfect tan and this is the first time ive ever use self tanner and it turned out amazing",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Perfect",
    "rating": "5.0 out of 5 stars",
    "content": "I have used Jergens' tanners before and this is a great addition. It tans quickly and evenly. ( I use disposable latex exam gloves for application.)  It gives me a nice, not too dark, tan and lasts pretty well until my next exfoliation. To keep the tan fresh between applications, I use Jergens Natural Glow Daily Moisturizer that has a sunless tanning ingredient that acts gradually. This combination gives me a reliable tan without dangerous rays.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve been buying this product for years and I have not been disappointed. I have very very skin so streaks would be a major problem for me. However, I do not have that with this. It looks very natural and gives me color and a relatively quick amount of time. Usually after two or three applications, I look Sunkissed.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Nice Tan, No Sun Needed",
    "rating": "5.0 out of 5 stars",
    "content": "Great products! Definitely prefer the mousse over the actual \"sunless tanning lotion\"... It's light and is easy to apply evenly .... I absolutely recommend 100% to exfoliate knees and elbows before application. Tanning mits are a must have as well for application! Works with a quickness! You can expect to see results within 1-3 days depending on how frequently you apply and how intense of a glow you are looking to achieve!",
    "post_time": "Reviewed in the United States on January 6, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Downside to this product, however, I've found that about after a week & 1/2 to 2 weeks you can expect to see the product beginning to become splotchy and spotted throughout the skin... With time, of course, we are expecting the product to \"fade away' or rinse off even with frequent showers/ bathing.... Its just the way it unevenly disperses through out the skin and leaves almost like a stain in your pores- is the only slight annoyance I have found... That is definitely the downside though ... lol... I would say the initial results of the rich caramelly tan are definitely worth it - to me at least! Just some things you may want to be aware of before you dive into this sunless tanning mousse.  All  in all it's an amazing product and fading is obviously expected with any sunless tanning product! 😊😊😊",
    "post_time": "Reviewed in the United States on April 12, 2021",
    "pid": "B00Q23KDOM"
},
{
    "title": "This looks good even on fair skin.",
    "rating": "5.0 out of 5 stars",
    "content": "People, I am pale. My legs are nearly neon. So I figured something must be wrong with this product when I used it four days in a row and became no tanner than when I started; I was still blinded by the glare coming off my lower body. I figured it must be user error, so I tried it with lotion, without lotion, with a tanning mitt, without a tanning mitt, after shaving, after not shaving, blah blah blah. I could barely see it as I was applying it, and the scent was almost non-existent. At first I figured it's simply an ineffective product, but I couldn't get why so many reviewers on here gave it high ratings. So I bought the same exact item at Target, and guess what, folks? Works great. It's a totally different color right out of the bottle--the Target one is more of a brown/red, whereas the Amazon one is yellow/gold. The Target one has a stronger smell, and I can see it everywhere I apply it. The Amazon one is clearly fake. Too bad I discovered this after the return window closed. Add it to the list of counterfeit trash I've been sent by Amazon recently.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "As for the product, I haven't yet managed to figure out how to apply it uniformly; It's still a little patchy, even when I rub it in well with my mitt. The self-tanner smell is definitely noticeable, but eventually you quit smelling it. The pros: if you've gone a little overboard with it, you can remove it/take it down a notch by lightly scrubbing your overly tanned parts with a washcloth in the shower; it does not rub off on fabrics; it gradually fades away and doesn't get splotchy after bathing; it's not orange (on me) at all. The color takes a few hours to fully develop.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Cali-girl tan in a bottle! Love🥰🥰🥰",
    "rating": "4.0 out of 5 stars",
    "content": "I would say that this won't be all that remarkable if you're already a little tan; the color just isn't dark enough. As I mentioned, I'm paler than an abominable snowman in a blizzard, and this product shows up on me as a very light tan, even if I use it a couple days in a row. And of course, it won't be remarkable if it's counterfeit.",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is my favorite!! I like it better than the sol. It gives a nice golden color and tans quick like the next day.",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "AWESOME TANNER",
    "rating": "5.0 out of 5 stars",
    "content": "I was hesitant to buy this based on some of the negative reviews but saw someone on Tik Tok who recommended it. I am so happy I decided to purchase it! I purchased the Light version. I put two coats on before bed and washed off in the morning. I had the most beautiful tan. The tan lasts a long time and fades like a regular tan from the sun would. No blotchiness like some tanners leave. It just gradually faded and with just those 2 applications, my tan lasted almost 3 weeks. I am impressed and will definitely purchase this again when my bottle runs out. I don’t understand the negative reviews because I just love it. I’m also very fair skinned and it still worked to give me a beautiful tan! If you’re on the fence, just give it a try. Like I mentioned, I applied two coats before bed. I let the first one dry and then put on another coat and went to bed. In the morning, I showered and was left with the best tan ever.",
    "post_time": "Reviewed in the United States on February 9, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you’re unsure, there is a smaller size you can purchase from Amazon. All in all, I am very impressed and happy.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "Great product",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm fair skinned and was afraid to try the ultra deep so I chose this deep instead. It did absolutely nothing for me",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Didn't work for me",
    "rating": "5.0 out of 5 stars",
    "content": "UPDATE: after the first application I waited 8-10 hours, rinsed, applied it again, slept in it and I had a good tan the next morning.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The only thing I don't like about it is that it DOES rub off on clothing ):",
    "post_time": "Reviewed in the United States on November 14, 2018",
    "pid": "B00Q23KDOM"
},
{
    "title": "Perfect Tan",
    "rating": "5.0 out of 5 stars",
    "content": "Produces a very natural looking tan. Love it!",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I LOVE this product! I cannot even tell you how happy I am to find this! It dries super quick which saves me a lot of time and unlike many other self tanners, it doesn’t stain your clothes. Easy to apply and it didn’t dry my skin. I only used it once so far and it already gave me a really nice tan which lasted ~1 week. It also has a really nice tone and it doesn’t turn you orange!!",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Could not be more satisfied",
    "rating": "5.0 out of 5 stars",
    "content": "I'm an extremely pale woman living in the PNW with fear of skin cancer, so sun is a rare commodity for me. I recently decided to try sunless tanning products and tried many that were streaky, orange, stinky, and just overall terrible. After using this product for the warm months (for my area this is April-August), these are my tips for using this product!",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Exfoliate skin and shave as needed. Apply small amount of lotion to elbows, feet, hands, and knees to avoid splotchiness in those areas. Then apply onto dry skin (I found no lotion was best on the rest of my body until after the tan had dried, often the following morning). I started application on my legs and work my way up. It's best to apply this mousse with a mitt (I purchased mine off of Amazon as well). Apply in circles, making sure to massage into the skin and cover all areas. It's fairly easy to see spots you have missed since there is small color development immediately. I also used a makeup sponge to apply tan to my face. After that, I let it dry for 15-20 minutes, sans clothes. Although it's supposed to dry quicker than that, it really doesn't...especially if you use an average amount of product. I hated to put clothes on while still sticky so I would just go around business as usual until it dried satisfactorily. I would apply at night, let it dry, sleep in it, and then lotion in the morning. Not gonna lie, no fake tan smells great on the skin, and this product is no exception. However, I didn't find it totally offensive, and it was relatively easy to mask with a nice smelling lotion. There was very little transfer to clothes and not too much onto bed sheets. The color that did transfer washed out in the washing machine.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "LOVE",
    "rating": "5.0 out of 5 stars",
    "content": "Absolutely love, go-to",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love to use this after tanning!  It’s a quality product that provides a bronzing glow.  Expedient Shipping!  Definitely recommend!",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Excellent Product",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried many fake tanners, ranging in all shades and prices. This one has been my go-to for years now. I apply it pretty seamlessly using latex gloves. I do it before bed and these is minuscule run off on the sheets, but after a few uses it can accumulate, but comes out of sheets easily. After showering in the morning, the tan looks great, NOT orange (unless you use it over and over and over in a short period of time). HIGHlY recommend, really great for the price too!",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use this every time I get out of the shower. Perfect color for my medium skin. Will buy again.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Love this tanner, use every single winter",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried so many self tanning products over the years. This one is by far my favorite. I am pretty fair skinned and I get the dark formula. It goes on with instant color so you can see where you are applying it. After a few hours the color develops and it’s a nice golden color, no orange tint at all. The scent is pleasant too. I would highly recommend using a mitt with this or any self tanner. It makes a world of difference in applying evenly with no mistakes.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m in love with this product. It’s perfect if you need an extra boost to your tan whether it’s for everyday or a night on the town. Gives great color and coverage but does get a little splotchy in wrinkled areas on me at least but I’ll still purchase again",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "No more orange color",
    "rating": "3.0 out of 5 stars",
    "content": "I purchased due to how many stars the product had. I found this product sticky, which I'm not used to. I found myself doing little activity for 4hrs. Then I used a clean wash cloth and removed the sticky residue.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The result was fantastic, great coverage and color.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "One of the Best Self Tanning Products",
    "rating": "5.0 out of 5 stars",
    "content": "I use the mit to put this on with and it’s perfect! No orange streaks and looks natural.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried a few different self tanners and this one is amazing!!",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "A must buy! Tanned in 2 hours!",
    "rating": "5.0 out of 5 stars",
    "content": "I will not use another tanning lotion. I recommend buying the glove also for better application. I use a makeup brush for my face! And it works wonders! Apply with clean skin.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Self tanner that looks reasonably natural and works fast .",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Looks reasonably natural",
    "rating": "4.0 out of 5 stars",
    "content": "This went on super easy and lasted for days. I was very happy with color and will probably use this as my go to tanner from now on. I read reviews that there was no order and that’s just not true. It has a very distinct odor on the skin and I try to only apply it when I’m not going out. It will get on your sheets at night if you apply before bedtime and sweat at all. Overall very satisfied with this product.",
    "post_time": "Reviewed in the United States on January 9, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I used a mitt to smooth the foam on my skin.  The foam spread evenly and gave a nice light tan color and remained on for a few days.  I wanted to have a little tan before wearing my swimsuit on vacation and was quite happy with the results.  I would recommend this product.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Easy to apply but does have an odor",
    "rating": "5.0 out of 5 stars",
    "content": "This is easy to apply. I use a plastic glove to apply. The color is believable and lasts. Just as good as expensive self tanners I have tried and better color.",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use. Applied with a mit and turned out natural bronze no streaks or lines. Would for sure recommend",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Nice even color",
    "rating": "5.0 out of 5 stars",
    "content": "I use this product for about 5 years. I love the natural tan! The tan last from 5 to 7 days! Definitely recommend!!!",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Spend a few extra to get a tanning mitt. This is an amazing and affordable way to keep some color if you're not one to be in the sun (like me). Buy the affordable mitt! Take your time to learn how to apply and you will LOVE this product!",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Great product",
    "rating": "4.0 out of 5 stars",
    "content": "Used this only once so far and have gotten so many compliments on my tan!!  People keep asking if I lay by my pool everyday or go to the beach a lot.  It is not fake looking whatsoever!!!!!  I even fooled my daughter when she said to me “I’m so jealous, you’re so tanned.”  I told her it was the Jergens self tanner. She ended up ordering it too.  A friend of hers mentioned my tan and my daughter told her “it’s fake.”  Her friend ordered it as well!!  Not expensive!!  I do recommend getting the glove to apply so your hands don’t get the color on them.  Then I use a brush to just dab a little color on the top of my hands and it looks natural.",
    "post_time": "Reviewed in the United States on July 30, 2023",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I swear by this product. I’ve been using it for YEARS. I wear gloves to avoid getting tan on the inside of my hands. It doesn’t have too much of that “tan” smell. It does rub off on my clothes but always comes out in the wash. Good to shake before use. But I’m obsessed with the natural tan it gives my skin and I always get compliments.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Great tan",
    "rating": "5.0 out of 5 stars",
    "content": "Other than having to wear gloves to apply to skin product works great! Fast dry time and natural look are a plus!",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Won’t use anything else!",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Best self tanner!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried so many high end self tanners and I aways find myself coming back to Jergens. It is so easy to use as the mouse is tinted and you can see where you have applied it. It also gives you an instant color with a deeper tan developing a few hours later. I have never experienced any transfer or staining on my clothes or bedding. I also find that it doesn't have a strong smell. Such an awesome product!!",
    "post_time": "Reviewed in the United States on April 30, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is very easy to put on and it dries very quickly.  It looks very natural love it.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "so easy to apply and leaves a golden color.",
    "rating": "5.0 out of 5 stars",
    "content": "I apply this mousse with a tanning mitt and back strap. I get a flawless sun-kissed look. It seems to take a few hours to truly “cure.”",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It lasts for about 3 days depending on swimming, shaving, and showering. At day 4 it’s definitely time to reapply. There is only a slight smell, hardly worth mentioning. Other tanners have a much stronger smell. Love this and use it regularly.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Love it",
    "rating": "4.0 out of 5 stars",
    "content": "Goes on so easily (highly recommend using with a mit!) and looks natural!",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the ease of use and the beautiful.color.it leaves on my skin. It washes off a little too easy though",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Easy application, quick dry, and blends nicely",
    "rating": "3.0 out of 5 stars",
    "content": "Lasts 4-5 days, goes on easy and no streaking. I have naturally light-olive skin and was complimented on my tan!",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B00Q23KDOM"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The color is very nice and the smell is what you would expect from a self tanner - it's fine. But as it is a mousse, no matter how evenly it is applied, the color is uneven. I had no issues with the self tanning lotion I used in the past (a generic from Walgreens) so I really think it is just the mousse texture. I will finish this bottle but I would not purchase again.",
    "post_time": "Reviewed in the United States on February 13, 2024",
    "pid": "B00Q23KDOM"
}
]