[
{
    "name": "        Fletchers' Mill Provencal Salt Mill, White with Blue \"Sel\" - 6 inch       ",
    "stars": [
        "79%",
        "21%",
        "0%",
        "0%",
        "0%"
    ],
    "pid": "B01KU7EA94",
    "ratings": "24 ratings",
    "other_info": {
        "Material": "Wood",
        "Color": "white with blue \"sel\"",
        "Product Dimensions": "6\"W x 6\"H",
        "Brand": "Fletchers' Mill",
        "Operation Mode": "Manual",
        "Recommended Uses For Product": "Kitchen",
        "Is Dishwasher Safe": "No",
        "UPC": "819936012458",
        "Global Trade Identification Number": "00819936012458"
    },
    "discount_price": "$ 75.",
    "normal_price": "$25.99",
    "about_this_item": [
        " Easy-to-use and refill: the Fletchers' Mill pepper mills are for novices and experts alike-anyone who wants complete control over the seasoning of their dishes  ",
        " Lock and grind system: Fletchers' Mill grinders give them precise control through a lock and grind grinding system. This unique mechanism ensures perfect consistency - whether fine grinds for fish, medium grinds for gravies or coarse grinds for meats  ",
        " Adjustable fineness: grinding is performed in a two-step process: First the peppercorns are crushed to release their natural oils and flavors; next, they are ground to the chosen consistency for perfect results every time  ",
        " Easy-to-clean: this mill features pop-out mechanisms for easy cleaning  ",
        " Made in the U. S. A. All Fletchers mill wood products are handcrafted in in Maine from the finest new England hardwoods, and carry a limited Lifetime on the mechanism only  "
    ]
},
{
    "title": "Lady of the house pays attention to elegant details",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful as pictured, buy whole Himalayan  salt and whole peppercorns for an elegant touch to any kitchen. Mine happens French country transitional as is LR, DR.",
    "post_time": "Reviewed in the United States on May 3, 2021",
    "pid": "B01KU7EA94"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful mill, looks like the pic or better.  Works much better than the Martha Stewart mills I bought at Target years ago.  Also, not sure the picture or description conveys this, but there is a gorgeous \"S\" on the hardware on the very top of the mill.  It is such an adorable, thoughtful detail that I was pleasantly surprised by when opening the package.  :)",
    "post_time": "Reviewed in the United States on August 30, 2018",
    "pid": "B01KU7EA94"
},
{
    "title": "It's exquisite.",
    "rating": "4.0 out of 5 stars",
    "content": "They attract a lot of attention with guests. One small caveat below.  Once in a while I find the pepper version stuffs working well and I have to flip the device over and push the mechanism back up. It’s a small issue and everyone thinks they’re just great.",
    "post_time": "Reviewed in the United States on October 31, 2022",
    "pid": "B01KU7EA94"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful, sturdy, made in USA, and perfect for my table!",
    "post_time": "Reviewed in the United States on July 13, 2021",
    "pid": "B01KU7EA94"
}
]