[
{
    "name": "  Before We Were Yours: A Novel ",
    "stars": [
        "71%",
        "22%",
        "5%",
        "1%",
        "1%"
    ],
    "pid": "B01M14UN1J",
    "ratings": "148,999 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$19.69",
    "about_this_item": []
},
{
    "title": "Twists and Turns!",
    "rating": "5.0 out of 5 stars",
    "content": "I would highly recommend this book.  First book I have read by this author and I liked the lot structure.  The entire book I was guessing as to what might happen with the families and children.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This story will bury itself into your soul. Make you cry for the children and how they were treated in the early 1900's. Shows how vulnerable our babies are then and now. Opens a persons eyes and makes one look more closely at the world around them. Read this and look at your surroundings in a different light.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Heart Breaking",
    "rating": "5.0 out of 5 stars",
    "content": "My family is from SC and it was fun to imagine Edisto Beach and Charleston! Quick read and a page turner.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It really is so horrible to know that the basis of this story is true. I was very happy about the sisters’ reunion, though, and loved all the characters….well, not ALL the characters! But so enjoyed this book.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Loved this",
    "rating": "5.0 out of 5 stars",
    "content": "It took a few chapters to really understand what’s going on and get to know all the characters but omg!!! Love It!!!!",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One of the best books I've read. Even though the truth of it is horrific and sad, the story is so well written.  Couldn't put it down!",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Sad but true",
    "rating": "5.0 out of 5 stars",
    "content": "The harsh reality of those cruel times was overshadowed by the fierce love and loyalty of Rill for her siblings. Her tireless dedication to reuniting with her parents was shattered, freeing she and Fern to live in world otherwise unreachable.  The persistent and driven curiosity of Avery and Trent to find truth was realistically presented. I finished this is less than a week.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I came across this when looking for a story I could get into.  Even though it is a number of years old it is still worth a read.  A story that will twist and turn you through out it.  .",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Loved It!!",
    "rating": "5.0 out of 5 stars",
    "content": "Lisa's way of telling a story is so fresh and causes the reader to think deeply. Although this book doesn't mention faith or scripture, it's easy to see God's hand woven into the story.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was well written and an adventure that I found myself wanting to get back to day after day. The truth of the baby selling was heart wrenching, but important for people to be aware of. I enjoyed it through and through.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Great Story",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed reading this book, characters really came alive, great story development and such a great ending. Would recommed",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent book",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Riviting",
    "rating": "5.0 out of 5 stars",
    "content": "At times, this book is so very sad and mysterious. I really enjoyed the read.  The ending made me happy.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "great book, great read",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "I Recommend",
    "rating": "5.0 out of 5 stars",
    "content": "I’m a Tennessee native and was saddened that there was truth in this fictional novel. How a woman could be so heartless to innocent children and for the poor parents who lost their children. Greed prevailed and yet some kids were saved from financial poverty and also were genuinely loved.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nice paperback book for the money. Good read.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Great",
    "rating": "5.0 out of 5 stars",
    "content": "I love books centered around the past history of our country. This book is about orphans and things that happen when no one is watching. Before the internet, people with bad intentions got away with so much. This story is about love and loyalty and if the truth should come out to set things right.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Such a beautifully tragic story. I absolutely loved it. Such a good read. I knew nothing about this story. Just unimaginable what those babies went through.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Very touching and informative about how children were purchased / adopted",
    "rating": "5.0 out of 5 stars",
    "content": "Heartbreaking story full of suspense. The telling of this tale in two different time periods is an impressive feat of writing skill. The characters are described and act as expected. Highly recommend.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Literally one of the best books I’ve read.  Not once did I want to stop reading.  Can’t wait to read more of her books",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Wow!!",
    "rating": "5.0 out of 5 stars",
    "content": "This story was so good!  I actually read it years ago and a friend was currently reading it and telling me how good it was.  I thought it sounded familiar so I read it again.  Loved it all over again!!",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is one of the best books I’ve read in a very long time, I didn’t want it to end! Spectacular, a must read!",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Wow!",
    "rating": "5.0 out of 5 stars",
    "content": "Reading a fictional book about true history where poor children and babies were stolen and sold to wealthy people was very painful.  Learning that this happened many times and was done in secret, yet wealthy and influential people received what they wanted with a son or daughter coming into their home.  These new parents had no idea of the physical and emotional history of these children.  It’s hard to imagine that any child leaving the Tennessee Orphanage could ever be emotionally stable enough to survive this treatment.",
    "post_time": "Reviewed in the United States on June 7, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Lisa Wingate writes about these fictional children in such a way that the reader wants to embrace and care for these children, showing them love and security.  This horrible adoption world happened!",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Heartbreaking News of Adoptions",
    "rating": "5.0 out of 5 stars",
    "content": "I give the rating of five stars because it taught me the true story of a horrific time in the State of Tennessee.  However, it is a painful, tear jerking book to read.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What a page turner!!  From one chapter to the next I loved the way this story unfolded.  It wasn’t a true story but one that could have happened.  Somehow we learn to survive.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Is it good to keep secrets?",
    "rating": "5.0 out of 5 stars",
    "content": "Couldn't put this book down. Tore at my heart strings!",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is the 2nd book I've read by Lisa Wingate. (The first one was The Book of Lost Friends-excellent book.) It grabbed my attention and never let go.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Brought tears to my eyes",
    "rating": "5.0 out of 5 stars",
    "content": "This was a great story, sad to say that this was actually happening in this country during that time period.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The ending made me cry.....It was a good ending.  :-)",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Kept my interest",
    "rating": "5.0 out of 5 stars",
    "content": "Good book....kept my interest.  Found out what deplorable conditions some orphanages were.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There was nothing I didn't like about this book! It is one of the best I've ever read. I could not put it down, reading into the wee hours 2 nights to finish in less than 3 days. Love the way Wingate takes us seamlessly back and forth in time, with the characters coming alive more and more on each page. Sadly 5 stars are just not enough!",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Engrossing from start to finish",
    "rating": "5.0 out of 5 stars",
    "content": "I read this in just a few days. I usually only read about 30-45 minutes a day. But I couldn’t put this down. Such a tragic story. Based on real events. The world is so unjust.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Thought provoking.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Wonderful book",
    "rating": "5.0 out of 5 stars",
    "content": "Fascinating look at the lives of the children caught up in the scandalous Tennessee Children’s Home Society from the 1930s - 1950 and the effects on families from all stations in life.  Well researched and well written, the author brought the characters to life.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Before We Were Yours is a novel by Lisa Wingate.  The novel is based on the story of the Tennessee Children’s Home Society and Miss Georgia Tann who ran an orphan scam from the 1920’s to 1950.  In this period of time, thousands of children were stolen or legally taken from their biological homes and adopted by celebrities and wealthy people all around the country.  Some of the adoptive parents were hit up later for even more money for extended legal suits.  Most of the biological parents never say or heard of their children again.  Of the children themselves, many dies of unknown causes or of disease or mistreatment. Thousands were adopted and forgot about their true families.  Still others remembered their past and mourned the loss of their parents and siblings.  Using this story as a backdrop, Lisa Wingate composed a story of one family whose children were taken illegally.  What happens to these helpless children is the basis of this story.  It is well-written and creates a haunting view of live at that time in the homes.",
    "post_time": "Reviewed in the United States on March 23, 2018",
    "pid": "B01M14UN1J"
},
{
    "title": "Content",
    "rating": "5.0 out of 5 stars",
    "content": "The five children of Briny and Queenie Foss were brought up on a riverboat.  They loved the life and could not envision anything else.  Then Queenie began having problems as she tried giving birth to a set of twins.  Briny took her to the hospital in Memphis leaving Rill in charge of her siblings, Camellia, Lark, Fern, and Gabby. The next morning, when they expected to see Briny, a group of men came and took the five children off the boat to be taken into the care of Miss Tann and the Tennessee Children’s Society.  They were looked upon as a great treat as they, except for Camellia, they all had blond hair and blue eyes.  This was the preferred option for adoptive parents.  Lisa takes us through the sordid life in the Home and the despair Rilla feels when she can neither protect nor keep her siblings together.  Rilla would spend her life trying to find her siblings and make sure they were all right.  She lived for the say she would return to the houseboat and Briny and Queenie would meet her with open arms and minds.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Lisa takes us to the depth of despair in the basement of the home where the siblings are housed until there is room for them upstairs.  We feel Camellia’s pain and displeasure for being her and her need to fight against it.  How will her rebellion turn out?  We feel Rilla’s guilt as not keeping her family together and not being able to protect them from harm.  Will Rilla be able to reunite her family?",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "INJUSTICE",
    "rating": "4.0 out of 5 stars",
    "content": "The book is very well-written and the topic is outstanding.  Although this is about a fictional family, Lisa brings the situation that really existed to the forefront of our mind and does not let us neglect it.  This ranks right up there with the top five books I have read this year which I think are the best I have read.",
    "post_time": "Reviewed in the United States on April 19, 2023",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There is nothing so fine as reading a finely crafted story by a talented writer.  I am grateful for this write.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "absolutely riveting!",
    "rating": "5.0 out of 5 stars",
    "content": "This book was amazing and I cannot wait to read more from this author. You really feel connected to the characters and feel all the emotions. I cannot believe things like this happened in real life not too long ago !!",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Another fabulous book from Lisa Wingate, but this one takes a different turn.  Lisa has taken actual events, the adoption scandal of The Tennessee Children's Home Society that was exposed in 1950, and has woven an engrossing account of lives changed.  It is told in two different voices in two different times, but unlike some books that doesn't prove a distraction.  It is very easy to keep it all straight, and it adds to the suspense by taking you up to a point and then pulling you back to a different aspect of the story.  The characters are well developed, and you are allowed to peel back the layers slowly to get the big picture.  As Rill's story unfolds, you are held spellbound by the unrelenting sadness of her situation, and horrified by the fact that these things really happened to some children.  Wingate has a gift for imagery that pulls you into a scene.  But in true Lisa Wingate fashion, there are also plenty of happier moments to relieve the sadness and many truths uncovered.  Avery's story gives some interesting insights into how political families live their lives on display.  She wasn't the most sympathetic character in the beginning, but she did grow on me as she learned to be more aware of her own aspirations and feelings.  A well-crafted new effort from Wingate, it is one of those books you can't put down and you don't want to end!",
    "post_time": "Reviewed in the United States on October 8, 2017",
    "pid": "B01M14UN1J"
},
{
    "title": "Lisa Wingate's best book yet!",
    "rating": "4.0 out of 5 stars",
    "content": "This book is a little different twist for Lisa Wingate.  She has taken actual events, the adoption scandal of The Tennessee Children's Home Society that was exposed in 1950, and has woven an engrossing account of lives changed.  A large family living on a houseboat on the Mississippi River finds themselves in a desperate situation one dark and stormy night.  The father must take the mother, in the midst of a life-threatening childbirth, to the hospital leaving the five children on the boat.  Operatives for the predatory orphanage grab the children and propel them into a terrifying situation.  Big sister Rill tries desperately to protect her siblings and keep them together through it all.  It is told in two different voices in two different times, but unlike some books that doesn't prove a distraction.  It is very easy to keep it all straight, and it adds to the suspense by taking you up to a point and then pulling you back to a different aspect of the story.  The characters are well developed, and you are allowed to peel back the layers slowly to get the big picture.  As Rill's story unfolds, you are held spellbound by the unrelenting sadness of her situation, and horrified by the fact that these things really happened to some children.  Wingate has a gift for imagery that pulls you into a scene.  But in true Lisa Wingate fashion, there are also plenty of happier moments to relieve the sadness and many truths uncovered. The other voice is that of Avery, the daughter and heir-apparent of a political dynasty.  Her story gives some interesting insights into how political families live their lives on display.  She wasn't the most sympathetic character in the beginning, but she did grow on me as she learned to be more aware of her own aspirations and feelings.  This is a well-crafted new effort from Wingate - one of those books you can’t put down and you don’t want to end!",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Printing on several of the pages are deformed.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Printing",
    "rating": "5.0 out of 5 stars",
    "content": "I had no idea of this history interesting and disturbing",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Interesting subject",
    "post_time": "Reviewed in the United States on July 4, 2018",
    "pid": "B01M14UN1J"
},
{
    "title": "Really great story",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve read them all; The Baby Thief (true; highly recommend!) to the books published by adoptees who were stolen. Aside from, ‘The Baby Thief,’ which is a must read for the history & facts the author spend years (16?) compiling, none of the others even come close to weaving a compelling, incredibly realistic & human look at what happened to these children.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a shame because while I would much prefer to read a true account vs. a non-fiction (but fiction) novel, I commend the author for her ability to weave this story & make it feel authentic.",
    "post_time": "Reviewed in the United States on June 12, 2017",
    "pid": "B01M14UN1J"
},
{
    "title": "Good read",
    "rating": "5.0 out of 5 stars",
    "content": "Parts of it are predictable, & I’m not talking about parts related to Miss Tann’s tactics or the conditions of the TCHS. The bore for me was the love (or rather, lack-there-of) story of the protagonist & her fiancé. He could have been removed, she still could have been a FP who left DC to care for her Dad & I wouldn’t have missed it one bit. To even suggest it completed the, ‘be who you are,’ idea is silly. There’s enough of that in the other fabric woven throughout that Elliot was completely discardable.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "While it goes without saying, I do believe it’s important to reiterate that the happy ending has simply not been the case for 95% of Georgia Tann’s victims. More than that, it absolutely needs to be made public that Georgia Tann is directly responsible for the adoption laws across the United States that maintain secrecy, altered birth certificates & leave adoptees—adults!—unable to ever view their original birth certificates. This remains policy in the majority of the United States! This woman did not only effect people during her reign of terror. She has & continues to harm millions of other people who are searching for answers.",
    "post_time": "Reviewed in the United States on April 3, 2019",
    "pid": "B01M14UN1J"
},
{
    "title": "Sweet",
    "rating": "5.0 out of 5 stars",
    "content": "This was a very touching heartfelt story that I personally think everyone will enjoy.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a stunning book that brought you right into the story. I loved it so much i bought it for my mom who loves historical fiction and she loved as well. There was laughter and tears. A great read!!",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Best book ever!",
    "rating": "5.0 out of 5 stars",
    "content": "Well told story as it tells about a sad time in our country’s history.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Eye opening story about the history of state I live in!  I felt for the characters and liked that the book told their story to the end.  I’ve just ordered the Georgia Tann book to understand how someone could be that horrible to innocent children.  There is no true excuse for her actions.. but this book promotes more questions than answers about a time I cannot even imagine.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Excellent read!",
    "rating": "5.0 out of 5 stars",
    "content": "So we’ll written….sucked me in right away! Very heart wrenching story, but wonderfully told.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wish there were 17 more of this book",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Great Book!!",
    "rating": "5.0 out of 5 stars",
    "content": "I will be taking a deep dive into the true history of the Tennessee Home Society for children. This story was amazing. The love between siblings is a beautifully told story.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very interesting and thrilling",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Fantastic book",
    "rating": "5.0 out of 5 stars",
    "content": "I had a hard time putting this book down. Both stories were intriguing and the characters were well developed. I’ve read the last chapter several times savoring the conclusion. I read all the acknowledgments and interesting facts the author included at the end just so the experience of the book wouldn’t end.",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book came up as a recommendation for me and as soon as I saw it was about Georgia Tann, I grabbed it. My mother-in-law was one of Georgia's infant adoptees. She was adopted by a California movie star. This is the second book about Georgia that I've read. The first was a factual book, so this covered the other side of the story...told by the children who had to endure her cruelty and abuse. It's a dual time line with the modern day woman trying to find out the history told in the other timeline. A nice mystery and I loved the ending. Personally, I think it was well written and I plan to look for other books by Lisa Windgate.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "A mysterious romantic novel.",
    "rating": "5.0 out of 5 stars",
    "content": "I liked the way it kept me focused. I tried to figure out the mystery but did not. It made me laugh and made me cry. I learned a lot of history that is new to me. History that will hopefully never happen again.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A beautiful story, absolutely love this book and would definitely recommend it to all book club ladies everywhere around the world!",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Beautiful Story",
    "rating": "4.0 out of 5 stars",
    "content": "An intriguing story of children from a poor background put in a bad orphanage and through adoption having a completely different life.  Two stories wind together and meet in the end.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book wow! The animalistic nature of Georgia Tann and her TCHS. It is absolutely horrifying how life is and how money can purchase humans as objects.",
    "post_time": "Reviewed in the United States on March 31, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Family Mystery",
    "rating": "5.0 out of 5 stars",
    "content": "This book is heartbreaking but also eye opening. The world we live in then and now, the way the rich are seen vs the poor.. It was not as easily exposed decades ago like it is now but naturally the issues from 1920 didn't disappear because news coverage and podcasts expose more, people just got better at avoiding direction or creating other distractions to hide the nasty.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Though this tale is heartbreaking it was a very good read in my opinion. Avery is stubborn and I love that she pushes on to find the truth. Rill is one of the sweetest motherly 10 year olds just trying to hold it all together and protect those she loves. ❤️",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "The heartbreaking truths of the past.",
    "rating": "5.0 out of 5 stars",
    "content": "The painful situation that happened in plain sight.  20 or more years of grief for these children.",
    "post_time": "Reviewed in the United States on November 26, 2018",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Not easy to get into but ok",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Horrors in plain sight.",
    "rating": "3.0 out of 5 stars",
    "content": "BEFORE WE WERE YOURS is two interwoven stories that take place two generations apart. Lisa Wingate uses this clever vehicle to tell the story of Georgia Tann, sometimes described as the most prolific mass murderer in American history. Her victims were not adults in a shopping center, millennials at a concert or students in school. They were often babies. No one knew for years. Historians have documented the life of Georgia Tann in several nonfiction books. Lisa Wingate puts a more human face on the story by overlaying the atrocities committed by Georgia Tann with the fictional 1939 account of Rill Foss and the current day account of Avery Stafford.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Rill Foss, 12 years old, lives with her parents and four siblings on a Mississippi River shanty boat. Although life is hard, the family is almost deliriously happy. Everything changes when Mrs. Foss, pregnant with twins, must be rushed to a Memphis Hospital. Mr. Foss, who leaves Rill in charge, promises to return with his wife and two new babies.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "CANNOT PUT DOWN READ",
    "rating": "5.0 out of 5 stars",
    "content": "Got this 4 weeks ago for a book club this Friday. Read in 3 days and hope I recall enough from 4 weeks ago to be a good participant. Goes from past to present buy never confusing as in some other books. I LOVED the young children who were neglected and worse at every turn.  I wanted justice for those who took advantage of them for profit and self indulgence.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This true life examination of the world some children occupied, while wealth and privilege went unchecked, leaves one wondering about the savage nature of humans.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Savage Humanity",
    "rating": "5.0 out of 5 stars",
    "content": "This book has taken me through so many heart felt emotional pains. I just loved, it !!! You can feel the water moving back & forth. See the children fishing in your mind , true life in ever word ! Have you ever been hungry or gotten the belt for No Reason !! Then this book won't mean as much , true loss & pain brings to life this Story. You feel  true & heart felt emotional drama these Children went through , but being loved comes . Sister's come in All sizes young & baby's , Old  But growing & staying close means everything. Loss \\ Love \\ Growth , Redemption , Old Age , Death. This has it All Enjoy !",
    "post_time": "Reviewed in the United States on March 14, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Even though this was an older read it was my best book of this year! Amazing must read. 5 star book!",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "A True Masterpiece !!",
    "rating": "4.0 out of 5 stars",
    "content": "I don't know why I need to add a written explanation for my review but here you go, 4 stars",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great multi-generational story .  Different time lines but easy to follow.  Very in-depth story on some of the things that went on with adoption agencies when children were brought and sold.  Depth of family love and loving care of the elderly.  Positive ending!",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Great find",
    "rating": "5.0 out of 5 stars",
    "content": "A sad and traumatic story with a thread of hope and light in spite of it all. Love the author's way with words.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am having trouble walking away from this story, even finding it difficult to read my next book. My mind keeps wandering off to this story again. The background facts for this novel are so shocking I needed to search more on the internet about the Tennessee Children's Home Society and the vicious, greedy woman who ran it, Georgia Tann. Her rationale offered to those who colluded with her was that these children of poverty, or babies from an unwed mothers, were infinitely better off in the homes where they were placed. No sympathy or thought is given to the mothers or families from whom these children were taken. Another reviewer said this was just the novel Orphan Train rehashed, but I do not agree. In that novel the source of the children is primarily from immigrant families in the slums and docks of NYC and the focus of that book is what happened to them after that --- shipped west on the orphan trains where they were adopted at train stops along the way. Many of these children were treated as chattel to work on western farms and/or abused. Little attention is given in that book to the original families.",
    "post_time": "Reviewed in the United States on September 4, 2017",
    "pid": "B01M14UN1J"
},
{
    "title": "Required",
    "rating": "5.0 out of 5 stars",
    "content": "In this book we get to spend time with the Foss family that lives on a shanty boat on the Mississippi in 1939, moving north and south on the river along with the seasons. Their level of poverty is hard to imagine, but the family of five children and their parents are all supportive of each other. There is music, singing, storytime and a group effort to find fish, frogs or whatever to eat. There is even a rudimentary community among the shanty boat dwellers; they travel along the same routes and tie up in the same areas, then move on.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "(Spoiler in this paragraph - skip to next paragraph if that is an issue.) An unexpected complication with the mothers pregnancy, where both she and the new baby could die, forces the father, in an effort to save his wife, to boat over in a skiff to the city, seeking help at a hospital. But before they can return the children are rounded up by the police and hauled off to Georgia Tann's orphan facility. Because this is a then-and-now type story, we get to figure out what happens to these kids as well as what happened to their parents. Little by little we also get to connect the dots between the present day characters and the Foss children who were stolen from their parents.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Absolutely haunting",
    "rating": "5.0 out of 5 stars",
    "content": "This book left me reading hours upon end in sad disbelief of the historical facts the novel was based on, yet unable to put it down over worry about what would happen to each character. The author weaved an incredible story embellished with depth, rich plot, and expert character development. Kept me guessing (and crying too) until the end. Enthralling, mortifying, heart breaking, and absolutely haunting. I literally thought about this story and the historical basis of the novel for weeks after finishing it- mortified and dwelling over the fact that a scandal so atrocious could have formed the basis for the adoption framework in America. Excellent book bringing to light a dark and shameful part of American history- but an incredible story all the same.",
    "post_time": "Reviewed in the United States on July 12, 2023",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "*Trigger warning & vague plot details follow…*",
    "post_time": "Reviewed in the United States on December 4, 2020",
    "pid": "B01M14UN1J"
},
{
    "title": "I WAS ON THE EDGE OF MY SEAT",
    "rating": "5.0 out of 5 stars",
    "content": "The only negative I will mention is a personal one that may not bother a reader who is prepared for the storyline but that did haunt me as I had no prior insight into the historical basis for the novel before reading the book— As a new mom, the plot revolving around prolific kidnapping and child abuse was incredibly difficult for me to read at this stage of my life with my own baby the same age as one of the main characters. But, I suppose the author therefore successfully elicited the emotional reaction from the reader that she was likely aiming for with her book. But it will certainly break your mommy heart!",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "SUCH A BENEFICIAL READ! Before We Were Yours by Lisa Wingate offered a very real depiction of the infamous Tennessee Children’s Home Society. Within this historical fiction, the terror these children endured in real life is brought to life and shown within a much larger context.",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Unusual read, but I loved it",
    "rating": "5.0 out of 5 stars",
    "content": "This novel is the perfect Young Adult read and engroses its reader in the mysterious tale. With the story being told through multiple points of view, it leaves you constantly on the edge of your seat and ready to solve the puzzle. Although you can see where the tale is headed by midpoint in the book, you won’t know for sure until the end. This alone makes the book hard to put down. The idea behind the book is a true story, making it ideal for those interested in true crime and survivor stories.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In conjunction with the main story, the personal backgrounds for the characters makes the story more complex and lends itself to the ability to be believed as a true story. The small details included by Wingate make the novel easy to understand, yet enticing. While this book is a New York Times Bestseller, and that often discourages me from reading, I actually believe this novel deserves the title, as it does justice to the true stories of child trafficking in the 50s.",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Before We Were Yours",
    "rating": "5.0 out of 5 stars",
    "content": "Oftentimes I find it difficult to follow along in books that are not only told from multiple perspectives, but also multiple time periods. However, the flow of this novel was very smooth and effortlessly alternated between narrators. If you are interested in this format of fiction but are unsure where to start, I think that this book is the place to begin.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "On top of the amazing writing style, the characters were easy to relate to. Avery’s hectic lifestyle and longing for truth make it impossible not to fall in love with the character. Additionally, the sympathy you feel for Rill is immaculate and makes having empathy for fictional characters easy to understand. The three leading women in the novel have such a strong connection to one another in the end of the novel, and makes the 300+ pages fly by.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "beautiful",
    "rating": "5.0 out of 5 stars",
    "content": "I'm usually one to read legal dramas or mysteries, but this had a unique plot, which was quite sad. A story of children being stolen and sold to couples wanting to adopt and the cruelty those children endured. But it's so much more. Enjoy!",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B01M14UN1J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was a real eye opener, all about the Tennessee Children's Home Society. Children wrenched from their homes and families, never to return. Heartbreaking. This went on from 1939 to 1950. A must read book.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B01M14UN1J"
}
]