[
{
    "name": "        Kitchen Gizmo Snap N' Strain - Silicone Clip-On Colander, Heat Resistant Drainer for Vegetables and Pasta Noodles, Kitchen Gadgets for Bowl, Pots, and Pans - Essential Home Cooking Tools - Grey       ",
    "stars": [
        "69%",
        "15%",
        "8%",
        "3%",
        "4%"
    ],
    "pid": "B01MZ14LJV",
    "ratings": "38,534 ratings",
    "other_info": {
        "Material": "Silicone",
        "Color": "Gray",
        "Brand": "Kitchen Gizmo",
        "Style": "Snap On",
        "Product Dimensions": "10\"L x 5\"W x 2.5\"H"
    },
    "discount_price": "$ .",
    "normal_price": "$49.99",
    "about_this_item": [
        " Plastic  ",
        " Hands-Free Straining: This clip on strainer easily snaps onto pots, pans, and bowls; keeping your hands free. It’s a fun addition to your strainers and colanders collection; simple for draining pasta or veggies  ",
        " Compact and Space-Saving: Unlike traditional strainers, this collapsible strainer clips on and takes up minimal space. It’s the go-to solution for limited kitchen storage or camping trips  ",
        " Heat Resistant: Made from heat-resistant silicone; it can handle temperatures up to 400°F/230°C. This pot strainer stays strong, giving you a sturdy grip while draining hot foods without bending  ",
        " Compatible with Most Cookware: Specially designed to attach to most pots, pans, and bowls; this clip-on strainer for pots is versatile. Its universal design suits any kitchen task, big or small  ",
        " Durable and Dishwasher Safe: This pasta strainer is built to last; crafted from silicone; this kitchen tool is sturdy yet flexible, making draining easy. Simply rinse or pop it in the dishwasher for easy cleaning  "
    ]
},
{
    "title": "Works exactly the way it was described.",
    "rating": "5.0 out of 5 stars",
    "content": "Draining food",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It works well if you cook a little, if it's a lot of pasta or rice, it overflows and you can't drain the water properly. Rice is more complicated than pasta, but it's a good option and takes up very little space.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Yes but...",
    "rating": "5.0 out of 5 stars",
    "content": "No more digging for a strainer, just simply hook on the pot, and TaDa!! Easy Peasey!! Love it. Wish I would have though of that!",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It works very well.  I have not had it release and dump contents into the sink.  It will replace your hand-held pot strainers and it is tall enough that what you are draining doesn't come over the front of it.  Good item to have.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Ingenious!",
    "rating": "5.0 out of 5 stars",
    "content": "I liked how flexible the rubber is. It’s like a one size because it bends perfectly for my sauce pan and wraps perfectly on to my pot.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recommend getting one I use it more than any of my strainers now and its easy to clean, doesnt take up much space in the dishwasher, easy to use.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Just think about how you hold your pot before you clip this on",
    "rating": "5.0 out of 5 stars",
    "content": "Love it, ended up buying another for my mom and she loves it too. Still need to be a bit careful when draining, but all good.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It fits perfectly on all my pots. I no longer use a calendar. Very sturdy and well made",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Game changer",
    "rating": "5.0 out of 5 stars",
    "content": "Handy gadget, works well takes up less space and easier to clean than a colander.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I used this when draining water out of pasta for a salad. Worked well",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Good",
    "rating": "5.0 out of 5 stars",
    "content": "Great",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The product was pretty nice, overall.  I was worried about the clips not being strong enough, but they were plenty strong to hang onto the pot I tried it on.  I expect that'll decay over time, though.  The strain worked well.",
    "post_time": "Reviewed in the United States on December 7, 2023",
    "pid": "B01MZ14LJV"
},
{
    "title": "Decent, though I would definitely go for a larger version.",
    "rating": "5.0 out of 5 stars",
    "content": "My only real complaint about the item is that the strainer wall just isn't high enough.  I cooked only 1lb of meat in a 10in pan and struggled to keep the meat in the pan as I tilted to get the grease out.  All of the images show thing thing being used with pan tilted like 80º backwards.  Which is great to get \"some\" of the liquid out, but you have to tilt more than 90º for realistic usage, and that's where things start to try and fall over the top.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Again, like the item, and will continue to use it.  But I would definitely like one with a bigger wall.  The same seems to be using it on a small pot, but for anything with a larger diameter, the strainer only covers like 20% of the opening.  For spaghetti, I'll definitely continue using my https://a.co/d/f5b9b94 instead, though.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Portable strainer",
    "rating": "5.0 out of 5 stars",
    "content": "This item makes it easy to strain any thing . It stays in place on the pot and is made strong I love to use it to drain pasta. It also takes up a lot less space then traditional strainers which gives for more space for other things a must have for anyone who cooks",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excelente",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Excelente",
    "rating": "5.0 out of 5 stars",
    "content": "No more need to balance colander in the sink to drain pasta water.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Works great on all pot sizes and can be cleaned easily in the dishwasher.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Works great!",
    "rating": "5.0 out of 5 stars",
    "content": "I love this strainer! I don't know why I waited so long to get it! I think I'm at the point that I can just get rid of or put away my normal strainers. This one clips onto all my pots just fine. Makes it so much easier to make pasta dishes. Going to buy some as gifts!",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like this well enough, but what I don't like is that the clips are hard to clip on to the pan, especially if there is a lip on the top of the pan.  On the plus side, it drains well without any food escaping!  And I like that I can throw it in the dishwasher after I'm done with it.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Easy and effective",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and store - perfect to cut down on bulky colanders if you have minimal space such as in an RV, camping, etc.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This product does what it purports to do: it keeps the pasta in the pot and lets the water out if you're like me. And you just really, really, really hate getting a separate sieve out to drain your pasta and then you always have to put it back in the pot to make whatever you're making, especially mac and cheese, right? Then get this, pour the water out, leave the pasta in the pot. You're not transferring it back and forth. Throw your butter in through your powdered in your milk. Boom bang bang mac and cheese in one pot and you're not dirtying another thing..",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Pasta in, water out",
    "rating": "5.0 out of 5 stars",
    "content": "Also, it comes in a lot of colors and if you're a purple fanatic like me it's great.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Highly recommend. Keep your pot clean please cuz other people notice...",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Easy to use. Easy to clean. Takes up very little space.",
    "rating": "5.0 out of 5 stars",
    "content": "Buy it!",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have used this gizmo multiple times since I bought it, and have recommended it to family and friends.  The quality is excellent and it fits lots of sizes of pots.  So easy to attach and remove!",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Best gizmo ever!",
    "rating": "5.0 out of 5 stars",
    "content": "I no longer use my colander when draining anything cooked in a pot/pan, but use this instead. It is easy to clean.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Works really good and stats in place with the clips.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Works great on any size pan",
    "rating": "5.0 out of 5 stars",
    "content": "Clips to pan nicely. Easy to clean. Durable plastic. Makes pouring out liquid easy. Great product.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is a bit smaller than I expected for draining vegetables and pasta. It does the job and is easy to use. Locks on our pots without issue but needs work to get it onto the pot. Hit or miss if you would like it. certainly not worth the price asked for.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Clip on works great. .",
    "rating": "4.0 out of 5 stars",
    "content": "Your hands will be more able to handle hot steam from burning your skin.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Only fits certain pans. But on the ones it fits it’s really great. I use it for pasta and it allows the pasta to stay hot. Before I pored it into a colander and it lost it heat immediately.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Limited use",
    "rating": "4.0 out of 5 stars",
    "content": "It is high quality, and convenient in storing and draining pasta. But it is not super accessible in terms of the clamps. Takes a lot of strength to open them enough to get on and off the pot. Disappointing as I wanted this to make cooking easier since I have weak joints so not having to worry about a strainer would be nice.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this because some of my family members have a hard time straining hot liquids. I'm old school and normally just hold the lid while I drain the water and \"tough out\" the steam but I used it once just to see how it worked and was pleasantly surprised at how well it worked.  It seems relatively sturdy, but I'm not sure how long it will last since the \"grips\" are covered spring clips.",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Convenient but a bit hard to clamp",
    "rating": "4.0 out of 5 stars",
    "content": "Clips on easy, holds on well and I've used it on several different sized pots with no issues.  If you have room to store it with your other strainers I recommend it.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Had a little trouble clipping it on my pot, but I think it probably works better on the large pan.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "I like it more than I thought I would!",
    "rating": "5.0 out of 5 stars",
    "content": "Likes to loose noodle out of strainer",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Easy to attach and works great!",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Neat little gadget.",
    "rating": "5.0 out of 5 stars",
    "content": "Clips just need to open wider as it is hard to put on our pots.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B01MZ14LJV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I just tried this out for the first time and it did what it was supposed to do. It held my pasta in while the water drained out. I only lost one penne…",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B01MZ14LJV"
}
]