[
{
    "name": "        TruSkin Vitamin C Serum – Anti Aging Facial Serum with Vitamin C, Hyaluronic Acid, Vitamin E & More – Brightening Serum for Dark Spots, Even Skin Tone, Eye Area, Fine Lines & Wrinkles, 1 Fl Oz       ",
    "stars": [
        "65%",
        "17%",
        "10%",
        "4%",
        "5%"
    ],
    "pid": "B01M4MCUAF",
    "ratings": "145,699 ratings",
    "other_info": {
        "Skin Type": "Oily, Combination, Sensitive, Dry, Normal",
        "Product Benefits": "Brightening",
        "Use for": "Skin, Face, Body, Hand",
        "Scent": "Vitamin C Serum (1oz)",
        "Special Ingredients": "Vitamin C, Hyaluronic Acid, Vitamin E"
    },
    "discount_price": "$ .",
    "normal_price": "$48.99",
    "about_this_item": [
        " SKIN BRIGHTENING SERUM: Vitamin C evens skin tone, neutralizes free radicals, and boosts collagen to improve vibrance and reduce dark spots, dark circles, fine lines & wrinkles  ",
        " ANTI AGING FORMULA: Purposefully balanced blend with Vitamin C, botanical Hyaluronic Acid, Vitamin E, Aloe Vera, Jojoba Oil, and MSM to help brighten, calm & protect skin  ",
        " BETTER FORM of VITAMIN C: Highly stable, Sodium Ascorbyl Phosphate maintains potency for longer with less skin stinging than other commonly used forms of Vitamin C  ",
        " SKIN FRIENDLY, GENTLE SKIN CARE: Fragrance free skin nourishment using vital nutrients, antioxidants and botanical actives to improve skin wellness, all in a vegan and cruelty-free formula without parabens and other harmful chemicals you don’t want  ",
        " THE TRUSKIN DIFFERENCE: If for any reason you decide this product isn't a fit for your skin, we're here for you. Each purposefully balanced medley of key antioxidants, super-nutrients and nourishing botanical actives enhances efficacy and delivers skin-friendly benefits, without added additives or fragrances. The expiration date is printed on the barcode sticker attached to the packaging.  "
    ]
},
{
    "title": "Great Product",
    "rating": "5.0 out of 5 stars",
    "content": "Worked wonders for my skin… my skin was soft again in a few days… very thick",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great product. A little goes a long way. Love that the bottle is glass and keeps it well. Brightened my skin and faded some spots but did not make them go away totally. This is my 2nd bottle so hoping to see more fading of age spots.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Works great",
    "rating": "5.0 out of 5 stars",
    "content": "Quita  las manchas y deja la piel suave y reluciente",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I bought No7  cream w/vit C & have  been using it abt a month, I saw the vit C facial serum made by TruSkin & thought I'd give it a try.  This serum works,  within a week I noticed results! I didn't have to wait a month or 3 months, I use it in morning & in evening after washing my face &  I cannot believe the difference.  My face is smooth & soft & it looks tighter than it has in a very long time, I also notice fewer wrinkles & as we women get older, alot of us are looking to stay younger & get rid of some of those lines.  I've been using No7 which is great & I added this to my daily regimen & it works.  I'll finish the No7 vit C",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Lo recomiendo",
    "rating": "5.0 out of 5 stars",
    "content": "cream & start buying this. When I was looking for vit C for face the price range was from only a few dollars up towards $100 & there's no way I'm spending $100 on a little bottle of serum or any makeup or skin care item!  I can't remember how much this TruSkin cost, around $20 I think , it's worth it.  I'm really happy bc like I said earlier,  I saw results within a week. The dropper half full into your palm & apply to your face morning & night, I don't yet know how long a bottle will last, I'll let you know on my next purchase of this TruSkin vit C.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My dermatologist recommended a Vitamin C product.  TruSkin is so much more.  It is smooth, easy to apply and the quality is high standard.  I appreciate that I can understand the ingredients and love what’s in this 2oz bottle.  So far my face is brighter, as a new product I expect to see more results with continued use.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "I've been using over a week",
    "rating": "5.0 out of 5 stars",
    "content": "I truly love this vitamin C serum ! It gives your face the glow it needs all year round and is light on sensitive skin such as myself . Deff a must buy .",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love this product as well as all TruSkin products. I feel I can trust their ingredients. I have used this and their other products for several years now. I have very dry skin - my skin looks and feels great!",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "More than Vitamin C!",
    "rating": "5.0 out of 5 stars",
    "content": "Use this everyday under moisturizer on face to help brighten complexion.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the way it makes my skin feel and others have noticed. I've gotten compliments on the freshness and brightness of my face. Will continue to buy this item.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Excellent!",
    "rating": "5.0 out of 5 stars",
    "content": "Love this product. I put it on first thing in the morning after I wash my face and it’s soaking in for five minutes then add my moisturizer. It seems to even tighten my skin and make it look brighter. it is a good buy because you get 2 ounces for the price of one many other products.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This serum really does the trick. I noticed that my skin was looking dull and flat, and different from older photos so I remembered what I had been doing during that time and it was this serum plus hyaluronic acid and that time, so I started doing this again and now my skin is dewy and illuminated again!",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Brightens my skin!",
    "rating": "5.0 out of 5 stars",
    "content": "I have been using this product for a few months now and I'm really enjoying it. This will be my new go to for Vitamin C serum.  It applies nicely to the skin and does not feel sticky like other products I have used and absorbs quickly.  Overall, my skin seems brighter and softer, and the golden look of the serum is refreshing.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I tried this product based on an Amazon Prime Day whim & it’s a hit!  My skin is clear & healthy!  This product is definitely a staple in my skin care routine moving forward!",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "gorgeous glow",
    "rating": "5.0 out of 5 stars",
    "content": "When I purchased this product my face was a mess. At 71 years old my face was breaking out constantly.  My skin was rough looking.  The breakouts are fewer.  Looks much healthier and people can’t believe I’m 71.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This C serum works as described & is a must daily for everyone.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Skin renewed!",
    "rating": "5.0 out of 5 stars",
    "content": "I have been using this for the past 2 months and have seen considerable change in my skin texture and color.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is more smooth and even tone than before.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "It helped me.",
    "rating": "5.0 out of 5 stars",
    "content": "It has made a difference with the dark splotches on my face",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I tried this as an alternate to my usual serum. I like it and will use it as a substitute for my favorite serum. Don’t like the consistency .",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "If this had been organic, I'd still be using it!",
    "rating": "4.0 out of 5 stars",
    "content": "This is a really interesting product. When you first put it on your finger to apply, it feels sticky, but it absorbs immediately into your skin, leaving it soft and smooth. It only took 4-5 drops from the included dropper for my whole face and neck. Unfortunately, the bottle tends to leak if it gets turned on its side, and it's not USDA organic, so I am trying a new product that is organic and looks to be similar. I'll let you know!",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Someone recommended this product so I got some. It seems to absorb nicely and no skin sensitivity.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Nice product",
    "rating": "5.0 out of 5 stars",
    "content": "I've used this product for many years and will continue to use it. My skin is the best it has ever looked. I use this morning and night and will continue to use it since it has made my skin look and feel so nice. TruSkin is also very reasonable in price vs many of the other expensive items I have tried in the past. Worth giving this a try.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The serum makes my skin feel soft but the best ting it does is fade the spots on my face. I love this product.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "I've used this product for many years....",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve been using this product for several weeks now and have noticed a big improvement with the skin on my face. My skin is super soft and hydrated. I recommend using the oil.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve tried several and this one works great on my skin. Dries nicely and skin feels and looks better",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Fades age spots",
    "rating": "4.0 out of 5 stars",
    "content": "Just started using it. Dries quickly but so far haven't noticed my skin any softer or \" glowing \".",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Expensive for the amount you get.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Great product!",
    "rating": "4.0 out of 5 stars",
    "content": "Only time will tell.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great product for the money.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Texture and results mimic high end",
    "rating": "5.0 out of 5 stars",
    "content": "The texture of this product is very comparable to high end. The results are great. Will repurchase!",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great for use in the morning with face yoga! Tapping it in or patting it in instead of rubbing, seems to work best when i used this product. You need to use a moisturizer afterwards , though, because it is not extremely moisturizing and does not have a lot of slip unless you apply more product; but even then it evaporates quickly, and what happens to get left behind on the skin, absorbs but it's a bit sticky. If you don't want to use a heavy moisturizer on top of it or if you are skipping the sunscreen, you can spray on something light and moisturizing like rose water or glycerin water, and be good to go for applying your makeup or for bare-facing it. This serum does not have a huge scent, but what you can smell, is not at all offensive, which is perfect if you don't like a lot of perfumy fragrance close to your nose. If looking for a daily serum, this one is a good, clean one to have on hand. I don't notice a super plumping, hydrated, shiny, glow-y look from this product  like i see with some serums, but you do get a clean, brightened, natural, and bit of a dewy look with this product. Plus, it is consistently gentle. Hope you try it! It is truly a good, clean daily serum to have on hand! By the way, it gently smooths the back of your hands, too! Works nicely underneath a moisturizing hand cream.",
    "post_time": "Reviewed in the United States on December 22, 2023",
    "pid": "B01M4MCUAF"
},
{
    "title": "Works great with face yoga -Consistently gentle - A good, clean daily serum to have on hand!",
    "rating": "4.0 out of 5 stars",
    "content": "Vitamin-C Serum was as described and at a good price.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Not sure yet about the results in removing dark spots, let’s see",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Item as Described",
    "rating": "5.0 out of 5 stars",
    "content": "PLEASE READ PRIOR TO PURCHASING!",
    "post_time": "Reviewed in the United States on May 10, 2018",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I was looking for a natural product, that would not only help the condition of my skin, but also make it feel more healthy as well. I have a very rare, very serious diseases for which I have to have chemotherapy regularly, and I take many, many medications . I'm a 31 year old, who REALLY hadn't started putting too much effort into skincare up until recently. I already have the Vitamin C moisturizer and love it, so I decided to try the serum, along with the eye gel Truskin offers (I think it's referred to as Super Eye Cream Gel, and it's amazing as well; my under eye area is so smooth and my dark circls have lightened so much, in only about a months time.... And the results began immediately!).",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Great texture and smell",
    "rating": "5.0 out of 5 stars",
    "content": "Both products feel amazing on application and absorb quickly, and fully(no problems with makeup application after use!). Well, my skin did a \"purge,\" I believe, which is apparently quite common when you begin any new skin care regimen, and I do already get cystic acne right before and during my monthly cycle around my chin, but I thought I'd email the company and just ask if possibly I'd chosen the wrong product for my partular skin type. I gave a little description of what my skin was doing, along with a little background information about myself to give them a better idea so they could advise me better, and I asked if maybe the tea tree serum would be more appropriate since I had the acne.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What I've received from Erica in return was so unexpected and so kind; the definition of above and beyond. Before anything else, her first instinct was to have me ensure with my doctor that these ingredients were ok for me to use with my treatment. It was something I hadn't even considered, and on top of that it no was a complete shock; a wonderful person, who was much more concerned about me as an individual, rather than making a sale! As I'm sure you all know, that's rare these days!  I checked with my doctor and my care team, and got back with her to let her know they didn't see anything wrong with me using the products... Infact they said they would highly recommend them because of how natural the products are! And though the company did NOTHING wrong, and I myself had mostly likely just chosen the wrong product for my individual skin type (or who knows; I'm still entertaining the idea of using both, alternating days maybe!), Erica then offered me a complementary bottle if the tea tree super serum (which was more expensive than this product...and again, they had no mistake to rectify!).  They had done nothing wrong; she was just that kind, and wanted me to be able to try it!  What a kind, honest and caring company! And thus far, ALL of the products are so amazing, and I hope to soon collect the entire line! I truly could not say enough good things about the products themselves, along with the unbelievably honest and caring customer service I have received. Definitely purchase this product!!",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "ABSOLUTELY WONDERFUL!!!",
    "rating": "4.0 out of 5 stars",
    "content": "Note; I've seen another brand on Amazon being advertised, sometimes alongside Truskin naturals' products, having very similar packaging and very similar names and claims. I didn't discuss this with Erica, but I have noticed it and i did mention it when discussing with my care team to make sure they were reviewing the correct products, and they were in agreement with me; that whatever those products are.... They are NOT the same as  TruSkin products and do not appear to be as safe, natural, or of high quality like these. So please make sure you don't add a knock off look alike to your cart (and this is not something I've been paid to do or even asked to do.... This is coming straight from my heart and the wonderful, touching experience I've had with this company!).",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wanted to love this.  As mentioned by others it has a sticky consistency.  I used it for a least a month and haven't seen any results.  Skin felt softer in the beginning but then the product seems like it started to go bad.  It now is thick and hard to get out of the dropper and is gunked around the top of the container.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Very impressed",
    "rating": "5.0 out of 5 stars",
    "content": "The product has nice consistency. I am very impressed by the post purchase services from the seller.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've used the product on a burn on my arm and the scar is barely there at all. I just had bacon grease spatter right next to my eye. (Between my nose and eye) Fortunately, it didn't go into my eye. But I'm out of this product because I've been using it so much. So I'm going to order more on prime day (5 hrs) and I will take pictures of my burn before during and after to prove my point. If you have older burn scars it works but you have to be vigilant. It definitely works on newer or semi new.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Works on new and semi new burn scars",
    "rating": "5.0 out of 5 stars",
    "content": "I love it. I wish I ordered it sooner. Everyone should try it. It makes your face feel so good.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I liked it",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "It’s worth every penny",
    "rating": "5.0 out of 5 stars",
    "content": "First of all let me start off by saying this is my second bottle of this serum. Here’s my story so you can understand a few things and reasons why I’m a customer for life. I’m a 34 yr old woman, who has endometriosis and PCOS. I don’t take birth control because although it gave me porcelain doll skin, everything else that happened to me while on birth control was miserable. It helped control my hormonal acne, and it helped me lose a lot of weight. I have been off birth control a full 3 years now. I have always had what I felt was “decent” looking skin. I had a bit of teenage acne growing up but never much where I felt I had to slab make up on every day. Now at 34, with cystic ovaries, I had to change things up in my routine. I started doing research and I’ve always liked and leaned towards things that were more natural with less alcohol and other horrible ingredients just bad for your skin. After my research of serums, toners and supplements. I chose TruSkin Naturals Vitamin C Serum. The fact that it also has vitamin E and Hyaluronic acid is major plus. The vitamin E is also great for helping scars face and help fight against aging as well. The thickness and consistency of the serum is matched perfectly. It is not greasy nor oily. I use a dropper full amount for my whole face and entire neck. My acne scars are mostly on my neck and it’s embarrassing. Having to wear make-up all the way down to my shoulders almost is horrible. With the bottle I noticed very quickly within less than a week that my fine lines faded, my acne not only basically cleared up but the scars did too. I kept getting compliments at work and from my patients and they asked what I used on my skin because it looked like a doll’s face. They would tell me my skin looked soft and smooth and it was. I Told them I use the TruSkin Vitamin C serum, along with Burt’s Bees Chamomile and Soap bark face wash. I have continued to have amazing results until hurricane/tropical storm Harvey hit. We lost half of our patients due to them losing everything as well and some relocated and others we don’t know. There was a company lay off and being someone who loves and is passionate in skin care and I’m a nursing student, and while trying to reach out about working from home to make it easier with my studies, I went to the actual TruSkin company site and sent a message asking about possible employment. The site and I believe business owner, Erica, responded kindly and so sweet. I had actually forgot I had sent that message at the time of the reply and the worst part was it looked like I was drunk while typing it. I lost my glasses from the flooding. Anyways, although she was unable to offer employment she was beyond so kind and compassionate and understanding during our correspondence and I was offered a free bottle of the serum to help compensate and I was so excited. I’ve never had that happen to me and I told her pretty much all I’ve said here on my long winded story. When I temporarily stopped using TruSkin Vitamin C serum due to Harvey my skin flipped out on me. I know it’s from stress and hormones. I received my bottle of serum yesterday and my bottle of the retinol moisturizer today. It’s crazy to say that the results are already amazing. I have sensitive skin. The serum feels amazing, the moisturizer feels great. It smells soft and no burning or stinging. I’ll update soon with pictures as promised. Thank you Erica, for the kindness you showed me and for having these amazing and natural products. I hope to use these as long as I can. Because just after a day and a half my skin has already shown the softness and smooth skin I had before that I received so many compliments on.",
    "post_time": "Reviewed in the United States on November 4, 2017",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Okay so I have been using this product now for about 4 days and honest to God I already see a difference in my face. I have seen a few dermatologists and asked them for an anti-aging skin care regimen (I am 24 years old). However, there advice was always basic and they just told me to use tretinoine cream for now and sunscreen. After doing my own research on the internet I found there is a lot more I could be doing to protect my skin. I also suffer from pimples here and there sometimes. So the last dermatologist I saw also recommended I use gly/sal 5-2 pads.",
    "post_time": "Reviewed in the United States on January 31, 2020",
    "pid": "B01M4MCUAF"
},
{
    "title": "Good",
    "rating": "5.0 out of 5 stars",
    "content": "I've listed below my old skincare routine to my new one. I feel strongly about taking great care of my skin and feel I have come up with a great solid routine after searching so long scouring the internet for adcvice. Hopefully this helps any of you that are also struggling with a routine. (I found all these products on Amazon by the way). I truly feel my skin looks amazing and has a glow to it now that it didn't have before. I do think TruSkin vitamin C serum is playing a major role in that. Based of my research it has so many good ingredients in it that are perfect for anti-aging and protection. All the other new products are part of my updated skin routine that I recently purchased and so far I've liked them all.",
    "post_time": "Reviewed in the United States on October 24, 2016",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "If you suffer from any time of acne or hormonal breakouts use the gly-sal 5-2 pads or even the stronger ones. They have helped keep my face clear so far! <3",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Finally something amazing!",
    "rating": "4.0 out of 5 stars",
    "content": "Old morning routine:",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "1.)  cleanse face with Cerave foaming cleanser (perfect for sensitive skin)",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Not what I  expected",
    "rating": "4.0 out of 5 stars",
    "content": "It was ok .",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "SO I do this first thing in the morning, IT WORKS I have tried a lot I am 54 and the little fine lines ETC are visible but you can feel the tightness when you put it on, I do after i shower, I do my hair then I put this on and I use a little hand fan to make it dry, I then put my make up on... I only use a little eyeliner and clear mascara... after I get off work, I wash my face and use it again... I WILL be putting this on my rotation!! but not every month but it's only a little drop under my eyes, mouth and forehead..",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "WOW",
    "rating": "4.0 out of 5 stars",
    "content": "I always say I'm going to write reviews about things and don't but I've been using this stuff for a few years and I absolutely love it I hadn't gotten any in a while but when I just got in the bottle I was so so disappointed because I noticed that my absolute favorite thing about it which was this just perfectly light citrus wonderful scent that used to be in it is completely gone.",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I literally hate the smell of citrus but whatever the smell was that used to be in this was amazing and was the number one reason I like to get it besides how it feels on my face and now I feel like I'm going to have to find a new serum. Y'all should sell it with and without scent for the people who actually do enjoy it. That's the only reason it doesn't have five stars it would have normally been like 20 Stars I love this stuff",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "SO SAD THEY TOOK AWAY THE CITRUS SCENT",
    "rating": "5.0 out of 5 stars",
    "content": "Lo mejor",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "great stuff",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Vitamin C",
    "rating": "5.0 out of 5 stars",
    "content": "I have used this product on and off for a few years, but I will be steadily using it moving forward. A biopsy showed an area on nose was precancerous. To save space, every 4 months I have to go back to have a new layer removed by freezing it. This Vitamin C has kept a scar from forming.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have used Timeless and Skinsceuticals and this outperforms both. The hype is real! Will continue to use! I wish I bought the bigger size. My skin loves it and it has changed the way my skin looks after first use. It looks better day by day.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "good",
    "rating": "5.0 out of 5 stars",
    "content": "My significant other started using this in addition to retinol night cream and 5he difference is night and day. After using this for solid 2 ro 3 week there was a notice in softness and now he really does look to years younger",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B01M4MCUAF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have fallen in love with this serum and I've tried several but keep coming back to this one!  I feel like you can tell the brighten instantly with this brand were others just made my face feel wet.  Grant it you have to put this serum on and walk away until it dries (less than 2 minutes) but it really works and it's fantastic.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B01M4MCUAF"
}
]