[
{
    "name": "        RENPHO Smart Scale for Body Weight, FSA HSA Eligible, Digital Bathroom Scale BMI Weighing Bluetooth Body Fat Scale, Body Composition Monitor Health Analyzer with Smartphone App, 400 lbs - Elis 1       ",
    "stars": [
        "82%",
        "11%",
        "3%",
        "1%",
        "3%"
    ],
    "pid": "B01N1UX8RW",
    "ratings": "346,887 ratings",
    "other_info": {
        "Brand": "RENPHO",
        "Color": "Black",
        "Recommended Uses For Product": "Animals, Weight loss, Adults, Fitness",
        "Special Feature": "Precision Balanced, Backlit Display, Body Fat, Bone Mass, Auto Shut Off",
        "Display Type": "LED"
    },
    "discount_price": "$ .",
    "normal_price": "$59.99",
    "about_this_item": [
        " Renpho smart app works in connection with fitness apps. Easy setup app works with Samsung Health, Fitbit and Apple Health. Renpho already has millions of happy global users  ",
        " 13 essential body measurements. Body weight shows on the scale, other body composition data including weight, BMI, body fat percentage stored in the app. Track everybody's metrics change on Renpho Health app  ",
        " User-friendly app. Download Renpho Health at App Store or Google Play, also works with Apple Watch (Except for Apple Watch Series 1). Renpho Health App works with Bluetooth 4.0 and above  ",
        " High-Quality Innovation. Auto calibration, high precision sensors measure in increments of 0.2 lb, 0.05 kg with 400 lbs, 180 kg capacity. 4 high sensitive electrodes. DO NOT let the sides of the digital weight scale, especially the four corners of the surface tempered glass hit any object, and it is recommended to wrap the four corners of the glass with soft objects  ",
        " Monitor your progress, unlimited users and baby weighing mode. Renpho bathroom scale connects with apps to help motivate toward your goals, save historical data, and track your daily, weekly, and monthly progress. Use baby weighing mode for weighing baby or pets, 1 scale for whole family, support for adding unlimited users  "
    ]
},
{
    "title": "Accurate",
    "rating": "4.0 out of 5 stars",
    "content": "I like the idea of all the info and able to use an app to keep track of everything during my health journey. The look is sleek and modern. I still havent figured out how to hook up all connectivity but it does keep track of weight and BMI.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great scale and slim. Its heavy enough I dont have to worry about it breaking easily or tipping over. I am still trying to figure out how to do the body fat mass percentage, no instructions came in box. But easy to read digital reading for weight.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Great scale",
    "rating": "4.0 out of 5 stars",
    "content": "The look is sleek and the app provides quite some comprehensive data. I stepped quite close to the edge of the scale by accident once and it tipped over almost making me fall. Make sure you step on the middle part of the scale to be safe!",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love everything about this scale.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Works well but be careful when you step on it",
    "rating": "5.0 out of 5 stars",
    "content": "Today I went to go push it where I keep it and I accidentally hit it on a bottle that was sitting there and the scale broke. Instantly I thought I was going to have to pick up tons of tiny little shards, but it's shatterproof. This is a feature I did not know I wanted or needed. It made cleaning it up really easy and it was my fault completely, but I am so grateful.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Buying again right now.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "I would recommend this scale!",
    "rating": "5.0 out of 5 stars",
    "content": "As far as the actual weight, I know that the scale is accurate. I tested it against a doctors scale. Im not sure about all the other information it provides because I have no way to test it. I find it all very useful and its a great guide for when you gain or lose weight. You cant beat the price.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It keeps me motivated to lose weight as I can watch my weight loss on the app. I can pull up my history to track trends and other health information. Has an easy to connect app that seamlessly logs your information. Seems very accurate.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "For the price of the scale is absolutely amazing.",
    "rating": "5.0 out of 5 stars",
    "content": "Great product, takes all sorts of information in and to push all kinds of relevant information out. Works pretty fast. Not as completely stable as some scales, so ya gotta beware of how you step off it, but other than that I'd recommend it.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this scale after my son raved about it. He was right...this scale sets up in seconds, has it's own app, and tells you things about your body you never knew (of course some people might not want to know but still) Weight, BMI, Body Fat percentage, fat free body weight, subcutaneous fat, visceral fat, body water, skeletal muscle, muscle mass, bone mass, protein, and BMR...oh and metabolic age (not going to lie, I was insulted) you can store body measurements...honestly the options are endless.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Non working scale was replaced",
    "rating": "4.0 out of 5 stars",
    "content": "I updated from a 1 star to 4 stars due to customer service. The company promptly contacted me and replaced the non working scale as it was under warranty (which I wasn't aware of).",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Original review:",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Me encanta",
    "rating": "5.0 out of 5 stars",
    "content": "I haven't had this scale for 2 months yet and it is already defective. When no one is on it and it's on a level surface it never goes to zero and keeps telling me I weigh over 100 lbs less than I do. I've replaced the batteries and it still won't calibrate properly.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Me agrada que puedo tener una seguimiento de mi peso, masa corporal, hidrataci贸n, etc., lo que ha ayudado a estar pendiente de la hidrataci贸n, y controlar la calidad y cantidad de las comidas.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Accurate scale with great info",
    "rating": "5.0 out of 5 stars",
    "content": "En 1 semana  he logrado bajar 1,2 libras, gracias a la informaci贸n inmediata e hist贸rica disponible.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Had been using an old scale that fluctuated a lot, so when that one quit working we read reviews and decided to try this one. We wanted a scale we both could track on our devices and this one fit the bill perfectly. It takes a couple of minutes to set up and synch, but it gives you a ton of info which is useful if youre tracking on a diet and exercise plan. Highly recommend.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Great data and AMAZING Customer Service",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this product at the end of 2023 and it has been great for over 8 months. The data that it tracks is incredible and it is very conveniently connected to an App on your phone. I started to experience a minor defect in the screen reading \"888\" repeatedly, but their customer service team sent me a brand new product! All they needed was a video or photo of the defect and my shipping address.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great smart scale with bluetooth connectivity. Easy to read and very accurate. Comes with bettery. Tons of health info like BMI, muscle weight, sub fat, fat weight, etc. Renpho app can sync with Google Fit, Samsung Health and MyfitnessPal. Can be used by multiple users with their own Renpho app. Item arrived in good condition w/o damage, kudos to the delivery. Priced really low, cheaper than other scales out there. Highly recommended!!! ",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Great smart scale that is easy on the pocket!",
    "rating": "5.0 out of 5 stars",
    "content": "Love this scale! It is accurate, weight is same as my other scale. I love the app that goes with it. When getting started set up your measurements and goals if trying to loose weight otherwise just use the scale as a scale. It will on the app give you lots of informative about your body. When I get up in the morning I bring my phone in the bathroom pull up the app than weigh myself , I cute tune goes off after all the information is gathered. I am not too sure if all the information is exact but it is a real nice idea to go with. Keeps a good record for you also. I do not use all the features but i still really like this scale. Would recomend it.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love how much information this scale gives you. Its just a little tricky to get the hang of at first but otherwise it is very user friendly.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Very accurate",
    "rating": "5.0 out of 5 stars",
    "content": "Love this scale! It looks very kind of \"futuristic\".",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I took it with me to the Doctors office and checked several times against their scale.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "great value",
    "rating": "5.0 out of 5 stars",
    "content": "Both scales read exactly the same every time down to the 10th of a pound.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "i am really impressed with this scale! the app is easy to use, and allows you to track progress without having to enter all information manually. i wasnt sure how it would work if my boyfriend also wanted to use this scale, but he downloaded the app and was able to get connected as well!",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Scale is awesome. works as advertised",
    "rating": "5.0 out of 5 stars",
    "content": "When I bought this I was a bit skeptical but when I got it I was surprised, it gave me detailed information about my weight & body",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This scale works great and interfaces well with the app. The only downside is that you have to have the app open when you're looking to get more than just your weight for the data to sync so that you can track it. I also like that I can create multiple profiles so I have one for me and one for my GF.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Great for tracking additional body metrics",
    "rating": "5.0 out of 5 stars",
    "content": "I like the low price of this digital scale that provides 10+ bits of info, including body weight, comparisons to other weigh-ins, BMI, protein, muscle, body fat, calories to maintain the posted weight, and users' age based on the above info visible on your phone app.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this for myself. I didnt know my whole household would start using it too, they never cared about a scale before! Feature packed for the price. App works flawlessly and has many subcategories that it tracks. Great for not just knowing your base weight, but gives insight on where you need to work on to be healthy.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Lots of health info with this scale",
    "rating": "4.0 out of 5 stars",
    "content": "This was MY year to get healthy! the countdown to the BIG 60 was not going to stop me from being the best ME I can work on!  Besides clean eating, it was important to be accountable for my activities and or non-activities:{....I find this smart scale very easy to use, and set up was a breeze.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Now getting on the scale was always a daunting task, but this technology make it interesting especially to see my BMI going down.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Great scale!",
    "rating": "5.0 out of 5 stars",
    "content": "This arrived exactly as described. It's a great scale and I love how it connects to your phone so you can keep track of progress.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My mom bought one years ago (5+) and now I wanted my own so I knew what scale to buy! I love the readability and the quality. Great battery life too. The app is user friendly but the scale can be used without the app. Amazing purchase",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "My favorite brand for scales!",
    "rating": "5.0 out of 5 stars",
    "content": "Mine shattered after a year, totally my fault. I had a heavy candle in a window sill about the scale and the candle fell onto the scale. Pieces everywhere! However, I love the scale and ordered a second one right away. ",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is fantastic!!! I have to have a digital scale that tracks everything accurately and the data cant be changed. My eating disorder specialist recommended this. This has tracked very well, with extremely easy set up instructions with great app. Results cannot be altered, thus her recommendation. Id repurchase in a heartbeat! Easy to clean and wipe, size is decent, display is clear and overall appearance isnt a bathroom eyesore.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Love it, but be careful",
    "rating": "5.0 out of 5 stars",
    "content": "When I get on my old scales, if I step off and on 3times, there would be three different weights. Not with these! They seem to be very accurate and look stylish in my bathroom.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent product. Very affordable. This scale is the perfect addition to any fitness regime to track BMI, visceral fat, percentage of water and other valuable body composition markers.  It has a nice \"trends\" feature that allows you to graph your progress. It's perfect. Highly recommend!",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Buy it",
    "rating": "5.0 out of 5 stars",
    "content": "Unfortunately this scale is too accurate.  It is showing my wight as heavier than I really want to be, so it does encourage me to try to eat and drink less and exercise more.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I started a weight loss journey and I wanted to get a scale I could rely on. I decided to purchase this scale and I love it. The scale is easy to set up and easily storable. Readability is also very easy as the numbers are big and it shows on the app. OH THE APP. Download the app that comes with this scale and it keeps track of all your process including weight, BMI, Water weight, bone density, etc. definitely a great tool!",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Love these!",
    "rating": "5.0 out of 5 stars",
    "content": "I sold my Renpho scale when I moved and have regretted it ever since. Finally replaced it.  I find being able to view my results over time and see how I compare with \"standards\" on the app, very motivating.  Great product.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you are interested in knowing how the inside of your body is doing, this is the scale you need. I love it?グ",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Love it",
    "rating": "5.0 out of 5 stars",
    "content": "This smart scale could possibly be one of the best I have gotten. The amount of information the scale gives you is incredible, and the compatible app makes the experience a lot better. The screen on the scale is very easy to read, using a bright red color. The slick appearance makes it fit in almost anywhere. It comes with AAA batteries that you can easily put in the scale. It is fairly easily to clean because of the glass top, but also make sure to dry it before every use as it DOES get slippery when wet. As for the weight, it is very light and fits in most places due to its compact size. My only issue (which isnt really a dealbreaker for me or for most people) is that if you move it or turn it upside down, you have to recalibrate it. But that is easily done by just stepping on the scale with one foot.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great scale! It has a lot of built-in features. The app that goes with it is amazing, its very easy to store and track your weight loss, and your goals. Also about 15 other factors.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Great scale!!",
    "rating": "4.0 out of 5 stars",
    "content": "Good design, its simple and slick.  My only issue is the accuracy of the body fat reading, it certainly is incorrect on mine, but may be a random defect.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Other than that, no complaints",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Good weighing scale but inaccurate body fat reading",
    "rating": "5.0 out of 5 stars",
    "content": "This is the second one I've owned.  The first was damaged in a move.  The app provides a lot of information that will help with targeting issues with type of fat, hydration, and bone density.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have always had a renpho scale. This was my second one for our second home. I love the app and how I can keep track of my results. Even just seeing a little drop in body fat or pounds is motivational to keep going.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Really Great Smart Scale!!",
    "rating": "4.0 out of 5 stars",
    "content": "Only used a couple times it seems very accurate  and easy to use. I bought one for my sister's also. Connects easy to phone.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this scale for tracking measurements. The only complaint I have is that the additional users do not seem to have access to the full set of measurements that the primary user has.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "love this scale",
    "rating": "5.0 out of 5 stars",
    "content": "Been using this scale for 2mo now, and I can say its helped me see patterns in not only weightloss but BMI, visceral & subcutaneous fat.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I cant wait to have months worth of data to compare.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Tipping the scale as a YES buy!",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to set up and a very good value product.  Batteries were even included and it was easy to program",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Quality is great. This is my second Renpho. Purchased for a different room, but can easily use both with the same app.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Easy and informational",
    "rating": "5.0 out of 5 stars",
    "content": "I loved the fact this BMI SCALE, was an excellent price because of Amazon sale. Accuracy in weight, quality built for the price.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "i bought this so that i could be able to monitor my new puppys weight, the added bonus of having an app to use it for myself, is very informational! amazing quality for the price, cant beat it !",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Excellent BMI scale for the price",
    "rating": "5.0 out of 5 stars",
    "content": "For someone who gets frustrated with technology very easily, this scale is Awesome!! Im absolutely enjoying this scale!! It easily measures and records BMI, bone, water, visceral, and Subcutaneous fats and compares your measurements on an athletic to unhealthy range! This scale even measures and records ones metabolic age in comparison to ones chronological age! Im very impressed!",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My old scale would give me 5 different weights with 5 different attempts all in rapid succession. This beauty is consistently accurate and is probably the best bathroom scale I have ever had.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "very detailed",
    "rating": "4.0 out of 5 stars",
    "content": "I love this scale only wish it did the baby calculations as I thought it did. Only other thing I wish it had was the ability to go back to other weights like a history. It may do it but I have not yet figured it out yet. I love that it takes AAA batteries and it auto shuts off. The quality seems great too but Im sure if dropped though it may break I would not recommend for anyone with small kids that can get ahold of it.  The app is fantastic I love how it gives so much more that weight and BMI just wish I knew how it did water weight and protein and all that other stuff. I do recommend this scale especially for the price.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My nephew weighs just under 500lbs and he has been working on losing weight. This scale holds him and helps him know how he's progressing and he's making good headway now. It's a very nice sleek thick glass top and is easy to store and clean.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "So nice and easy to use!!",
    "rating": "4.0 out of 5 stars",
    "content": "Great value, easy to use app. Measurements are close to Dexa results.  Cons - scale surface area is small footprint and may be tight for some users.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B01N1UX8RW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is darn near accurate and I am surprised. I compared to my professional InBody scans and its right on.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B01N1UX8RW"
}
]