[
{
    "name": "        HATHASPACE Smart Air Purifiers - True HEPA Air Purifier, Cleaner & Filter for Allergies, Smoke, Pets - Eliminator of 99.9% of Dust, Pet Hair, Odors - HSP001-700 Sq. Ft.       ",
    "stars": [
        "77%",
        "14%",
        "5%",
        "2%",
        "3%"
    ],
    "pid": "B075ZZND8B",
    "ratings": "14,946 ratings",
    "other_info": {
        "Color": "White",
        "Brand": "HATHASPACE",
        "Product Dimensions": "8.9\"D x 8.9\"W x 22.2\"H",
        "Noise Level": "43 dB",
        "Particle Retention Size": "0.30"
    },
    "discount_price": "$ 149.99",
    "normal_price": "$282.99",
    "about_this_item": [
        " SMART FILTER FOR BEDROOM: Our 4-in-1 filter system targets pollen, dust, pet dander, VOC’s, smoke, and odors - the H11 HEPA filter captures 99.9% of particles down to 0.3 microns. Our lightweight device is portable, allowing you to improve air quality wherever you need it. Our smart air quality sensor & touch-screen display makes the purifier easy to use & adjust your settings, & also shows air quality information.  ",
        " EXCEPTIONALLY SILENT: Designed for quiet operation, making it perfect for use in bedrooms and living rooms. The purifier's efficiency in capturing dust and particles - see just how much our air purifiers for home can assist and support the body’s natural response  ",
        " EASY TO USE & INSTALLATION: Built to easily identify, access, and change your filters - our purifier comes with multiple fan speed options, enabling you to set the pace of air filtration to suit your needs. Included is a remote to easily adjust the speed to your preference and turn the light on & off when needed - with the auto mode as well to facilitate real-time adjustments based on your room's air quality, & ITS QUIET!  ",
        " REMOVE ODORS, SMOKE, & VOC'S: Both an air cleaner & odor eliminator, our air purifier features a unique honeycomb activated-carbon filter that absorbs odors, smoke, and VOC’s. With a state-of-the-art fan and motor, enjoy clean air delivered quietly and efficiently in your home, bedroom, office, kitchen, basement, dorm, apartment, or living room.  ",
        " FEATURE: Before using the Ionizer/Anion feature, be sure to clear the room of humans and animals and wait 30 minutes after completing before reentry. This feature should be used in unoccupied spaces only. Using the ionizer in an occupied space can cause irritation and injury.  ",
        " FIND RELIEF: Our purifiers come with a 2-year warranty, award-winning customer support 7 days a week, and the peace of mind with a brand you can trust. You can also find our replacement filters to ensure you have fresh air all year around!  "
    ]
},
{
    "title": "Could not be happier with my Hathaspace",
    "rating": "5.0 out of 5 stars",
    "content": "Absolutely works to clean up the air quality in our 1600 sqft 3 bd 2 ba Florida home. It’s super quiet. So much so that you second guess if it’s still pushing air. I added a video with sound to give you an idea of how quiet it really is. With it on the low setting, air is still being driven at a good clip but you can’t hear it. If you stand above it the fan is blowing strong but it’s still silent. Medium speed you can hear air movement of sorts. On high you can hear it whispering low. So low that if your sitting on the couch next to it the sounds of the TV are never challenged. As for it creating better air quality, I can assure you it does. After the first 24 hours it was night and day in my home. Since turning this unit on 4 weeks back my nightly routine of allergy medication has gone to the wayside. All of our allergy eye issues along with mild respiratory issues are now gone. The air feels lighter and any of the Cat odors have left the building. I can’t stand the subtle odor of a cat and I’ve complained to the wife and kids for years about it since I’m rather over sensitive to smells of animals I’ve never wanted. But I can honestly say now with this Hathaspace Purifier when I return home after being gone all day the air smells and feels fresh. I’ve never been a fan of a home that hints of the smell of pets but the things you’ll live with to make your children happy. Right? Well now this machine has taken the hint of cat odor out of the equation.",
    "post_time": "Reviewed in the United States on February 18, 2021",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Visitors to our home have also purchased one of these and they love it. The instructions say to change filters every 4 months and the backup filters were only $30 so that’s not that much of an issue. I’ll probably switch out mine every 2 months since we have the cat. But that’s just me.",
    "post_time": "Reviewed in the United States on November 22, 2022",
    "pid": "B075ZZND8B"
},
{
    "title": "Hathaspace HSP001",
    "rating": "5.0 out of 5 stars",
    "content": "If your on the fence deciding which one to purchase I can assure you this one works awesomely and it was half the price. Like I said, we have 3 bd 2 bath one level Florida home and it cleans the air for our whole house perfectly.",
    "post_time": "Reviewed in the United States on July 25, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I do recommend for anyone with seasonal allergies that can get trapped inside the home or with anyone who has a pet they prefer not to notice through their nose and lungs.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Worth every cent and More!",
    "rating": "5.0 out of 5 stars",
    "content": "Just got this in a couple of days ago. I've been looking at air purifiers for several months and after the wife recently had a friend come clean the house, realized just how dusty our house had become.",
    "post_time": "Reviewed in the United States on January 18, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Living a few miles out of town in SW Oklahoma and it's WAY dustier than when we lived in town. So anyway, after the cleaning gig, decided it was time to get serious about choosing a purifier to try.",
    "post_time": "Reviewed in the United States on June 7, 2018",
    "pid": "B075ZZND8B"
},
{
    "title": "Works great. Well made. Easy to use. May be unable to remove odors.........",
    "rating": "5.0 out of 5 stars",
    "content": "Of course, there are literally HUNDREDS of them on the market so I've read many, many reviews. I kept coming back to 2 or 3 and then I noticed that Amazon had this one on sale at, what seemed to me, an affordable price.",
    "post_time": "Reviewed in the United States on May 31, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So, with the sale price, the features listed, and favorable reviews I pulled the trigger on this one.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Fresh Air Times Two: My HATHASPACE Smart Air Purifier Experience",
    "rating": "4.0 out of 5 stars",
    "content": "Took just a few minutes to load the filters and get it going.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It's a nice looking machine and seems to be built well. Nothing really flimsy feeling about it. The front is lock-hinged at the top and uses magnets to close at the bottom, so that's cool.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Works fantastic.",
    "rating": "5.0 out of 5 stars",
    "content": "A great unit that works fantastic. However I received my order 3 days late because of Amazons new policy that you have to give the driver a 6 digit code before he will deliver your products. If you want this without any delays, buy from another company.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Awesome product and price. 2 years and no issues. Runs good and strong",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Air purifier",
    "rating": "5.0 out of 5 stars",
    "content": "I have 3, 1 in each of the bedrooms in my house and I have the 1500 sqft model in the living room. I love these things.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the third Hathaspace air purifier I've bought. I bought one for our downstairs the HSE1500-1500 Sq. Ft. and I loved it so much, I ordered another one just like it for our upstairs. I had another brand air purifier in my bedroom but my asthma and allergies have been acting up, so I bought this one for my bedroom. I've had it for less than 24 hours but I can already tell, it's helping me breath better. I love these air purifiers!! I love how you can turn the lights off at night time too!!",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Best air purifier",
    "rating": "4.0 out of 5 stars",
    "content": "Very, very good and nice and quiet",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In small climate controlled Office/storage shed (10x20ish?)  Laser engraver location.  Really seems to have eliminated  the \"smokey\" smell.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Hathaspace makes the BEST Air Purifiers!!",
    "rating": "5.0 out of 5 stars",
    "content": "Got the extra filters at same time.",
    "post_time": "Reviewed in the United States on April 12, 2020",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Worth it in my opinion",
    "post_time": "Reviewed in the United States on March 21, 2022",
    "pid": "B075ZZND8B"
},
{
    "title": "Do you have a lot of filters to buy?",
    "rating": "2.0 out of 5 stars",
    "content": "r/",
    "post_time": "Reviewed in the United States on May 25, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I read some reviews on here that think the air quality sensor on this unit \"is a scam.\" I have one thing to say to those people, \"READ the manual.\" If you read the manual it says upfront that the unit cycles through red, yellow and green for the first several minutes and does so anytime you reboot (unplug) it.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Good Product",
    "rating": "4.0 out of 5 stars",
    "content": "Seens to do a good job, but I wish the buttons were on the top like my other one. The buttons are very hard to see to set controls.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I moved right next to a nature preserve in August of last year (it’s May now). What used to be Autumn seasonal allergies in North Texas has turned into year-round allergies from all of the trees/foliage nearby. I’m sure letting the dog on the bed isn’t a great idea with allergies, but he owns the apartment.",
    "post_time": "Reviewed in the United States on May 31, 2023",
    "pid": "B075ZZND8B"
},
{
    "title": "Brain fog and fatigue from ALLERGIES disappeared overnight!",
    "rating": "5.0 out of 5 stars",
    "content": "I went on a trip to NYC and breathed easy for the first time in several weeks. Twelve hours back in North Texas and the sinus drainage + brain fog + fatigue we’re back with a vengeance. I was discouraged and overwhelmed.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I decided to look up reviews on YT and this one fit the size of my apartment and had good reviews. I put it on high (just keep it permanently on high, don’t use the sensor), and the next morning my brain fog and fatigue were GONE. Some sniffles remained, but I didn’t care one bit because I could think straight for the first time in probably TEN WEEKS. Since then, the rest of my symptoms have eased up, but I can still get the sniffles and itchy if I go outside or leave the door open. However, it always dramatically improves by morning (doesn’t disappear completely).",
    "post_time": "Reviewed in the United States on May 16, 2020",
    "pid": "B075ZZND8B"
},
{
    "title": "Air cleaner",
    "rating": "5.0 out of 5 stars",
    "content": "I have sent the link to this filter to a few people already and I’ll continue to every chance I get. I didn’t expect much, but it really has dramatically altered my quality of life.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have a roughly 700 square feet apartment, so I bought the 700 square feet unit. I keep it by my bed near my head since allergies are at their worst in the mornings. I will eventually buy another one to put by my patio door so I can leave the door open without fear.",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Was skeptical, but months later (bought before covid), I'm still happily surprised",
    "rating": "4.0 out of 5 stars",
    "content": "Other things have have helped me:",
    "post_time": "Reviewed in the United States on June 26, 2021",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "-Wash hands and face when you come inside",
    "post_time": "Reviewed in the United States on February 25, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "They work!",
    "rating": "5.0 out of 5 stars",
    "content": "-Wash hair if you’ve been outside for extended periods of time",
    "post_time": "Reviewed in the United States on April 3, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "-Wash bedding frequently",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "So far, so good",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and very quiet. We live in a dusty, drought-ridden part of Texas with a dog that sheds constantly and considerably. I run the robot vacuum every other day and keep on the air purifier 24/7. At night I move it to the bedroom. I sleep much better and don’t suffer congestion like I used to. It also makes the house smell fresher. Highly recommend!",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Boy it's hard to find a decent Air Purifier. This one from Hathaspace I had never heard of before. I had never even heard of the Company.  I thought the price was a tad higher than I was hoping to pay and I was hesitant.",
    "post_time": "Reviewed in the United States on August 7, 2020",
    "pid": "B075ZZND8B"
},
{
    "title": "Wow, and I Mean Wow When I Say Wow",
    "rating": "5.0 out of 5 stars",
    "content": "Research, research, research I did, for a long time (hours). Turns out all air-purifiers end up with a few bad reviews but is one had so very few. A lot of them have a lot of horrible reviews. And I researched beyond Amazon for honest reviews. I could have spent $500 or more for a huge machine but I thought, No way Jose.",
    "post_time": "Reviewed in the United States on June 6, 2021",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I recently had a lot of dust (that's an understatement) through out my downstairs because of major construction and my husband and I (as well as the pets) were having breathing issues even though the construction company had sealed off our living space with plastic and zippers. During that period I ran to Target and bought a Honeywell Air-purifier and that baby worked it's heart out, making the house at least livable during the dirty part of construction. But it was just not enough.",
    "post_time": "Reviewed in the United States on April 23, 2023",
    "pid": "B075ZZND8B"
},
{
    "title": "Not what I expected, but BETTER!",
    "rating": "3.0 out of 5 stars",
    "content": "So I bit the bullet and bought this machine. I was so surprised how easy it was to set up and running after 5 minutes and then Red lines flared up on the screen. But I took a deep breath (pun intended) and waited a few hours for it to circulate the rooms and then it turned Green. It was doing it's job.",
    "post_time": "Reviewed in the United States on June 8, 2022",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Now when we come inside the house the air has never smelled so clean and fresh. I made the right choice.",
    "post_time": "Reviewed in the United States on August 20, 2021",
    "pid": "B075ZZND8B"
},
{
    "title": "Decent, but doesn't meet expectations",
    "rating": "5.0 out of 5 stars",
    "content": "P.S. If you wonder what happened to the Honeywell air-purifier, I cleaned her up and put her in a different room. And I am going to buy another Hathaspace air-purifier for our upstairs. Why not.... as far as I am concerned quality of life depends on clean water, clean air and clean food.",
    "post_time": "Reviewed in the United States on April 30, 2020",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "UPDATE: Now I have  2 of these machines on the bottom floor of the house. I live in Northern California with so much smoke from the wildfires around (and ash falling from the sky). Let me make it very clear, after being outside for a few minutes or after doing errands and returning inside, my house is actually a breath of fresh air! And that's with 2 humans, a dog and a long hair Siamese cat living under one roof.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Will review after using this for awhile.  Using this in smaller room.",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this last year when the pandemic was in full force(March 2020) and when the city fires were going crazy here in Los Angeles, CA. I needed to test out how good it really was. I saw the video and I was like really? I did read ppl's reviews, but I always like to decide for myself. Well, great news I haven't had to use my inhaler, I feel like I'm breathing normally.",
    "post_time": "Reviewed in the United States on November 19, 2023",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The machine itself is pretty strong, I use it mostly in my bedroom. I did use it once in our oversize kitchen, it definitely made the smell disappear fast from the burnt food that someone left. That part I mean strong is you can hear the power of the machine sucking up the smell and dust around the room really fast. It lights up, red(air not good), orange(it's cleaning the bad air out), and green(you are good to breathe fresh air). The only time you hear noise coming out of the machines is when it's cleaning out the air and dust, otherwise, it's really quiet you can't hear anything but the air on the back of the machine which you can feel the air coming out of. Funny story, I farted and the machine literally activated and suck out the bad smell in my room as it knows, haha I was really impressed! The remote is very small like a garage door opener and quite easy to deal with. I love the light button cause you can press it off and not see any lights from the machine. It is still working unless you decided to turn it off. I really don't use the other features like the timer, speed, anion, and sleep. Everything is kind of automatic and defaulted when you turn it on, it practically runs itself.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Asthma and allergy symptoms lessening!",
    "rating": "5.0 out of 5 stars",
    "content": "For starters I’ve had this little “friend” of mine going on two years. He runs all day everyday. He is still going strong as I write this. I would not have thought that this machine would only cost $150 be on at all times, still running strong and relieve my allergy and asthma symptoms. I started out in a studio apartment with shared central air. My neighbors were smokers and the first night I slept in my first apartment my nostrils were black and I couldn’t breathe. So I bought this. Immediately I noticed that when I woke up my sore throat was less noticeable. After only a week of running it, I checked the filters. Boy was I surprised how much dust and crap was floating in the air that was caught. It was like my nostrils times 10. So I used my vacuum to quickly get off the surface dust and kept him running. I always have the sleep mode on so I don’t have to bother with the lights, but I can always hear him with a very low white noise type sound. It actually helps me sleep. Now that I have moved to a bigger place with my own ac, and air I still have this little magic machine. He stays in my bedroom and I keep him closer to the air vents. Whenever I start to feel stuffy I know it’s time to change the filters. I usually will vacuum off the surface dust about every 6 weeks and replace the entire filter every 6 months. I know it should ideally be every 3 months but the filters aren’t cheap. I do love this machine. I even have a dog now and even the hair is trapped in the filter. Highly recommend! By far the best investment I’ve made. If you have allergies, asthma, pets, it’s well worth every penny. Im actually considering buying a second one for my living room.",
    "post_time": "Reviewed in the United States on August 22, 2021",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works great, solid product",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Solid product works great",
    "rating": "5.0 out of 5 stars",
    "content": "I bought two of these to help with the cat litter dust in my house and just regular dust. I love them. I actually replace the filters every 3 months compared to the recommended every 4 months. I find they work better that way. The noise level is very low. As to how it works for odor? That I don't know. I don't have any stinky stink going on in the house. :o) I can still burn scented candles and smell them. The filters do not remove that scent as the candles burn. Perhaps once the candles are extinguished the filters remove the scent faster? Either way, they did immediately clean the air and make it easier for me to breathe once I turned them on. So that right there is what I was looking for.",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Bought one of the SP001 units in September to possibly help with the wildfire smoke seeping into our home. The SP001 unit is fairly light and easy to handle to place it wherever you need it. The sound is somewhat elevated when on \"high,\" but it automatically cycles down after a while and becomes whisper quiet. Also, the ability to shut off the devices light display makes it great for sleeping. The instructions for the unit and remote are simple and easy to follow; and, the remote's features are very good for our homeowner needs.",
    "post_time": "Reviewed in the United States on November 21, 2020",
    "pid": "B075ZZND8B"
},
{
    "title": "Just what I was looking for.",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, great pricing, nice features, and easy to install (and reasonably priced) filter elements. For now, we have \"upgraded\" our filters to \"medical grade quality\" and are confident that our units are helping keep our home safer. We liked this unit enough to purchase a second one in early November to help increase the specific coverage areas in our home without having to move a single unit around every day",
    "post_time": "Reviewed in the United States on February 7, 2020",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My only issue has been with the complete lack of response to my emails to \"team hathaspace\". Following their printed information - Hathaspace.com/pages/warranty - merely provides text information. Any attempt to seek and provide user registration information simply routes back to the initial page - just goes around in a circle. No way to register my purchases, and no other options or windows that help. Have sent three emails (two in late September and one in mid-November seeking help), but no response to date.",
    "post_time": "Reviewed in the United States on January 10, 2022",
    "pid": "B075ZZND8B"
},
{
    "title": "Great Product But Silent Customer Service Assistance",
    "rating": "4.0 out of 5 stars",
    "content": "The units we have seem to be working just fine, and we are very happy with them, but so far, \"team hathaspace\" has not responded to any of our written requests for assistance. Yes, I could call (and wait in line for however long these days) to try to eventually reach a live person, but with all their enclosed and specific printed information and the onscreen pages, that should not be required. On this detail, I am not impressed.",
    "post_time": "Reviewed in the United States on December 12, 2022",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I never take the time to write products reviews, however this purifier is truly worth the time if it can help anyone! I have reccomended it to numerous people on a personal level! First off, I spent MONTHS reviewing air purifiers and kept ignoring my desire for one knowing how most make minimal difference or tend to not last. It came to a point that broke down and made the investment with high hopes that it would help my daughter's sinus allergies. I can not begin to tell you how guilty i felt for not buying this product sooner!!! Before saying what it has done for us, I want to mention that my daughter had a cough specifically at night from age 2 on (shes now 6) and also had that constant allergy that never went away. We had tried numerous natural methods as well as medicines and monitoring for a possible  specific illness or allergy and could never find a cure.  We had this unit running 2 days and she was clear!!! I kept waiting for it to come back. It had to be a fluke. Here we are just under 1yr later and she has yet to have the symptoms resurface aside from a couple inevitable minor colds. That in itself has sold me 100%",
    "post_time": "Reviewed in the United States on January 14, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Constant allergies and nightime cough are gone!!!",
    "rating": "4.0 out of 5 stars",
    "content": "Also to include, for those simply seeking cleaner air and want assurance of the quality of this product aside from how it helped my daughters health, i have been assured over and over with undenying proof! We are currently mid remodel of our home. Without much detail it's old, majorly outdated and is being renovated from a poorly maintained duplex. We've had mold, musty carpet under appliances, etc. Im for one very easily bothered by all of the above and this purifier has made the difference between me having painful, irritated lungs for a couple days after tearing into walls/flooring to completely symptom free. We have had an entire room clouded with drywall dust completely clear within 2 hours and the filters packed with the debri just to simply take them out, vaccum the debri, air them out and good to go again. I've had new filters on hand for over a month now and havnt had to replace them yet!",
    "post_time": "Reviewed in the United States on July 5, 2020",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have no doubt that you will not regret this purchase!!!",
    "post_time": "Reviewed in the United States on December 12, 2023",
    "pid": "B075ZZND8B"
},
{
    "title": "Works Wonderfully!!",
    "rating": "5.0 out of 5 stars",
    "content": "I live with 2 large dogs (1 that sheds constantly), 4 Siamese cats, 2 Cockatoos (that never stop producing powdery dander that flies everywhere) and other various companion animals that do not shed but produce their own odors.  To top it off, I am a chronic allergic asthmatic that tested extremely high to any animal with fur or feathers and was told numerous times by my doctor(s) to find homes for them.  I refuse!  Like many people know, animals are family and I will not live without them, no matter what!",
    "post_time": "Reviewed in the United States on October 14, 2022",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this unit last year and have been extremely happy with its ability to keep clean air quality levels - I don’t have the odors and the house smells clean and fresher than it ever has!  The dander issue is almost non-existent, just what lands on furniture/objects that are close to the bird cages which has been cut down substantially.  Also, I haven’t had an asthma attack in my home since, which was the main reason I purchased this unit!  I’m not saying everyone that share my symptoms will have the same results, but in my case this little machine has gone far and above any other air purifier I have tried.",
    "post_time": "Reviewed in the United States on June 30, 2023",
    "pid": "B075ZZND8B"
},
{
    "title": "HATHASPACE HSP001 - 3 Year Review (With 2 Dogs At Home)",
    "rating": "3.0 out of 5 stars",
    "content": "Hathaspace’s filters are super easy to replace and in my home they last 4-5 months with occasional light vacuuming.",
    "post_time": "Reviewed in the United States on June 4, 2022",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, I’d give a 6+ rating if it were available!  Love this air purifier and highly recommend it!",
    "post_time": "Reviewed in the United States on September 22, 2023",
    "pid": "B075ZZND8B"
},
{
    "title": "Possibly a scam?",
    "rating": "4.0 out of 5 stars",
    "content": "I've had this Hathaspace HATHASPACE Air Purifier HSP001 for 3 years as of May 2023. I've had zero problems with the unit and the air is so much noticeably fresher and cleaner. I have two small Pomeranian dogs and there's no dog smell.",
    "post_time": "Reviewed in the United States on March 10, 2022",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The cost has changed significantly from $165 in May 2020 to current. The filter cost has stayed consistent (around $40 per Replacement Filters - 1 Set), so that's a plus. They're not gouging customers on filters over a 3-year period.",
    "post_time": "Reviewed in the United States on July 9, 2022",
    "pid": "B075ZZND8B"
},
{
    "title": "Best air purifier",
    "rating": "3.0 out of 5 stars",
    "content": "In 2020, they recommended changing the filter set every 6 months. They now recommend every 4 months. I'm not sure it matters. But when it is time to replace you can see all of the gunk in the air that was trapped by the purifier.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It does what it is advertised to do, and I like the subtle white noise. It's not loud at all. This little powerhouse keeps you and your pets healthy for sure. I don't have anything bad to say about the unit. My friend has several through his house and raved about it, which is how I found out about Hathaspace.",
    "post_time": "Reviewed in the United States on December 8, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "If you value your respiratory health and clean air – this is a no brainer.",
    "post_time": "Reviewed in the United States on January 2, 2023",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I will totally admit that I know very little about air purifiers and did some brief research that led me to this one. So know most of this comes from a very subjective view point.",
    "post_time": "Reviewed in the United States on March 9, 2022",
    "pid": "B075ZZND8B"
},
{
    "title": "Update after having filters for at least 6 months",
    "rating": "5.0 out of 5 stars",
    "content": "This is an update to a previous review.  I tried 5 filters (the 4 others ones “top rated” in multi-filter comparisons, none of which even mentioned HathaSpace).  Coway mighty was the top in two of those review sites.  This filter is not a scam.  It does kick into the red zone every time your turn it back on, but later adjusts its intensity only if it detects bad air quality.  My husband and I had the same concerns, initially.",
    "post_time": "Reviewed in the United States on October 28, 2020",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I got these for home and my medical clinic.  I also got one Coway for home and one for my clinic.  When the two brands were placed side by side and exposed to Chlorox wipes, the HathaSpace hiked up to red and the Coway continued to indicate “clean air”.  In fact, I handle patient credit cards with tiny alcohol wipes so as not to have to wash the keyboard every time I take a payment.  I’m behind the checkout counter and I have the HathaSpace sitting higher up on the other side of the counter.  A few moments after pulling out the alcohol swab, the HathaSpace kicks into yellow/medium setting mode.  I’ve had two patients so impressed with this that they left intending to buy this filter for themselves.",
    "post_time": "Reviewed in the United States on March 10, 2022",
    "pid": "B075ZZND8B"
},
{
    "title": "Worth it",
    "rating": "5.0 out of 5 stars",
    "content": "Also, as I previously noted, my daughter’s room where she’s spending her entire life (it seems !) does not have the stale air smell /feel since keeping this filter in her room.  My daughter is also very sensitive to noise at night and this filter is quit quiet enough not to bother her.  Put it on night mode that turns the setting lights off, too, and you’re fooled into thinking the unit is off !",
    "post_time": "Reviewed in the United States on June 23, 2020",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "(I don’t use the remote, so can’t speak to that.)",
    "post_time": "Reviewed in the United States on August 26, 2023",
    "pid": "B075ZZND8B"
},
{
    "title": "Very effective air-purifier at an inexpensive price.",
    "rating": "5.0 out of 5 stars",
    "content": "Need I say more?...",
    "post_time": "Reviewed in the United States on October 13, 2021",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased a used model of this. It was to help out with the insurmountable dust build up we have on a daily basis as well as to control and eliminate the cigarette smoke that comes into our home. The item was slightly scratched when we got it, being used I still wanted to give it the chance. We plugged it in amd it got to work right away. The instructions were simple. Plug it in and press power and let it run on auto or choose your own settings. We let it run on auto. After about 30 min, the cigarette smoke issue was gone. I've given it a couple of days. Normally we have to dust on a daily basis and I havent had to do so in over a week. When I lay in bed, my allergies start kocking in amd that has been a non issue so far as well. Since we have plugged it in, I continue to hold my hand over the fan area to make sure it is on because I cannot believe how quiet it is. When we place it on the highest setting it still makes less noise than any of our tower fans on the low setting. I am so pleased and happy with the product and the immediate results. I will wait about 6 months and provide a more detailed review in the progress as well as photos of the filters.",
    "post_time": "Reviewed in the United States on February 2, 2022",
    "pid": "B075ZZND8B"
},
{
    "title": "Smaller filter works well",
    "rating": "5.0 out of 5 stars",
    "content": "The Hathaspace Air Purifier is very quiet at low speed and there is not much discernable noise at the highest speed.  The Air Purifier really works well and it does a great job of filtering the air in a 450 sq.ft room and making it feel fresher.  It has a built in sensor to detect air quality and change the speed of the fan, supported by a color indicator for the current quality of the air.  This Hathaspace Air-Purifier comes with an anion mode feature that works great and also appears that it cleans the room of gnats and other small flying bugs. There are versions, although no longer offered according to Hathaspace, that also come with a UVc feature. There is an \"Auto\" mode feature that works great and it adjusts the product function to filter the air as necessary which is evident by the change in the color indicator. The filters are easily obtainable and inexpensive.  The filters are easy to replace. Care should be taken to replace the filters as removed or as noted in the User Manual or there would be strange smells coming from the device. The design is pleasing to the eyes and makes for good room furniture.  The remote control is a plus and makes handling the controls very easy since the manual controls are on the side of the unit and are difficult to see and use. It will connect from across a 450 sq.ft  room. The \"sleep\" feature is great too and turns off all the LED lights and sets the product running at minimum noise.  Hathaspace's customer support is stellar.  Hathaspace's customer service does strive to make things right when there are discrepancies with the product.  This is a very efficient product that does what it is supposed to do at an inexpensive price and very competitive with higher priced products.",
    "post_time": "Reviewed in the United States on June 29, 2023",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought 2 of the smaller units exactly 3 years ago this month for about $160 each. I have always kept them both set to high, I don’t bother w/the auto setting. I change the filters every six months and could probably do it more often as they are always filthy! I clean often and only have one nonshedding dog, but this thing is still pulling tons of dust and crud out of the air. No strange noises or issues and filters are reasonable and easy to order. I’m considering buying more of the smaller units for my basement bc the bigger cylindrical one doesn’t seem to have good reviews.",
    "post_time": "Reviewed in the United States on April 17, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "This purifier has made a huge difference in our house!",
    "rating": "5.0 out of 5 stars",
    "content": "**We've had this purifier for a year and half and it is still doing great! I don't change the filters as often as I should, although I do clean them every few months. I still highly recommend this machine!**",
    "post_time": "Reviewed in the United States on April 8, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have a 3000 sq ft house where the living room is open to the second floor. In the afternoons, I would see large and small dust particles and pet hair floating around in the beams of sunlight. With three pets and a big house that doesn't get dusted like it should, it was a lot! Within a few days, the dust was visibly reduced to just the smallest particles showing in the sunbeams, and the reduced collection of dust on surfaces proves it works. It really does detect smells and kick on. The review talking about her kids \"testing\" it? Yup. Some reviewers complained about it running on high for 15 mins when it first turns on and then saying the air was clean. Yes, it does that, but it's supposed to. I think it's looking for any big issues and testing the air. If the quality is passable it will then switch to low. It doesn't mean your air is completely clean. It just means there is no massive bad smells to clean at that moment. Trust me, if someone uses our guest bath (next to where the unit sits) or when I'm cooking something stinky, it kicks on until the smell is gone. I'm very happy with this unit and would buy it again!",
    "post_time": "Reviewed in the United States on April 28, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Real questions & concerns",
    "rating": "4.0 out of 5 stars",
    "content": "I was confused about the air intake as it doesn’t feel like it pulls in as much air as it pushes out/up. I checked the filters and noticed zero cat hair. (my cat is a fatty)  my first thought was “is this thing pulling any of the air in the room into it? Or just pushing air out...”",
    "post_time": "Reviewed in the United States on May 9, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I still can’t decide and it’s exactly the same as it was when I first turned it on.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "I am so happy we got this",
    "rating": "5.0 out of 5 stars",
    "content": "The lights/modes - I noticed that It doesn’t stay at the high/full clean mode for longer than a few minutes.",
    "post_time": "Reviewed in the United States on August 22, 2018",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I don’t think it can clean an entire room in 5 minutes... so my presumption is that it has a 5 foot radius that it cleans and then turns off that mode bc the sensor doesn’t it pick up outside the perimeter of presumed 5 ft.",
    "post_time": "Reviewed in the United States on May 2, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Tested and one of the best purchases I have made",
    "rating": "5.0 out of 5 stars",
    "content": "The idea of clean air sells itself.",
    "post_time": "Reviewed in the United States on November 25, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "But how much of that is actuality?",
    "post_time": "Reviewed in the United States on February 9, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Regales with beautiful air and stylish attitude",
    "rating": "5.0 out of 5 stars",
    "content": "Since I can’t say I notice any difference, it’s hard for me to leave much of a review on effectivity.",
    "post_time": "Reviewed in the United States on November 28, 2023",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "(This is my first air purifier other than a Vick’s humidifier)",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Excellent product and exemplary customer service",
    "rating": "5.0 out of 5 stars",
    "content": "We plugged it in by our cats litter box in hopes that it would stay high lvl (bc how can it not pick up the scent that close) and to my surprise, it did the same thing and stopped running at red or yellow. It would get itself down to green yet I’m not sensing much change it air quality or smell.",
    "post_time": "Reviewed in the United States on September 8, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Another question is that for $170, how does this contrast from the hefty $600 + models?",
    "post_time": "Reviewed in the United States on February 23, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Working like what it seems to claim",
    "rating": "5.0 out of 5 stars",
    "content": "Only had this for probably 5 days. At first I thought the air sensor doesn’t seem to work. It seemEd to work from bad to good air within 5 minutes without variation when I moved it so I did an experiment. I opened our second floor sliding doors and wow, I guess the air outside is pretty bad because it took a looong time probably almost 20 minutes when I kept the door opened. It was 7-8 feet away from it. I live in Southern California and I have a backyard with plenty of greens on it. I still have to add more though. Anyway, even after I closed the doors, it worked pretty much a long time than before I opened it. About 12 minutes before it turned from red to green, which meant good air. I was beginning to smell kinda something awful from it so I decided to take the filters out and put it under the sun, 10 minutes on each side. When I put it back, red to green was less than 5 minutes. So I’m thinking the sunlight killed sine bacteria I hope.",
    "post_time": "Reviewed in the United States on September 3, 2020",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Am thinking of getting a new filter even if it was only less than a week because I don’t want to raise our electricity if it works too hard. Second, I was sick and definitely this one seemed to help. I Have asthma and was coughing for awhile and I don’t want my bacteria or any bacteria staying there in the filters. Placing it under the sun seems good but I’d still change it probably after 2weeks, will see.",
    "post_time": "Reviewed in the United States on September 6, 2018",
    "pid": "B075ZZND8B"
},
{
    "title": "SIMPLY AWESOME !!!",
    "rating": "4.0 out of 5 stars",
    "content": "The food odor don’t seem to go away that much but if it’s food I won’t worry. It’s more the bacteria that I’m worried about.",
    "post_time": "Reviewed in the United States on July 11, 2023",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What a well designed machine!  Folks, I've had asthma my entire life.  It is so severe that I have suffered a full respiratory arrest.  We really tested this machine's performance.  During the fires of 2018, ten western states were on fire.  My state was no acception, we had 11 here one which was up our nearby canyon.  For 15 years, I've used a high quality filtration system on my furnaces blower.  It has helped.  But it didn't take long to figure out it just wasn't enough from the heavy smoke.  The humidifier for my oxygen concentrator would become turbid with smoke particles in just days after replenishing the water.  I use two different inhalers for my asthma.  The first one is used for maintenance to help me from having an attack and the 2nd is an emergency inhaler.  The first inhaler does a great job, most times, and my emergency inhaler usually expires before it has any use.  During the fires of 2018, I was using my emergency inhaler each day.  And my chest felt like a very heavy person was standing on it, even turning up the oxygen by 50% didn't help much.  In desperation we had to find something which would bridge the gap.  After doing some research on what makes a great air purifier, this one fit the bill.  No sooner had we got this machine filtering the air, I noticed that on the second day of using this air purifier that the \"fat lady\" was getting off my chest.  Somewhere between day 3 or 4 the pain in my chest was gone.  We like it so much we purchased a second machine.  The replacement filters are low cost and very easy to change.  HIGHLY RECOMMEND!  If we could give this machine a 10 star rating we would.  SIMPLY AWESOME!!!",
    "post_time": "Reviewed in the United States on November 11, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Clean air again and dust free (almost) 😉",
    "rating": "4.0 out of 5 stars",
    "content": "Love the clean air after purchasing this. It’s very responsive to air changes. The only flaw I just noticed is if you have it close to the TV and I have 2 next to each other and you try to set the timer suddenly my fire tv turned on started scrolling to the right and my Vizio TV with PlayStation 5 on it the menu started moving to the right.",
    "post_time": "Reviewed in the United States on June 13, 2020",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You really have to change those frequencies ASAP",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Best air purifier I have used",
    "rating": "5.0 out of 5 stars",
    "content": "Other than that it’s almost perfect I only have it a couple weeks.",
    "post_time": "Reviewed in the United States on February 28, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "And yes I can set the timer on the purifier but that’s not why a remote is included right. 🤣",
    "post_time": "Reviewed in the United States on December 28, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Kinda Useless Air Quality Sensor",
    "rating": "5.0 out of 5 stars",
    "content": "My family members all suffer with allergies and I also suffer from sinus issues.  I initially started researching air filters for my 3 year old son’s room as his allergies keep him up coughing all night.  Makes it hard on the whole family.  I purchased a smaller air purifier for his room which is different from this one, but purchased this one for our living area (living room/dining/kitchen).  I am extremely happy with both.  This one is just simply amazing.  My husband was kind of “oh whatever” about getting this for the house.  Skeptical maybe???  Lol.  I got it in the late morning and placed it in our main living area.  My husband came home from work 6 hours later.  He initially just looked at the purifier, then carried on about his evening.  Of importance is the fact that we have 4 cats and one dog....the cats he is allergic to.  Usually he comes home and starts having problems with allergies right away, itchy watery eyes, sneezing, coughing, and excessive phlegm.  He looked at me and said, “call me crazy, but I think that thing actually works!”  I was so happy.  We have all but rid ourselves from our allergy symptoms with this purifier!  It is a life changer.  I will be purchasing 2 more when my budget allows.  One for our bedroom and one for our kids playroom downstairs.  The area I am treating in my house is about 700 sq ft and it does beautifully.  I move it to the others areas of the house and run it after cleaning to get all the stirred up crud out of the air.  So very pleased with this unit!",
    "post_time": "Reviewed in the United States on June 15, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "EDIT: Ok, so the air quality sensor isnt total BS. Though its not very good. I've noticed if I spray deodorant around the thing the quality measure doesn't change at all, yet for some reason if I spray a peppermint foot spray near it, it immediately jumps to red and kicks into high gear. So far this is the only thing I've seen that actually triggers a change.",
    "post_time": "Reviewed in the United States on March 8, 2021",
    "pid": "B075ZZND8B"
},
{
    "title": "My observation: From a chronic allergy, asthma and COPD sufferer",
    "rating": "5.0 out of 5 stars",
    "content": "REVISED MARCH 15, 2020 - I took a chance on this air purifier based on comments.  However, I never heard of the company.  Immediately upon receipt I plugged it in.  I too thought that it wasn’t doing much however 13 months later, I realize that have I spent significantly less time in Urgent Care and in my pulmonologist office. This unit relieves  my  chronic allergy, asthma, COPD symptoms and I know that it’s because of this unit.  I cough less, and sneeze less, and am less dependent on Albuterol.  When my husband burned something on the stove, the unit immediately kicked in and purified the air.  If you spray a fragrance, release gas, it detects it and the fans speed up and the air is purified.",
    "post_time": "Reviewed in the United States on February 10, 2019",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I find sensors are amazing in detecting air levels.",
    "post_time": "Reviewed in the United States on October 28, 2023",
    "pid": "B075ZZND8B"
},
{
    "title": "Smaller than I thought",
    "rating": "5.0 out of 5 stars",
    "content": "I keep it in my bedroom (except when Mr burns stuff) on a timer and am very pleased with the unit and the additional filters that I bought on Amazon for future use.  It’s important to change filters and a gentle wipe down the internal fan area between filter changes for optimal use.  I have such confidence in it, that I’m buying 2 additional units for my adult kids.",
    "post_time": "Reviewed in the United States on March 26, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Skeptics should note that a home based air purifier will not completely rid your home/apt of odors but will decrease some odors.  This unit is beneficial throughout the house.  Very lightweight that enables me to bring it downstairs for a few hours if needed or frying fish.  It’s set to Anon/Purify and does it’s thing.",
    "post_time": "Reviewed in the United States on February 27, 2022",
    "pid": "B075ZZND8B"
},
{
    "title": "So Quiet!",
    "rating": "5.0 out of 5 stars",
    "content": "Photo included:  unit with 6 month old HEPA  filter, next to a clean replacement filter.",
    "post_time": "Reviewed in the United States on March 7, 2020",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was surprised at how small this unit is. It appears to help a little. I have a few cats. Their hair and dander is everywhere. I vacuum frequently but still want fresh clean air in my home. I will give it more time. I do not thing this little thing covers 700 sq feet",
    "post_time": "Reviewed in the United States on July 25, 2022",
    "pid": "B075ZZND8B"
},
{
    "title": "Definitely NOT a scam. lol",
    "rating": "5.0 out of 5 stars",
    "content": "Overall this air purifier is great! Works very well. Note to seller, it should be packaged better. Box that it comes in doesn't hold up to shipping very well. Mine came falling apart, thankfully the unit was okay.",
    "post_time": "Reviewed in the United States on December 21, 2020",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This Purifier is well built, looks good is, quiet and so far works great. After running in for a while I re-entered the bedroom and did notice the air smelled fresher and felt less stuffy.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B075ZZND8B"
},
{
    "title": "These dudes kick some serious A!",
    "rating": "5.0 out of 5 stars",
    "content": "To respond to the negative review about it being a scam. I almost didn't buy it because of that negative review.  I'm glad I tried it for myself.",
    "post_time": "Reviewed in the United States on March 18, 2020",
    "pid": "B075ZZND8B"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The review said it was scam because after powering off and unplugging the unit while the air quality was on green (good) and then immediately plugging it back in and restarting it the air quality light was on red (bad). The reviewer was asking how could the air quality get so bad in one minute therefore calling it a scam.  What the reviewer failed to realize (and is clearly stated in the manual) is that whenever the unit is powered on it automatically starts off as red by default. After a few minutes it will \"read\" the air quality and adjust accordingly.  I think the reviewer should wait a few months and then check the filters see how much if any of the dust or particles the unit caught.",
    "post_time": "Reviewed in the United States on August 15, 2021",
    "pid": "B075ZZND8B"
}
]