[
{
    "name": " Can't Hurt Me: Master Your Mind and Defy the Odds ",
    "stars": [
        "86%",
        "10%",
        "3%",
        "1%",
        "1%"
    ],
    "pid": "B07KKP62FW",
    "ratings": "102,806 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "LOVE for self-help",
    "rating": "5.0 out of 5 stars",
    "content": "This helped me change my mindset. I am not someone who reads and thoroughly enjoyed this book. Have and will continue to recommend to any and every one!",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent quality 👌 👏 👍 🙌",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Excellent quality 👌 👏 👍",
    "rating": "5.0 out of 5 stars",
    "content": "\"You are in danger of living a life so comfortable and soft that you never realize your full potential\"",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book completely changed my mindset and outlook on life. If you take the message seriously it will change you for the better. Stay hard.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Absolute must read",
    "rating": "5.0 out of 5 stars",
    "content": "Why are you reading this? Go outside and run 30 miles today. Goggins did it, and his knees are messed up. Now, GO!",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Must read for everyone willing or wanting to change and toughen up. Well written, very relatable with simple steps to follow.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Who is going to carry the boats?",
    "rating": "5.0 out of 5 stars",
    "content": "Got this book for my son and I enjoy when he tells me what he’s learned from it.  We can do more than we think we can.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "WHOS GONNA CARRY THE LOGS.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "amazing",
    "rating": "5.0 out of 5 stars",
    "content": "Good Story the narrator kind of annoys me though.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "IF you have not yet made yourself familiar with David Goggins, you are really missing out. This man has a message which should not be missed.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "so inspiring!",
    "rating": "5.0 out of 5 stars",
    "content": "After a childhood that would have broken most, David turned his life around in ways that are unparalleled.  If you want inspiration and a wealth of insight on the human mind and human potential, this is the book for you.  Hard to put down.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book has helped me understand to branch beyond the standard. To be comfortable to push myself outside my comfort bubble. This book is a hard truth that many will hear but few will truly understand.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Astonishing",
    "rating": "5.0 out of 5 stars",
    "content": "Loved the book. Helped me to reinforce that we car phenomenal creatures with the ability to do whatever we put our minds to. This book gives you some of the tools you need to arm yourself in those battles. Ask yourself “ what if” and go get",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "it",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "What if",
    "rating": "5.0 out of 5 stars",
    "content": "Page turner",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy read. Was very entertaining as well. Inspiring story as well. Amazing how someone can put themselves through so much.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Very inspiring",
    "rating": "4.0 out of 5 stars",
    "content": "Love this book. Defined recommend is your trying to challenge yourself. This book will help you to take accountability for your actions and show you how anyone can do it. David Goggins is an inspiration.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good read it gives energy and desire not to stop. This book also shows everything can be done and ppl can change.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Quick entertaining read",
    "rating": "5.0 out of 5 stars",
    "content": "I really needed to read this. Was getting complacent and this book has reinvigorated me. Bought his next one. Look forward to reading that one too!",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My son is reading again! Also it was a great testimony to being able to achieve anything! No one can hold you back!",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "This book will make you go to war with yourself!",
    "rating": "5.0 out of 5 stars",
    "content": "I cannot say how much this book has inspired me to make changes in all aspects of my life. This has to be the single best motivational book",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Stay Hard! Merry Christmas! If you know anything about David Goggins, then you know what I’m talk about it. If not, then get ready to meet a man who could change your life.",
    "post_time": "Reviewed in the United States on January 2, 2019",
    "pid": "B07KKP62FW"
},
{
    "title": "Read This! An amazing story from an incredible guy who shows you how to start being your best self",
    "rating": "5.0 out of 5 stars",
    "content": "Can’t Hurt Me (364 pages) is the (living) autobiography of David Goggins – and he is having quite a life. But recounting his life accomplishments is not the principle subject of this book. Instead, David focuses on what he had to endure to achieve. From the book’s cover:",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "For David Goggins, childhood was a nightmare - poverty, prejudice, and physical abuse colored his days and haunted his nights. But through self-discipline, mental toughness, and hard work, Goggins transformed himself from a depressed, overweight young man with no future into a U.S. Armed Forces icon and one of the world's top endurance athletes. The only man in history to complete elite training as a Navy SEAL, Army Ranger, and Air Force Tactical Air Controller, he went on to set records in numerous endurance events, inspiring Outside magazine to name him The Fittest (Real) Man in America.  ",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "I understand now why David says to stay hard",
    "rating": "5.0 out of 5 stars",
    "content": "In Can't Hurt Me, he shares his astonishing life story and reveals that most of us tap into only 40% of our capabilities. Goggins calls this The 40% Rule, and his story illuminates a path that anyone can follow to push past pain, demolish fear, and reach their full potential.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Still not convinced you should this book? Go to YouTube and watch David Goggins.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Loved this book!",
    "rating": "5.0 out of 5 stars",
    "content": "He has appeared on several top rated YouTube channels and podcasts. If you like what you see, you will like this book. Can’t Hurt Me is a raw account of David’s life and the writing style is a seamless transition from the David you have seen in video.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "David is living proof that accomplishing big (or really any) goals is possible through hard work. Based on his background and early life, David should have been a statistic in his words. He grew up with an abusive father in a broken home in a community full of prejudice and poverty. But, you can’t hurt David Goggins. What I like about this book is not only the story of triumph, but also the path forward outlined for the reader. At the end of each chapter are mini-challenges that you can implement today to begin changing your situation and chasing your goals the way David did.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "What a Wonderful, Motivational Story",
    "rating": "5.0 out of 5 stars",
    "content": "For instance, the Accountability Mirror (#accountabilitymirror) is a tactic used by  David to set and achieve goals. It’s simple: Write your goal on a Post-It note, then put it on your bathroom mirror. Sounds easy, right? Try it; it works, especially if you have others in the house that use this mirror...",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Or, try the Cookie Jar (#cookiejar). The Cookie Jar is a physical reminder of how strong you are, especially when you feel weak or depressed. For me, I’m experimenting with an old cookie tin on my desk. As instructed, I'm filling the tin with slips of paper of major obstacles overcome in my life that can be later retrieved to serve as reminders of hardships already surmounted.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Transformational",
    "rating": "5.0 out of 5 stars",
    "content": "\"An eye-opener! This transformational book challenged my perceptions and spurred deep introspection. It illuminated my laziness, motivating me to embrace change and strive for more. A must-read for anyone seeking profound personal growth and a fresh perspective on life.\"",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have never in my life found so much motivation to better myself and “callous my mind” than after reading this book. The stories David tells are incredible demonstrations in how hard work really pays off, and I can’t wait to apply the challenges he offers on my life and the way I tackle shortcomings and obstacles. This book inspires you to be better.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Impressive",
    "rating": "5.0 out of 5 stars",
    "content": "My life kind of echoed his, in this book. I do not read self help books, but I bought this one, and now I watch his you tube videos. He is one of the realest Mf’rs you will hear about. Everyone can read this book and gain something from it. Everyone will interpret it differently. That’s how I know it’s a good book. I’ve started training my mind and thought process to motivate myself now. I cut a lot of dead weight from my life now. When my body says “ let’s do it in 30 minutes”. I get up and do it then not 30 minutes later. There are not many men who could go through 3 seperate hell weeks and keep pushing. I cannot begin to explain to you how much this man over came to get to where he was. I love this book, I’ve bought it for others, and I want you to watch his videos, and if your not ready to go get after it in life. Then stay on your couch. I’ve over came 3 back surgeries, broke all my fingers twice, i a have 3 compressed discs in my neck, I’ve fractured 3 ribs, broke my rotator cuff, my shin bone, I survived cancer and treatments, and soooooo much more. So yes I wake up sore, yes I’ve had to have fluid drained out of my knees, the metal and springs in my back on cold days hurt, I can’t make a fist sometimes from authorities , I have people working against me in life. But I wake up everyday by making my bed, taking my shower, spend a few minutes clearing my mind and then I start my routine of going to work at a warehouse where I lift boxes that can weigh up to 80lbs repeatedly , stacking pallets, and driving equipment. And I’m 45 yrs old. I am that guy that will work circles around you not because I want praise or managers attention, but because it makes me happy. Be blessed , snatch some souls",
    "post_time": "Reviewed in the United States on December 6, 2023",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My 16-year-old grandson loved this book. He is already an over achiever. Thanks for writing this",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Goggins mode and snatching souls",
    "rating": "5.0 out of 5 stars",
    "content": "https://amzn.to/3YH78X7",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Incredible example of someone spending their life conquering their mind and reaching the highest levels of potential.  What a journey!  Definitely admirable.",
    "post_time": "Reviewed in the United States on August 19, 2021",
    "pid": "B07KKP62FW"
},
{
    "title": "Motivational Awesome",
    "rating": "5.0 out of 5 stars",
    "content": "While the nature of Mr. Goggins' transformation & mental toughness manifested in his physical accomplishments, there is so much in this book that serves anyone looking to adapt and overcome. You can ALWAYS do more and do better for yourself. This book really helps shape your perspective if there is a part of you that is ready to stop complaining, be accountable and start actually living to your full potential. Your goal may not be to be a SEAL or an Ultra Marathoner, but knowing that you are the only thing in your way from a better life SHOULD make you uncomfortable and so should a lot of this book if that's true. I loved it!",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Edited on 8/21/21",
    "post_time": "Reviewed in the United States on December 31, 2023",
    "pid": "B07KKP62FW"
},
{
    "title": "Conquer your mind",
    "rating": "5.0 out of 5 stars",
    "content": "Have to add to my review. I had admittedly not read the reviews on here since I read the book at the request of my husband. These reviews are really disappointing, but not because this book and this story are any less inspirational to me. It's because these people with the negative reviews (and yes they were read with an objective mindset) missed the point. You go in to each reading experience hoping to gain something for YOURSELF. People should check their own ego before claiming to be open to learning from others' experiences. My husband, much like Mr. Goggins experienced a very abusive childhood. Reading the reviews - not to pre-judge too harshly myself - I don't believe people realized that the minds/brains of people that grow up in severely abusive environments do not develop as those of people who grew up in more conventional families and environments. There is still a huge stigma surrounding mental health. So the one thing I can encourage readers is don't expect to learn from a perfect \"role model\" with these lessons, do not expect a man that has endured as much as he did to be eager to open his life up to you regarding his marriages and children. The story he wished to share was HIS story and what he overcame through these hard lessons was HIS experience. While what we each draw from this is subjective, your mind, your heart and intentions should most definitely be objective. There is mention of the foul language and misogyny. This is a testament to the fact that people only accept a message being received from someone like YOU. This is the opposite of getting out of your own way to learn something. It's not for the faint of heart or someone looking for a watered down version of someone's struggles just so you can walk away with enough inspiration to go drive your kids to school and go for your morning run. What a person like David Goggins had to overcome BEFORE mastering his own mind is more difficult than what most people achieve in a lifetime of privilege and comfort. His journey and story demands respect at the least. At best he is a HUGE inspiration to people who didn't have a shot in hell of making it let alone having an exceptional or even \"normal life.\" The greater the pain the greater the gain.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bad things suck, but when used as fuel they can change everything about you. Goggins shows you the blueprint but it’s up to you to apply it and make it tangible",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Awesome",
    "rating": "5.0 out of 5 stars",
    "content": "Wonderful book. I really enjoyed reading about Goggins. He’s very inspirational.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just finished this book yesterday. Can’t wait to order his other book! It was awesome",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Awesome book!",
    "rating": "3.0 out of 5 stars",
    "content": "I bought Can’t Hurt Me after tuning into the Rich Roll podcast recently when David Goggins was a guest. I’d also heard him about a year ago so was already familiar with his story. As a 55 year old competitive female endurance athlete, I thought I might glean some useful tidbits and possibly some inspirational insights from the book. Although the in-depth description of Navy Seal training was interesting, and the book was well written, I have to say that for a guy who writes incessantly about feeling “stupid” and prejudiced against, he doesn’t do much to rise above (or lead by example) by lacing every page with non-stop profanity. I intensely disliked his various descriptions of female genitalia as a synonym for weakness. I get that it was Drill Sargent talk during Seal Training but Goggins defaults to it as self talk whenever he’s experiencing a low point in a race, and that’s on him. It’s actually disturbing that he can drum up adrenaline that way. In addition, while some of the points of this book are valid (as in how much time people waste on social media and watching television, yet complain that they don’t have time to exercise ), Goggins seems truly addicted to pain and suffering and doesn’t actually seem to be able to feel any other emotion. He is self-proclaimed “the badest mother-f*****” on the planet, and those words are repeated over and over throughout the book. Yawn. He perpetually overtrains with zero regard for how it’s affecting his body. No wonder he crashed and burned and trashed his adrenals. He’s lucky to be alive. This was more an autobiography of a tormented man who can’t feel happiness so seeks out endless pain to validate his existence, and is cheering the reader on to seek out the same. I understand the mental game of endurance but feel Goggins takes it to an extremely unhealthy level. You only get this one body.  If you unnecessarily destroy it, what then?",
    "post_time": "Reviewed in the United States on January 24, 2019",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "2023 edit: this book inspired Dad to embark on a health journey, today he looks and feels incredible. He is now enjoying Goggins' latest book. When I gave him the hardcover copy for Christmas, turns out he already had it, gave it to one of my brothers who looked forward to reading it. I then purchased copies for all my siblings so they would have one too.",
    "post_time": "Reviewed in the United States on December 22, 2019",
    "pid": "B07KKP62FW"
},
{
    "title": "Interesting story, Dangerous methodology",
    "rating": "5.0 out of 5 stars",
    "content": "I've since purchased Cant Hurt Me for several friends and family members, including giving a copy to a coworker before he was deployed so he would have something inspiring to read.",
    "post_time": "Reviewed in the United States on December 15, 2023",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I listen to my audio version from time to time and it has given me great insight to use in everyday life. The one quote that stuck with me is \"There can be a smile behind a snarl, and a snarl behind a smile.\" I find this very true when interacting with people and discovering their true intentions.",
    "post_time": "Reviewed in the United States on May 29, 2019",
    "pid": "B07KKP62FW"
},
{
    "title": "Life changing stories embedded in obscenity",
    "rating": "5.0 out of 5 stars",
    "content": "Spoiler alert: I mentioned to my primary Bikram yoga teacher a part at the end of this book, when Goggins' body mysteriously started shutting down; turns out all he had to do was practice yoga to decompress and increase circulation. She replied \"oh I love Goggins! I need to read that!\" She now often recites inspiring quotes from him while teaching class.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love Goggins' Youtube videos and need to read his newest book!",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Personal Review",
    "rating": "5.0 out of 5 stars",
    "content": "Original 2019 review:",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This review is written by a 32 year old female. Last year my whole world fell apart, and to cope I channeled my rage and fear into training for races. Ended up finishing a Spartan trifecta and full marathon. When my 60 something dad congratulated me, he mentioned he has always wanted to run a marathon, and I replied that it's never too late to start.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Kept my attention",
    "rating": "4.0 out of 5 stars",
    "content": "Great book, kept wanting me to read more. Thought this was going to be a different type of motivation book than what it was.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’d heard of David Goggins many times and I’d always considered his life and endurance to be incredible. Yet that was only through snippets of podcasts or tweets of his physical accomplishments. Reading his book was the first time I’d ever delved deeply into his story. Let me just say that reading it for myself took my impressions of him to a new high.",
    "post_time": "Reviewed in the United States on February 18, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "The Message Remains Powerful",
    "rating": "5.0 out of 5 stars",
    "content": "His story is tremendous yet his message (based on his lives experience) is simple: We’re all capable of so much more than we think. We only need to push past our own boundaries and limiting factors to achieve or goals.",
    "post_time": "Reviewed in the United States on May 22, 2020",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "He doesn’t set any of this out as pie-in-the-sky fluff but offers real steps on a path. It’s not an easy path, but it is an achievable one. Goggins made me a believer in his outlook.",
    "post_time": "Reviewed in the United States on February 22, 2020",
    "pid": "B07KKP62FW"
},
{
    "title": "Excellent Example of Fortitude!!",
    "rating": "4.0 out of 5 stars",
    "content": "As far as its quality as a book, I’d rate it as top notch. I started reading it on a Thursday night and stayed up way past my bedtime because of the quality story and writing. I was completely finished reading it two days later. So, even if you don’t agree with the message, know that you’re at least getting a real page turner.",
    "post_time": "Reviewed in the United States on September 27, 2023",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "An excellent story about an amazing individual!  I will not waste time summarizing this book - READ IT!!  David's life story is very impressive!!  A book to keep!  The important thing is ... WHAT will reading this book do for you?",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "A different kind of survival story",
    "rating": "5.0 out of 5 stars",
    "content": "David's story teaches a very strong lesson in fortitude that is applicable to ALL AGES (little kids to the elderly).  He's the \"real deal\" in demonstrating that the power of the mind can only be accessed and utilized when it has experienced hardship and suffering.  That means that we consistently miss out on becoming our best selves when we stay in \"the comfort zone\" all our lives and avoid difficult tasks. Thus, it makes complete sense to understand that taking the \"difficult and hard path\" (when we are at a crossroad where it would be easy to stay comfortable and avoid pain) lends access toward achieving things you never thought possible because you are afraid or too lazy.  He shows you that taking the hard path forces you to get at the core of who you are.  Facing challenges (however small they may be) creates mental callouses so that those \"difficult things\" become easier as you perfect the person that is YOU.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Repeatedly taking the more difficult path creates a feedback loop that allows you to excel and achieve more and more as you discover and unveil the \"best self\" that you can be.  David demonstrates this superbly by his life's work and the incredible challenges he faced.  He purposely seeks the harder path, and he does all this without an ego to pave the way.  He is out to impress no one but himself!!  He is true to himself before anything else, and his excellence in character shines.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Great source of motivation",
    "rating": "5.0 out of 5 stars",
    "content": "This book is trying to say that we ALL have that power, and reading it will undoubtedly cause you to stop and think about yourself and your life and how you can start now to become the best \"YOU\" that you can be.  It's great that after each chapter, David gives you clear guidelines toward achieving your excellence that he used on himself as he went through his transformation.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Oh, as for the \"cussing\" that some reviewers commented they didn't like in the book.  These people are MISSING THE POINT!!  David's cussing isn't excessive, and it's in total character with his life story and his EXTREME experiences.  Language is a way to express our emotions.  Cuss words exist as a way to express extreme feeling or emotion while it also increases tolerance to pain.  Such words elicit attention and reaction from the listener toward the speaker's feelings about something.  So do not ignore this great story about David and the lessons learned just because he uses cuss words - it will be your loss if you do.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "What's a calloused mind?",
    "rating": "5.0 out of 5 stars",
    "content": "I am still reading this book.  I like it so far.  The concept of mental toughness is not used.  Instead Mr. Goggins uses Mental Callouses.  I find it a better description.  Toughness is something you are.  It could be something you might not have worked very hard to get.  Callouses are something you have to actively develop.  He suggests a way to get there is thru getting physical callouses, i.e. exercising/working- hard.  After getting physical callouses, you can work on getting mental callouses and transform yourself past your 40% mental limit.",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had never heard of an ultra marathon before reading this book. This is a man who has set the standard high and showed what is possible! It shows how anybody can set the bar high in any field and any subject. I am sure that we can all learn something from this. Good job!",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "A Good Book Every American Should Read",
    "rating": "5.0 out of 5 stars",
    "content": "I mean, there’s already thousands of reviews lol. Now I can see why. I can’t remember the last time I finished a book so fast.",
    "post_time": "Reviewed in the United States on November 2, 2021",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I think the reason this book was so great to read is he goes into specific details but at same time. without adding in too much fluff. A lot of books, whether nonfiction or otherwise sometimes take awhile to get to a point. This book never does that.",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Wow, I never write reviews for books",
    "rating": "5.0 out of 5 stars",
    "content": "Even the ends at each chapter don’t come off as corny or forced in.",
    "post_time": "Reviewed in the United States on July 21, 2023",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Content wise? Wow, extremely inspiring, I ran cross country in high school so I do enjoy running longer distances, though I’ve never considered an Ironman or any ultra races. After reading this, I’m very interested in training for one of those races. I see several similarities between myself and Goggins. I know several reviewers didn’t like how he repeatedly mentioned suffering or talking intensely at one self. But I can relate to that mentality a bit. On tougher runs I get tough on myself, if I’m on a long run or bike ride and I’m feeling the pain and boredom, I got to give myself a kick in the ass. Reading how he used his own techniques in highly difficult situations was awe inspiring and fascinating to learn about.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Real raw material!",
    "rating": "5.0 out of 5 stars",
    "content": "It is a great read, I recommend it to anyone who wants to feel more fulfilled.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I will say in terms of the vulgar language, maybe because I’m used to, comfortable with it in my own life etc, but I was expecting much more vulgar language based off of what reviews said. How someone perceives vulgar language though is relative though.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "A book that will inspire generations to come",
    "rating": "5.0 out of 5 stars",
    "content": "There are a couple times, and literally only a couple, where he uses a woman’s reproductive anatomy as an analogy to feeling weak etc. I can see why that was criticized but other than those rare examples of choice words, (I think twice in the book) it’s a well written story of perseverance and survival.",
    "post_time": "Reviewed in the United States on June 25, 2023",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One of the best books I’ve ever read without question.",
    "post_time": "Reviewed in the United States on January 15, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Good Audio Book with additional commentary.",
    "rating": "5.0 out of 5 stars",
    "content": "It’s David Goggins, it’s a little rough around the edges but he makes several great points throughout the book and has challenges after each chapter that build upon each other as you go through the book. It’s very well done.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What can I say, \"Can't Hurt Me\" (CHM) is by far a must read for anyone, young/old, any creed, race or gender. I wouldn't be surprised if the Library of Congress considers and selects this book as part of its catalog preserving it for the rest of time.",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Man, I hope DG doesn't read Amazon reviews",
    "rating": "4.0 out of 5 stars",
    "content": "The book itself is narrative which allows the author to take us on journey and get a glimpse of someone who made choice, then another choice and another and so on. It's am incredible read that I am fortunate enough to be living in a time, where I can read David Goggins account of his life and what choices he could have made never knowing their outcome.",
    "post_time": "Reviewed in the United States on January 24, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Highly recommend.  I have purchased copies for friends who are those crossroads, followed up with them to hear their thoughts and we can all agree, CHM is a must read for all.",
    "post_time": "Reviewed in the United States on June 5, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Excellent read",
    "rating": "5.0 out of 5 stars",
    "content": "I am a David Goggins fan from YouTube who knew after a few views that I needed to know what he's all about. This book was a fantastic peek into his mind. I have been able to use some of the techniques he teaches to get back into an active, more focused life. I took one star because although it was necessary in some ways, there were small sections of the book I found myself skimming through some of the military talk. I'm thankful and proud it was just a few times beyond my military knowledge. I def recommend reading if you need a push forward.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If youre looking for a book to motivate you, this is it.",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "It written well and a great intro to his second book.",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great for personal growth and development",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "B07KKP62FW"
},
{
    "title": "Maximize your capabilities",
    "rating": "4.0 out of 5 stars",
    "content": "My son is a leader in kansas prison as an inmate and started a teaching with certain people that is open to 4 different life changing books. He chose yours as one of them and wow it is flowing around the prison and making a difference. He is also a song writer and performer and writer and we are working on prison ministry and helping people from the inside/out. Meaning family on the outside and a way to help even some of the guards look at life a different way. This is transforming people out of the darkness into the light. So thank you so much for your books as I think he wants me to order some other ones by you. God bless you so much and continue to write...",
    "post_time": "Reviewed in the United States on May 16, 2022",
    "pid": "B07KKP62FW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "David Goggins has become my hero. It felt like yet another book about \"successful success\" in the beginning but as I was reading, David's story was getting deeper and deeper into my heart. His story, with all the rises falls, is a perfect example of how far a person can get despite any obstacles in life. I highly recommend this book to everyone who looks for answers to questions \"Why?\" and \"What if?\".",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B07KKP62FW"
}
]