[
{
    "name": " Take Control of Your Life: How to Silence Fear and Win the Mental Game ",
    "stars": [
        "80%",
        "8%",
        "3%",
        "1%",
        "7%"
    ],
    "pid": "B07LFKZQGZ",
    "ratings": "233 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "Great audible",
    "rating": "5.0 out of 5 stars",
    "content": "Great listen",
    "post_time": "Reviewed in the United States on April 17, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "DON'T  BUY THIS ITEM.  I  received this CD and it was blank.  I don't  have the packaging  to return item.  This was a waste of money.",
    "post_time": "Reviewed in the United States on January 13, 2020",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Waste of money",
    "rating": "1.0 out of 5 stars",
    "content": "Very repetitive and drawn out. Not helpful for me at all.",
    "post_time": "Reviewed in the United States on May 24, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the best self help book I have ever listened to. Mel breaks it down and hands it to you in a way that a 3rd grader can understand it.",
    "post_time": "Reviewed in the United States on February 8, 2024",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Not helpful for me",
    "rating": "1.0 out of 5 stars",
    "content": "I was truly shocked by the amount of misinformation presented by Mel. She is constantly stating fear begins in the body. This is completely false. I took time to try to find anything corroborating her claims, but everything I found was clear that fear begins in the brain, specifically the amygdala. After registering something that it feels may be dangerous, it sends a fear signal to your body. The fear is then analyzed by other areas of the brain to decide if the fear response is necessary. I had hoped that Mel was just stating her point poorly, but that just isn't the case. She flat out tells one of the clients that she's \"coaching\" that fear isn't an intellectual problem, it's a physical problem. I honestly don't know how she could come to that conclusion. She repeatedly states that fear lives in the body, and that the body remembers fear from childhood. She bases this on what seems to be her misunderstanding of a study where people showed a physical response to a situation before they were consciously aware of it. What the study showed was that your subconscious mind is aware of threats and danger long before your conscious mind is. But Mel concluded that it meant your body is aware of threats and danger before your brain is.",
    "post_time": "Reviewed in the United States on April 8, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Now, about her \"coaching.\" I doubt what she's doing would be acceptable by the International Coach Federation (ICF) as good coaching practice. She spends as much, if not more, time the clients speaking. She barely gets into their problems before she starts talking about her own similar problems, and then proceeds to tell them what they're REALLY feeling and thinking. One of her clients, the hoarder, was tell her what she felt her problems were and Mel would cut her off and tell her it was something else. Specifically, she felt she was a control freak, and Mel told her she was wrong. However, in the recap portion that takes place during the book recording Mel agrees that she was a control freak, but cuts out the portion where she told her she was wrong. Mel basically bullied this same client into cleaning out her house. When the client was resistant, she went so far as to get the client's boyfriend on the phone and they both pressured her into it. They really didn't take any time to get to the core of the issues that lead her to hoarding or really dealing with those issues. And that seemed to be the case for all of the clients. Mel really didn't dig down deeper into the real issues. She developed her own conclusions from the start and told them what to do, without giving them a chance to come up with their own conclusions and solutions. This is getting wordy already, but I could really write several paragraphs on each of the coaching sessions about the poor quality of coaching that was provided.",
    "post_time": "Reviewed in the United States on September 14, 2020",
    "pid": "B07LFKZQGZ"
},
{
    "title": "learning so much from Mel and she is just cool",
    "rating": "5.0 out of 5 stars",
    "content": "I was severely disappointed. I respect and admire Mel Robbins. I buy her products, I'm on her email list, I watch her shows and livestreams, & I've read her books. I expected much better from her. I feel that going forward I'll have to take everything she says with a grain of salt until I can verify it for myself.",
    "post_time": "Reviewed in the United States on March 29, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Misinformation Galore & Terrible \"Coaching\"",
    "rating": "4.0 out of 5 stars",
    "content": "It's worth a listen if you're wanting to take control of your life more. Helpful tips and ways of looking at dysfunctions and (learned) character traits. But be aware that the people interviewed reveal perfectly within their 5-minute self descriptions what their core issues may be. And Robbins, who is not a doctor nor licensed therapist, based on limited 'patient' information is able to immediately diagnose issues and root causes and solutions.  In real life, people aren't so self aware, self descriptive, so easily revealing,  nor can an analyst or therapist conclude  within just minutes what is going on and what should be done.  So,  real self examination and professional therapy will take more time, more effort.  Robbins has compacted it all into pithy profiles, it feels a little manipulated and packaged.  Still, the presentations can be illustrative and helpful to many.",
    "post_time": "Reviewed in the United States on June 7, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Helpful, but Robbins' quickie psychoanalysis is bit deceptive",
    "rating": "4.0 out of 5 stars",
    "content": "I RARELY ever review on Amazon, but this was necessary.",
    "post_time": "Reviewed in the United States on November 6, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Game Changer! ⭐",
    "rating": "5.0 out of 5 stars",
    "content": "Searching through Audible for the next best listen is like finding the Chamber of Secrets. You either wind up back in the toilet with Moaning Myrtle, or you find the next Horcrux needed to defeat the Dark Lord, in this case the Dark Lord being boredom.",
    "post_time": "Reviewed in the United States on February 28, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Helpful in Some Ways - But How About People With Real Problems",
    "rating": "3.0 out of 5 stars",
    "content": "I found some value in this audio book. I find Mel Robbins to be a very compelling thinker, and I like her no BS way of presenting her ideas. I had high hopes for this book. I actually preferred the content that was not part of the coaching sessions, because the first-world problems of the first two clients was a turn-off. I didn't make it to the third. For people looking for real help in getting control of their lives, the first two clients who have pretty nice lives but are questioning if they will ever do enough because a parent was grouchy and made them get As on their report card, is not terribly useful unless you're 25 with an advanced degree and watching Eat, Pray, Love left you more confused than ever.  Would love to see Mel Robbins do this again with real problems. People who have perhaps lost everything and starting over. Or people over 50. Or self-made people. So many great ideas in here, but just felt like her target audience was 30 year old upper middle class conflicted yoga moms.",
    "post_time": "Reviewed in the United States on February 4, 2021",
    "pid": "B07LFKZQGZ"
},
{
    "title": "If you have trauma/PTSD - this is a must listen!",
    "rating": "5.0 out of 5 stars",
    "content": "I honestly can’t fathom the one star reviews here. How insulting. This book was a tremendous inspiration to me. I related so intimately to each of the characters and I could’ve immediately started this book over as quickly as I finished it. I found so much truth and knowledge here! I absolutely adored this work and the stories of those involved and it truly connected some of the dots in my life that I had been feeling gaps in for so long. I’ve listened to all the big self help books but this work by Mel Robbins really bridged the gap for me!! Highly, highly recommend.",
    "post_time": "Reviewed in the United States on July 7, 2020",
    "pid": "B07LFKZQGZ"
},
{
    "title": "One of the best books I have read in a long time",
    "rating": "5.0 out of 5 stars",
    "content": "Y’all 1 star reviewers really need to take a good hard look at yourselves — walking away from this book without a single positive thing to say or claiming not to have any positive knowledge gained has everything to do with YOU..... check your ego.",
    "post_time": "Reviewed in the United States on February 10, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Really useful despite the naysayers and closed minded",
    "rating": "5.0 out of 5 stars",
    "content": "Mel really nailed it with this book. She provides practical, actionable insights about how to identify limiting fears and quickly overcome them. I really enjoyed listening to Heather's session, in particular, in which Mel coached her through her struggles with perfectionism. The main takeaway was that what we really fear is losing our sense of control. The way to regain our control is to identify how fear presents itself in our bodies and then respond in a more empowered way. 5 stars! I also really like the fact that Mel provides an accompanying workbook to keep her readers accountable. Too many self-help books say the same things, and the advice isn't really actionable. This book is totally different and is one of the best books of any category I have read in a long time.",
    "post_time": "Reviewed in the United States on July 29, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Fantastic book with great insight",
    "rating": "5.0 out of 5 stars",
    "content": "I started this book on my 90 minute drive home and found it so easy to listen to relative to some information dense books that I had myself believing that I got all there was to get out of it and could potentially even stop listening. However I kept going and it never ceased impressing me. I noted some things that she said that weren't 100% accurate but they did still succeed in steering you towards valid and useful concepts.",
    "post_time": "Reviewed in the United States on September 8, 2021",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Yes! Great stuff here",
    "rating": "5.0 out of 5 stars",
    "content": "I've seen another review in here that waxed hypercritical on such inaccuracies and saw fit to judge the how magnificent effort as a 1 star failure. I would encourage you to keep an open mind and take as much as is useful away from it as you can before you start judging and labeling the whole with attributes of 2 immaterial mistakes.",
    "post_time": "Reviewed in the United States on March 18, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Mel is transparent, open, and such an inspiration.",
    "rating": "5.0 out of 5 stars",
    "content": "I am benefiting from this a lot and am extremely happy and grateful for those benefits.",
    "post_time": "Reviewed in the United States on February 20, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Essential Life Advice",
    "rating": "5.0 out of 5 stars",
    "content": "I try not to give 5 stars where they aren't deserved lest my 5 star reviews lose their meaning however here they are completely deserved.",
    "post_time": "Reviewed in the United States on March 2, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Better than therapy!",
    "rating": "5.0 out of 5 stars",
    "content": "This book is helping me a ton. I'd say life changing but I wasn't in a bad way before it started helping me get even better.",
    "post_time": "Reviewed in the United States on July 10, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Totally Useful",
    "rating": "5.0 out of 5 stars",
    "content": "This book is different than other personal development books. Mrs. Robbins interviews people with different situations and dilemmas. At first, I really did not want to hear them talk to be honest. However, it is a genius move. If you really want to take control of your life, read this. She is unhurried in her analysis and approach.",
    "post_time": "Reviewed in the United States on February 21, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Voyeuristic at Best",
    "rating": "3.0 out of 5 stars",
    "content": "I kept reading reviews that referred to this recording as a book. It’s not a book. It’s a series of somewhat interesting interviews/coaching sessions. That should be made more clear to the customer.",
    "post_time": "Reviewed in the United States on June 30, 2020",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Such a beneficial book",
    "rating": "5.0 out of 5 stars",
    "content": "A surface treatment of some research but not much depth into whether those studies were replicated. Sounds like an enthusiastic first year psyc major.",
    "post_time": "Reviewed in the United States on April 2, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Too much awkward crying/sniffles but great book",
    "rating": "5.0 out of 5 stars",
    "content": "I liked it for the peek into others’ experiences and a few nuggets of wisdom from Ms Robbins, but in the end it was just listening in on personal sharing that felt a little voyeuristic eventually.",
    "post_time": "Reviewed in the United States on April 26, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "A most listen audible.",
    "rating": "5.0 out of 5 stars",
    "content": "I will preface this by saying that I love Mel Robbins. I happened upon her TedTalk about 6 months ago and watched it about once every other day until she started doing Coffee Talks on IG. I scoured for podcasts and videos with her and was dismayed that most were based on the 5 Second Rule (which doesn't work for me). I was thrilled when she had the MindSet Reset course at the beginning of the year and even more thrilled when this audible original became available shortly after that was over. I love this. Even when I can't relate to the stories or the people's problems there is still some lesson in there that I take with me.",
    "post_time": "Reviewed in the United States on March 31, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Decent book.  I prefer the audio version of her books",
    "rating": "3.0 out of 5 stars",
    "content": "Mel Robbins is definitely my spirit guide through life and I am glad she is branching out past the 5 Second Rule and I can't wait to watch the talk show.",
    "post_time": "Reviewed in the United States on October 16, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Wow!",
    "rating": "5.0 out of 5 stars",
    "content": "I'm still listening to this audiobook... I am giving 5 stars because I love Mel Robbins and I refuse to give her anything less than 5 stars. But I will admit this audiobook is hard to listen to mainly because the coaching sessions involve a lot of emotional crying and sniffles which makes it awkward to listen to when I'm driving to work. This audiobook is helpful and Mel offers amazing insight and tips but I will admit I could have done WITHOUT feeling like I was listening in on someone's private therapy session. I'm glad I listened to the coaching sessions because afterwards Mel reflects on important parts, replays them and gives her amazing invaluable insight/advice. This book is helping me reflect on a lot of things but I can only listen to so much of it every day due to the above mentioned issues.",
    "post_time": "Reviewed in the United States on March 16, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "These coaching sessions are phenomenal!",
    "rating": "5.0 out of 5 stars",
    "content": "I love this book because there are lessons that can be applied to anybody's life. Mel did a great job unpacking the fears of the participants and giving then professional advices. I like the participants updates and how the experience helped them.",
    "post_time": "Reviewed in the United States on February 11, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Mel Robbins = Crazy awesome",
    "rating": "5.0 out of 5 stars",
    "content": "P.S if you are looking for a book with deep psychological research and study, this might not be for you. There so many negative reviews because people have the wrong expectations. Mel is a life coach not a psychologist. So, from the life coach prospective it's an amazing book. If you have psychological issues, you need to get professional help as she advised",
    "post_time": "Reviewed in the United States on October 24, 2022",
    "pid": "B07LFKZQGZ"
},
{
    "title": "It’s a great book for everyone $ I will definitely listen to it again and again",
    "rating": "5.0 out of 5 stars",
    "content": "I'm a big fan, actually went to the 4th taping of her TV show.  If you read the 5 Second Rule - then you are familiar with Mel's style.  I prefer the audio version because her delivery is so down to earth & she is an excellent speaker.  I wish I was thrilled enough to give this 5 stars BUT although I found the interviews interesting , the \"TAKE AWAYS\" each of the many interviews wee just annoyingly TOO long and by the 3rd one, I was skipping over it.  I really didn't want to recap anymore of the interview.  My opinion is that her discussion with the client during the interview was sufficient rather than have to listen to repeats of some segments of the interviews .  I think much more editing would have been very appropriate for this book.",
    "post_time": "Reviewed in the United States on March 5, 2020",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Listening to this Audible and taking action step by step Moment by moment can be life-changing!",
    "rating": "5.0 out of 5 stars",
    "content": "Once again- Mel Robbins nails it! This is such a great 10 hours of loaded information to literally Take Control of You!! There is so much info- and so many ways to listen to it- and do the workbook with it while you are listening or after done listening. I will have this repeating for a while- as it triggered so many things I wasn't even aware of! This by far is one of the best personal growth tools I have had in a long time. ( And I do A Lot of personal growth programs-Lol) Thank you Mel! So grateful for you!",
    "post_time": "Reviewed in the United States on March 2, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "In the therapy session the author therapist uses the F word constantly",
    "rating": "1.0 out of 5 stars",
    "content": "I am so disappointed! When you buy a book that is supposed to help you emotionally, you want to believe that the therapist is professional. Using the F word And other cuss words in therapy sessions did not provoke that idea for me. I didn’t even make it past the first therapy session with one of her clients. She is turning off a general portion of the population that does not want to hear a professional therapist use the F word. Therefore, she is not reaching all her audience she could! So unprofessional and disappointing",
    "post_time": "Reviewed in the United States on May 28, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Loved This Book",
    "rating": "5.0 out of 5 stars",
    "content": "I really liked listening to the interviews and gained some insight from each one. The last one I found myself crying (and I don't cry) about what the woman had gone through. It made me wonder why I was so moved. Now I am going through the book again with the workbook this time to gain more insights. A must read. If you are offended by harsh language don't listen. I can overlook the language.",
    "post_time": "Reviewed in the United States on March 7, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "A MUST LISTEN!!",
    "rating": "5.0 out of 5 stars",
    "content": "This audio will revolutionize your thinking. I could relate to each person she was speaking with.  Just when I thought I knew what it was, she would would hit me with another session that spoke to me.  I didn't know what to expect, but it was far more than anything I could have imagined and it was just what I needed.",
    "post_time": "Reviewed in the United States on February 21, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "This Book Is Going to CHANGE LIVES!",
    "rating": "5.0 out of 5 stars",
    "content": "I am only half way through and it's already changing my life. I can relate to every coaching session on some level. It has caused me to have an \"ah-ha\" moment about where my anxiety stems from, why I have reacted how I do to different situations in my life, etc. If you are thinking of getting this book DO IT! It will change your life!",
    "post_time": "Reviewed in the United States on February 19, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Life Changing",
    "rating": "5.0 out of 5 stars",
    "content": "I don't know how you could listen to this and not be moved in your life. This book has been so refreshing and life changing for me. I had to stop and re-listen so many times because there are incredibly truths throughout that just resonated with me. Please, please listen to this book and start taking ownership of your life. Mel is real, thought provoking and sharp. Her research is on-point and her delivery is so enjoyable. Thank you for this, Mel.",
    "post_time": "Reviewed in the United States on March 30, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Here’s the place to start on the road to personal development",
    "rating": "5.0 out of 5 stars",
    "content": "I love her no nonsense approach to our excuses to growing.",
    "post_time": "Reviewed in the United States on March 15, 2021",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Life Changing...",
    "rating": "5.0 out of 5 stars",
    "content": "Enough said.  This book changed my life, the way I process situations, and the way I understand my reactions. Mel Robbins has an incredible way of speaking truth while remaining likable.  The content of this book is very insightful and doesn't feel like \"another self-help book\".  I'm excited to listen to another and know that I will revisit this book from time to time.",
    "post_time": "Reviewed in the United States on October 16, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "Great book! Highly recommend.",
    "post_time": "Reviewed in the United States on May 9, 2021",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Mel Robbins Knows How to Hit the Nail on the Head!",
    "rating": "5.0 out of 5 stars",
    "content": "I LOVE listening to Mel Robbins and her coaching. She really knows how to get to the heart of the issues and then go right in and guide the individuals on what they need to do or what the next steps are for the. And she does all this while being direct and kind at the same time. Listening to other's issues always strikes a cord and all the coaching sessions can be applied to all our lives! Thanks Mel!",
    "post_time": "Reviewed in the United States on April 2, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Fellow Michigander",
    "rating": "5.0 out of 5 stars",
    "content": "Mel is amazing. She gives the best life advice ever.  All of the sessions on here were relate-able almost like she did this just for me. I stumbled across this Audible at a time I needed it. Thanks Mel for being awesome! Getting ready to listen again in 5-4-3-2-1!",
    "post_time": "Reviewed in the United States on February 26, 2020",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Still reading, very good book",
    "rating": "5.0 out of 5 stars",
    "content": "Great book",
    "post_time": "Reviewed in the United States on May 7, 2021",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Fantastic resource for those who want real change.",
    "rating": "5.0 out of 5 stars",
    "content": "I really enjoyed this audio book.  It’s different from most personal development books, in that you get to listen to Mel coach people, hear their individual stories, and receive some practical tools for how to overcome personal struggles/triggers.  She talks a lot about the importance of indentifying where you feel emotions in your body.  Mel totally gets it and I just love how honest and relatable she is.  So well done.",
    "post_time": "Reviewed in the United States on June 25, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "I'd give 6 stars if I could",
    "rating": "5.0 out of 5 stars",
    "content": "This is a terrific audio book.  I love Mel's straightforward, down to earth, practical advice.  She breaks things down into bite sized pieces and actions to take to break self-destructive or defeating habits.  She has such great insights.  I will listen to this again because I really want to absorb every last bit of wisdom she shares in these coaching sessions.",
    "post_time": "Reviewed in the United States on September 20, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Game Changer",
    "rating": "5.0 out of 5 stars",
    "content": "So many inspiring and actionable take aways in this book! Mel's quotes and encouragement come to mind each day as I am entering this new phase of my life. I love that Mel reads her book. I feel like she is talking to directly to me. I am now listening a second time as I focus on the FREE workbook! This experience is a game-changer for me! Thanks Mel!",
    "post_time": "Reviewed in the United States on March 17, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "I strongly recommend it to everyone",
    "rating": "5.0 out of 5 stars",
    "content": "Loved it! I've completed many personal development courses over the years and I've read countless of books... I would have to say that this was one of the best I've ever experienced. Very insightful and relatable. I'm definitely going to do the workbook as well, and if I could go through live session with Mel herself, I would do it. It would interesting to see the outcome.",
    "post_time": "Reviewed in the United States on March 18, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Mel does it again!",
    "rating": "5.0 out of 5 stars",
    "content": "In this 6 person, 10+ hour series, Mel takes the time to dive in to each participant's story and help them unpack why they are stuck and what their fear is.  The thing is, I found a piece of myself in EACH story.  I was able to make sense of some limiting beliefs and gain tools and knowledge to push myself forward in order to get closer to living my best life!",
    "post_time": "Reviewed in the United States on March 11, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Life changer!!",
    "rating": "5.0 out of 5 stars",
    "content": "I can't say enough good stuff about this! Mel has a great voice that keeps you listening. I loved each coaching session. I enjoyed being able to see how Mel's methods work in a practical sense. She is able to show you and not just tell you. I took lots of notes and downloaded the free workbook too.",
    "post_time": "Reviewed in the United States on October 1, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "I am now obsessed with Mel",
    "rating": "5.0 out of 5 stars",
    "content": "I love her advice and since this book, I have made it a point to buy them all and listen to her matter-of-fact advice. I love the case studies and could listen to her helping others for hours.",
    "post_time": "Reviewed in the United States on March 1, 2020",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Best book for your self help tool box",
    "rating": "5.0 out of 5 stars",
    "content": "I got the audio version and printed out & did the free workbook. This really gives you everything you need to make a break through in your life. I loved the step by step ways and the takeaways from each of the people.",
    "post_time": "Reviewed in the United States on March 1, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Powerful",
    "rating": "5.0 out of 5 stars",
    "content": "Not quite as knock-you-off-your-feet powerful as The 5 Second Rule, but incredible in its own right! Mel does an awesome job of taking the lessons from each person and making them applicable to you, showing you key lessons for how to improve your life and your mindset no matter where you are. Highly recommend.",
    "post_time": "Reviewed in the United States on April 17, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Be ready and open to really listen the coaching sessions.",
    "rating": "5.0 out of 5 stars",
    "content": "This is a must book to listen to. It is so clear and right to the the point about old patterns that we used in the past and not serving us anymore. But we are so deep in them that we are not able to see how they’re controlling our live. Therefore, we feel something is missing and unable to reach full potential.",
    "post_time": "Reviewed in the United States on March 13, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Essential part of your library",
    "rating": "5.0 out of 5 stars",
    "content": "My first purchase on audible and love the way it works! This book is full of Ah ha moments and practical tips on how to move forward in your life. There’s something in here for everyone and I found it to be something I will reuse often. Get it... it WILL help you.",
    "post_time": "Reviewed in the United States on March 31, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "So eye opening!!",
    "rating": "5.0 out of 5 stars",
    "content": "This book has given me the tools to address fear issues (some I didn’t even realize until listening to this book) and live my life to the fullest.  By making me aware, I’m able to change the behavior and face my fears.",
    "post_time": "Reviewed in the United States on February 20, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Mel is a Boss!",
    "rating": "5.0 out of 5 stars",
    "content": "Liked this one. All about the small building blocks and fully understand your fears. Recommended.",
    "post_time": "Reviewed in the United States on March 13, 2020",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Ok",
    "rating": "3.0 out of 5 stars",
    "content": "Mel is a boss!",
    "post_time": "Reviewed in the United States on August 29, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Mel gets right to it",
    "rating": "5.0 out of 5 stars",
    "content": "Just started but I’m sorry but Dan is gay. So I don’t know if I should continue.",
    "post_time": "Reviewed in the United States on February 20, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Little substance and repetitive",
    "rating": "1.0 out of 5 stars",
    "content": "Mel gets right down to it, doesn’t allow you to push away when the tough stuff comes. She has a gift and I’m so glad she continues to share it!",
    "post_time": "Reviewed in the United States on August 20, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Life changing!",
    "rating": "5.0 out of 5 stars",
    "content": "I should have read the 1 star reviews.  In summary:",
    "post_time": "Reviewed in the United States on February 16, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Awesome",
    "rating": "5.0 out of 5 stars",
    "content": "- Very little substance, super repetitive. The whole audio book worth 5 minutes max.",
    "post_time": "Reviewed in the United States on July 15, 2020",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Best selfhelp book ever!",
    "rating": "5.0 out of 5 stars",
    "content": "- Therapy coaching sessions are ridiculous. The author speaks majority of the time.  She made all kind of assumptions and then her own conclusion.",
    "post_time": "Reviewed in the United States on March 7, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Very effective book",
    "rating": "5.0 out of 5 stars",
    "content": "Mel’s approach to coaching her clients in the stories is direct and effective. The book was very helpful in getting me to face my own fears.",
    "post_time": "Reviewed in the United States on December 19, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Real good listen.",
    "rating": "5.0 out of 5 stars",
    "content": "Honest. Simple. To the point. Understandable. Definitely relatable.",
    "post_time": "Reviewed in the United States on March 13, 2020",
    "pid": "B07LFKZQGZ"
},
{
    "title": "A Life Changer!",
    "rating": "5.0 out of 5 stars",
    "content": "Mel Robbins has done it again! So much great content and tangible take always not to mention the massive companion workbook you get with this for FREE! A MUST LISTEN to anyone seeking advice on how to live a better life. Mel, keep doing what you are doing. You are changing lives!!!",
    "post_time": "Reviewed in the United States on April 6, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Audio binge expected!",
    "rating": "5.0 out of 5 stars",
    "content": "This is everything iv needed to hear to understand myself, and whats going on in my head. Be prepared to binge listen, the feeling of lightness, relief, closure is truly exhilarating. Thank YOU Mel!",
    "post_time": "Reviewed in the United States on August 23, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Love love love this topic and format!",
    "rating": "5.0 out of 5 stars",
    "content": "These conversations between Mel and these folks are wonderful and very insightful! I feel like I'm sitting in on their therapy session and getting just as much benefit. I love Mel's casual style and the simple, yet powerful, questions she poses. Do another audio like this, Mel!",
    "post_time": "Reviewed in the United States on April 4, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "This!",
    "rating": "5.0 out of 5 stars",
    "content": "Yes! Yes! Yes!  This is the best self help/ personal development book I have read or listened to.  It cuts through the mess and hits you right on the head with real self awareness and guidance.  Thank you Mel!",
    "post_time": "Reviewed in the United States on May 20, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "If you need to boost your inner self confidence when feeling stuck",
    "rating": "5.0 out of 5 stars",
    "content": "Best and inspirational motivational speaker. Mel Robbins will make think, talk and especially act. I love her advices and energy Mel creates both, in my mind and body when I listen to her.",
    "post_time": "Reviewed in the United States on July 26, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Great book for people wanting to get over sudden anxiety attacks",
    "rating": "5.0 out of 5 stars",
    "content": "Just want I needed thank you Mel!",
    "post_time": "Reviewed in the United States on January 21, 2020",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Lifechanging",
    "rating": "5.0 out of 5 stars",
    "content": "Mel nails it.  I will be listening to this several times AND using the workbook. Valuable lessons for anyone struggling to move forward.",
    "post_time": "Reviewed in the United States on March 6, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Very raw",
    "rating": "5.0 out of 5 stars",
    "content": "I am blown away by the humility of the people who tell their stories.  I think everyone can relate and find something that will help them take another perspective on your life.",
    "post_time": "Reviewed in the United States on April 14, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "understanding fear",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent book! Very motivating but through a different channel..your FEAR and the power of understanding why you’re afraid.",
    "post_time": "Reviewed in the United States on February 12, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Mel Robbins is my new fav!",
    "rating": "5.0 out of 5 stars",
    "content": "This audiobook was without a doubt life changing!! Amazing!!",
    "post_time": "Reviewed in the United States on February 28, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Love this!",
    "rating": "5.0 out of 5 stars",
    "content": "Great book! I recommend  this for anyone and everyone! Mel Robin's is a great communicator and real. She is really an expert in the field of getting your act together!",
    "post_time": "Reviewed in the United States on April 15, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "She teaches strategies that will improve your life immediately.",
    "rating": "5.0 out of 5 stars",
    "content": "To improve my effectiveness of getting past my procrastination. Mel Robbins is very straight forward and makes sense of improving your dad to day life. She is a great speaker, narrator, and business woman.",
    "post_time": "Reviewed in the United States on March 18, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Hands down, one of the best!!",
    "rating": "5.0 out of 5 stars",
    "content": "Couldn't stop listening to the audible version.",
    "post_time": "Reviewed in the United States on February 28, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Amazing!",
    "rating": "5.0 out of 5 stars",
    "content": "I was in a rut for a bit and this book brought me back to life! I play it over and over it and over!",
    "post_time": "Reviewed in the United States on July 25, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Either you love it or you hate it, and I love it",
    "rating": "5.0 out of 5 stars",
    "content": "This book really open my eyes for me. And no, change don't happen overnight. but it really get the ball rolling",
    "post_time": "Reviewed in the United States on September 1, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Fantastic!!",
    "rating": "5.0 out of 5 stars",
    "content": "Loved everything about this! Mel Robbins gets right to the point and is totally fantastic!!",
    "post_time": "Reviewed in the United States on October 7, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "Great audiobook",
    "rating": "5.0 out of 5 stars",
    "content": "Really fun to listen to. Mel is an entertaining storyteller and always encourages people to take small but concrete actions to improve their lives.",
    "post_time": "Reviewed in the United States on July 7, 2019",
    "pid": "B07LFKZQGZ"
},
{
    "title": "A must read",
    "rating": "5.0 out of 5 stars",
    "content": "Fear and Stress were my life!!! All Gone thanks to Mel Robbins teaching me to Stop the cycle and mindset",
    "post_time": "Reviewed in the United States on March 20, 2019",
    "pid": "B07LFKZQGZ"
}
]