[
{
    "name": "        Bali Women's Underwire, One Smooth U Ultra Light T-shirt, Convertible Bra       ",
    "stars": [
        "65%",
        "15%",
        "9%",
        "5%",
        "6%"
    ],
    "pid": "B07MNHHXNC",
    "ratings": "39,352 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Buy these!",
    "rating": "5.0 out of 5 stars",
    "content": "I have been on a new bra hunt. Several months ago I decided that the underwire had to go and sort of successfully found some that work-BUT they  are still poking me under the arms with a piece of plastic.  My husband inadvertently put my underwire bras in the dryer and now all have bent hooks, so it's time for new ones.  We have 1 Kohl's store locally and nothing else, so finding  a selection is limited. Back to Amazon.  I started reading reviews and looking at how many were purchased, etc.  I have worn Bali bras before and know that they seem to hold up well and fit me. My only problem with this is the \"modesty layer\", I am a 40DD and have NEVER had any kind of padding-why do bra companies do this? I don't want or need it.  But, in reading the reviews, many talked about how thin this was and especially how comfortable these bras are.  So-my thought, \"I'll order one and try it and return it if I don't like it\".  Well, I don't like it, I LOVE it! This is by far the most comfortable bra I have ever worn. It definitely is true to size and I don't mind or notice the \"layer\".  Most importantly, NO POKING, especially under the arms!  I can come home and take it off and not have red marks on my body.  It is soft, cool, not overly tight (but still supportive) and looks pretty.  I love the upper mesh part on these.  I do have one comment as several others mentioned, the fabric on the hook part is a little scratchy but only when putting it on.  I am a \"spinner\"-I cannot reach behind me to hook the bra, I have to hook in front and spin around my body (yeah, not good, I know), and it's a little scratchy when doing that, but once on, it's fine.  I have now purchased 4 of these in various colors and am hopeful that they will hold up.  These are convertible straps (I may never use that feature) and as others have posted, the strap adjustment is in the back.  No problem, adjust once and that's fine.  I also noticed while trying on non-underwire bras that many had very short straps-I am 5'2\" and frequently have to shorten them a lot.  Many of the non underwire ones had very short straps that I still had to shorten.  These do not, they are more \"normal\" in length.  The price was great too, as the retail is $48 on these (why are bras so ridiculously expensive???). At $23, I feel like I can purchase several.  I am QUITE pleased with this and would highly recommend!",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Okay, so I have a LOT to say about this bra. I'm sure you're reading the 1 and 2 star reviews and wondering whether you should take a chance. YES, by all means, do! I am going to do my best to address the issues raised in the low ratings. But first, please know that I have been wearing the bra for two days now (all day) and can tell you without reservation that it is one of the most - if not THE most - comfortable and attractive bras I've ever owned. I am rather chesty (a 38D) and usually have to try many bras on before I find an acceptable one, and then I buy like 3 or 4 at a time. I've worn Bali (though, not a ton of styles), Warner, Soma and others that perhaps I've long forgotten.  TAKE A LOOK AT MY PHOTOS and keep in mind that I am approaching my 64th birthday.  So, needless to say, the girls are not naturally perky at this stage in my life.  LOL.  I included one clothed so that you can see how it looks underneath a summer top.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "BUY. THIS. BRA.",
    "rating": "4.0 out of 5 stars",
    "content": "So, as to the issue of fit:  It fits VERY true to size.  The cup size fits exactly like a D-cup should fit - no gaps, full coverage, no side spillage out of the cups.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Underwire:  Truly, I have no idea what the complaints are all about.  There is more than adequate fabric covering the underwire, and it is very comfortable too.  If people are experiencing bruising (really???) or marks, perhaps they have it on hooks that are tighter than required, or maybe they need to go up to the next numeric size (e.g., 36 to 38).  As I said, I've been wearing this bra all day long for two days, and it doesn't even feel like I have it on - it's THAT comfortable.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "My favorite bra but…",
    "rating": "5.0 out of 5 stars",
    "content": "Straps:  They adjust well and give a good range for just about any body.  I found that the girls are not sagging and are well supported. Sure, it would be easier to have them adjust in the front instead of the back, but once you make your adjustment, it's not like you have to do it every day (unless you're switching back and forth between racer-back and standard).  BTW, I am wearing it as a racer back today, and it's fabulous!",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Padding:  Unless you have literal bullets for nipples, there is no way they're gonna poke through the padding.  The cups are not overly padded, which is really nice IMO, because too many bras have quite heavy padding, which is hot and uncomfortable and makes your chest look fake.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Very flattering",
    "rating": "5.0 out of 5 stars",
    "content": "Embellishment:  The mesh portion on the upper cups is really attractive and lies perfectly.  I haven't found issues with gapping, unevenness or seams showing through the clothing.  I suppose if you wore a really tight top that is maybe silk or satin, you might see something.  But for everyday use, the seam is it is not an issue.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Bottom line:  I am ordering two more bras today in different colors.  If there is any deviation from this review regarding quality, etc., I will update this review.",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Wonderful Bras!",
    "rating": "4.0 out of 5 stars",
    "content": "HOPE THIS HELPS!",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was very happy with this bra. It fits well and is super comfortable in, always except one. The back band, where it connects to the hooks, has an uncomfortable piece of material that I can’t seem to get rid of. I’ve even tried trimming it with scissors. I now use a cloth type Band-Aid to put on the bra that sits against my skin and that works, but it looks tacky. I like the bra so much that I bought a second one, hoping that it would not have the same discomfort. Unfortunately, it’s the exact same discomfort . So I just keep an extra batch of Band-Aids in my underwear drawer.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Nice bra, fold lines in cups",
    "rating": "4.0 out of 5 stars",
    "content": "This is a very nice bra. I wear 38C or 38D in Warners, and I thought maybe Bali was smaller in the band and bigger in the cups. I think it is slightly bigger in the cups, because I would be swimming in a D in this, but I don't think the band is much smaller, since the 40 band is quite large. The C cup it lots large. I probably could have ordered a 38C as recommended, and been fine. The bra is pretty on, and I like the cut of it. The only issue is there are fold lines in the (albeit thin) foam lining. I hope they will come out in the wash, but I'm not so sure. It looks like the cups were damaged in shipping. I might have tried to return this for a smaller size and hopefully line-free cups if I didn't live overseas, but the shipping to return it and get another one back would cost more than the bra!",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Update: Having worn this bra for a bit I have noticed that if you have back love handles the part of the bra across the back will enhance that.  “Back” to the drawing board.  If you don’t have that issue the bra is still worth a try.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Ladies THIS is the fit!",
    "rating": "5.0 out of 5 stars",
    "content": "I spent so much money on bras from Torrid and Lane Bryant and they always fit me odd. There is more bra than a gal needs. If you want a natural looking fit with cups that do not have the weird gap at the top of the cup then this is the bra for you. I remember this brand from so long ago how did we get distracted away from a natural looking bust line and comfortable to boot? Never again. This bra comes in a lot of pretty colors also so do yourself a favor if you’re tired of getting stabbed in the side by your underwire and give this bra a try. It’s also soft and easy on your bank account.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love these particular Bali bras. I prefer underwire because the ones without ALWAYS bunch up no matter if you are small or large chested. I have never had a bra without underwire that didn't no matter what they claim in the ads. Needless to say, I needed to order more and replace my current bra wardrobe and I ordered the exact same Bali bra a few months ago and there was something off on the sewing that it itched and dug into my skin. I don't like other bras so I was hoping it was a manufacturing defect and took my chances and ordered another. After a few days of wearing, thankful my comfortable Bali bra without defects is back! Whew.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Much better from my last order!",
    "rating": "4.0 out of 5 stars",
    "content": "This now my new favorite bra. It is completely comfortable in all areas from the strap, cup, and band. I have had no issues of the band rolling up or moving at all. The only personal qualm I have is there’s no padding which may be revealing if you are wearing a tight shirt but I just stuff a pad from another bra to help. Out of all the bras I have tried, this one was cost effective, and “ready to wear” right out of the packaging. They also had my size where I have seen most places don’t! For reference, I was told I am a 40D and in fact I am actually a 42C (which is the size I purchased this bra in).",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really have a hard time finding bras that I don't want to whip off the second I get home. This one is very comfortable and supportive. The only problem is the padding is not quite as thick as I expected, so the headlights are on sometimes, if you know what I mean. But, I can deal with that. Overall a comfortable bra.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Comfortable! 10/10",
    "rating": "5.0 out of 5 stars",
    "content": "I am not a product reviewer type but this deserves a review. Outside of being fitted by a professional I’ve never been able to find a bra that fit so well. So I felt like I had to let others know. This bra cups all the right places so well. It’s not restricting because I hate feeling confined but it’s just perfecting supportive without extra padding. It’s a absolutely wonderful.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The absolute most comfortable bra i've ever owned. the only bra i've ever worn where i can forget i'm even wearing one. also, i know you're not supposed to throw your bras in the dryer with everything else, but i've washed and dried this baby like a thousand times with absolutely no negative consequences to the shape",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Comfy",
    "rating": "4.0 out of 5 stars",
    "content": "For the last 5 or so years Ive been wearing Soma brand bras, but recently my body has been changing (just getting older) and I found that I needed more support. I've tried probably 15 bras from Victoria’s Secret, Nordstrom, Target, etc. but this bra is by far the best fitting and most comfortable. It smoothes the back and doesn't create indents on my shoulders.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered two of these bras in different colors, they are very comfortable, but they are not all day wearing bras for me. I wear a 36 DD, and the straps don't cinch up short enough to fit my accommodations. I have tried crossing them in the back, this helps, but I think I will try a different style from this brand. This brand of bra always has good comfortable bras, but this one for me isn't some thing I would wear if I were wanting my girls to set up right and not droop… \"Because of the straps.\"",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Fits well",
    "rating": "4.0 out of 5 stars",
    "content": "I like this bra, however looses tightness in shoulder straps with time. Good fit to what I typically wear, true to size. Not much padding which is good for someone who’s already “big chested”",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love the fit of this bra but it makes me itch.  I washed it before wearing but by the end of just a full days wear, I’m itchy every place the bra touches.  I’m hopeful I’ll get use to it and itching stops. I’m use to cotton bras so maybe it’s just me.  Crossing my fingers!",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Love the fit but….",
    "rating": "4.0 out of 5 stars",
    "content": "Y'all... I'm shocked. I am so picky about bras. I hate torpedo boobs which I feel like always happens when I buy bras online. You know what I mean, when the bra cup cones out. It's just a personal preference, no hate. But these bras... chefs kiss. They don't cut me anywhere, everything feels secure, my rolls aren't rolling and I'm not adjusting every few minutes. You can't feel the under wire either. The only thing I would like more of in this bra is lift. I'm old, chubby and have had 2 kids who slowly have drained the life outta me so the girls are sad but it's not enough to deter me. Just buy it. Also, follow the size chart. I questioned it so I bought the size I thought and the size the chart said and the chart won.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I typically buy a bra with light padding which this does not have. However, it's very flattering on and offers comfort. The cups are not oversized and it fit's great! I appreciate the Bali brand. They've continued to keep their quality.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "So comfortable",
    "rating": "4.0 out of 5 stars",
    "content": "I like the price, color and comfort.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This bra is very comfortable to wear. Straps are very stretchy yet provide support. The material is soft to the touch. Added protection to the cups provides better coverage.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Great fit and quality!",
    "rating": "4.0 out of 5 stars",
    "content": "This bra is amazing! It supports and shapes everything very well. I like that it is really light. The only thing that I dislike about this bra is the back where the clasp is. It is really scratchy and irritating on my back. I wish they had used a softer material there and different thread.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have long been a fan of Bali bras; however, the ones I have been wearing have become uncomfortable, and I sensed I needed a bra with more support.  This one is perfect for me.  The back has three hooks instead of just two, and the straps are set wider apart on my shoulders, eliminating those dreaded \"digging dips\".  I recently ordered three more and will certainly be throwing my old Bali bras out.  Though the instructions say to handwash, I have been machine washing it in a lingerie bag in cold water along with other delicate items, then hanging it to dry - no problem.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Really comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "I have struggled with finding the right bra for me that is comfortable yet supper supportive and doesn't leave me with overflow or gaping. I can finally say I found that bra. I loved it so much I bought two. When those get old and broken, I will definitely be buying these again!",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was really skeptical about ordering a bra online because I usually like to try them on. I prefer comfort and full coverage because I had a lumpectomy years ago and under wiring is always uncomfortable for me. I read the reviews and decided to order it and take a chance. To my surprise, it was everything I’ve been looking for! Full coverage, not an un- comfortable underwire, and definitely no push-up. Love love love!! Highly recommend! Just for reference I’m a 34C and petite.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Feels fantastic on!",
    "rating": "5.0 out of 5 stars",
    "content": "Great fit. True to size. Nice support and very pretty!  Great colors too! Great value for the price in white",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is great bra, great price, very comfortable and like the very light padding for privacy. Ordered in 2 different colors. Would buy again.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Very comfy",
    "rating": "5.0 out of 5 stars",
    "content": "Very comfortable and full coverage. Straps can be converted to a cross-back style, although they sometimes come unhooked that way. Only real downside is that the white shows up very brightly under light colored shirts but that’s normal for a white bra.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is my go toe everyday bra. I have two in black, two nude, one ivory and one blue. Very comfortable and wash well. The padding is light which I like since I'm large in the chest. I do have to wear silicone nip covers underneath whenever my shirt is thin. I also like the fact that you can cross the straps when you're wearing a racetrack tank top. And the price is great!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Very comfortable",
    "rating": "4.0 out of 5 stars",
    "content": "Sometimes you can see my nips but I don't care because of how comfortable it is",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Being a 32ddd or 34dd the sizes are all but impossible to find in most stores. This is super comfy and fits great.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "40D and love it",
    "rating": "5.0 out of 5 stars",
    "content": "This bra is so very comfortable and light weight.  Soft and at the same time very supportive.  May cost more than a cheap bra at the department store but well worth it.  Also I like full coverage and this bra checks all the boxes.  I will certainly buy it again.  I also like the versatility of changing the straps in the back.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After searching years for a full coverage bra with an underwire that doesn't poke and hurt I've finally found one! I love this bra, I'm a 40 D and it feels like I'm not even wearing a bra! I love the support it gives too for the larger chested girlies and I'm thrilled lol. Great bra!!!!",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Currently my favorite bra",
    "rating": "4.0 out of 5 stars",
    "content": "Had it for months now, wash in a bag, air dry, still holding up. I ordered 2 more.  Wish they were made in the USA. I would pay more for that.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Bra is light in weight and light in padding. I personally don’t like my nips showing, so if showy is not your preference, do not buy this. Also, I feel the foam pads will not hold up to multiple washes. It’s already crinkled from being shipped, so I’m betting it will crinkle more after wears. Chanced it with 38dd when I wear 38ddd. The cups fit perfectly on me, no spills. Keeping for home wear only.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Comfort and wearability",
    "rating": "5.0 out of 5 stars",
    "content": "So comfortable  supportive w/ comfort. Will continue to buy this bra. Now have a black white and beige. The bra also can be worn cross cross in back. Slim straps perfect w sleeveless high neck cut in shoulder top",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Really good quality, Holds them girls in place, and very comfortable.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Comfy!",
    "rating": "5.0 out of 5 stars",
    "content": "Great quality, smooth fit, no bulk, light weight.  Cup is true C, but need next size up for comfort, 38, order 40, 40 order 42.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Holds up well in wash, hang dry",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Great value",
    "rating": "4.0 out of 5 stars",
    "content": "This is by far the most comfortable bra I’ve ever work.  I immediately ordered three more!!  Perfect fit for my body!!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good fit. True to size. Good price.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Outstanding bra",
    "rating": "5.0 out of 5 stars",
    "content": "A little scratchy but I am very impressed with the fit. Zero gaps! The padding is thin so if you are looking for thick padding on the cups, you might not like it. The straps are pretty comfy too!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ll be getting more in more colors.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Good bra for good price",
    "rating": "4.0 out of 5 stars",
    "content": "This bra is extremely comfortable and the fabric is one of the best I’ve felt used for a bra!",
    "post_time": "Reviewed in the United States on March 24, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have ordered several of these bras and they are comfortable and easy to adjust straps. The prices are great too!  Plus very cute too!",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Awesome",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered this off-line not thinking that I could not try them on. But I would rate these at 100% perfect thank you so much Amazon.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Not one negative thing to say!  Smooth, supportive, comfortable.  Perfect bra!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Best fitting bra ever!!",
    "rating": "4.0 out of 5 stars",
    "content": "I love the look and the idea that I can make it a cross strap bra, but I do not wear it often because it is so thin. I like a thicker coverage in the nip area.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I normally have a hard time with cup size but they carried my size 42B and for the first time in years, I’m happy with my purchase.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Cute but not enough padding for my taste",
    "rating": "4.0 out of 5 stars",
    "content": "Im a 38D, im 70 yrs old so need all the support i can get. Unfortunately this bra doesnt quite do the job. Itd be great if youre semi perky to begin with...  Its ok for wearing around the house, but theres not enough uplift and support to give your breasts nice definition. Ill stick with Playtex brand.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is actually very flattering and well fit under clothes, and the underwire bothers me less than most underwire bras. Great buy.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Perfect fit",
    "rating": "5.0 out of 5 stars",
    "content": "I bought these bras in a store and I like how comfortable and affordable they are.  So when I saw Amazon had them and I could buy them and not have to leave my house it was a done deal.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Sostén muy bueno para personas con busto grande. Agarra bien y lo que más me gusta es que deja el espacio bien definido entre un pecho y el otro, colocándolo bien en su lugar.  Full coverage. Se ve muy bien en franelas y camisas. Tiene la forma de la copa sin relleno adicional.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Very soft and comfortable",
    "rating": "4.0 out of 5 stars",
    "content": "This bra is very light, perfect for summer heat.  It has a nice fit and pretty with a touch of lace.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you’re looking for comfort, this is the bra for you!",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Comfortable, pretty",
    "rating": "5.0 out of 5 stars",
    "content": "Its very comfortable, sturdy, good value for money. Very minimal padding",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "very fashionable and comfortable.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "very good",
    "rating": "4.0 out of 5 stars",
    "content": "Supportive and comfortable for a bra.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love the bra, has a nice shape, well made, comfortable",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "I’m always skeptical of buying bra’s and clothing online, but this bra was a perfect fit and is super comfortable.  I’ll be purchasing more in alternative colors for sure.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There is no lining/padding in this bra so when necessary, I use silicone nipple covers to hide the “headlights.” Great price and very comfortable. My only concern is that the shoulder straps have limited ability to tighten so I’m afraid after continued wear, the straps will stretch out and there won’t be a way to pull the cups up higher.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Very nice fit",
    "rating": "5.0 out of 5 stars",
    "content": "Always looking for the most cooling bras to get me through the hottest, sweatiest months of our work season.  Tried this style and was shockingly surprised to find it is THE COOLEST BRA EVER for working outdoors in sweltering weather, and I've tried all kinds.  The fit is flexible and comfortable, with the stretchy mesh edging conforming to my every move, no spilling out when I bend forward.  The underwires are so much cooler against the skin than the big elastic bands of so-called wicking, cooling sports bras.  Thin cup material is def cooling, but you do lose a bit of the \"modesty\" protection of traditionally thicker foam cups.  Whatever!  I just want to be cool and dry!  I wear it under printed cotton blouses for work, so if anyone notices any headlight action, they're looking way too closely!",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Soooo comfortable! The price is perfect, I’m ready to throw out all my bolder holders and replace with these. 38 DD (and sometimes wonder if I’m bigger) the fit is full coverage and soft. Normal lift and comfy straps.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Very comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "Huge fan of wearing the U Bra.  Great fit.  I have purchased many times.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It was a bit tight around I would order my next size up next time.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Great Everyday Bra",
    "rating": "5.0 out of 5 stars",
    "content": "I was really surprised but the perfect fit of this bra. It holds it shape all day, the straps never fall, and washes great. I wear this of everyday use and it keeps everything in place all day.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So I bought 2 more👍 ⭐️",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Most comfortable bra I’ve ever owned",
    "rating": "5.0 out of 5 stars",
    "content": "I am a true 36DD and have tried literally every bra out there. I end up returning most or just settling for “good enough”. This is the bra. The holy grail. The one I’ve been searching for. It is so supportive, gives a great shape, no spillage, no back fat, no gapping. It’s thin, but conceals the nips. I’m telling you, you will love this. I’m throwing away my others  and ordering these from now on.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like this bra..I usually go with Hanes but tried this one.  Happy with the fit and super soft material.  38 c",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "The BEST bra, hands down",
    "rating": "5.0 out of 5 stars",
    "content": "It fits perfectly. Very confortable",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fit great and very comfortable.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Feels soft",
    "rating": "5.0 out of 5 stars",
    "content": "Love this bra! I've had this bra in several different sizes. I lost weight and have had to size down twice. Each time this bra did not disappoint, it fits perfectly. Great value for the price.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great ! Love Bali Bras ! Their all I  can wear !",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Very confortable . Fit perfect",
    "rating": "4.0 out of 5 stars",
    "content": "This is a great fit if you’re curvy. The nude color is nice for my light complexion and provides great support. It is also lightly lined so the nothing shows even with a white t-shirt on. I wasn’t sure about the net piece on the cup, but it prevents puckers or gaps that would be visible under a t-shirt. I’m  a fan of a more natural, rounded look so if you like lots of lift and padding this is not the bra for you! I would’ve given it 5 stars but where the mesh/net piece is sown to the cup was a bit rough at first. It smoothed out after the 3 rd wash on delicate in a laundry net bag.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very Comfortable and seems to be a good quality. However, the padding is super thin so I would bot chose to buy again.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Great buy",
    "rating": "4.0 out of 5 stars",
    "content": "I liked the style and fit it gives nice support and material soft",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like it.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Good",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent brass comfortable. Good quality",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I HATE bra shopping.  But this bra fits very well and doesn’t have rolls hanging out the back.  The only reason I didn’t give it 5 stars is that the mesh part is a bit itchy on me for some reason.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Brassiere",
    "rating": "4.0 out of 5 stars",
    "content": "Just received my bra today. It’s very comfortable and supportive. Only thing I don’t like is that it could use a tad bit more padding in the nipple areas for when it’s colder weather for sure lol. -Jess",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This bra fits me perfectly. Perhaps the best fitting bra I've ever had. Nothing shows under t shirts or close fitting blouses/dresses. I only wish they had them in brown which would be a nude look for me. I bought black instead, not the best but ok under some clothes.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Good Fit",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great fit and very comfortable.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Will buy more.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Good bra",
    "rating": "4.0 out of 5 stars",
    "content": "I was so excited for this bra, however I ordered the wrong size. I believe I went too big. It ended up rubbing up against my low sternum and created really red, irritated marks. I would order again and try another size. I typically wear a 40D and ended up ordering a sister size instead (38 DD) which has never been a problem before. But I is my fault. The bra itself was very nice, the fabric was very breathable.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This type of Bali bra is usually well-fitting and well-made. I believe that these reduced products are seconds, however, because there are clear mistakes -e.g., one shoulder strap is longer than the other, and such. If not for the reduced price, I would be unhappy.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "product description",
    "rating": "4.0 out of 5 stars",
    "content": "Not bad for the price. Still a Maidenform fan though.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very comfortable bra. The only down side is that it seems to shape my breasts a little off. Other than that one of the most comfortable bras I’ve tried.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Comfy",
    "rating": "5.0 out of 5 stars",
    "content": "This is a very comfortable item with an excellent price.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This bra is super is comfortable and flattering, which is nice for me as I’m a 40 DD, the only reason I give 4 stars instead of 5 is because I wish there was a little more padding.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Most comfortable",
    "rating": "4.0 out of 5 stars",
    "content": "I was pleased to find this in a size 40B. The only downside for me is that there is an annoying seam in the upper cup. It is irritating and sad because it was not necessary to the construction of the bra. I decided to keep it anyway because it fits well.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Me gusta esta marca de brasier, la varilla no molesta es perfecto para mi además lo tengo en varios colores .",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Very comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "I have several of these and they are super versatile and comfortable.  There is juuuuust enough 'modesty' padding and no top line gaps or digging band. They aren't great for a plunge neckline, but they're made as a T-shirt bra, so I'm happy with them.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I ordered a 36 C and short have ordered a 38 C run a bit small around cup size was good",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Great Bra at a Reasonable Price",
    "rating": "5.0 out of 5 stars",
    "content": "Been buying this bra for years. Very good quality",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B07MNHHXNC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this bra the fit is awesome 👍🏽👍🏽👍🏽🧁👍🏽",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B07MNHHXNC"
}
]