[
{
    "name": "        e.l.f., Monochromatic Multi Stick, Creamy, Lightweight, Versatile, Luxurious, Adds Shimmer, Easy To Use On The Go, Blends Effortlessly, Sparkling Rose, 0.17 Oz       ",
    "stars": [
        "62%",
        "17%",
        "12%",
        "4%",
        "5%"
    ],
    "pid": "B07MWSRJ89",
    "ratings": "67,390 ratings",
    "other_info": {
        "Item Form": "Stick",
        "Finish Type": "Shimmery",
        "Coverage": "Full",
        "Brand": "e.l.f.",
        "Color": "Sparkling Rose"
    },
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": [
        " PERFECT PIGMENT: Use this shimmery, luxuriously blendable cream-to-powder stick as your eyeshadow, lipstick, and blush for a cohesive monochromatic look. The lightweight formula makes it virtually mistake-proof and perfect for touch-ups on the go.  ",
        " HOW TO WEAR: Apply to eyes, lips, and cheeks, and blend with a brush or fingertips. Use alone or as a base for powder products for even longer-lasting color.  ",
        " 100% CRUELTY-FREE & VEGAN: Proud to be 100% vegan and cruelty-free, worldwide. Because kindness is chic.  ",
        " All e.l.f. products are made from skin-loving ingredients you want—all at good-for-you prices. All e.l.f. products are 100% vegan, cruelty-free, and leaping bunny certified  ",
        " BEAUTY FOR ALL: e.l.f. Cosmetics provides professional-quality products at get-real prices, because we believe beauty should be accessible to every eye, lip, and face.  "
    ]
},
{
    "title": "Love it!",
    "rating": "5.0 out of 5 stars",
    "content": "This is great! I have always used the powder blush and figured why not try something new. So glad I did! It goes on easy and blends in nice with a brush. I actually like it better than the powder blush! Highly recommend!!",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is my favorite blush. It’s a super pretty color with a tiny bit of shimmer. It’s buildable and easy to blend. I don’t like it much as a lip color as it’s a little too light and highlights any dryness. Cute as an eyeshadow. I’ve bought four of these and will continue to buy them as long as they’re sold!",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "I adore this product",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this product for my Mom who is in her 80’s but still very stylish and pretty. It is smooth and silky with great color, so it is simple and easy for her to use plus it looks great on her.  I would recommend this for anyone who wants just a pop-up color anywhere on their face from their cheeks to their lips!",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Color, texture and volume ok",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Simple to use",
    "rating": "5.0 out of 5 stars",
    "content": "This lasts long, I like this glow stick better than the liquid one’s offered on the market",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first time using non powder blush and I really like it! It goes on smooth and I prefer a natural look - it gives me some color and glow without overdoing it. Also really easy to take on the go. I would try other colors too. Really great value too.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Small and handy to take along",
    "rating": "4.0 out of 5 stars",
    "content": "Small but perfect",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love a subtle blush and fits the bill. Looks great on. Shipped fas and packaged well",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Perfect Touch Of Glow",
    "rating": "5.0 out of 5 stars",
    "content": "I USE THIS PRODUCT FOR SHADING  AND CONTOURING ON MY FACE.  IT IS SO VERSITILE!",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You'll catch me wearing WAY TOO MUCH blush 9 times out of 10 because I am sincerely in love with it. Always have been, always will. I should have been born in the 80's.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Great for Eyes, Cheeks, Lips!",
    "rating": "5.0 out of 5 stars",
    "content": "I love ELF skin care and make up products, some are better than others but this is in the GREAT category!  All the reviews you see are correct, this is an amazing little multi-use product!",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This cream that glides ultra-smooth across the skin.  I usually use a brush to blend it, tap tap tapping, but it will blend perfectly with the fingertips.  It isn't heavy or greasy or too bold. It gives such a nice glow!!  It doesn't take much at all to create beautiful color on your skin.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Dazzling Peony - perfect blush for travel",
    "rating": "5.0 out of 5 stars",
    "content": "Yes it is small, so small it is surprising but it packs a big payload of color!  I can easily carry one in my purse for some touch-ups if needed.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I set it with a setting spray or powder.  It stays well that way.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Best of the Best",
    "rating": "5.0 out of 5 stars",
    "content": "Get your youthful glow on and the SPARKLING ROSE is everything.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love this cute thing! It's perfect for travel. There is some sparkle to it which I do not usually prefer. Smooth application and it looks great with a tan. I like to put it on my hand first and then go in with a small stipple brush and then buff it into my cheeks instead of applying it directly to cheek first.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Love",
    "rating": "4.0 out of 5 stars",
    "content": "Best all over blush of all of the best ones that I own.  For me the perfect color and lasting power I need and has a slight glow, so you don't really need a separate highlighter on the go.  I keep in my purse as an all-purpose option.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I think elf products are amazing and they’re totally underrated! I think this is the perfect blush color for fall. I use a little bit now on my cheeks, but I also let my daughter use it as just the tiniest bit of gloss cause she likes to play make up. It’s very sheer looking, but gives you that nice little tint at the same time. You don’t look like a clown and I also love how compact it is because you could just throw it in any wristlet bag.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Es  un encanto",
    "rating": "4.0 out of 5 stars",
    "content": "Es muy bonito el color, tiene muy buena calidad el producto, y el tiempo de duración es perfecto, lo compré para regalárselo a mi nieta y a ella le encanto",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "good product. goes on fast, blends well and lasts for hours.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Me encanta!",
    "rating": "5.0 out of 5 stars",
    "content": "Me encanta este producto, es primera vez que lo compro y me dejó sorprendida lo que dura una vez te lo pones, hidrata bastante los labios.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "En las mejillas se ve bellísimo al igual que como sombra de ojos.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Nice shade",
    "rating": "5.0 out of 5 stars",
    "content": "10/10",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Goes on really smoothly and the color is very pretty/subtle rouge. Lasts all day and doesn't smudge or wipe off.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Teen daughter loves it!",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this for my daughter to use, she loves it! The color is beautiful, lasts over time and goes on smooth! Happy with purchase will buy again!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this in sparkling rose and luminous glow and the rose is my favorite for sure!",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Sparkling Rose",
    "rating": "5.0 out of 5 stars",
    "content": "It is perfectly rose pink and stays on all day. I love using cream blush and this elf didn’t disappoint! I typically have an oily T zone but this doesn’t smudge off easy. It’s buildable too and I put some on my nose for that sunkissed look!",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Lindo color en maquillaje en crema. Lo uso para labios, como blush o color para pómulos y también lo uso como sombra. Es practico para las que no queremos tomar tiempo en el maquillado diario o para los que no nos gusta cargar con tantos maquillajes. Son cremosos y se sienten bien a la piel. El producto llegó a tiempo y según las indicaciones por el vendedor. Buen producto.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Maquillaje",
    "rating": "4.0 out of 5 stars",
    "content": "This has really sped up my time in front of the mirror. The monochrome color for lips, cheeks and eyes works for me. The Sparkling Rose color is a really great color. I've reached an age where I'm only interested in what makes me happy with myself. Part of that has been simplifying my makeup routine. I use the Dermatology universal tinted moisturizer, The E.L.F. multi-stick for my lips, cheeks and eyes, and a setting spray. Thats all I need. If it's a special occasion I may use an under eye concealer.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I use these every day for blush and sometimes eyeshadow. If I'm applying it as blush, I just use my hands. For eyeshadow, I use brushes. This product plays well with other products. I use it on top of sunscreen, lotion, and other skincare and it looks great and lasts all day. Once you are blending it, it feels and acts like a super fine powder blush, but lasts longer and is more durable. Super easy to throw one of these into your bag for a weekend trip with some mascara and a lip gloss.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "First time user- Obsessed!",
    "rating": "5.0 out of 5 stars",
    "content": "I got the e.l.f Monochromatic Multi Stick in 3 colors. Beautiful neutral shades that glides on smoothly and blends so easily with the perfect amount of shimmer and shine. Left skin glowing all day. For reference, I’m medium to deep with a neutral undertone. In the picture, I have on ‘Bronzed Cherry’ and girl! Great product!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This blush provided light, luminous coverage.  It’s pretty, but the product is very small.  Will be great for travel.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Very light coverage",
    "rating": "4.0 out of 5 stars",
    "content": "Don’t like the glitter it has but overall the color is nice",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this on a whim.  The price was right and the color looked promising.  Wow.  A sweet little multi-stick which goes on creamy and works as advertised.  Just enough color.  Caveat = have not used on my eyes, just lips and cheeks and a dot at my center hairline.  Will definitely buy more to tuck in my travel bag and powder room.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Color is nice",
    "rating": "5.0 out of 5 stars",
    "content": "This is easy to apply. I use a brush to apply and one to blend. It is small for traveling. It make quick work for basic makeup application.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Won’t buy again was to small used up in under two weeks",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "You really want this in your purse",
    "rating": "4.0 out of 5 stars",
    "content": "I ave 3 of these in different colors and they are sheer and moisturizing.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very Beautiful. Orange and pink Sade with glitter.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Small multi purpose",
    "rating": "5.0 out of 5 stars",
    "content": "I love a multi stick. I love this color. So pretty!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very happy with my purchase! While this is tiny, the color is perfect and the feel is smooth (not sticky, like some lip gloss can be). Nice!",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Small but Mighty",
    "rating": "4.0 out of 5 stars",
    "content": "I thought it would be a larger size, but it works well.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This small product seems like it wouldn't last very long, but it definitely lasts, even doing makeup everyday. The color is correct, and looks nice on pale skin like my own. Use one of those circle puffs with a small handle on one half and dab it onto cheeks; set with powder blush. This would be nice for someone who likes natural makeup, as the pigment isn't insane and the product only gets covered easily by powder on top. Blendable, affordable, and worth it. Will be ordering again.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Balanced pigment, lasts a while, true to color.",
    "rating": "5.0 out of 5 stars",
    "content": "You know it if all the expensive blushes I've purchased over the years this is definitely now my go to.  Gives a beautiful glowing look!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was pleasantly surprised with this inexpensive product. It is very pigmented and also has great staying power. Love it!!  Already ordered in another color!!!",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Love it",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect, recommend using the side for a sharper blushy kind of day! Use the center for a more rounded kind of day. The shade is nice. Dark enough I don't need alot of product",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I did not think I would love this. I am not a pro when it comes to makeup. This makes it easy. I use my finger to apply to avoid cross contamination. I mix this berry and the tan/gold one for my cheeks. The berry is gorgeous on my skin tone (I'm Hispanic, light brown with yellow undertones).",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Very pigmented",
    "rating": "5.0 out of 5 stars",
    "content": "It brings back a lovely youthful glow that my 51 year old face has been missing. It’s easy and light and not greasy. Only bad thing is that it doesn’t last long and you will need to really after an hour - at least I have too. Otherwise it’s a really great product!! Always makes me feel pretty!",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Not my color",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "I love her",
    "rating": "4.0 out of 5 stars",
    "content": "I use this product on top of primer, but I do not use with a setting powder.  The color is so good and I love how easy and forgiving it is to apply.  I often use it on my face and eyelids with little other makeup and it gives a great look.  The only issue is that it does not last.  After a few hours, it is all but disappeared off my face.  At the end of the day, I can't even find traces it of it on my cleansing pad!  If you don't mind reapplication or if you want to just try it, I still recommend you do.  The price is great, the look is great so it is worth a try!",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B07MWSRJ89"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this blush. The color is beautiful and goes with any skin tone. I purchased to use for a wedding that my family and I attending to. I did my daughters, my sister and my own makeup. Simple makeup and it looked fabulous on all of us. We are Latina's of different skin tones.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B07MWSRJ89"
}
]