[
{
    "name": " The Things We Cannot Say ",
    "stars": [
        "77%",
        "18%",
        "4%",
        "1%",
        "1%"
    ],
    "pid": "B07MRKPHKR",
    "ratings": "39,618 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "Five Stars!",
    "rating": "5.0 out of 5 stars",
    "content": "I could not put this book down!",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the first book I have read by this author.  However, it will not be the last!  The story is very well written, I stayed up late reading because I just had to know what happened next.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Very well written, page turner",
    "rating": "5.0 out of 5 stars",
    "content": "Loved how all the characters' stories were interwoven at the end.  It is a highly emotional tale - I sobbed thru at least the last 4 chapters!  I'd love to see this made into a movie.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One of the best books I’ve ever read. Informative and educational and beautiful. This story tugged at my heart strings and ignited a fire in my own life to learn about my ancestors.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Unforgettable",
    "rating": "5.0 out of 5 stars",
    "content": "The author's storytelling prowess shines through in every chapter, painting vivid pictures and evoking a wide range of emotions. From moments of heart-wrenching sadness to exhilarating triumphs, the reader becomes fully immersed in the lives of the characters. The depth of emotion conveyed in the narration is truly remarkable, leaving a lasting impact on the reader's heart and mind.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What sets this book apart is its ability to leave no story untold. The author skillfully weaves together multiple narratives, ensuring that each character's journey is given the attention it deserves. The seamless transitions between different storylines create a sense of cohesion and keeps the reader engaged and invested throughout.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "incredible.",
    "rating": "5.0 out of 5 stars",
    "content": "I really loved this book so much! The mix of past and present came together so beautifully. This book touched my heart in so many ways.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There was nothing to dislike in this book but lots of tears and fears for all the people.  A must read!",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "A Captivating Journey Through Unforgettable Stories",
    "rating": "5.0 out of 5 stars",
    "content": "This book was a wonderful read that was hard to put down. Full of hop, dangerous ecxiteme, unconditional love and true sacrifice. Definitely recommend this book!",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is an incredibly well written book that takes you straight in to WW2. And the perils that many families faced. I can't recommend this one enough.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Excellent read",
    "rating": "5.0 out of 5 stars",
    "content": "This book was amazing. Well written, moving back and forth from present time to Nazi invasion of Poland. Definitely recommend this book",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I could not put this book down…and when I did I was always thinking about the characters, their hardships, the sadness of the cruelty they had to endure, and what was coming next.  I was cheering for Alina and Tomaz the whole time, while also trying to figure out how Alice fit into their story.  Do yourself  favor and get reading now!",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "A MUST READ!!!",
    "rating": "5.0 out of 5 stars",
    "content": "This paints such a good picture of WWII Poland. It’s heart wrenching how people can treat other human beings, but the hope of those willing to help is comforting. Such a wonderfully written book with a few twists and turns that keep it exciting. I also feel the portrayal of the non-verbal autistic boy was very well done.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What a beautiful story. I loved this book and will remember how it made me feel for a very long time. A job well done and I’m truly sad the book came to an end.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Wonderful Historical Fiction",
    "rating": "5.0 out of 5 stars",
    "content": "Don't walk to get it.... run. It's that good.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love a good mystery and this one was hard to put down. I knew the Nazi occupation was brutal but Kelly makes it all so real. I pray I never have to face one. And I appreciate the journey into life with an autistic child. What a challenge, and what a heartwarming turn of events. Thank you Kelly Rimmer! I will look for more of your books.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "A truly amazing novel!",
    "rating": "5.0 out of 5 stars",
    "content": "I know very little of the Holocaust and actual events during WW2 in Poland. This book was an eye opener and I really enjoyed it.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I got emotional towards the end and it truly was a great read.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "One of the best books I've read in a while!",
    "rating": "5.0 out of 5 stars",
    "content": "I didn't expect to relate to this book, but found many everyday occasions appear. It brought history & the day to day nuances relatable.  Good read for historical fiction & romance enthusiasts.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A beautiful story about love, family, and self-discovery. I have read many WWII historical fiction books but this one made me cry. It made me more determined to search my own ancestry and how grateful we should be to our families who sacrificed and worked hard so that we could have these precious lives. It made me realize that we should make the most of every moment in our precious lives .",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Truly moving!",
    "rating": "5.0 out of 5 stars",
    "content": "This book really took me to another place and time.  Great story! I will probably read it again.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "  I have a deeper understanding of what the victims went through in Poland during  WWII",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Unstoppable determination",
    "rating": "5.0 out of 5 stars",
    "content": "This WWII novel was not like others I’ve read before. It showed the determination of the human spirit to help others, and stay alive in spite of risks.  Plus, the love of two people and what they were willing to go through to be together.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It has a good story line and lots of action.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Good book",
    "rating": "4.0 out of 5 stars",
    "content": "This book is written about such a difficult time but so well done.  Take the time ...history, strength,love through the toughest of time.  When you finish read the author's note.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I toggled back & forth between reading and listening to this book, frequently annoyed with the attempted variety of Polish accents. At the end, I teared up and got a little emotional, so I can’t say it wasn’t worth the effort. But I can recommend you skip the audio-version, or at least find a different narrator.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "A Read to Remember",
    "rating": "5.0 out of 5 stars",
    "content": "The story of their struggles and escape from occupied Poland will bring you to tears.  Have already passed this title on to friends and family as a recommended read.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If reading about autism or about the holocaust are emotional triggers don’t read; otherwise, this is your book.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Finally, it came together",
    "rating": "5.0 out of 5 stars",
    "content": "Sad and wonderful. To hear stories from a family. Love, death, fear, tragedy, life. It gives hope and meaning to all readers. Thank you for sharing this history with us.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love thus Author & all of her books so far.  Can't wait till next book comes out!",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Great story",
    "rating": "5.0 out of 5 stars",
    "content": "This book has several unexpected twist. It is spot on with detailed from WWII. Once you start reading it, you can't put it down.  Far better than I expected.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A fascinating, painful story filled with truth and gut-wrenching emotion. It won't matter if you like the characters or not, you will be moved, and you will know you are alive. I am filled with awe at the level of writing chops this book required.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Just...wow.",
    "rating": "5.0 out of 5 stars",
    "content": "Fabulous book!",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely loved this book! I couldn’t put it down. It is beautifully written, thought provoking and at times… heart wrenching. It was like I was literally there with the characters.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Heartbreaking",
    "rating": "5.0 out of 5 stars",
    "content": "Bravo! Well done.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Well written, gripping story; finding it hard to put down. So good that I'm planning to also buy her first book!",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Best book I have read in a long time",
    "rating": "5.0 out of 5 stars",
    "content": "Stirring, beautiful, enlightening, tragic, with an emotional and fabulous ending.  Great book.  A look at how our family histories matter and can change us all, if we're brave enough.",
    "post_time": "Reviewed in the United States on September 10, 2020",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "With fat tears running down my face, I'm writing this review.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Excellent",
    "rating": "4.0 out of 5 stars",
    "content": "It has been almost a year since The Things We Cannot Say came out yet life has made it impossible for me to read it before now. So many friends recommended it and they were not wrong. It's a beautiful devastating story. One that will be impossible to forget.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I went in blind which I'm so happy I did. Kelly Rimmer does a beautiful job at creating Tomasz, Alina, Alice, Eddie, Emilia, Saul, and all others right in front of me.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Good read",
    "rating": "5.0 out of 5 stars",
    "content": "Book club selection.  Characters seemed very real.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this genre of books, this one did not disappoint.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Excellent read",
    "rating": "5.0 out of 5 stars",
    "content": "I love the two story lines evolving in the book.  Great ending.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Twist and turns, hope and disappointment, grit and endurance. Friendships made that will never end and proof that love that stays with you forever.",
    "post_time": "Reviewed in the United States on May 26, 2020",
    "pid": "B07MRKPHKR"
},
{
    "title": "Heart pounding tear jerking masterpiece!",
    "rating": "5.0 out of 5 stars",
    "content": "I began reading this book and almost put it aside as not very interesting, but I plodded on....by the last few chapters I was a finding it difficult to read through my tears and not wanting to put it down for a moment.  The story has had a profound effect on me, and I am so very pleased I read it.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This story of a Polish family during WWI and the present day daughter and extended family is a powerful one.  The children of immigrants often do not understand nor care to truly grasp the lives of their immigrant parents/grandparents.  This is especially so when those elders don't explain their circumstances or what it meant to live in a wartime country.  This book tells the story from two aspects, one of a young Polish woman, very much in love, who lives on a small farm with her family during the war and during the Nazi occupation of her country, and her granddaughter in present day Florida with her own family challenges with an autistic son.",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "4.5 stars!",
    "rating": "5.0 out of 5 stars",
    "content": "Early on in the book, as I indicated previously, I was less than enthusiastic with the plot as the 96- year-old Polish grandmother has been hospitalized due to stroke.  Her granddaughter has arrived to her hospital bed and is met with the problem of lack of communication with her grandmother due to effects of the stroke. This is where her autistic  son becomes key to the plot.  Without spoiling the story I will leave it here only to say  this made the story very rich throughout.",
    "post_time": "Reviewed in the United States on April 24, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The author obviously did much research into the occupation of Poland and destruction of gentle life in a farming community.  I have read, at length, many varying accounts of this era and must say this truly gives a sense of the fear and desperation of  the people whose lives are so changed as they are enslaved by the Nazis.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Stirrings of the Heart",
    "rating": "5.0 out of 5 stars",
    "content": "This is a timeless love story that will grab your heart and explains so much about why we must never forget the past.  I highly recommend this book and feel it has much to teach us. I am so glad I decided to read on.  Prepare to cry.",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a beautiful story of love and loss and family. It captures a time in history that was so tragic, and yet, stirs hope and tenderness. I highly recommend it.",
    "post_time": "Reviewed in the United States on January 6, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "great read",
    "rating": "5.0 out of 5 stars",
    "content": "The knowledge learned from this book will forever be a part of me. We must never forget, as it will lead us to repeat. God Bless those who fought for us to be free.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I read WWII / Holocaust fiction frequently. Not since Beach Music (Pat Conroy) have I been so moved by a story.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Oh. My. Goodness!",
    "rating": "5.0 out of 5 stars",
    "content": "I'm a big WWII historical fiction reader - Pam Jenoff, Kate Quinn, etc. I count The Things We Cannot Say by Kelly Rimmer right up there among the best. Her research is impeccable, and the events are consistent with the time period. Most importantly, her characters simply sing. They develop throughout the book in a way that's realistic and represents both the strengths and frailties of human beings. By the end of the book, I had tears rolling down my face. This is one of those books that you don't want to end.",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A wonderfully written book that will move you to tears .",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Fantastic Read!!",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful historical novel. Wonderful love storey. Reminded one about the great sadness of ww2. It shows how strong people can actually be",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A single HOLOCAUST perspective that needs to be shared.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "A fabulous read . I could not put it down",
    "rating": "3.0 out of 5 stars",
    "content": "I’m only 7 chapters in and have discovered quite a few typos.  Will give a review of the story once I finish.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was amazing and heart wrenching. Very well written, I felt I was right there. A must read for anyone interested in  history of WWll. I shed a tear at what everyone went through and it saddens me so. The strength and endurance of the human spirit moves me. Praise god",
    "post_time": "Reviewed in the United States on June 7, 2024",
    "pid": "B07MRKPHKR"
},
{
    "title": "beautiful story very well written.",
    "rating": "5.0 out of 5 stars",
    "content": "There are so many things I like about this novel that I don’t know where to start. It’s educational, engaging, and inspiring.  It’s a story spanning at least four generations and two continents, a story of love, loss, heartache, bravery, and determination.",
    "post_time": "Reviewed in the United States on November 28, 2022",
    "pid": "B07MRKPHKR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I never knew about Poland’s occupation by the Nazis except in a factual way. Now I can see it on an individual level affecting real families. I was reminded of intergenerational relationships and how people from the past affect our lives and our children’s lives…not just with hair and eye color but also with character traits like courage. I was reminded of love and how it’s the strongest, most powerful emotion on the planet. Families have their struggles, but many can be resolved with faith, love, and mercy.",
    "post_time": "Reviewed in the United States on February 3, 2024",
    "pid": "B07MRKPHKR"
}
]