[
{
    "name": "        Keonjinn LED Bathroom Mirror 28 x 36 Inch Bathroom Mirror with Lights Front Lighted Makeup Mirror Anti-Fog Dimmable UL Listed LED Driver Tempered Glass Wall Mounted Vanity Mirror (Vertical/Horizontal)       ",
    "stars": [
        "70%",
        "15%",
        "5%",
        "2%",
        "7%"
    ],
    "pid": "B07MNDTY9C",
    "ratings": "1,631 ratings",
    "other_info": {
        "Brand": "Keonjinn",
        "Room Type": "Bathroom, Living Room, Powder Room",
        "Shape": "Rectangular",
        "Product Dimensions": "36\"L x 28\"W",
        "Frame Material": "Glass"
    },
    "discount_price": "$ 169.99",
    "normal_price": "$209.99",
    "about_this_item": [
        " 【Dimmable & Memory】 The brightness of this modern led mirror is dimmable, short press to turn the mirror light on/off while long press on the button can adjust the brightness of the mirror (10%-100%). With the UL listed LED power driver, this wonderful bathroom mirror are available for an excellent lighting experience. When the LED mirror is restarted after a power failure, it will return to the last use, no need to adjust again.  ",
        " 【Safe Defogging】 The frontlit mirror's light and anti-fog are controlled separately. To avoid overheating of the mirror due to long time use of defogging, the anti fog function will automatically turn off after one hour of continuous use, then you need to click the defogging button to turn on the defogging function again.  ",
        " 【Easy Flexible Installation】Super easy to install with French cleat brackets. Our bathroom mirror support normal wall switch control and can be connected using plugs or hardwired. Can be installed in bathroom, bedroom and the room you want to install. Only plays an auxiliary role in the brightness of the room, and is not recommended as a separate lighting.  ",
        " 【Tempered Glass & Packaging】 Strong and safe tempered glass are resistant to breakage, ensuring your daily use for safety. Newly improved packing greatly reduces damage during transportation. Keonjinn led mirrors have passed all tests including dropping test, impact test, heavy pressure test etc.  ",
        " 【Brand Keonjinn】 As the leading brand in the mirror category, we have been committed to providing consumers with affordable quality mirrors and have received over 7,800 reviews on Amazon for 6 years. We are constantly improving the craftsmanship and packaging of our mirrors to ensure that our mirrors reach our customers intact. Please don't hesitate to get in touch if there's anything we can help with you.  "
    ]
},
{
    "title": "Value, beauty, utility…superb",
    "rating": "5.0 out of 5 stars",
    "content": "I installed this LED mirror to modernized my guest bath.  Added a recessed light receptacle for it, connected to vanity light.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s superb.  I like the dimming & anti-fog controls.  At the selling price, it’s a great value.",
    "post_time": "Reviewed in the United States on May 16, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "A non performing expensive novelty",
    "rating": "4.0 out of 5 stars",
    "content": "I contacted the seller CS via Amazon CS for additional brackets (it came with 2).  The seller CS responded within 3 minutes & offered to ship additional brackets.  I may not need them, as two seems to be holding the mirror adequately, but truly appreciate the kindness of the seller’s CS.",
    "post_time": "Reviewed in the United States on February 6, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I may be tempted to buy two additional mirrors for my other bathroom!",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "Nice mirror...bad directions",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased my 17 months ago and the are both broken. $500 down the drain. Now I am left  w 2 $ 100 pretty mirrors. Not my intention when I fell in love with these.",
    "post_time": "Reviewed in the United States on February 24, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I saw these first at my girlfriends house when she was doing her b room.  She purchased them in a mother location ( same price).  I was enthralled by them. I knew I had to have them. 2 months later I started my b room and I purchased them. Both of my girlfriends mirrors stopped working after 22 months.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "Good value for the money",
    "rating": "1.0 out of 5 stars",
    "content": "I contacted the vendor letting them know what’s happened. I did not expect much. To my surprise he ask me to send photos of me trying to put the light on and of. I sent those photos asap! I was so encouraged. I did not expect new mirrors. I never  heard back from them. This made me mad. They should have contacted me back and said they have no answer. Something customer servicey. I will give the vendor a OMG!  Customer service. Customer  service!",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am here to tell you I know I’d two people, my girlfriend and myself who have purchased this mirror a total of 4 and none of them lasted past 22 months.",
    "post_time": "Reviewed in the United States on November 28, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Looks beautiful, but quality is not so good.",
    "rating": "4.0 out of 5 stars",
    "content": "Don’t buy it because it’s gorgeous. Its a bad expensive buy. It will  damage your wall if you want to take it down because it is an electrical installation. Bad, expensive and a wall damaging installation. Don’t buy. You’ll be sorry. I am. I wasted $500 !",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Installed two of these mirrors in our bathrooms today.  We wanted to get lighted mirrors since the lighting in the bathrooms was not great for getting ready.  I will say that these mirrors are a significant upgrade to what we had.  They are very clear and provide a good amount of light, which can be adjusted brighter or softer.  We haven't used the defogger yet but testing it out made the surface heat up so it should probably work.",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "It's good but could be better",
    "rating": "4.0 out of 5 stars",
    "content": "As a service technician, being inside other people's homes, I've seen what these lit up mirrors are capable of and how bright they can be. When my mirror came in, the box was beat up and even our UPS driver told me his came in broken and to check the box out. Our mirror was not damaged thankfully.",
    "post_time": "Reviewed in the United States on September 8, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I proceeded to attach the wiring to the bolt on 110 plug to test and make sure it works. It did. I brought it into the bathroom where the vanity mirror and light was being replaced, and compared the brightness of the two. The mirrors built in light even adjusted to its highest setting is half of what two light bulbs would be considered. I've certainly seen brighter so that's where my \"it could be better\" is coming from.",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "Stopped working ((",
    "rating": "4.0 out of 5 stars",
    "content": "The brightness however does not cause any glare while looking into the mirror at your reflection. The anti fog works, just sometimes you have to press it multiple times.",
    "post_time": "Reviewed in the United States on February 8, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Unfortunately the electrical part stopped working after 2.5 years. I see that the seller claims to refund or replace within 3 years, but see no way to contact the seller (.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "Hardware that is included",
    "rating": "5.0 out of 5 stars",
    "content": "Editing my review: The customer service got back to me a little bit late, but they tried to help very efficiently and friendly. They started with the comprehensive informational support, and finally after they realized they couldn't help me any other way, I got a full refund.",
    "post_time": "Reviewed in the United States on November 22, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This mirror is fantastic and looks beautiful in our  master bath. My daughter bought on for new  bath an loved it so I ordered the 39\" x 60\".",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "Love it",
    "rating": "4.0 out of 5 stars",
    "content": "An electrician will need help hanging this mirror and our guy was amazing. The only complaint is that the hardware, which is 4- 3\" ( I think) and 4 PLASTIC holders. Unless this is new construction, you can't plan where the hangars will attach, since these are set. You totally need to install this very heavy mirror in the studs and since our home is now 30 years old, and we were replacing our existing mirror, the drywall, would not hold the molly bolts he used in place of the tiny PLASTIC screw holders. The studs of course were in the wrong place and the only part  of the mirror was on the upper left corner. The electrician made his own hardware that solved the problem. So using molly bolts, still would not hold and blew out of the drywall. Also the points which are on the back of this mirror ARE NOT ADJUSTABLE. So the connection points have to be exact!",
    "post_time": "Reviewed in the United States on February 24, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love the mirror it makes",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "One Year Later - Still Love this Mirror",
    "rating": "4.0 out of 5 stars",
    "content": "We remodeled our bathroom in late 2020, and this mirror was one of the upgrades included in our remodel. After a year of daily use of both the LED lighting and the heated anti-fog feature, we are still very pleased with our purchase.",
    "post_time": "Reviewed in the United States on December 28, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The mirror came well-packaged and there was no shipping damage. It was a bit of a pain to mount on the wall (having a helper is necessary), and according to a family member who is an electrician who helped me mount/wire this mirror, the wiring is odd; if I remember, the wiring only has white and black wires for power, there is no grounding). Mounting this took about an hour, as we were being very cautious to ensure it was perfectly level. The instructions for mounting were laughably lacking; if I remember correctly, we threw away the instructions as they weren't much help. We mounted ours to drywall and it is worth mentioning that this mirror is  heavy, so buying some high-quality drywall mounts separately from the mirror is an absolute necessity in my opinion.",
    "post_time": "Reviewed in the United States on December 7, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Expensive.",
    "rating": "4.0 out of 5 stars",
    "content": "I was excited about this mirror but not so much after installing it. My daughter likes it though.",
    "post_time": "Reviewed in the United States on December 13, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "- I needed a handyman to install it.",
    "post_time": "Reviewed in the United States on June 6, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Delivered shattered in box, but Keonjinn made it right",
    "rating": "3.0 out of 5 stars",
    "content": "- The lighting around the mirror takes away two inches on all sides. So, choose a mirror that four inches longer and higher than your current regular mirror.",
    "post_time": "Reviewed in the United States on July 12, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "- The lighting looks cool but useless. In fact, it hinders vision a little. It doesn’t light up your face but causes glare. I always turn it off.",
    "post_time": "Reviewed in the United States on December 18, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Little if any manufacturer's support in US",
    "rating": "5.0 out of 5 stars",
    "content": "- The defog area is quite small. (About 20” x 12” in a 48” x 28” mirror.)",
    "post_time": "Reviewed in the United States on June 22, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "- Turn on the defogger before your shower.",
    "post_time": "Reviewed in the United States on April 3, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "Very Satisfied!",
    "rating": "4.0 out of 5 stars",
    "content": "Update 6/28 - Keonjinn reached out to me after my review and offered their apologies & a discount on the smaller Keonjinn mirror we purchased and installed in our guest bathroom. They asked for my input about the packaging of the 72x36 mirror, and I suggested they they add additional layers of protection so future purchasers receive their mirror in good condition. We gave the smaller Keonjinn mirror 5 stars, and I’m sure if we would’ve been able to use this larger version, we would’ve loved it just as much so I have changed my review from 2 stars to 4 stars for the good customer service.",
    "post_time": "Reviewed in the United States on March 25, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Mirror came in broken. Completely shattered. We did get a smaller LED mirror in this brand that we enjoy, but we went with a different brand for our 72x36 led mirror in our master bath after this came in such bad shape. We got a full refund on the 72 x 36 mirror.",
    "post_time": "Reviewed in the United States on March 5, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "Great Customer Service",
    "rating": "5.0 out of 5 stars",
    "content": "(7/19/2022 Update)  Replacement LED received today.  Company was pleasant to work with, responding to my issue quickly and efficiently.  I have not tried to install the new unit yet but issues there will be on my.  The company performed well.",
    "post_time": "Reviewed in the United States on March 11, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "(written 7-12-2022)  I bought a 36x28 Keonjinn mirror on 10/16/19.  It has worked perfectly until 2 nights ago.  For some reason the blue LED lights are now off and it's acting like a strobe light when its dark. Like middle of night dark.  Maybe there's a on/off switch or reset button somewhere?  I do not have, or cannot find, my owner's manual and have spent this morning trying to find someone representing the company in America who is willing to help me.  If there is someone I cannot find them.  Manufacturer's website chat is through WhatAp which I do not use.  I sent an email to the company headquarters in Hong Kong.  No idea if I'll get a response or not.  I like the mirror but....",
    "post_time": "Reviewed in the United States on June 15, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Good!!  Hoping it lasts",
    "rating": "5.0 out of 5 stars",
    "content": "Replacing light fixture and mirror in guest bathroom with this mirror.  It looks way more modern and is super functional.  Although it looked like it would be relatively easy to install, I opted for an electrician to do it because there was no ground wire coming from the mirror and I just didn’t want to mess it up.  (30 min total) There is a tiny delay from flicking the switch to the mirror lighting up but it seems to work well.  You can adjust the brightness by holding down the power button on the mirror.  It’s a fairly intense LED, so if you are looking for soft white, this isn’t for you, although you can dim the bright white.  Haven’t used the anti-fog feature yet. It arrives well-packed in styrofoam.",
    "post_time": "Reviewed in the United States on December 10, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": " I just hope it lasts over time, but I have no reason to believe it won’t.  Ordered 2 more for my master bathroom.  For $200 each  (with Amazon Coupon) it’s worth it for a little bathroom spruce-up.",
    "post_time": "Reviewed in the United States on March 18, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Almost 5 stars...",
    "rating": "4.0 out of 5 stars",
    "content": "It's beautiful! Looks perfect in my bathroom. My contractor installed it, so I don't know how \"easy\" it was, but he didn't have any issues.  I would give it 5 stars, but the anti fog button is a little temperamental... I usually have to press it a few times before it turns on. Other than that, perfect!",
    "post_time": "Reviewed in the United States on May 7, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "UPDATE:  11/2/22 Found out the light is dimmable. If you press and hold after you turn it on, itll start dimming. Press and hold again, it gets brighter, pretty bright actually. Hence why it's making that humming sound, the dimmer!",
    "post_time": "Reviewed in the United States on November 13, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Nice but...",
    "rating": "5.0 out of 5 stars",
    "content": "It makes a very light humming sound when it's switched off. But the sound goes away after I turn the light back on.",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I had a professional installed it for me and he said he couldn't hear it.",
    "post_time": "Reviewed in the United States on May 17, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Very nice quality!",
    "rating": "4.0 out of 5 stars",
    "content": "Comes with cord that plugs right into outlet. Retains memory if being used with a wall switch. Doesnt have dark spots where the light is like others being sold on here. I would buy again for sure.",
    "post_time": "Reviewed in the United States on June 18, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Just what I wanted mirror with extra lighting. Love the off and on button.",
    "post_time": "Reviewed in the United States on August 15, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Awesome mirror",
    "rating": "4.0 out of 5 stars",
    "content": "I got two 36”x28” and was exactly what I was looking for... after reviewing several LED mirror I decided to give it a chance...",
    "post_time": "Reviewed in the United States on January 8, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Pros",
    "post_time": "Reviewed in the United States on December 13, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Modern and looks great",
    "rating": "4.0 out of 5 stars",
    "content": "This mirror is a great way to update an old bathroom. It was easy to install.",
    "post_time": "Reviewed in the United States on May 29, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is easy to use and the dimmer settings make for good ambiance.",
    "post_time": "Reviewed in the United States on February 3, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "Awesome!!",
    "rating": "4.0 out of 5 stars",
    "content": "Only drawback is that there are several scratches in the mirror coating. We didn’t notice in time to contact seller to exchange/return.",
    "post_time": "Reviewed in the United States on August 17, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We need two more mirrors. Will definitely consider getting these again and inspecting before install.",
    "post_time": "Reviewed in the United States on May 19, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Very good mirror with a few minor issues.",
    "rating": "4.0 out of 5 stars",
    "content": "Great mirror. Second one we have purchased !!",
    "post_time": "Reviewed in the United States on March 9, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a good mirror and its well made. It is a good purchase and makes the bathroom look awesome. I have this mirror for about a week now, so far its good. The light and anti-fog do work as intended. I do have some minor issues.",
    "post_time": "Reviewed in the United States on October 1, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Really ties the bathroom together.",
    "rating": "3.0 out of 5 stars",
    "content": "1: The listing mentions the dimensions as 36 x 28 x 1.6 inches, its not. Its a about half inch short in the length and breadth. Maybe I missed it somewhere, but I checked the listing and nowhere it mentions that its half inch short,you know like lumber dimension...",
    "post_time": "Reviewed in the United States on September 10, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "2: The blue light for the touch buttons is way to bright for me..lights up the entire bathroom at night",
    "post_time": "Reviewed in the United States on September 30, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "One of the lights stopped working. I need to contact the seller. How can I do that",
    "rating": "4.0 out of 5 stars",
    "content": "3: Price dropped by $10 after i got it.. :(",
    "post_time": "Reviewed in the United States on March 7, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This mirror was exactly what we were looking for to give our open vanity area that hotel look. It’s not super bright, so if you are going to be applying makeup in you bathroom, I’d add supplemental lighting or get a brighter mirror. The light is very cool toned, so if you’re looking for warm white light, this is not for you. Our handyman installed it very easily using the j box for the old light fixture. We can use the switch on the wall or the button on the mirror itself to turn it on. It does not make any weird buzzing sounds.  Can’t speak to the defrost, as we have no need to use it. Pictured is the 36x28 size. Excuse the mess.",
    "post_time": "Reviewed in the United States on March 27, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Great mirror - didn't have any instructions",
    "rating": "4.0 out of 5 stars",
    "content": "I guess I got a newer one where the wires were the appropriate color. It did not come with any hardware or instructions. I wouldn't trust whatever cheap hardware that would come with it anyway. Get good anchors and measure accurately as there isn't much wiggle room. Looks great and the de-fogger works just fine right in the center. It is not bright so this shouldn't be your only light in your bathroom.",
    "post_time": "Reviewed in the United States on April 5, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was the perfect compliment to my updated bathroom.  You won't be disappointed. It can be installed vertical or horizontally.  If you don't want it to get power when you flip your light switch, you have to put it on a separate switch.  Mine is attached to the light switch, so it gets power (the little blue lights come on) I still have to turn it on (turns from blue to white), but it cannot be on by itself unless my bathroom lights are on.  I did try to see what it looked like with the lights out (unscrewed the bulbs) - and its not very bright.  So, I'll leave it as it is.  Gorgeous!!!",
    "post_time": "Reviewed in the United States on November 23, 2019",
    "pid": "B07MNDTY9C"
},
{
    "title": "Love Love this mirror!!!",
    "rating": "5.0 out of 5 stars",
    "content": "Really love this",
    "post_time": "Reviewed in the United States on December 19, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I like the look - wish it had a template in order to know where to drill holes to hang as it took a lot of measuring and hoping I got it right.",
    "post_time": "Reviewed in the United States on November 6, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Love",
    "rating": "5.0 out of 5 stars",
    "content": "The light is more blueish than yellow which isn’t what I really like -",
    "post_time": "Reviewed in the United States on November 3, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Also there is a delay between when you turn on and when the light comes on. Like the old fluorescent lights...",
    "post_time": "Reviewed in the United States on January 14, 2024",
    "pid": "B07MNDTY9C"
},
{
    "title": "Nice mirror but light is blue-not warm yellow...",
    "rating": "3.0 out of 5 stars",
    "content": "Mine had a little dent in the top but not seen when hung so didn’t bother to return.",
    "post_time": "Reviewed in the United States on April 25, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this mirror.  Took down the contractor mirror and put this mirror in.  The light is a comfortable light and the no fog feature is GREAT!  Several sizes to choose from.  The mirror was packed very well.  Yes I was concerned about shipping but not a problem.",
    "post_time": "Reviewed in the United States on May 7, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Love this mirror",
    "rating": "4.0 out of 5 stars",
    "content": "I will give just one install tip.  The mirror does not come with a hanging template.  We made one and the mirror was up and plugged in in 15 minutes.",
    "post_time": "Reviewed in the United States on March 10, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "When I imagined LED lights, I imagined there would be a setting that was so bright that I would only use it when I was applying makeup. It’s not that bright. In fact, I have to shove my face into the corner just to see to put on my makeup. Disappointed for sure.",
    "post_time": "Reviewed in the United States on June 30, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Very nice product.",
    "rating": "4.0 out of 5 stars",
    "content": "The mirror works great and it is beautiful. it is had to install for one reason, yo have to have all 4 screws perfect in order to install it. I do mean perfect. however it is do able. I got it installed and wired in and turned it on and i have a strip of LED lights hanging don and visible (about 2 inches) I don't know what I want to do yet about it.",
    "post_time": "Reviewed in the United States on January 6, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Overall, nice product. Came all in one piece and not damaged. Mirror is hard wired, so make sure you have an outlet behind mirror. You will need additional wire if your outlet is too far away from the mirrors wiring. Wiring is blue and brown. Not correct wiring coloring, but I wired blue to black and brown to neutral, that worked for me. Light is nice, but not enough for entire bathroom.  Hope this helps because directions are horribly written. For the money and additional lighting it's worth the buy.",
    "post_time": "Reviewed in the United States on October 26, 2019",
    "pid": "B07MNDTY9C"
},
{
    "title": "Nice fixture, bad directions.",
    "rating": "4.0 out of 5 stars",
    "content": "I would like for this mirror to be brighter, but the quality of the light is very nice. I had an old florescent light with a pull-chain and no light switch, so this was the perfect solution! I had my handyman install it because it was too heavy and cumbersome for me to deal with, but he put it up in 30 minutes. The glow from the buttons creates the perfect nightlight, too.",
    "post_time": "Reviewed in the United States on October 27, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I've had 4 of these now. Not because they're great but because they kept breaking and I had to return them. The electronics have to be the most cheaply made light fixture on the planet. One of them wouldnt turn on right out of the box, another one would turn on but made this terrible buzzing noise that could be heard from another room, and another one is doing the same thing but the noise is not as loud so we're just dealing with it. Out of the 4 mirrors we've received, only 1 works well.",
    "post_time": "Reviewed in the United States on May 3, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Gorgeous Mirror",
    "rating": "3.0 out of 5 stars",
    "content": "Also, they are very difficult to install. They don't come with a template, and for a mirror that isn't going to be glued... a template really should be included. I know it sounds dumb, \"why don't you just measure properly\". Well the mount holes are rather small and pretty far apart, so if your measurement is off by a couple millimeters then its not happening and you have to put more holes in your wall.",
    "post_time": "Reviewed in the United States on August 4, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "And finally, the electrical cable is too short. It's like 2 feet. If you're hooking it up to wiring in your wall then that's probably not a big deal, but if you're planning on plugging it into outlet then you'll have to extend it.",
    "post_time": "Reviewed in the United States on September 23, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Not a great product",
    "rating": "5.0 out of 5 stars",
    "content": "PS: If you're wondering \"is it bright enough...\" the answer is no. You'll always need another light source in your bathroom. Maybe if it was only a small bathroom that was either sink+toilet or sink only, but it's not bright enough for any bathroom that includes a tub/shower.",
    "post_time": "Reviewed in the United States on August 21, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great size for a modest bathroom. It shines nice and bright. However, others at this price range can adjust tone of light and oftentimes takes a very hard press for the button to light up.",
    "post_time": "Reviewed in the United States on June 12, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Great size. Doesn’t compare to others on market",
    "rating": "1.0 out of 5 stars",
    "content": "A faint noise can be heard when it’s off at night and goes away when it’s turned on.",
    "post_time": "Reviewed in the United States on April 13, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’d look elsewhere for my next purchase. However, satisfied. C+",
    "post_time": "Reviewed in the United States on April 26, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Connection cord Interfere with mounting on Mirror.",
    "rating": "3.0 out of 5 stars",
    "content": "Measurements are wrong 36/28 as advertised.actual dimensions are 36x27 1/4",
    "post_time": "Reviewed in the United States on June 23, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Makes a difference  if you are tryin to hide any imperfections of previous glass on wall.",
    "post_time": "Reviewed in the United States on February 27, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Love this mirror!!!!",
    "rating": "3.0 out of 5 stars",
    "content": "The mirror was well packaged, no damage.  I was a little nervous with it coming USPS.  It was easy to hang and wire into our existing vanity light that we removed.  I would recommend you have more than one light source in your bathroom if it's large.  I can't wait to show it off!!",
    "post_time": "Reviewed in the United States on June 2, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Dope mirror.. but came with a chip in the corner.. would be dope to get refund instead of shipping this thing back. Would have given it it 5 but for the chip",
    "post_time": "Reviewed in the United States on June 28, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Mirror came with a chip in the corner",
    "rating": "3.0 out of 5 stars",
    "content": "The mirror is beautiful and well lit.  My wife and girls now refuse to use any other mirror in the house, especially for applying makeup.  Anti-fog function is a big added plus.  I rarely write product reviews; however, the Keonjinn customer service team truly warrants recognition.  They even went as far as to replace the mirror after I had damaged it.  Top notch quality and customer support.  Highly recommend!",
    "post_time": "Reviewed in the United States on April 4, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've installed tons of mirrors, lights, fans, outlets, etc. and this mirror is very difficult to install. The instructions are confusing and we had to install it differently than laid out in the diagram. This mirror would benefit from preinstalled hardware to attach it to the wall.  That being said, it was easy to hardwire to my existing outlet and the mirror is extremely bright and the defog function works as expected.",
    "post_time": "Reviewed in the United States on December 28, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Incredible customer service.  Great mirror!!  Great company!!",
    "rating": "4.0 out of 5 stars",
    "content": "Did some shopping around for different lighted mirrors during our bathroom remodel.",
    "post_time": "Reviewed in the United States on July 27, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Found this one and liked the simplistic look. Figured I'd give it a shot.",
    "post_time": "Reviewed in the United States on June 27, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Horrible to install, but when it's installed it works great",
    "rating": "4.0 out of 5 stars",
    "content": "It was easy to install, even for a \"savvy homeowner\" and fit the space perfectly.",
    "post_time": "Reviewed in the United States on November 15, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I thought the anti-fog feature would be a gimmick and not work but I can safely say its not and works great! Adjustable brightness is cool, but wish I would get just a alittle brighter.",
    "post_time": "Reviewed in the United States on May 4, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Like it but can't hard wire it into the wall",
    "rating": "4.0 out of 5 stars",
    "content": "I really like the mirror, the brightness is great. The only problem is I had an electrician come to wire it and he said he couldn't put the cord it comes with into the wall. He said it's a lamp cord. Kind of bummed because it would have been nice to be wired with a switch.",
    "post_time": "Reviewed in the United States on September 21, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Not sure about ease of install, our contractor installed but didn’t seem to have any problems. After almost a year of daily use, controls still work fine and light is still bright. Love the anti-fog feature. Will buy this brand again when we remodel our guest bathroom for sure!",
    "post_time": "Reviewed in the United States on March 30, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Still bright and beautiful after almost a year of daily use!",
    "rating": "5.0 out of 5 stars",
    "content": "I have had this about a couple of months.  I didn’t have it professionally installed.  I wouldn’t use it as my sole source of lighting.  It’s a great mirror excellent price.",
    "post_time": "Reviewed in the United States on October 18, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Mirror looks nice however when in standby mode it makes a high pitch whining sound.",
    "post_time": "Reviewed in the United States on December 18, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Love it",
    "rating": "4.0 out of 5 stars",
    "content": "Update 1/15/23, I received a replacement mirror which works perfectly! It’s quiet and looks good.",
    "post_time": "Reviewed in the United States on December 7, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works great, looks amazing. The only thing is it’s just not bright enough for me. That’s the only reason I didn’t give it a 5 star rating.",
    "post_time": "Reviewed in the United States on August 10, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Sound **Updated",
    "rating": "4.0 out of 5 stars",
    "content": "These mirrors replace 1 huge plain mirror and are beautiful.",
    "post_time": "Reviewed in the United States on February 13, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They give two small anchors and screws. Wire in the back not long enough either.",
    "post_time": "Reviewed in the United States on January 10, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Wish it were brighter",
    "rating": "4.0 out of 5 stars",
    "content": "Not muck for lighting as well.",
    "post_time": "Reviewed in the United States on November 18, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Totally like this mirror, not quite as bright as I was hoping but my wife likes it.  It weighs quite a bit and I was attempting to hang it in a narrow space over the existing sink.  Put it up before installing the sink!!  I would recommend this product.",
    "post_time": "Reviewed in the United States on May 16, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "My Splurge",
    "rating": "5.0 out of 5 stars",
    "content": "Doing my bathroom renovation on a budget but so happy I splurged on this mirror. It is amazing and worth it!",
    "post_time": "Reviewed in the United States on April 4, 2023",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "For the money it looks pretty decent on the wall, the lighting is not even all the way around the frame and in some spots it shows darker than the rest of the framed area. Still looks pretty nice when it’s up and definitely different than a plain old mirror. If it lasts for quite a few years I’m saying it will have been a good buy.....",
    "post_time": "Reviewed in the United States on March 2, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Not superb, but not terrible either....",
    "rating": "5.0 out of 5 stars",
    "content": "Also you need to watch the other types of lighting you have in the room, because if the light color is different than one or the other of the lights seems to look out of place...",
    "post_time": "Reviewed in the United States on March 16, 2019",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The lighting is great. And I love the touch on/off switch. It was screwed too tight in the back and made some of the back plastic crack around the screws. That was the only issue. My boyfriend had to strip an old lamp wire so I would be able to plug it in to an outlet, a different alternative if you rent like we do and can't do any real wiring. Bought it new, and I think it is worth the money.",
    "post_time": "Reviewed in the United States on October 5, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Very satisfied",
    "rating": "4.0 out of 5 stars",
    "content": "The mirror met all my expectations. It was easy to install and works like a charm. Before getting into the shower, touch the defrost mode, and when out of the shower, the mirror is clear. The adjustable light brightness is a nice touch. Would recommend this product if that is what you need.",
    "post_time": "Reviewed in the United States on November 29, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Exactly what she was wanting. These lights are not for bathroom lighting but for mirror lighting only. Look awesome and worked as expected. Installation can be a pain, wish it had a bracket instead of just screw holes, but it works.",
    "post_time": "Reviewed in the United States on April 19, 2022",
    "pid": "B07MNDTY9C"
},
{
    "title": "Good lighted bathroom mirror.",
    "rating": "5.0 out of 5 stars",
    "content": "The product is designed extremely bad. The back of the mirror is solid flat rather than having a void that can accommodate wire or outlet (even a recessed outlet), a wire projects out of flat surface at the back, it would not allow the mirror to be installed flushed on the wall. The screw holes at the back of the mirror to hang on the wall right at the edge of the mirror back frame (less than 0.5\"), and they are fixed. You have to get the screws on both side exactly at a precise distance to mount the mirror, no room for adjustment. This is even a bigger problem if you have to change the location of the screes on the wall (because of wires, studs or other obstacles), and now you will have at least one of the holes outside the area covered by mirror. That is a huge problem on a tiled wall as you cannot fill a hole in a tile and make it good.  Overall, very poor design, low quality material. Had to return and buy from another brand. Waste of time.",
    "post_time": "Reviewed in the United States on February 29, 2020",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "We bought this mirror 10 months ago, and everyone loves it!  It is bright and beautiful.  Anyone who sees it (I make sure to turn the light on when we have company, to show it off!) always compliments us on it!  My son installed it, and he said it wasn't difficult, but, he is an electrician so I don't know if it's an issue for an untrained person.  It is one of the best purchases we made in our remodel!",
    "post_time": "Reviewed in the United States on January 9, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "She Loves Em",
    "rating": "4.0 out of 5 stars",
    "content": "I received both of these mirrors and opened them and was impressed. They will look great in new bathroom space; however, the biggest problem is both mirrors have scratches on the front of the mirror. They are not able to be buffed out as are into the glass surface. Having to get them replaced and hoping I just got unlucky that 2 have scratches and I won’t have to return them again. Will update review when replacements arrive.",
    "post_time": "Reviewed in the United States on March 7, 2021",
    "pid": "B07MNDTY9C"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It is a beautiful mirror and so far, has fit most of my expectations.  My only draw back is the brightness.  I really anticipated more, but it is  just not a super bright vanity.  Love the look in my newly remodeled bath.",
    "post_time": "Reviewed in the United States on January 4, 2022",
    "pid": "B07MNDTY9C"
}
]