[
{
    "name": " The Giver of Stars: Reese's Book Club (A Novel) ",
    "stars": [
        "67%",
        "25%",
        "6%",
        "1%",
        "1%"
    ],
    "pid": "B07QQ3J91J",
    "ratings": "97,918 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "ahhh summer reading",
    "rating": "5.0 out of 5 stars",
    "content": "I throughly enjoyed reading this book. Perfect for getting away and taking a trip to another place and time.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My kind of book.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "Incredible!",
    "rating": "5.0 out of 5 stars",
    "content": "Worth reading! The best historical, based and truth book I have read. It would make a good movie for sure.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved the characters and the well written story about how these womens lives intertwined and changed their town. I didn’t want to put it down !",
    "post_time": "Reviewed in the United States on July 14, 2022",
    "pid": "B07QQ3J91J"
},
{
    "title": "excellent!",
    "rating": "4.0 out of 5 stars",
    "content": "I loved this book. I came here to write a review and I was shocked to see all the negative reviews because there was a similar book out there. If you look into the timing, no one plagiarized anyone. It’s also a historical book so the packhorse library existed. This is like saying one titanic author copied another one. That’s ridiculous. That being said because so many of these reviews are saying they felt this was taken from the other one, or the other one is better, I have now read them both. I couldn’t stand the other one. I’m not gonna go and spew venom on her book review page. I’ll give it a two star review and move on. I’m disappointed in the women here who think it’s OK to sit here and trash another novel.  After reading both of them, this one is the far superior book. It is better written it’s a better story and it’s a better love story for sure. I also prefer the female camaraderie that is laced from beginning to end in this book. There was barely any female bonding in the other book and when there was, the person either died or left. I thoroughly enjoyed the friendship of the women in this book. The other one was just so canned it was ridiculous. So if you’re reading this and you’re trying to decide which of these books to read, this is the book to read. I really do not see the value in reading the other one at all.",
    "post_time": "Reviewed in the United States on August 8, 2020",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I gave it four stars because it was a good read, but I could put it down and leave it for a few days. The book begins like \"Where the Crawdads Sing\" with a dramatic event out of temporal order, then begins months before in 1937 England with Alice, the main character, a woman out of step for her time marrying a young American and \"escaping\" to a small Kentucky town in the mountains. Alice soon realizes she is very out of place and bored so when the opportunity arises to join a Packhorse Library, she grabs it. Her \"teacher\" is Margery, a woman set on living her own life and saying what needed to be said. In taking books to people, Alice meets and is befriended by the mountain people, some farmers, some coalminers. This provides the purpose in her life that her marriage is lacking and space to be away from her overbearing father-in-law who runs the lives of his son and daughter-in-law as he runs the local coal mine, with violence when necessary.",
    "post_time": "Reviewed in the United States on February 9, 2021",
    "pid": "B07QQ3J91J"
},
{
    "title": "So much better than the “other one.”",
    "rating": "5.0 out of 5 stars",
    "content": "When her father-in-law beats Alice, she leaves the house to live with Margery, discovering that Margery has a lover, Sven. In watching the two of them, Alice realizes what her marriage lacked—sex. Alice's father-in-law tries to take her home, but Margery makes him back down, earning his ire.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In the last hundred pages, the event at the beginning comes back to haunt Margery. Although she did not kill the drunk man who threatened to rape her at the beginning of the book, the man is found dead and Alice's father-in-law, makes sure that Margery is charged with his murder.",
    "post_time": "Reviewed in the United States on November 29, 2019",
    "pid": "B07QQ3J91J"
},
{
    "title": "And interesting read set in the coal mining are of Kentucky",
    "rating": "5.0 out of 5 stars",
    "content": "I will not give away the ending. But, I felt there was more than a little plot borrowing between this book and Where the Crawdads Sing. It was good and made me think of the country people I lived among when I was working.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I waited a year to read this because reviewers raised the plagiarism flag re: The Book Woman of Troublesome Creek, which I really enjoyed. But anyone who thinks Moyes' novel is plagiarized is sadly mistaken. Both books are loosely based on historical events during the Depression, but they each treat the subject matter very differently.  Are complainers  suggesting there can be no more than one novel about Auschwitz? Harlem? The Civil War? etc. Certainly, that's not the case. In any event, if you have enjoyed other novels by Moyes, and I have, especially The Horse Dancer and Me Before You, you will likely love this book.  The four chief female characters are poetically and powerfully constructed, and you will find yourself wishing to be friends with one or more of them, all courageous against unthinkable odds. The two \"good guy\" male characters are wonderful, and you might fall in love with one of them; whereas, the two main \"bad guys\" are predictable, shallow, and insufferable. They may be rich, and one of them is handsome, but Alice, our heroine runs from their abuse faster than you can say, \"Lady Chatterley and Mellors.\" Good on her! But their mission to deliver books to the poorest of the poor in Kentucky's mining communities is truly inspiring. A real life program under the auspices of the WPA and Eleanor Roosevelt is brought to life with scenes of sure-footed horses and mules, backpacks brimming with books, blizzards, mudslides, and floods; but all of these challenges pale in comparison to the scorn of some of the townspeople. Interspersed with Biblical, historical, and literary quotes, including the Amy Lowell poem which lends the title, the narrative will enfold you like a hillbilly mama's heirloom quilt. So do yourself a favor, keep an open mind, and enjoy a book that only enhances and enriches its \"Troublesome\" counterpart. Surely there's room for two excellent novels.",
    "post_time": "Reviewed in the United States on March 9, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "Great Story!",
    "rating": "5.0 out of 5 stars",
    "content": "I loved reading this book. The characters were interesting and the relationships between the women and all they had to deal with for just living as a woman in the 1930’s was very interesting to read about. I feel as if we have not come super far in the last 80 years, but these women are brave and just trying to live life on their own terms- not the small Kentucky town they live in. I loved the images of Kentucky. Having only spent one night ever in Kentucky, I can say that it was very beautiful and I would love to see it again, for longer than a day this time, after reading this book. I loved learning about the packhorse library and I would have loved to have done something like that. I adore libraries so this subject was so appealing to me. I can’t imagine the hard work that must have gone into to doing that but it never fails to surprise me, a reader, how incredibly strong people’s passion for books and learning can disrupt and threaten small-minded thinking.",
    "post_time": "Reviewed in the United States on June 5, 2020",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I would like to have heard more about the lead character’s thoughts/reaction to America’s treatment of black people, things she would not have seen coming from England. Especially because the relationship with Sophia is so important and Alice, who comes from England, seems to accept that Sophia managed “colored library” without any questions. I know that England did not have segregation and I am always interested in what foreigners think of race relations in the US, especially during this time period when things were very segregated. This isn’t a criticism, I loved this book so much, but I was thinking about that a lot while I read.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "Great read!",
    "rating": "5.0 out of 5 stars",
    "content": "Moves right along. The story and characters were great.",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Actually had never heard of the traveling library. It was a great story about women connecting and sharing. They learned about their strengths and weaknesses as they forged through.",
    "post_time": "Reviewed in the United States on April 21, 2020",
    "pid": "B07QQ3J91J"
},
{
    "title": "Awesome read",
    "rating": "5.0 out of 5 stars",
    "content": "Already passed it on, no pic !",
    "post_time": "Reviewed in the United States on December 1, 2023",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’d loved Moyes’s Me Before You (2012) and looked forward to reading this novel (2019), in spite of the accusations of plagiarism against it. The similarities between it and the slightly earlier novel, Book Woman of Troublesome Creek, were probably, I read, coincidental. The two novels, after all, were about a similar subject—the female pack horse librarians of Kentucky who delivered books to rural families in the 1930s.  Also, I must admit I was curious how this very English writer would portray the American South.",
    "post_time": "Reviewed in the United States on February 29, 2020",
    "pid": "B07QQ3J91J"
},
{
    "title": "A disappointment",
    "rating": "5.0 out of 5 stars",
    "content": "  Overall, I was disappointed in the novel. Apparently Moyes wrote it in nine months (I guess that doesn’t count the time doing research and visiting Kentucky) because she was afraid someone else would write a book about the same subject—as in fact was the case! Maybe her rush explains why the plot and characters seemed to me unoriginal. It has stereotypical Southerners, an evil big business mine owner, and as in Where the Crawdads Sing, which had come out the year before, a dramatic trial. [Possible spoiler ahead.] Also it was a stretch to accept that when a handsome American marries the beautiful English girl Alice and takes her to his home in Kentucky, their marriage is never consummated—and she doesn’t even realize it! I thought her husband must be gay, but it turns out the reason he shuns his bride is that he loves another woman in their little town. Or maybe that’s the reason.",
    "post_time": "Reviewed in the United States on January 26, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "  Of course a local hero and Alice, who joins the pack horse librarian team, fall in love, but for me there was no convincing sexual tension between them. In fact, two other characters, in my opinion, steal the romance plot line—the beautiful, unconventional tough woman, Margery, and her lover Sven. (Margery reminded me of Kya in Where the Crawdads Sing; both are “wild” women who are accused of murder.) Several minor female characters, including a black woman, also appear. All these characters’ plot lines are neatly tied up at the end.",
    "post_time": "Reviewed in the United States on January 15, 2021",
    "pid": "B07QQ3J91J"
},
{
    "title": "A wonderful read.",
    "rating": "5.0 out of 5 stars",
    "content": "  Apparently the novel has been a commercial success. Giver of Stars has sold well and a movie is being made of it. But it wasn’t the quality I had hoped for.",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Once I started this book, I could not wait to read it every night. It is beautifully written and explains the strong bond of women who are not only best friends but determined to succeed at their goal of introducing library books to rural communities where not all were educated educated.  These women stand up to the sometimes “cruel” powerful men in their town and you can’t help but want to be part of their pioneering team to fight for women against bullying men.",
    "post_time": "Reviewed in the United States on October 21, 2023",
    "pid": "B07QQ3J91J"
},
{
    "title": "Captivating but flawed",
    "rating": "3.0 out of 5 stars",
    "content": "This story moves right along and kept my interest, but I felt frustrated at the ending because it does not hang together well. The book turns on one of the main characters being accused of murder, yet the important legal details and the final trial are sketchily drawn and there are some gaping holes. The novel falls solidly into the \"chick lit\" genre since it has brave female leads and is stocked with romances that proceed along predictable lines. I did enjoy the descriptive passages of the Kentucky hills.",
    "post_time": "Reviewed in the United States on March 2, 2023",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book relies on the fascination of the subject: young women riding their horses and mules through tough terrain and all kinds of weather to deliver library books to people isolated in the mountains. But I found the characterizations uneven: the main female characters seemed believable, but many of the secondary characters were too simply drawn. The wimpy husband of the main character is so weak he's hard to believe, and the mean old coal baron father in law is a caricature of the type. Overall the female characters are more believable than the male.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "The Giver of Stars",
    "rating": "5.0 out of 5 stars",
    "content": "Apparently there is another novel covering the same subject (see other reviews for details) so it might make for an interesting comparison to read both.",
    "post_time": "Reviewed in the United States on September 23, 2020",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Haven’t finished reading the novel but, so far so good!",
    "post_time": "Reviewed in the United States on August 24, 2023",
    "pid": "B07QQ3J91J"
},
{
    "title": "The Giver of Stars",
    "rating": "4.0 out of 5 stars",
    "content": "A unique story set between the 1930's and 40's. A group of four women create a mobile library in a small town in Kentucky.  The story focuses  mainly on Alice Van Cleve. An English woman who was brought to Kentucky  through marriage to a mine owners son. Out of her element and unhappy with her circumstance she tries to find something  to fill a void. At a church  function a woman says that the town will be receiving  a mobile library. They were in need of riders to deliver books to rural families. To try to spread literacy. There Alice meets Margery. They quickly become friends. As well as Sophia, Izzy, and Beth. All these women have unique stories and dreams. They quickly find purpose and friendship while working at their library. However women were treated differently  during those times. Not everyone is okay with what these ladies are doing. Or the changes it brings to their town. The ladies must band together even when it all seems hopeless.",
    "post_time": "Reviewed in the United States on January 18, 2020",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is a story of perseverance  and the bonds of friendship. Also simply right verses wrong. It was beautifully  written.  The storyline was unique and rife with plot twists and turns. Once again Ms. Moyes has outdone herself.",
    "post_time": "Reviewed in the United States on June 12, 2020",
    "pid": "B07QQ3J91J"
},
{
    "title": "Knowledge",
    "rating": "4.0 out of 5 stars",
    "content": "This is probably one of the best books I have ever read.  I usual read about 3 novels a week.",
    "post_time": "Reviewed in the United States on April 25, 2020",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This story will stay with you long after you have read it.  One of my favorite reads takes place in the South.  The characters are true to life & leave you feeling joyful, sad, angry, & awestruck at the courage & independence these women had & felt during a very hard time in America.  I hope this book becomes a movie.  It is so moving & heartfelt.",
    "post_time": "Reviewed in the United States on November 9, 2023",
    "pid": "B07QQ3J91J"
},
{
    "title": "Without the language and sex it'd be a 5-star book",
    "rating": "5.0 out of 5 stars",
    "content": "If you only read one book this year, I recommend highly The Giver of Stars!",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "When I give a book four stars it means I liked the book a lot. I either loved the book but didn’t love the language and/or felt there was too much sexual description (which was the case with this book), OR I just liked a lot it more than loved it.",
    "post_time": "Reviewed in the United States on November 5, 2023",
    "pid": "B07QQ3J91J"
},
{
    "title": "All’s well that ends well",
    "rating": "4.0 out of 5 stars",
    "content": "The Giver of Stars is a compelling story about five woman with completely different backgrounds coming together as a team to keep rural 1937 Kentucky residents flush with library books that they deliver in all types of weather on horseback.",
    "post_time": "Reviewed in the United States on January 23, 2023",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The story is set in the coal mining hills of rural Kentucky where women were restricted in their daily lives because of their gender. It was refreshing to see women in that time period not be swayed by the times and hold jobs and fend for themselves.",
    "post_time": "Reviewed in the United States on June 9, 2022",
    "pid": "B07QQ3J91J"
},
{
    "title": "Loved it!",
    "rating": "4.0 out of 5 stars",
    "content": "I was born and have lived in Kentucky all of my 53 years. Because of that, I passed on this book several times. My thoughts were how can a British woman possibly understand Kentucky, the people, places and all our eccentricities.  I stumbled on it again while searching for something new to read. I reluctantly gave it a chance. This is the first book I've read by JoJo Moyes. It won't be the last. She vividly brings her characters to life. She captured the beauty of the Kentucky landscape perfectly. I loved every minute of this adventure and can't wait to find my next read by this author. I applaud you Miss Moyes. So many people have written negatively about Kentucky and it's people. I'm so glad you saw the beauty in the people and the terrain of my wonderful home.",
    "post_time": "Reviewed in the United States on October 18, 2023",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed this book & could hardly put it down. It was a believable story, true to life.",
    "post_time": "Reviewed in the United States on January 7, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "GOOD STORY, TRUE TO LIFE",
    "rating": "5.0 out of 5 stars",
    "content": "I thoroughly enjoyed this book. Based on the true packhorse librarians of Kentucky, it told an amazing tale of smart, strong woman who wouldn't let anyone change their minds about bring books and learning to rural Kentucky.",
    "post_time": "Reviewed in the United States on December 23, 2019",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There seems to be some controversy regarding The Giver of Stars  and The Book Woman of Troublesome Creek.  Don’t get caught up in the drama of negative reviews.  The Giver of Stars is one of the best books I’ve read in a long time.  I’ve also read The Book Woman of Troublesome Creek…it was okay but certainly didn’t grab me like The Giver of Stars.  Yes, the stories are similar in that they are both stories about the WPA.  But there the similarities end.  The Giver of Stars is a much more fleshed out story about a group of women from different backgrounds who become co-workers and best friends.  The character development was satisfying and overall it’s a great story.  Don’t be put off by some of the ridiculous accusations of plagerism.  How many books have been written about George Washington, World War I, the bombing of Pearl Harbor, etc.?  It just so happens these two authors decided to write about the WPA and this particular period of time.  Why not enjoy both books?  I did.",
    "post_time": "Reviewed in the United States on February 24, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "Fantastic read",
    "rating": "5.0 out of 5 stars",
    "content": "Everything about this novel reflects the strong and interesting people of Eastern Kentucky and the unique heritage of the WPA librarians.",
    "post_time": "Reviewed in the United States on November 17, 2023",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have found many books by Jojo Moyes to be well written and engaging, but this is one of myfavorites! Love reading about the mounted librarians, and Ms. Moues brings the life of these women into living color. So moving and gripping you won't want to let go.",
    "post_time": "Reviewed in the United States on October 23, 2019",
    "pid": "B07QQ3J91J"
},
{
    "title": "Wonderful story with strong female characters!!!",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first time reading anything by this author.  Had I realized she has mostly written romances, I'd not have bought the book and I would have missed this absolutely delightful page-turner.  Not only has the author created and fleshed out her characters, but she has also placed them in a time and location that actually had the library ladies who delivered books to remote residents in the 'hollers' and ridges of Eastern Kentucky.",
    "post_time": "Reviewed in the United States on July 31, 2020",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "She captures the rigid religious views and morality of the times between the Haves and the Have-nots, men and women, the whites and the 'coloreds', and the owners and the workers.  She places a young, privileged woman from England into a raw, impoverished area where. initially, she is laughed at for her accent and manners.  This changes as she becomes one of the women riding and delivering books to remote homesteads in the Appalachian mountains.  You will fall in love with the friends she makes as she learns to make her way in this alien culture.  The historical aspect is solid as is the story that fleshes it out.  I couldn't put it down and stayed up way too late to finish it.",
    "post_time": "Reviewed in the United States on March 23, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "loved every word",
    "rating": "5.0 out of 5 stars",
    "content": "This is a story about women who started a library in Kentucky for the people who lived up in the hills. These women rode horses up these mountains to bring the joy of reading. They were not always met kindly, there were moonshine operations to steer clear of after all.  Being an avid reader I really enjoyed this book and the many trials these women went through, along with friendships they made.",
    "post_time": "Reviewed in the United States on August 26, 2023",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved The Giver of Stars because of the strong characterizations, the descriptions of the mountains, and the part played by reading and books. I was surprised that so many of the characters liked reading, especially a novel like Little Women; it was not unusual for people to stop their education in the fourth grade. I have my grandmother’s text and although the vocabulary is definitely advanced for an elementary student, people had little time to read. The author doesn’t dwell on the hardships they faced, but women who raised gardens, canned, kept house, carried water from wells, and cooked meals had little leisure time. The oil lamps were expensive to use so everything had to be done between sun up and sundown. PThe author has definitely changed the grammar the mountain people, other than the community leaders who lived in town,used.  I found myself wondering how the author met the people of the area she thanks in the acknowledgements. And I thank her for her descriptions of the beauty of southeastern Kentucky.",
    "post_time": "Reviewed in the United States on October 26, 2020",
    "pid": "B07QQ3J91J"
},
{
    "title": "Appreciation for an engrossing novel set in a beautiful part of the country",
    "rating": "4.0 out of 5 stars",
    "content": "I liked a lot about this book. It’s prose is pretty, the characters compelling, the story itself pretty great. I was interested from the first chapter, which doesn’t always happen, and my cold little heart warmed at some of the character interactions.",
    "post_time": "Reviewed in the United States on March 3, 2021",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "However, toward the late middle/end is where the author lost me. Maybe it’s just me reading it in COVID times, longing for something happy to read, but in a book about the power of books and relationships, I think it’s important to linger on the heartwarming bits. I know that’s not realistic, but what the author did with an absolutely insane amount of drama was even less realistic. Thankfully, my attachment to the characters involved was strong enough that I still liked the book, but the second half of events were puzzling, frankly unbelievable, and really pulled focus from the book’s stronger parts.",
    "post_time": "Reviewed in the United States on March 19, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "Pretty good",
    "rating": "4.0 out of 5 stars",
    "content": "Still, an entertaining, if not entirely satisfying, read.",
    "post_time": "Reviewed in the United States on July 19, 2023",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book had great promise in the beginning; however,  the conclusion was simplistic and formulaic.  Additionally,  some characters seemed flat and not well-developed.",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "B07QQ3J91J"
},
{
    "title": "Meh for The Giver of Stars",
    "rating": "5.0 out of 5 stars",
    "content": "I have enjoyed all the books I've read by JoJo Moyes: My favorite has been \"Me Before You\"",
    "post_time": "Reviewed in the United States on December 20, 2023",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Was recommended by a friend and she was right, it's a great book.  Will now read more of this author's books.",
    "post_time": "Reviewed in the United States on October 15, 2023",
    "pid": "B07QQ3J91J"
},
{
    "title": "Very pleased!",
    "rating": "5.0 out of 5 stars",
    "content": "Don't start this book if you have things to do; I am way behind.  Characters are wonderful, you become engaged with all of them.",
    "post_time": "Reviewed in the United States on September 25, 2023",
    "pid": "B07QQ3J91J"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book and all books about strong women. My church family is going through a change that is questioning the importance of women in the pulpit right now so I was very happy to read a book where the women were listened to and their word was valuable!",
    "post_time": "Reviewed in the United States on January 28, 2024",
    "pid": "B07QQ3J91J"
}
]