[
{
    "name": " The Guardians: A Novel ",
    "stars": [
        "64%",
        "25%",
        "8%",
        "2%",
        "1%"
    ],
    "pid": "B07R8W9QZ5",
    "ratings": "83,607 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "Very excellent read!",
    "rating": "5.0 out of 5 stars",
    "content": "An enjoyable read with many twists.  So glad I read it!  Was hard to put down.",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "  Thank you John Grisham.",
    "post_time": "Reviewed in the United States on October 19, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Literally Guilty Until Proven Innocent",
    "rating": "5.0 out of 5 stars",
    "content": "John Grisham's latest legal thriller, \"The Guardians,\" traces the steps of Cullen Post and the other lawyers and investigators of a nonprofit organization dedicated to proving the innocence of incarcerated persons who were wrongfully convicted.  The Guardian Ministry has a track record of having secured the release of 8 persons. This case concerns Quincy Miller, who has been on death row for 22 years.  The evidence against Miller, accused of murdering his divorce lawyer,  seems so sketchy, but once a jury found him guilty, it is exceedingly difficult to undo the damage.  As Post investigates, he realizes he is up against an elaborate conspiracy featuring well-connected players with deep pockets who will go to any lengths not to have Miller exonerated.  Post's efforts are complicated by shortcomings of the  initial investigation, planted and missing evidence, the perjury of witnesses, crooked local officials,  prison gangs, and drug cartels.  True to his typical writing style, Grisham provides a  straightforward, fast-moving pace, with intricate details and subplots that will make a reader wonder if it is too late (or too dangerous) for the Guardians to  uncover the real culprits so that Quincy Miller can be set free. According to the author's note, this book was inspired by separate true events.",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Enjoying his characters and plots!",
    "post_time": "Reviewed in the United States on October 21, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "New author!",
    "rating": "4.0 out of 5 stars",
    "content": "Now days when I start to read a new John Grisham it feels sitting down in your big overstuffed chair and you get situated and comforted to start a new adventure with your long lost friend.",
    "post_time": "Reviewed in the United States on February 15, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This story follows Cullen Post a public defender who has an emotional breakdown and leaves law work. His recovery path leads him to a man of cloth. He spends part of his time visiting people in prison and running a prison ministry. While he conducts his ministry he runs into various who claim to be innocent. There are some that stand out but one in particular that peaks his interest and so he ends following his true calling with his first successful overturned wrongful conviction and release of a long term inmate. This follows along about 6 or 8 cases that working on in various stages with the goal to have the same results. This being said there were times I felt I needed a score card to keep track of all the individuals. But this book really follows one case in particular. This story has a lot of twist and turns and just like most of Mr. Grishams other books it is a pretty easy read that keeps your attention. I would definitely recommend this book",
    "post_time": "Reviewed in the United States on January 20, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Another great Grisham read",
    "rating": "4.0 out of 5 stars",
    "content": "This isn't a thrilling fast read, but it is a book well worth reading.  The basic premise involves a charity that functions as a legal firm finding prisoners who were found guilty and jailed even though they were actually innocent.  It delves into some of the ways juries can be misled, and how difficult it can be to undo the damage of wrongful convictions based on lies, unscientific \"expert testimony\" and an unhealthy desire to \"close the case\" no matter how poorly that is done.",
    "post_time": "Reviewed in the United States on October 18, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book is a little slow, but it does educate and provide hope.  You do see several good people saved from that system after years and years of suffering in prison.  You see kindness winning over greed and evil.  You see forgiveness in full flower.  Sometimes it takes a bit of a drag to get to those things, but a little judicious fast reading through a few pages solves that problem  In the end it isn't a thriller with a fast paced surprise ending, but it is educational, inspiring and the very end is absolutely wonderful.  Don't read the last page  - save it so you can savor it as the perfect ending to this story.",
    "post_time": "Reviewed in the United States on April 4, 2022",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Slow read, but good",
    "rating": "2.0 out of 5 stars",
    "content": "First, let me say that I would have easily given this book 5 stars if there had not been so many characters to follow.  That being said, this was an amazing book full of mystery, controversy and even inspiration.  Based on a couple of true stories, the book really makes you think about how many people have been wrongly accused and put to death.  I know better than anyone, thanks to a very good friend of mine, that some cops are dirty.  They will trump up charges, allow prisoners to roast in hell for crimes that they did not commit; it doesn't just happen in movies..  This is just one of those books that makes you realize that no matter how we fight it, racism and other forms of intolerance cloud people's thinking, even the ones that have sworn to uphold truth and justice.  Grisham does an amazing job of bringing injustice in society and in the legal system to the forefront.  In this way, the book inspires me to fight these unfair practices because, in the end, it is our moral duty to fight for those who cannot fight for themselves.",
    "post_time": "Reviewed in the United States on December 11, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is one of Grisham's better books. Twists and turns until it all comes together in a surprising end. Good read.",
    "post_time": "Reviewed in the United States on January 23, 2024",
    "pid": "B07R8W9QZ5"
},
{
    "title": "snoozer",
    "rating": "2.0 out of 5 stars",
    "content": "Silly stereotypes without any effort at character development. Outcome telegraphed from the outset. Illogical plotting. Even a haunted house for extra laughs. Boat payment.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I chose a 5* rating because  there wasn't a 10*!  I use to read all of John Grishams books but slowly veered in a different direction. Thank goodness I decided to read 'The Guardians'. It kept me riveted from beginning to end. I found how little I understand about how the justice system really works, how uneducated I am in the processes of attempting to free those wrongly convicted. Because the book is based on fact it became even more intriguing and educational. I bought a hard cover and gave to one of my adult children who works in the courts. I then bought the kindle edition for myself. This is by far one of the top reads for me this year, 2019!  And as Amazon knows, I'm a purchaser and reader of many books 📚.  Thank you Mr. Grisham for giving me a wonderful look into the criminal justice system, and a brief look into the time invested fighting for wrongs to be corrected.. A must read for those who need a better understanding of the plight of those wrongfully convicted and sentenced to prison, as well as those who are ordered to pay for crime they may be innocent of, through execution. For the innocent, may truth be found.",
    "post_time": "Reviewed in the United States on December 3, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Riveting!",
    "rating": "5.0 out of 5 stars",
    "content": "I received this book from Amazon and read it in 2 days.  It would have been sooner; however, I do have life to live.",
    "post_time": "Reviewed in the United States on October 18, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The plot, characters, and action of this novel are simply perfect.  They merely needed John Grisham to bring them to life as a legal thriller.  How exciting can a novel about death row convicts regaining their freedom and being declared innocent be?  In this instance, it can all be pretty exciting and enlightening.  The novel is a page-turner from the beginning; and it never lets up.  We readers see a number of death row inmates reclaim their freedom, while we get a intensive look into our American justice system's failures in assuring that the innocent go free and the guilty face justice.  Thank God for organizations like Centurian and the Innocence Project.  Justice would not work without them!",
    "post_time": "Reviewed in the United States on December 11, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "MASTERFUL",
    "rating": "5.0 out of 5 stars",
    "content": "Other reviewers have commented that other Grisham novels have not been up to par; but I have found his novels remarkably consistent in quality, although varying in legal topics.  Each is a lesson in what the American Judicial System really is and how it works in the real world.  That is a unique service that Grisham provides for us all.",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My congratulations on another stunning achievement for John Grisham; and I personally hope to be reading many more of his novels to come.  Can the movie of this one be far behind????",
    "post_time": "Reviewed in the United States on August 24, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Not the typical Grisham legal thriller",
    "rating": "5.0 out of 5 stars",
    "content": "John Grisham is one of my favorite authors and I have read all of his legal thrillers, excluding the Theodore Boone series.  The Guardians distinguishes itself from his former legal thrillers in that it focuses on legal exoneration--getting convicted murderers exonerated after years and decades of serving time for a crime not committed.  This book is about social injustice, why it occurs, and how devastating it can be on a human being's life.  It is also about lawyers who work for years without the high compensation of most lawyers to see that people wrongly convicted have a shot at freedom.  Cullen Post is one such lawyer--a good man using his talents and limited resources to right serious wrongs.  Because of the nature of the two main cases in The Guardians, the typical legal intrigue in a Grisham legal thriller is missing.  That said, the book is very interesting and informative about a serious issue in America--legal injustice, especially for black males.  The last 30 pages of the book are worth the price of the book.  I highly recommend The Guardians.",
    "post_time": "Reviewed in the United States on February 18, 2024",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Read like a charm, just like a great book should. A lovely mix of lawyer lingo, suspense and a bit of humor. Thank you John",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B07R8W9QZ5"
},
{
    "title": "utterly fantastic",
    "rating": "4.0 out of 5 stars",
    "content": "Another enjoyable read from Grisham. My wife enjoys watching those true crime shows on tv and this book read like it could have been an episode on one of the shows.",
    "post_time": "Reviewed in the United States on March 18, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have traveled some of the roads that Mr Post traveled in this book and was exhausted reading how he rode them over and over in such short periods of time.  He made it sound like Orlando to Savannah was like going to the corner store.",
    "post_time": "Reviewed in the United States on November 2, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Slow build, but satisfying finish",
    "rating": "4.0 out of 5 stars",
    "content": "I haven’t been reading for a while. It took me a little time to catch my rhythm. But, Grisham never disappoints me.",
    "post_time": "Reviewed in the United States on August 17, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this book as a gift for my sister.  She is a fan of his books and I know she will enjoy reading it.",
    "post_time": "Reviewed in the United States on January 21, 2024",
    "pid": "B07R8W9QZ5"
},
{
    "title": "The Guardians",
    "rating": "5.0 out of 5 stars",
    "content": "I heard about this case about a month ago watching one of the t.v. news magazine shows. Grisham had been on the outskirts of the trial, a school principal had been charged with murdering his wife even though he was at an educational seminar hours away from his home and had numerous witnesses placing him at the seminar at the time the murder took.place. The man was put in prison for over 20 years for a crime he didn't commit. Mr. Grisham said it played a big role for writing this book. Although I had read this book when it first came out I couldn't recall reading this. This story is eye opening on the way innocent people are put in prison for crimes they did not commit. It grabs you from the start and keeps you reading to see what happens. I highly recommend this book!",
    "post_time": "Reviewed in the United States on November 1, 2021",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I",
    "post_time": "Reviewed in the United States on September 24, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Grisham is good !",
    "rating": "4.0 out of 5 stars",
    "content": "This book was a page turner. I found myself routing for the characters and for the lawyers to right the wrongs of the justice system. Even though this was a work of fiction, wrongful convictions happen in our society all the time. I'm happy there are organizations like the fictitious Guardian who spend countless hours working to free those wrongfully convicted.",
    "post_time": "Reviewed in the United States on December 7, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am a great fan of John Grisham's, but this book was a disappointment and certainly not among his best.  I found it tedious, too much thrown together, and not compelling enough to hold my interest without my forcing myself to finish it.  Learning more about the many innocent people wrongly incarcerated was interesting and definitely worthy of Grisham's publicizing.  But raising many threads and not following them to finish (the other current Guardians' clients described, then dropped; the evil cartel never followed up on to conclusion) is not good writing, nor are the hodgepodge of Gothic novel scariness (the haunted Kent house), the random characters who just stop by to offer pieces of the mystery history the main character needs, and the unnecessary and gruesome torture scene (doesn't lead anywhere and the character who brings it to us is dropped out of the novel).  The book went on too long and was too coincidental, full of disjointed, episodic events, and not compelling.",
    "post_time": "Reviewed in the United States on March 9, 2024",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Great read",
    "rating": "2.0 out of 5 stars",
    "content": "Well described, fast delivery, a great story line.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I was having trouble reading this book when on page 57 there was this regarding pridons, \"In black America, they are too often used as warehouses to keep minorities off the streets.\". I do not need to read someone's distorted and biased social commentsry. I stopped reading.",
    "post_time": "Reviewed in the United States on April 17, 2022",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Not Grisham's Best",
    "rating": "4.0 out of 5 stars",
    "content": "Grisham is great. The stories are good and heart wrenching. But, instead of drama, the book should be classified as fantasy. First, this great ending rarely happens. Even people wrongly convicted die in prison.  Secondly, why must there always be a white savior? Is white guilt at work here trying to compensate for past wrongs?  And lastly, Grisham left a lot of cases here open.  Is there another book in the works?  I liked the book while I was reading it. But after I finished, and reflected. I came up with these thoughts.",
    "post_time": "Reviewed in the United States on August 3, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book started at a very slow start but it picked up in the 2nd half.",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Probably not his best",
    "rating": "3.0 out of 5 stars",
    "content": "Grisham tells the story of former lawyer and minister Cullen Post who founded Guardian Ministries, a non-profit that attempts to reverse unjust imprisonment of a select people. The story centers on the killing of a lawyer, Keith Russo, in a small Florida town. Post believes Quincy Miller, a black man who has been serving 20+ years in prison for Russo's murder, is innocent. That Quincy was set-up.",
    "post_time": "Reviewed in the United States on January 17, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "All good...so far. Part of my issue with the story as it unfolds is both how it is told and the pace/plot. Grisham uses first-person present tense, not a common use in novels today, but not unheard of. About halfway in or so, he seems to get stuck by this choice. There are a number of chapters later in the book where Post is apparently just telling what is happening in scenes where he is not present. Scenes necessary to the plot. Or maybe Grisham is just telling us, I'm not sure. Either way, those chapters take away the immediacy of seeing the action through the first-person protagonist. You feel like someone is just telling you a story rather than feeling a part of it. And the story itself really lacks suspense. I won't give away what happens, but its definitely not surprising. Plus there are places where its kind of disjointed as well. Your not quite sure which story-line Grisham is pushing. Not your typical suspense/thriller/mystery that builds to a worthy climax.",
    "post_time": "Reviewed in the United States on December 27, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Miscarriages of Justice - Deeply disturbing",
    "rating": "5.0 out of 5 stars",
    "content": "I liked the characters and the premise. But the book was just average at best.",
    "post_time": "Reviewed in the United States on December 28, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Think of being jailed for 23 years for a crime you did not commit. Think about being framed by the people who are sworn to uphold the law. Unimaginable how your entire life is lost to you. This is what happened to Quincy Miller.",
    "post_time": "Reviewed in the United States on November 18, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Fast Paced, Real, Inspirational",
    "rating": "5.0 out of 5 stars",
    "content": "In this deeply disturbing book about the miscarriages of justice in the United States, of the number of people languishing in jail and even being executed, for crimes they did not commit, Grisham explores this shameful side of the US justice system. The ‘hero’ of this book, Cullen Post and his three colleagues have made it their life’s mission to identify such cases and try to correct the miscarriage of justice. The book also explores the heartlessness of the system that refuses to accept its mistakes and the corrupt and scary prison system made even more so through privatization.",
    "post_time": "Reviewed in the United States on October 30, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Written in a subdued low key style, the impact is even more on the reader. Grisham at his best.",
    "post_time": "Reviewed in the United States on October 29, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Another Grisham Page Turner",
    "rating": "5.0 out of 5 stars",
    "content": "Do read.",
    "post_time": "Reviewed in the United States on August 27, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "First the cons: I am not a religious person and the religious slant was not to my taste. However, it never reached the level if proselytizing; it was merely a minor part of the makeup of some of the characters. It was never overbearing.",
    "post_time": "Reviewed in the United States on November 1, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Excellent",
    "rating": "5.0 out of 5 stars",
    "content": "The pros: people, mainly lawyers, working on correcting mistakes made by our judicial. These were easy cases to see where misappropriations of Justice that involved graft, lying and self interest perverted the spirit of our legal system.",
    "post_time": "Reviewed in the United States on December 1, 2022",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": " The story deals with real miscarriages of Justice and enlighten us to the need of the many organizations that our protagonist interacts with and the financial struggles under which they struggle. But it is also a story of good versus evil, right versus wrong and the enormous good we can do in supporting the right organizations in order to make the United States a better place to live.",
    "post_time": "Reviewed in the United States on January 18, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "I've been a Grisham fan since the early days and this is just another good story by a good storyteller.",
    "rating": "4.0 out of 5 stars",
    "content": "It's also a sad reflection on justice for blacks in America. It's hard for me to see how reparations could ever be enough to erase all the injustice.",
    "post_time": "Reviewed in the United States on March 5, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book plot is simple and the threads weave together one by one. There are scary moments like sketchy back roads in the deep South where beat up pick-up trucks sporting gun racks appear in the rearview mirror. The characters are believable, even if they are  painted with broad word strokes.  Grisham lets readers know the origins of the story in the Afterword and he deserves a few rounds for the gentle pitch to readers to do good for those seeking to right enormous wrongs. Yeah, if Texas is such a great state it should lock up it's judges & their taxpayer-funded crooks that turn justice on her head.",
    "post_time": "Reviewed in the United States on February 13, 2024",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Good book",
    "rating": "5.0 out of 5 stars",
    "content": "I like Audio books for road trips.",
    "post_time": "Reviewed in the United States on November 4, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Well written with generally believable action.  Not a roller coaster, page turner but a plausible unrelenting, well  paced tale of justice prevailing over a corrupt frame-up conviction from the past.  A small town justice system (corrupt sheriff, racist judges, etc.)  ensure that the murder of a lawyer is punished by sending an innocent man to prison for life based on manufactured evidence and false testimony.  Obviously not a new plot, but the remorseless logic followed by a lawyer dedicated to reversing wrongful convictions, along with the dangers he and his small coterie face in tracking down the evidence needed to prove his case makes for a compelling read.",
    "post_time": "Reviewed in the United States on November 19, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "A Good Read - Grisham at a Slower Pace",
    "rating": "4.0 out of 5 stars",
    "content": "Finally, this was all the more a pleasure to read as I didn't know what Grisham's political views were when I finished - which is exactly the point.  I'm getting sick of paying for novels by writers who have already established their reputation, but feel compelled to incorporate partisan political opinion in their fiction.",
    "post_time": "Reviewed in the United States on January 13, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have always thought that John Grisham's writing style was somewhat dry, sounding more factual in its descriptions than other authors who tend to use many mores adjectives and flowery language to create an image in the readers mind. This is just what one would expect from a lawyer. All that being said, Grisham still elicits those images in a more straightforward manner. He makes you feel like you know his characters, the settings his stories take place in, and the stories themselves are gripping and compel me to keep reading even when I know I have other pressing obligations to attend to. I have been a fan all along and read every book, usually starting as soon as it is released, for years I read the hard covers, and more recently, the electronic version. The Guardians is another example of his best, this time including a message about a noble cause, and based on fact. I  highly recommend it to anyone who likes to read any type of fiction.",
    "post_time": "Reviewed in the United States on September 23, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Another winner",
    "rating": "5.0 out of 5 stars",
    "content": "This book is fiction but based on a real organization.  I read this book at year's end and it really inspired me to do meaningful work and be a better person.  The main character in this book has a law degree and chooses to use it in a most meaningful, but low paid and tough role.  He helps free innocent criminals on death row and with life sentences.  The fact that there are people in the world who do such work with such personal sacrifice really made me think.  I loved that part of the book.  The actual criminal plot and plot line began to drag about 2/3 of the way through the book and was not as powerful to me as the main characters in the story.",
    "post_time": "Reviewed in the United States on November 17, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After the unimaginative fluff of Camino Winds, John Grisham returns to what he does best:  Writing a legal thriller which, though fiction, is thoroughly grounded in reality.  In an afterword, he identifies a couple of real-life cases in which innocent people have been incarcerated and dedicated lawyers have fought to exonerate them.  Cullen Post, the protagonist, is a lawyer turned priest turned lawyer again.  Because of this, he has a depth of commitment not often seen in attorneys.  His work with Guardian Ministries (read The Innocence Project) is indeed holy work, and it takes him on long road trips across the modern South.  Post, as he prefers to be called, runs down witnesses who lied in the trial which put his client in prison for life twenty-three years ago.  There are some surprising twists, some colorful characters on both sides of the law, and an immensely satisfying ending.  Highly recommended.",
    "post_time": "Reviewed in the United States on September 23, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "This Book Inspired Me!",
    "rating": "5.0 out of 5 stars",
    "content": "As a lawyer I'm always dismayed by how little the general public understands  about the legal system which has been forged in this country to protect their rights. It's often not until average folks come face to face with justice, whether as a party to a claim, a victim of injustice, or juror, do they really begin to understand what's at stake and how easily the law can be misused and justice denied! John Grisham's  latest novel provides an opportunity for all of us to consider how important affording equal protection and treatment to all is in this system as well as how important checks and balances are both before and after a conviction.  This book is a sobering reminder that there are dedicated lawyers who face extraordinary hurdles every day to protect and defend us yet receive little in return for their dedication. Hopefully this will change, but for now supporting their efforts is up to the rest of us.",
    "post_time": "Reviewed in the United States on November 8, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Had you on pins and needles near the end thinking something just to go wrong or he gets killed in a car wreck but that didn't happen .  Always like John Grisham excellent writer",
    "post_time": "Reviewed in the United States on November 28, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Another",
    "rating": "5.0 out of 5 stars",
    "content": "Another good read by Grisham.  Enjoy certain authors and he is defying in drawn to, and will read when I see a new book out.",
    "post_time": "Reviewed in the United States on October 21, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "There are many stories nowadays about wrongly convicted people being exonerated and released from prisons. Thank God these dedicated groups of people work toward this and are able to get some freed. This is not an easy thing to do, it takes a lot of work and a lot of smart people.",
    "post_time": "Reviewed in the United States on February 4, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "The premise is great, but ...",
    "rating": "4.0 out of 5 stars",
    "content": "So I loved the idea of this book, especially with the main character also going to seminary and becoming a priest. That meant something to him during a low time of his life. I was disappointed to see that he only wears the collar when it is beneficial for him to get into a hospital or prison. He doesn't act like an Episcopal priest, doesn't pray, or act thankful that Priesthood saved him from an ugly breakdown. There is a lot more to it than just the collar.",
    "post_time": "Reviewed in the United States on May 3, 2022",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My other concern with the book is how flat the characters are. None of them really stand out or have remarkable personalities. Many of the characters could have played the same role,  just switch the names around.",
    "post_time": "Reviewed in the United States on September 18, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Guardian",
    "rating": "5.0 out of 5 stars",
    "content": "This was not my favorite Grisham book, and I had to make myself stay with it and finish it, even as I have other, more tantalizing books on the shelf ready to be read.",
    "post_time": "Reviewed in the United States on November 29, 2021",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Really enjoyed The Guardian book.  Mr. Grisham writes extremely well and makes the story very realistic.  It’s easy to follow, but I felt it was drawn out a bit too much.  Every chapter brought in another person of interest just when I expected the case to come to a close.  Sad and frustrating story, yet very interesting.",
    "post_time": "Reviewed in the United States on April 26, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Gresham has never let me down",
    "rating": "5.0 out of 5 stars",
    "content": "This book kept me guessing.  I enjoyed the read. I have read most of the Grisham's. Books. First for a while. My next one will  be another",
    "post_time": "Reviewed in the United States on March 9, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a wonderful story about justice finally being served but also about a broken system that allowed innocent men to be wrongfully convicted and imprisoned for decades. Post is one of a kind and will do just about anything to prove these men are innocent. I love to hear how he gets peoples trust and helps win the cases with old witnesses and lots of traveling for evidence and statements. I loved the story and helps me confirm that I want to pursue a career in forensic nursing so I can help show the truth as well in cases that I may one day be a part of.",
    "post_time": "Reviewed in the United States on April 6, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "makes you want to work for Guardians 🙂",
    "rating": "4.0 out of 5 stars",
    "content": "A little slow initially, but developed quickly for a great ending. **Don't forget to read Author's Note at end. **",
    "post_time": "Reviewed in the United States on May 2, 2021",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this book to read on vacation. Haven’t read a Grisham book in over ten years…The Guardians is similar to the other Grisham books I’ve read which is fine with me. Had me in tears a couple times which means I connected with the characters and he knows how to tug on the heart. At least mine.",
    "post_time": "Reviewed in the United States on January 2, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Different than my usual fare, but a very interesting read.",
    "rating": "5.0 out of 5 stars",
    "content": "I always shy away from legal fiction, because (1) it tends to get factual things wrong, which is irritating, and (2) it’s too much like my day job. Grisham is usually pretty good about the first one, only cutting corners where it makes sense to do so, and explaining the real procedures would add nothing to the story. But 2 has been an issue for me in the past. This story, though, was far enough away from anything that I do on a daily basis that it wasn’t a problem.",
    "post_time": "Reviewed in the United States on December 28, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The story itself is great; it’s inspiring and funny and interesting. The characters are believable, though some are a bit flat. The only negative was the downer that the book gives when you realize just how significant it is that people really are wrongfully convicted, and their ability to escape is often nonexistent.",
    "post_time": "Reviewed in the United States on April 22, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Couldn't put this book down",
    "rating": "4.0 out of 5 stars",
    "content": "John Grisham never fails... Not only does the reader get a great story, a plot that builds and evolves to places I never thought could be so interesting, you learn a lot about our current judicial system, how our taxes are used to fund jails,  organisations in our society that really make a difference.  I could not put this book down, it's awful to have to stop reading to feed your spouse or answer the phone. You want to stay in \"The Guardians\" world. Took me 2 1/2 half days to read the book.  The characters are so very well filled out, I wish I could take them to lunch and get updates on what they are doing.",
    "post_time": "Reviewed in the United States on January 19, 2022",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I liked this book, built for me it got a bit bogged down in spots. The last third made the whole thing worthwhile, so I’m glad that when it got muddy, I just took breaks and didn’t quit. If you’re a fan of Grisham — and I am — you’ll enjoy reading this.  The end is… nope. I’m not gonna spoil it.",
    "post_time": "Reviewed in the United States on August 30, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Slow patches",
    "rating": "3.0 out of 5 stars",
    "content": "Not as convoluted as some of his books. I enjoyed the straightforward storyline though, they can't all be mazes and sometimes simpler is better. As usual, great story with likeable characters.",
    "post_time": "Reviewed in the United States on November 12, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have every book John Grisham has written.  All first editions.  Living where I do, Memphis, I am always interested in the latest one.....he always weaves Memphis into his writings.....best of all \"The Firm\"! But this book is outright boring.  Usually I await the arrival of the book (thanks Amazon!) and read it in two days.  Not this one.  I had to force myself to read it.  At page 250 or so I almost put it away with the others.  But, that would be, I guess,  sort of treason.  The main character, Cullen Post, is like a cut out.  The others just do not jump off the pages. Every thing is sooooo very predictable.  I never review the plot of any book I review on Amazon because it can ruin it for others.  Grisham's other books were never all that predictable.  Usually I can cast a movie in my head while reading his books.  Not this one.  So, I shall await another more exciting book from Mr. Grisham in the future.  He should return to the \"old days\"!",
    "post_time": "Reviewed in the United States on March 24, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "For the most part this is a really great book. My one complaint is how things were tied up at the end. Quincy is being pursued relentlessly by the cartel and then it just stops. I get that a couple of main characters are now either incarcerated, awaiting trial or in hiding... so why bring in Russo’s ex wife and her cartel husband Ramon if they don’t care enough to pursue things once it starts unraveling. Grisham either needed to tie up that loose end  or he shouldn’t have introduced it in the first place. Seems like it’s still out there dangling. I’d still recommend the book. Very entertaining.",
    "post_time": "Reviewed in the United States on November 1, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I am not one to want to read books with a partisan view of what is going on today. We get enough of that every day, 24/7 in the news. Justice reform is very much in the news and justifiable so, and i was wondering if this would be another partisan book. It was not. It was great. It brought attention to this cause with a very interesting layout of how a very innocent person could be framed up and by the people who are supposed to be fair. I love that it brought much needed attention to the innocent project. This story was based on a true story. Thank goodness for lawyers who will try and do the right thing vs. being only about the money. It was a fast read and i never wanted to put it down. Loved it",
    "post_time": "Reviewed in the United States on December 28, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Not Your Typical Grisham",
    "rating": "5.0 out of 5 stars",
    "content": "Cullen Post a Lawyer and Episcopal Priest works for Guardian Ministries  a Pro Bono non profit that specializes in attempting to overturn the convictions of men that have been imprisoned for 15-20 years that in fact were innocent. In most cases the men that were convicted are black and were convicted by white police, white judges and all white juries. The book deals with such a person Quincy Miller who is serving a 23 year sentence . There are a lot of moving parts in this book lots of names and lots of locations you have to pay attention.  Overall it’s a good read so you should read it",
    "post_time": "Reviewed in the United States on June 5, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Grisham's characters are not only introduced and developed as the book progresses, I couldn't help but  love them.  I was drawn into the story of each person on death row.  I was moved by the story of the women running this local innocence project!",
    "post_time": "Reviewed in the United States on August 11, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Good Read",
    "rating": "4.0 out of 5 stars",
    "content": "I've enjoyed John Grisham's fictional legal novels over the decades - this book was no exception.  The storyline has a bit more of a window into the background logistical detail of the Innocence Projects than I might have preferred, but it never completely got in the way of the fictional plot line.  The final chapters of the book are \"classic\" Grisham...building suspense and a sense of urgency to \"beat the clock\" and deliver - what the reader hopes will be - a fair and just conclusion.",
    "post_time": "Reviewed in the United States on March 13, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "So, a fun ride in the quest for justice for an innocent man. (That awful scene of torture with the bag of bloody chickens and two naked boys (why two?) being tossed into a river of crocodiles was over the top!). But the deliberate unfolding and discovery of events that led to the wrongful conviction is well-paced. There is the final courtroom retrial which is satisfying, too. But we've seen this from Grisham before... I had fun reading this as the pace doesn't lag. Interesting characters, but so many colorful Southern lawyers and lawmen. Hard to keep track of who is who... There will be a movie soon, no doubt...",
    "post_time": "Reviewed in the United States on October 26, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "A new but old Grisham thriller",
    "rating": "4.0 out of 5 stars",
    "content": "There is a lot to learn before feeling like it is easy to read.  When all the players are in place, the book really takes off.  It is a beautiful idea to help those innocent people who have been judged guilty and incarcerated.  It is an amazing story that Grisham wrote about all the possible things someone goes through to prove the incarcerated person is innocent.  More power to them.  A great book.  It just took me a while for the book to get a hold of me!",
    "post_time": "Reviewed in the United States on January 17, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "As always, Grisham delivers a first class novel. The Guardians is a crisp easy read that keeps the reader turning the pages. There is one flaw. While describing one of the characters, Mazy Ruffin, Grisham refers to her educational background noting that she attending Morehouse College. Morehouse, a HBBU, is a traditional male private university. Mazy would have been allowed to take classes as part of the consortium of schools in that area but she would not have been a graduate. It's a small oversight but it caught my attention. Otherwise, this is a great book.",
    "post_time": "Reviewed in the United States on January 3, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "The Guardians",
    "rating": "5.0 out of 5 stars",
    "content": "This is one of Grisham’s best books. I have read many of his works and this book not only reveals his knowledge of the law, a back story that’s entertaining",
    "post_time": "Reviewed in the United States on August 15, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had never heard of groups like \"the Guardians\" before. Now I want to support these advocates for the innocent.",
    "post_time": "Reviewed in the United States on September 24, 2023",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Incredible Read",
    "rating": "4.0 out of 5 stars",
    "content": "Good tale, well told.  Learned a lot about prison and court system, if book is accurate.  The characters could have been developed with more depth.  Dramatic parts were \" over the top\" and gripping.  Some sub plots were left dangling but the main threads were developed very well and told well.  It was a \"page turner\" but did not have me sitting on the edge of my seat. This is a good book but not one of Grisham's best because he sets a high  standard.",
    "post_time": "Reviewed in the United States on August 7, 2020",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Recommendedhowever.",
    "post_time": "Reviewed in the United States on December 23, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "outstanding",
    "rating": "5.0 out of 5 stars",
    "content": "I hadn't read a Grisham in years but a recent review of this latest book claimed that the author, despite keeping up the grueling pace of writing/publishing a book a year for decades, was still delivering tales with originality and interesting plot twists.",
    "post_time": "Reviewed in the United States on October 29, 2019",
    "pid": "B07R8W9QZ5"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Hmm - I'm not so sure.  This one reads more like an attempt to use the novel as a vehicle to increase awareness of the various projects and organizations now active in the field of \"innocence law\" - i.e. clearing and freeing people who have languished in prison for years, convicted of crimes they didn't commit.  That is undoubtedly a great cause that we should all applaud. (Clap, clap!)",
    "post_time": "Reviewed in the United States on February 16, 2022",
    "pid": "B07R8W9QZ5"
}
]