[
{
    "name": "        Tai Chi Fit OVER 50 3-DVD Set (David-Dorian Ross Tai Chi DVD Bestsellers) Tai Chi Beginner workouts include Standing, Seated, and Balance Exercises **Chair Exercise**Perfect for Beginners and Seniors       ",
    "stars": [
        "60%",
        "22%",
        "9%",
        "0%",
        "9%"
    ],
    "pid": "B07YNSMG81",
    "ratings": "48 ratings",
    "other_info": {
        "Genre": "Exercise & Fitness, Special Interests, Sports, Faith & Spirituality",
        "Format": "DVD",
        "Contributor": "YMAA Publication Center, David-Dorian Ross",
        "Runtime": "2 hours",
        "Studio": "YMAA Publication Center"
    },
    "discount_price": "$ 35.",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Good videos to learn",
    "rating": "5.0 out of 5 stars",
    "content": "Am 65 and have some balance issues.  My husband has some health issues.  I find that the standing tai chi is easier for us rather than the sitting.  Although both are good.  We are new to tai chi and sometimes he seemed to go a little fast for us on sitting.  But I think it’s because we are learning.  Nice set of 3 videos.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B07YNSMG81"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love David Dorian Ross; he makes learning Tai Chi easy to learn and follow. Unfortunately, one disc, Tai Over 50 balance disc, workout 2 is not working—the disc freezes 1/3 way through workout 2, I've tried everything to get it to work, cleaned the disc, stop and start, take disc out and start again, nothing works. Disappointed because that workout uses the balls which I was hoping to do.",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "B07YNSMG81"
},
{
    "title": "Great but..",
    "rating": "5.0 out of 5 stars",
    "content": "This set was shared between myself (55 yrs) and my mom (85 yrs). It's great because there are workouts for both our abilities. My mom has a hard time hearing or understanding ESL instructors. This instructor has a standard American English accent so that helped her. The sequences were easy and varied.",
    "post_time": "Reviewed in the United States on April 10, 2021",
    "pid": "B07YNSMG81"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this set from a recommendation by one of my fitness pals. I have never done TaiChi before, so this was all new to me.  I can’t compare them to anyone else’s,  but I enjoy working out with them.",
    "post_time": "Reviewed in the United States on March 10, 2020",
    "pid": "B07YNSMG81"
},
{
    "title": "Great for anyone",
    "rating": "1.0 out of 5 stars",
    "content": "The videos/DVD's don't play on PC",
    "post_time": "Reviewed in the United States on July 5, 2022",
    "pid": "B07YNSMG81"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I liked this set of DVD's. They were useful. I'm a long-time runner and biker. I haven't given Tai Chi, yoga, or the martial arts much credit over the years.",
    "post_time": "Reviewed in the United States on August 11, 2023",
    "pid": "B07YNSMG81"
},
{
    "title": "Tai Chi for Over 50",
    "rating": "5.0 out of 5 stars",
    "content": "But now that I'm older and need something vigorous that isn't too straining, that isn't too much of an energy sapper, I've turned to a more gentle means of strength and flexibility training.",
    "post_time": "Reviewed in the United States on May 3, 2022",
    "pid": "B07YNSMG81"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "These videos do what they purport to do: they instruct you in the basics of the practice. They show you exactly what you need to do, how and how long to do it, where to start, what to work your way up to, etc. I generally liked the presenter and the others in the videos were \"real\" people trying Tai Chi themselves, some of them, for the first time. They gave viewers what seemed like honest opinions of what Tai Chi moves to do and why/how they work.",
    "post_time": "Reviewed in the United States on October 26, 2022",
    "pid": "B07YNSMG81"
},
{
    "title": "Videos don't play on PC",
    "rating": "5.0 out of 5 stars",
    "content": "I recommend this set. But I gave it three stars because I'm pretty sure there's something better out there, at least for me. The lessons in these videos take a long while to get to the point. I thought the videos could have saved the viewer time by streamlining the examples of moves, and by cutting out at least half of the oral instruction. Several times while viewing I was saying to myself, \"Okay, okay. I get it. Move on!\"",
    "post_time": "Reviewed in the United States on September 11, 2022",
    "pid": "B07YNSMG81"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Ease of understanding and David's sense of humor.",
    "post_time": "Reviewed in the United States on October 18, 2022",
    "pid": "B07YNSMG81"
},
{
    "title": "Nice Intro to Tai Chi for Older Learners",
    "rating": "5.0 out of 5 stars",
    "content": "I did a little bit of Tai Chi a decade or more ago, and always wanted to get back into it. I found this set and figured I'd try it. I really like it because it's a routine that you don't have to think about. The instructor David tells you what to do. He's very level and even-keel throughout the videos. The nice thing is that after a few minutes, you can start feeling it. It's nice to help center your mind, slow your breathing, and get a little fitter in the process.",
    "post_time": "Reviewed in the United States on September 19, 2022",
    "pid": "B07YNSMG81"
},
{
    "title": "Gentle and Fun",
    "rating": "5.0 out of 5 stars",
    "content": "There are various 'forms' or movement patterns, and in this set, you don't have to learn the patterns because you're following the instructor. If you continue learning Tai Chi, you can dig into the various forms and learn them, but like I said, this is a great place to start.",
    "post_time": "Reviewed in the United States on September 14, 2022",
    "pid": "B07YNSMG81"
},
{
    "title": "Great set for those interested in at home Tai chi",
    "rating": "5.0 out of 5 stars",
    "content": "Tai Chi is supposed to have many healthy benefits that have been studied and proven effective. I'm willing to try lots of different things to increase my health. David has other video sets that I am definitely going to check out.",
    "post_time": "Reviewed in the United States on November 30, 2022",
    "pid": "B07YNSMG81"
},
{
    "title": "Delicious!",
    "rating": "5.0 out of 5 stars",
    "content": "This is a fun set for anyone, not just the fifty plus set. The instructor is clear and the routines are easy to follow. You will definitely feel better after doing them. Very low pressure and relaxed but remarkably effective. My mother had a stroke and the seated program is perfect for her. She just started the balance dvd too. Moving has helped her physically and mentally.",
    "post_time": "Reviewed in the United States on October 22, 2022",
    "pid": "B07YNSMG81"
}
]