[
{
    "name": "        Yocada Carpet Sweeper Cleaner for Home Office Low Carpets Rugs Undercoat Carpets Pet Hair Dust Scraps Paper Small Rubbish Cleaning with a Brush Purple       ",
    "stars": [
        "67%",
        "17%",
        "9%",
        "3%",
        "5%"
    ],
    "pid": "B086DBC2NN",
    "ratings": "2,689 ratings",
    "other_info": {
        "Brand": "Yocada",
        "Color": "Purple",
        "Product Dimensions": "11\"D x 7.87\"W x 2.76\"H",
        "Style": "Modern",
        "Model Name": "Yocada Carpet Sweeper Cleaner"
    },
    "discount_price": "$ 22.09",
    "normal_price": "$29.99",
    "about_this_item": [
        " Carpet Sweeper MULTIFUNCTIONAL: Safe and efficient on low carpets, rugs, undercoat carpets. Please DON'T use it on floors like hardwood, ceramic, tile, laminate, marble or glass. It only works best on carpets  ",
        " Carpet Sweeper GOOD COLLECTING: For pet hair, bread crumbs, dust, debris, paper clips and etc  ",
        " Carpet Sweeper NO BATTERIES：No electricity needed and no messy cords to deal with  ",
        " Carpet Sweeper NO DUST PAN: There is no dustpan to deal with. You can easily empty the garbage by pressing the button on the sweeper  ",
        " The size of our carpet sweeper: The height is about 42.52 inch, and the size of the sweeper is about 11inch(L) 7.87inch(W) 2.76inch(H)  "
    ]
},
{
    "title": "Just what I was looking for",
    "rating": "5.0 out of 5 stars",
    "content": "It is a great sweeper. It works as expected and is what I was looking for. The color is nice as well. It is compact and easy to store. A good sweeper for the price!",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am a huge reader of reviews... most of the time I buy a product bc it has been highly recommended by the majority....so I bought this sweeper for a rug from hell ....it is rubber backing with grey strips of carpet...for the kitchen...had to drag up the vacuum just to keep it clean....this sweeper picked up everything from this rug...I have never owned a sweeper until now...if you prefer the easy way as I do...this is a quick resolve for quick and easy clean...no cords, no noise, and it picks up everything that even my vacuum wouldn't....MUST HAVE!",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Why pay more???",
    "rating": "5.0 out of 5 stars",
    "content": "Very pleased",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Works well but the way they designed the flip doors on the bottom doesn’t makes sense, everytime I try to empty it in the trash it ends up dumping everything everywhere",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Works great",
    "rating": "4.0 out of 5 stars",
    "content": "I can't seem to get the middle rotor back into the device. It just pops right out as soon as I carpet sweep again. Any advice? I probably will just purchase a different carpet sweeper if I can't get it to stay. This has happened multiple times, so maybe there's something I'm doing wrong. Before that it was working awesome!",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I needed this for a low-pile velvet style rug. My vacuum cleaner was too strong. This is old-fashioned but it works just fine. Easy to clean, easy to store",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Hard to empty",
    "rating": "3.0 out of 5 stars",
    "content": "It picks up the pet hair off the throw rugs, but only on the \"push\". Not on the \"pull.\" And it's hard to push. Works well enough for quick pickups between vacuuming, but probably spend a little more and get a better product.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is well made, lots of real metal not cheap plastic. I expect it will last. It works exceptionally well. Not only picks up the little specs I saw on the carpet like tiny little rips of paper, tiny little rocks/stones/sand, etc. but also picks up stuff I didn't even see or notice until I went to empty it into the garbage. Seems to pull dust and cat hair right out of the carpet. Besides working great, it also did not scare my cat like the regular vacuum does, which is a huge plus because it breaks my heart everytime I need to use the regular vacuum and my cat gets all low and scurries into the bedroom to hide under the bed all scared. Highly recommend.",
    "post_time": "Reviewed in the United States on May 12, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Middle Rotor Pops Out Instantly For Me?",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this carpet sweeper to use on days that I don't feel like dragging out the vacuum cleaner. I think it works great. It is easy to assemble, and I used it immediately. Some reviewers said that the handle comes apart. I check to be sure the handle is secure before I begin using it and, so far, only once have I needed to tighten one section of the handle just a little bit. It does a good job. Of course, not as good as a vacuum cleaner, which I was aware of when I ordered this item, but my carpets look clean after I use my carpet sweeper. I still use the vacuum cleaner, but not as often. This carpet sweeper makes cleaning easier. It's an easy gadget to use, and I recommend it.",
    "post_time": "Reviewed in the United States on April 30, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loooovvveeeeee it!!!!!  💜💜💜💜💜",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "You get what you pay for",
    "rating": "3.0 out of 5 stars",
    "content": "I was a little disappointed with this as it does not work as well as I hoped it would. But in retrospect, you get what you pay for.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I think this device works OK. But when it comes to getting instructions for emptying the device, I’m unable to comprehend the lacking instructions.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Operating Instructions Lacking",
    "rating": "3.0 out of 5 stars",
    "content": "Works well on carpet but not on floor!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It’s helpful in picking up minor carpet dust. It also saves me from pulling out the vacuum every day. I have a cat and so far it picks up the hair. I hope it lasts a longer time than the last one l got which was not from Amazon.",
    "post_time": "Reviewed in the United States on April 2, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Works well on carpet",
    "rating": "5.0 out of 5 stars",
    "content": "The Yocada Carpet Sweeper Cleaner works great on my rugs. I use this sweeper in my basement carpet beside my sewing area. I usually make a tiny fabric piece and thread mess. I would usually clean this carpet with a sweeper/power head. Unfortunately. I only own one sweeper/power head  which I keep in the upstairs. So after carting my sweeper/power head up and down the stairs I decided to purchase the Yocada Carpet Sweeper. It works great on my rug. I now have the rug swept faster than I can plug my sweeper/power head into the wall socket. I am so glad I purchased this. I also like the company Yocada, I have purchased other cleaning items that work well.",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This sweeper may be inexpensive but it is  BETTER than most vacuum cleaners. It is VERY  easy to assemble, light weight, quiet and the perfect size and price to have more than one. I am very pleased with this sweeper! 👍🏻👍🏻👍🏻👍🏻👍🏻💯%",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Amazon Regular",
    "rating": "5.0 out of 5 stars",
    "content": "I am a rural dweller with 2dogs and a cat in and out of the house with me.  I hate to drag out the Kirby as it is heavy and really not all that good at picking up hair and fur.  from my many rugs and carpets.  This Yocada is my new best friend!  First use revealed so much fur and my long hair was soo there as well.  It stores easily, cleans out easily with the included brush clean tool and is a pleasure to use.  Love it!",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've tried a few different vacuums foe my bunny room and this type was suggested to me. Works pretty well with picking up hay and turds! Doesn't get all the hay but definitely more than a regular house vac!",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "The Yocada Carpet Sweeper Cleaner works great on my rugs.",
    "rating": "5.0 out of 5 stars",
    "content": "I got this one to replace a powered sweeper. This one is easier to use and does a better job. It generally picks up stuff with one pass. With two cats and messy eaters, I use it two or three times a day. It is very easy to empty.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Wish the height of this product could be raised some.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Love It!!",
    "rating": "5.0 out of 5 stars",
    "content": "I am really appreciating my little carpet sweeper! It is so handy for quick pickups without having to lug out the main vacuum each time. I have area rugs and this is just perfect! I do not know what the longevity of it will be but even if it lasts only one year it is worth the price!",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Easy to assemble and sturdy construction.  Takes several passes to pick up strings, dog hair and leaves the dogs track in from outdoors.  Works o.k. on low pile area rugs, but not on any hard surface, such as tile or wood.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "So-so clean",
    "rating": "3.0 out of 5 stars",
    "content": "I bought this for cat litter on laminate flooring. It’s okay. It takes a few passes to pick up about 85% of what’s on the floor but it does a way better job than a plain broom and dustpan.",
    "post_time": "Reviewed in the United States on February 23, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s cheap. I don’t know why I thought this would be well made but it isn’t. It’s flimsy and you have to assemble the handle which isn’t really sturdy. I wouldn’t want to clean all the floors in my house using this.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Eh, works ok on litter",
    "rating": "5.0 out of 5 stars",
    "content": "There were two leaves on the entryway mat that it refused to get, as well as a decent size chunk of dried food under the kitchen table the size of maybe a dime. It’s hit and miss for what it will pick up.",
    "post_time": "Reviewed in the United States on June 5, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "So if you need something that can grab litter so you’re not hauling out a huge vacuum or brooming it every day, this is okay for the money I guess. But that’s all I’d use it for.",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Love it",
    "rating": "5.0 out of 5 stars",
    "content": "I love how convenient this is. My cat is horrible with tracking litter! This makes it so easy, no need to drag out the vacuum. It took under 3 mins put it together and it’s ready to go!! I do use every day before I go to bed to wake up to a clean room.",
    "post_time": "Reviewed in the United States on April 29, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have a small space with low pile rugs. People and cats track a lot of stuff into my room. This little sweeper is easy to assemble. It's easy to empty. It picks up pet hair, and comes with a nifty little brush to clean out the rollers as needed. The color, purple,  makes me happy, and the price was good. Definitely recommend.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Exactly what I need",
    "rating": "5.0 out of 5 stars",
    "content": "It’s a pain if you have alot of hair on your rugs or carpet just because you have to pull it out of the brushes on the bottom. Other than this minor inconvenience, it works great!!",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "not going to lie, I had my doubts a $25 sweeper could pick up from my awful low pile carpeting but it worked perfect. Everything sticks to it and my regular vacuum does not pick up. I sew alot so I am always walking around with thread stuck to my clothing,  which always makes it's way on my carpet. You can see that in first picture. I assembled this sweeper, went over that section of carpet 3-4 times and it picked up everything. I would definitely recommend..",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Carpet Sweeper",
    "rating": "5.0 out of 5 stars",
    "content": "Nice product. Works as advertised. Reasonably priced.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this! I was about to buy a new dustpan for my son to clean any spillover from his guinea pig's cage and somehow this came to mind as a better option. Our regular cordless vacuum clogs too easily from the hay and bedding. I remember these manual sweepers from when I was a kid but wasn't sure they even made them anymore. I did a search on Amazon and voila! It was easy to put together and seems pretty sturdy. I did a demonstration for my son on a runner in the kitchen and couldn't believe how much dog hair it picked up from the rug in a few passes! The best part is that my son actually LIKES using it- hah who would have thought?",
    "post_time": "Reviewed in the United States on February 8, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Works great!",
    "rating": "5.0 out of 5 stars",
    "content": "I got this carpet sweeper to use in my classroom.  Even though the kids pick up their crumbs after snack, we were still getting ants in the classroom.  Now, I quickly sweep the carpet after snack, and we haven't had any ants since!  The sweeper is sturdy and well-made.  The color is pretty, too!",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy To install and use.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Awesome carpet sweeper!",
    "rating": "5.0 out of 5 stars",
    "content": "I teach kindergarten. They are messy little people. I needed something that would be a quick solution to daily spills. I bought this without high hopes. My previous one by another well known manufacturer wasn't the greatest and I ended up tossing it. I LOVE this handy little machine. It picks up paper scraps, snack wrappers, grass clippings, wood chips, fallen leaves and even orbeez with ease.  My students love to use it and request daily to be the sweeper helper. (gotta love that!!) I highly recommend this if you have the industrial kind of carpet they put in schools and public spaces. It does a great job.",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and put together. Very convenient. Saves time when just needing to clean up a small mess and does not require a cord or batteries.  Picks up well on thinner carpet, which is what I needed it for. Love the color too.",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Great for carpets",
    "rating": "4.0 out of 5 stars",
    "content": "Sweeper is a compact 11 1/4 in. by 7  3/4in.-ish so indeed small but  just what I was hoping for, for my limited space.  It lives under the bed. I have only had it a week so am still learning about it.  It cleans daily debris so nicely I hope it lasts forever.  The hair remover for it's brushes attachable to handle is nice bonus.",
    "post_time": "Reviewed in the United States on August 14, 2022",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The only little glitch so far, is the hard time I have had opening the area where crumbs & hair are collected. However any average person once seeing how to slide the part properly in direction of arrows will become adept, & I will too in spite of wimpy hands. There are two dirt compartments, I put a dab of nail polish on one underside so it would be easy to know which side had been emptied. At this point, am very pleased. Great tool!  PS: as product info. says, this is for rugs only, get a dual purpose machine if you need to do rugs AND bare floors.",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Great for a classroom",
    "rating": "4.0 out of 5 stars",
    "content": "I didn’t expect this to work as well as it does. It does a great job at picking up everything from dirt to dog hair to leaves and anything in between. We have that crushed outdoor carpet on our patio and I am excited to not have to bend down for hours with the shop vac this year. My only constructive feedback is that the compartment in which the dirt and stuff is collected is not self contained, it is open so the stuff is liable to fall back out if you’re not careful.",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "to clean up small recurring messes, like in my craft room, or leaves the dog brings in,. this is a hancy item.  love it.",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Its portable and doesnt take up much room.",
    "rating": "4.0 out of 5 stars",
    "content": "It’s just okay. It requires very heavy pushing into the rug, even though its a very flat pile.",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Luv luv. Will purchase another",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Yokada carpet sweeper",
    "rating": "5.0 out of 5 stars",
    "content": "Super easy to assemble",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Handle is just a tad bit shorter than I expected",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Easy to Assemble- Works Great",
    "rating": "5.0 out of 5 stars",
    "content": "Works better than broom for area rugs. I LOVE IT. It picks up better than the rechargeable cordless vacuum I had for my area rugs. Sometimes going back to basics gets the job done Better",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Works great on carpet, easy to empty. No charging or power needed!",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Love this little sweeper",
    "rating": "4.0 out of 5 stars",
    "content": "We use daily and wished i ordered long ago.",
    "post_time": "Reviewed in the United States on February 28, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I thought this would be a great idea to use in our camper to vacuum our rugs. Our camper doesn’t have a generator so we have to be plugged into power to use a real vacuum cleaner. This sweeper picked up almost everything on the rugs BUT it snagged the heck out of one of my rugs! 🙄 Unfortunately I’ll be sending it back.",
    "post_time": "Reviewed in the United States on August 29, 2023",
    "pid": "B086DBC2NN"
},
{
    "title": "Perfect for our carpets",
    "rating": "5.0 out of 5 stars",
    "content": "I needed to glue the handle sections together to stop movement and loosening. Not that big of a deal.",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This sweeper is as advertised and works well. It is lightweight, reasonably maneuverable, and actually picks stuff up off of the indoor/outdoor carpeting in our very cheaply constructed apartment. I did, however, pay for a new item and received an open-box item. The item was shipped in a Tyvek mailer, the box container the sweeper was open, the bag with the handle parts had been ripped open, and the parts of the handle had spilled out into the mailer. The sweeper itself appeared unused and works fine.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered 3 for my business, they work great for a quick pick up.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This thing is awesome! It picked up dry cereal off the carpet with ease. I highly recommend this for people with kids to do a fast clean up.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Worth every penny",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered this Yorcada carpet sweeper as well as the Fuller Bursh carpet sweeper. Thie Yorcada weeper was 1/3 the price of the Fuller Brush. I compared the internal construction, quality of the parts, ability to pick up on a short weave carpet that we have as well as on ceramic tile. Neither sweeper was designed to pick up on hard floors such as ceramic tile. BOTH sweepers had IDENTICAL internal construction and parts. The fuller Brush sweeper was a little smaller than the Yorcada. The fuller Brush seemed to have trouble picking anything up on our short weave carpet whereas the Yorcada picked up everything. PLUS the Yorcada even picked up food particles and other loose small bits on the ceramic tile. The Yorcada has a little more inconvenient mechanism for opening the collection bins on the sweeper bottom. But once you figure it out it's not a big deal. I have been using the Yorcada every other day or so now for about 3 weeks and it works great. I returned the expensive Fuller Brush one. I am a retired man with a disabled wife and I do all the chores. I am very pleased with the Yorcada.",
    "post_time": "Reviewed in the United States on December 26, 2022",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love it",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Surprise",
    "rating": "3.0 out of 5 stars",
    "content": "I used this occasionally over the last few years to clean cat hair from my carpet when I didn't want to get out the vacuum.  It does well at this.  So well, that the small front and back rollers (they pick up hair, not dirt) hold onto the cat hair so well it is nearly impossible to get it off again.  The large middle roller does a good job of picking up small bits of dirt and debris.  Warning, it picks debris up only moving in one direction, not the reverse direction.",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the first time I have used a carpet sweeper as an adult.  This one is definitely not as sturdy (or as heavy) as the metal one that my mother had decades ago, but it does the job.  I am fostering four timid cats who leave fur, bits of dry food, carpet tufts from the scratching post, and general dust on the carpet.  A vacuum cleaner would frighten them, and those expensive vacuum cleaner bags would fill quickly.  This sweeper gets it, without electricity or vacuum cleaner bags, and the dust collection bins are easy to empty.  I am very pleased with this purchase.",
    "post_time": "Reviewed in the United States on November 20, 2023",
    "pid": "B086DBC2NN"
},
{
    "title": "I love it",
    "rating": "5.0 out of 5 stars",
    "content": "This sweeper picks up even fine pet hair off throw rugs. It’s easy to clean & a great value for those with area rugs.",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent value for the price. No fuss way to get the job done.",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "front and back rollers hard to clear",
    "rating": "4.0 out of 5 stars",
    "content": "Easy to assemble and picks up without dragging out your vacuum cleaner. Don't waste your money on an expensive one--this gets the job done.",
    "post_time": "Reviewed in the United States on January 22, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Purchased to use on commercial-grade indoor/outdoor carpet where cats track fur, litter, insect parts, and other miscellania.  Easy to assemble, picks up bits the first time, definitely accomplishing the task.  The downfall is, this feels chintzy and steering is a drag because the handle wants to come unscrewed all the time.  It's handier to lift and reposition, rather than try to steer via the handle.  8/10 would buy again unless I was too sorely tempted by the more solid feel and increased steering action of a name-brand sweeper.",
    "post_time": "Reviewed in the United States on July 20, 2023",
    "pid": "B086DBC2NN"
},
{
    "title": "Old school cleaning!",
    "rating": "5.0 out of 5 stars",
    "content": "I have a bad back, and this is light enough to maneuver without pain.  Big things stay on floor, but that little fine stuff that sticks in your feet will disappear.",
    "post_time": "Reviewed in the United States on May 5, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Purchased for the office to use in between regular weekly vac'ing. It's a hit!",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Works great!",
    "rating": "3.0 out of 5 stars",
    "content": "I purchased this product because it was supposed to work on both carpet and hard floors.  I used this twice and both times (on hard floor) I had to sweep over the same areas 4-5 times.",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This bad boy does the trick in my little college dorm. It picks up crumbs that i accidentally leave on my carpet and works pretty well in comparison to my previous vacuum. It’s a little gross to empty but thats the only negative.",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Leaves half the dirt behind",
    "rating": "5.0 out of 5 stars",
    "content": "I have used Bissell sweeper for years.",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This one is approximately 1/4 the price, yet very efficient. I",
    "post_time": "Reviewed in the United States on January 27, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Fantastic In My College Dorm",
    "rating": "5.0 out of 5 stars",
    "content": "plan to have one at each doorway.",
    "post_time": "Reviewed in the United States on February 21, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It does the job for a little clean up in between vacuuming..",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B086DBC2NN"
},
{
    "title": "Handy for quick clean up.",
    "rating": "4.0 out of 5 stars",
    "content": "So I wasn’t gonna waste money on a loud, annoying vacuum. No way. My autistic butt hates those loud monstrous machines. And so I was like, “I’m gonna get a broom thingy for my carpeted apartment.”",
    "post_time": "Reviewed in the United States on December 14, 2023",
    "pid": "B086DBC2NN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "And thus, I did. And it works great! Pulls up cat fur, my friend’s weave, my hair, carpet fuzz, debris, regular stuff. It’s incredible. And super easy to clean out.",
    "post_time": "Reviewed in the United States on August 22, 2023",
    "pid": "B086DBC2NN"
}
]