[
{
    "name": "        b.tan Darker Self Tanner Kit | Fall In Love at First Tan Bundle - Darker Self Tan Mousse with Self Tanning Mitt Applicator, Violet Base, 1 Hour Sunless Fast Tanner, No Fake Tan Smell, No Added Nasties, Vegan, Cruelty Free, 6.7 Fl Oz       ",
    "stars": [
        "66%",
        "15%",
        "8%",
        "4%",
        "7%"
    ],
    "pid": "B0888B6TBN",
    "ratings": "16,310 ratings",
    "other_info": {
        "Item Form": "Mousse",
        "Skin Type": "All, Oily, Combination, Sensitive, Dry, Normal",
        "Material Type Free": "Paraben Free",
        "Brand": "B.TAN",
        "Product Benefits": "Hydrating, Radiant Tan, Color Correction, Moisturizing"
    },
    "discount_price": "$ 14.",
    "normal_price": "$2.24",
    "about_this_item": [
        " NO ORANGE TONES. i'm perfect for anyone looking for a medium dark tan with absolutely no orange tones  ",
        " TANNING MITT INCLUDED. i come with our best selling mitt so you can create the most awesome, dark tan on the planet  ",
        " 1 HOUR CURE TIME. 1 hour development time, leave on for 4+ hours for darker results  ",
        " PRO TIP: apply a moisturizer to elbows, knees + ankles before application. apply evenly (but not too thick) + blend thoroughly for the perfect bronzed glow. use with a mitt for ultra smooth results.  ",
        " VEGAN FRIENDLY. i love animals so im 100% cruelty free, vegan friendly, and free of nasties like parabens  ",
        " MADE IN THE USA: Made by the tanning experts here in the USA. Our state of the art production facilities use only the highest quality ingredients so you know your skin is well looked after.  "
    ]
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "I have used the b. tan products now for 3 years for the summer.  I love it!  It's very natural looking and doesn't have a terrible smell.  I always get compliments on my tan and I didn't have to get it from the sun.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Natural looking and did not clog my pores as much as other face tanning spray has.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Natural looking",
    "rating": "5.0 out of 5 stars",
    "content": "This is by far my most favorite self tanner. I’ve tried. I’ve seen a lot of tanners. Other people have used and tried them. They always leave spotless or don’t get you dark enough or just take longer. This has been by far the easiest and lasted the longest and gotten me the darkness that I wanted And the most natural.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I got the 2* color since I’m pale, very new to tanning, and didn’t want a super dark tan. Initially I got this to do face contour. I blended it well using a makeup brush and sponge, but didn't find it to really work despite leaving the tanner on all day. I tried next day and didn’t blend it as much/left it darker on my face. Again it didn’t really work. Not sure why.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "My favorite self tanner",
    "rating": "4.0 out of 5 stars",
    "content": "Decided to use on my legs to add a bit of glow. I exfoliated and moisturized my knee area before application and rinsed it after 2 hours. One light coat left a nice glow but it was really subtle. Did a second coat a few days later and am pretty happy with it. It’s not obviously a faux tan but gives my legs a bit of color.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I recommend following the instructions and really exfoliating first, and working it in with the mitt. It dried within 30min-hr while I did my makeup. The second time I decided to leave it on longer, and applied in morning and didn’t shower/rinse for 48hr (don’t judge). I found that worked best for me and I liked using the lighter shade to build up instead of go too dark at once.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Nice for beginners",
    "rating": "4.0 out of 5 stars",
    "content": "TLDR: not good for contour but nice for body. Start light and build up.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Goes on easy leaves no streaks. I use it after spray tan and what it misses.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Great product",
    "rating": "4.0 out of 5 stars",
    "content": "I was hesitant with this spray but I think the color is pretty good! I used to do the tanning beds but it takes so long to do and this is a quick mist!",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So I’m usually a natural girl get tan by being in sun but this year I’ve been way to busy working in doors to get that glow this summer so figure when I do get chance to get out I’ll look like a ghost so why not try something I did purchase on prime day so it was cheaper then listed price but it’s still affordable I have only done a test on my arm to see how much to use as you can see in picture but so far I am I’m impressed it’s a noticeable yet subtle difference now I just have to do whole body keep posted if have any difficulte areas apply oh and fyi I have always been told to use hands not mitten so I just used hand when applied to arm and washed hand Thoroughly after",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "No orange tan",
    "rating": "4.0 out of 5 stars",
    "content": "I have been using another brand of self tanner with a violet base for the past 4 years but it was nearly $40 a bottle and they never offered free shipping. With everything getting more expensive I was looking for a lower priced self tanner that gave me similar results. This is the best one I have found. The price is reasonable and the color has a violet base to combat the orange oompah loompah look. I will say it does dry my skin out a little but I have just started putting on lotion after I rinse the tanner off. I took off one star because it dries my skin out. The spray has been nice too. It never seems to be extremely dark but it does give a bit of color. The rose water mist is hydrating and it doesn’t smell terrible either. I use it on my face, neck, and chest before applying moisturizer or makeup. Just let it dry before applying anything else to your skin, it dries relatively quickly. I like that you can spray it where sun would hit naturally to create a more realistic tan look.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Does not leave you orange. Foam is colored so you can make sure you apply evenly.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Good product",
    "rating": "5.0 out of 5 stars",
    "content": "This stuff is great if u apply it evenly it works good. Doesn't eave streaks or orange patches use glove and wash your hands after",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Have not used yet. It arrived opened and some leaked out. It does smell much better than other tanning lotions/gel that I have used.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "I like this product",
    "rating": "5.0 out of 5 stars",
    "content": "I spray this on my face and chest daily or every other day! It has a good smell and tans a pretty golden brown.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The mitt did help smooth out the application. The first time I applied, it was very light and almost unnoticeable. This product builds color so you can continue to reapply without it being streaky.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Arrived open",
    "rating": "5.0 out of 5 stars",
    "content": "I like this very much for my face. I put it on twice a week it dries really fast then I put on moisturizer or sunscreen. It give me a nice little touch of tan you can do it more often for darker tan. I love it",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Loving this product! I use this spray mist on my face. I love that you just spray, let it dry and that's it. Most other tan products you have to rinse off after x hrs etc. Love this doesn't transfer and love it doesn't have that typical tanner smell like most mousse tanners do.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "My favorite tanner mist!",
    "rating": "5.0 out of 5 stars",
    "content": "Everyone thinks I have a real tan, they are shocked when I tell them it's \"fake\".",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Ladies don't we all feel better when we have tan skin (over ghostly white) ; )",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "Gradual is definitely the key word here. I love that I can spray and they it will lightly tone me. Spray again, adds just a bit more tone. It’s not orange, even as it fades. This is one of the most natural sprays I’ve used. Definitely recommend.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Was easy to apply. We left overnight before rinsing with no problem but be sure it's completely dry before putting clothes back on.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "About 20 min max",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Rinsing in shower is when you see the places you missed but it's not that noticeable.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "This stuff really does work.... for a complete novice!",
    "rating": "4.0 out of 5 stars",
    "content": "This product so fast is the best we (my 2 daughters and I) have used.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I was getting ready for a trip to the Galapagos Islands, and thought it might be a good idea to try to give my pale white skin a head start for all the sun that was waiting for me. So after looking into this chemical tanning situation and reading dozens of reviews for dozens of products, I settled on this stuff. I am a moderately hairy male with dry skin, and I admit I did not follow the first (what seemed very important) step of exfoliating...I am not sure even how to go about that! So one morning I got out the very nice mitt and the sprayed some of the thick foam onto the thing and got started. It spread very easily over my arms and legs, and did not smell...too bad! I let it dry then put on my clothes and basically let it develop for around 8 hours. I then washed it off with my outdoor hose, carefully showered that night not soaping my arms and legs, and by the morning I had some legit color! So I let it go a day or two, and then re-applied another coat, following the same procedure and did not follow the directions of avoiding too much on the knees and other bony protrusions, so my tan deepened but my knees were too dark. So with a really ok medium-light tan after 2 doses, off to the equator I went! After two weeks, and with the use of a 30 spf sunscreen I came back a bit lighter than when I left, so I reapplied another couple of treatments when I returned, avoiding my knees this time, and I really again achieved a very nice tan! My adult children actually commented on how good my tan looked from the trip (I did not tell them how I really got the tan!) At any rate, this stuff actually does work. Very easy even for a novice like me to put the foam on in a reasonable manner to achieve the color I wanted. I have to say I am very pleasantly surprised!",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Works great!",
    "rating": "5.0 out of 5 stars",
    "content": "Works beautifully… just be sure to hit under your chin and neck- it WILL be noticeable if you do not.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I got this for my face to get a slight color but not be overwhelming with fake tanner or clog my skin to cause more breaking out and this effectively did this. I actually have very pale skin,  I wear makeup to go anywhere and with this I kept getting so many compliments and didn't need makeup to feel confident going out.  Apparently people in my life like me tan over pale because I was getting so many compliments I had to second guess my relationships because even living it, not planning to keep it up year round.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Surprised",
    "rating": "5.0 out of 5 stars",
    "content": "I dislike the scent of the product smells like self tanner and some other products that I have purchased with this company smelled way better. Doesn't smell bad but not the greatest scent either. Love that it also came with the glow up spray for refreshing of your tan from dull to a glow.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love the look of this from the moment it goes on. You can instantly see if you need to do some extra blending and you still have time to do it. Posting this review after my 3rd time using it and I’m hooked.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Great quality self tanner!",
    "rating": "5.0 out of 5 stars",
    "content": "As long as you can follow directions, cover every inch of skin and rub it in efficiently this product works amazing! 10/10 recommend.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Initially, I was nervous to use this self tanner as it came out grey. I’ve only ever used the Jergens Mousse Self Tanner and it’s a dark brown color. The grey didn’t necessarily guide me on where and where I had not tanned yet, but it’s pretty easy for me to get everywhere without a guide. The smell wasn’t too pungent, it smelled like alcohol wipes at first and did have a typical self tanner smell but nothing too crazy. And it wasn’t sticky after drying. I bought the “I want the darkest tan possible” and I left it on for 12+ hours. It gave me a nice VERY LIGHT color. I’m already fair skinned so I was expecting to be super tan but no, it’s very natural, not orange and barely gave me color. No worries, but for the tan I bought I would’ve assumed I would’ve got darker. I’m not a fan of putting 2 or 3+ coats on, I feel as if that defeats the purpose but if you want a darker color definitely do a couple coats. Overall, I’m not disappointed but I’m also not happy. I would buy this product again, especially for being such a good price. I wish I would’ve taken before and after photos to show the difference but I can only see a small difference where I didn’t tan (such as where my sports bra and shorts were).",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Great Product For Its Price",
    "rating": "4.0 out of 5 stars",
    "content": "Love the color results you get from this gel",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I bought the color \"I want the darkest tan possible\", I'm 5'7\", 230lbs & a medium skin tone on most of my body, but I never show legs, so they're pretty pale.",
    "post_time": "Reviewed in the United States on April 1, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Tan gel",
    "rating": "5.0 out of 5 stars",
    "content": "I'm a 2nd time self tan user (ever in my life). I'm always a \"research before you do anything\" person though because I don't want to mess it up, so per YouTubers... I exfoliated the parts on my body I was using the product on really well, shaved, & moisturized the rough patches (elbows, ankles, knees, etc) & I waited after my shower about 30 min so that my skin could cool down and the pores could close.  I'm naturally a very dry skin, so I had some rough patches on my shins that kind of absorbed the product more. I also have bigger pores on my shins, so it's a bit \"dotted\" (shown in close up pic)  & I have a pretty big scar that also absorbed a lot, but I was able to blend it out with my shower & make-up wipes.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I kept the product on for the 1st hr (see pic) & I could tell my skin color had changed, but it was kind of pale/ grey. So I applied a second coat & left it on overnight (approximately 14 hrs total) & I did use a tad bit (1 coat) on my face & it's a bit patchy as well, but I'm not too worried about that cause I have make up.  Overall, I like the color I got.  I'll probably rinse off and reapply one more time to my legs since they're still lighter than my arms, but I really like the color. It's not \"orange\" & you just have to keep adding layers to get your desired color.  The pics don't showcase it very well & please don't mind my bedhead & \"just woke up\" face. I hope this review helps anyone wanting to try it out.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Good for the price",
    "rating": "4.0 out of 5 stars",
    "content": "The product went on so great and I left it on overnight while sleeping and woke up to the most PERFECT tan!  I had so many compliments. Will definitely buy again.",
    "post_time": "Reviewed in the United States on June 8, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So, let's start this off by saying it does actually make you tan. For all you see through pale people who have never seen the sun, this is for you!!! You only need one application to go from scaring neighborhood kids to sun kissed. However, if you have a sense of smell or possibly go around anyone with a sense of smell you may want to spray some heavy perfume/cologne on. I kept wondering where the faint smell of burning tire was coming from. Was I having a stroke? Nope, just my self tanner.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Was perfect!",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve lived in Florida all my life so I have skin damage. I have white spots on my arms and legs that don’t tan. This helps to even out my skin tone in the summer. I exfoliate and use the mitt along with gloves. It rubs in evenly and I use what’s left on the mitt around the feet,ankles, knees and elbows. I’m surprised how tan I get since this product is next to the lowest tan level. The con is that it takes more than 4 hours to get tan and then take a shower to wash it off. It does transfer to clothing before you wash it off. After a shower pat dry or it comes off on the towel. I have to reapply once a week. In between it fades but doesn’t get blotchy. Be aware that it can make random moles or skin tags overly dark. Overall great product.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The BEST self tanner ! Has a distinct chemical smell that stays with you for about a day, but tolerable. I use at night before bed, doesnt transfer into my sheets. Wake up at least two shades darker the following day. Great value for product!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "excellent",
    "rating": "5.0 out of 5 stars",
    "content": "does not streak goes on smooth works very quick glove is easy to wash out",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve never used a self tanner in my life. This was easy to use with great coverage! Color was super natural looking!!",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Great product!!",
    "rating": "4.0 out of 5 stars",
    "content": "I liked the consistency of this tanner & the accompanying mitt. The mitt is a nice material and is plastic coated on the inside so the tanner doesn't soak thru to your palm. The tanner itself is *not* very tinted so it is a bit difficult to see where you've applied it once it's been rubbed in. That being said, one application doesn't darken that much so if it's not super even you're not gonna end up with streaks. It would take 2 or 3 applications to look like you had been at the beach for a day.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This stuff is amazing. Light weight with minimal scent. If you want a nice hint of color without being orange then this is your product. I apply every other night to my face, arms and chest and builds nicely",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Not too dark, good mitt",
    "rating": "4.0 out of 5 stars",
    "content": "It smells like candy to me lol but my boyfriend doesn’t think so. The face spray is so convenient and doesn’t leave drips, the product goes on great and looks great the next day! Been buying the brand for years.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It does have the self tanner scent that can be strong. But the mitt helped to blend the tanner in. Seems to develop the color pretty quickly. Like a few hours",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "New staple !!",
    "rating": "4.0 out of 5 stars",
    "content": "I thought I would love the clear gel but for me it’s a struggle to make sure everything is even because you can’t see it.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like the color it gives me.  The glove makes it easy to apply without staining your hands.  I would buy again.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Love this product",
    "rating": "5.0 out of 5 stars",
    "content": "My wife has been usinf this self tanner for awhile and she really likes it. The tanner goes on smoothly with the mitt and leaves a good tan. The tan is not too dark but quite a bit darker than normal. The scent of the tanner is not too bad either. The tanner rubs into your skin smoothly and then washes off well too. Overall this is a great self tanner that leaves your skin with a glowing tan and the mitt that comes with it helps the tan go on smoothly.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is AMAZING but I think it was my doing because I didn’t put lotion on my body before I would recommend that other wise it will turn out patchy",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "So far so good!",
    "rating": "4.0 out of 5 stars",
    "content": "This foam gives medium color and I feel like the longer it's left on, the darker it gets. It does have an odor, (hence the 4 stars) but if you follow directions and shower several hours after (with no soap) the smell goes away.  Typically, I shower and exfoliate, put lotion on after I towel dry, wait a few minutes, then apply tanning foam. After 3-4 hours, I hop back into the shower and rinse, dry, and apply my Bath and Body Works lotion. Usually apply twice a week for a medium tan.",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I don’t usually write reviews, but if you’re thinking about buying this — do it! I used to tan naturally and very quickly, all the way through high school. However, when I got a little older (19-20), it stopped. I’ve tried to tan for years now and have never gotten the result I was so used to as a kid and teenager. My self confidence had plummeted. I decided this year I was going to try self-tanning, and I’m so glad I did!!! I feel more confident and I look healthier. It’s not orange, or even orange tinted, and it looks incredibly close to my skin tone. I only took one star off because I think it smells horrible, but that’s just me.",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "10/10 Recommend",
    "rating": "4.0 out of 5 stars",
    "content": "I recommend spraying a glove instead of directly on your skin. I'm pretty pale and ended up with circles everywhere, even though I rubbed it in with a mitt pretty quickly after spraying and image I went along.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I work with my husband.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Just be careful...",
    "rating": "5.0 out of 5 stars",
    "content": "He told me I looked tan. Smelled funky, but tan.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I told him i didn't want to come to work looking like uncooked chicken so I used this.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Well,  I'm tan.",
    "rating": "5.0 out of 5 stars",
    "content": "Job well done.  5 out of 5.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Me encanta.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Súper like.",
    "rating": "5.0 out of 5 stars",
    "content": "This product is amazing.  It spread very easily with the mitten.  By 8 hours I looked like I had a healthy tan.  No orange overtone at all.  Just natural looking.  I highly recommend!",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Deeper tan than I would typically go (I have warm undertones, reddish/brown hair and light complexion) This felt like a gorgeous summer tan, layers nicely, lasts a week and didn’t totally wash in the shower. The glove is really nice quality too. I definitely second their recommendation of using a circular motion to avoid streaks.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Nice color",
    "rating": "3.0 out of 5 stars",
    "content": "So I never buy self tanner because you always end up orange-ish in one way or another. This stuff isn't orange on me, it has great color however if you're looking for something to stay for awhile this isn't it. As soon as you shower the color is gone. I tried leaving it on all day then shower hoping to keep some of the color, nope. Right down the drain it went. So if you just need color for an outfit or a certain night out this is perfect. If you want something to last for a little bit this isn't the product for you.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was gladly surprised at how this mist went on and was shocked at the tan afterwards. Definitely worth the money and would purchase again!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "b.tan clear face tan mist",
    "rating": "4.0 out of 5 stars",
    "content": "I’m 67 years old. I have vitaligo and was hoping to find a product to help blend my very pale patches with the skin that still tans. Enter b. Tan. Things I’ve learned:",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "• wash your hands…mine are scary.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Wash your hands!!!!",
    "rating": "4.0 out of 5 stars",
    "content": "• The product sucked into all my sun damage spots on my arms that I didn’t even know I had.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "•Read reviews if you want to do your face. Ladies of an age will discover wrinkles and dark spots best left hidden.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Takes time + is a bit smelly",
    "rating": "5.0 out of 5 stars",
    "content": "•The vitiligo patches still exist but aren’t as noticeable to me.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": " However, I’m excited about my legs. Buy it.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Easy application",
    "rating": "2.0 out of 5 stars",
    "content": "If you are patient and have time for this to develop and the smell to wear off, this self tanner is for you. If you need a tan fast and don’t want a lingering smell, I probably wouldn’t recommend this.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I applied the tanner twice on my legs because seemingly I didn’t get results the first layer I did, and now my legs are much darker than I anticipated after 24 hours or so (not necessarily bad but the delay in the color developing was unexpected, especially after I’d already washed the product off). I also cannot get past the smell. It lingered for so long after I had already washed the tanner off and the only way I could seem to get rid of the smell was scrubbing with soap later in the day and using heavily perfumed lotion. I have a very sensitive nose so perhaps this is just a me problem but the smell was reminiscent of sweaty skin (like a gym locker room kind of? Not pleasant either way). Probably wouldn’t repurchase",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "How to apply",
    "rating": "4.0 out of 5 stars",
    "content": "ABSOLUTELY AMAZING!!! I always put it on before bed and rinse it off with lukewarm water in the morning DO NOT SCRUB and pat with a towel for the best results!!! The only downside is that it’s really hard to take off!",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I feel like such a FOOL for ever spending a minute in a tanning salon, and for all the hours I laid out in the sun to get a tan. I have had so much success using this product. I don’t have any experience with other self-tanners, so I have nothing to compare, but I love this stuff. I have a very fair complexion, and this turns me a nice bronze with one application. I do try to exfoliate and shave before I apply it, and I am careful to really rub it in with the mitt. It has worked great for me. Thanks.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Love it",
    "rating": "5.0 out of 5 stars",
    "content": "I like that it does not turn your skin yellow or orange",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This stuff made my skin glow and made me look so tan. I am definitely going to keep buying this!!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Good coloring",
    "rating": "5.0 out of 5 stars",
    "content": "Most self tanners leave you orange and streaky. This one has a great application and beautiful violet undertone!",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I like this tanner. It has a very dark color to show you where you've already put it on. It works best if you can wait 8 hours and then just rinse off. Even following all the directions, the natural-looking tan does not last 11 days as claimed in the promotions for the product.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "So good!",
    "rating": "4.0 out of 5 stars",
    "content": "This product is awesome! So easy to apply and dries quick. Tan was nice and even. BUT it does smell like the old school tanning products from 20 years ago. After rinsing I still smell it. But worth it for the no-streaking and easy apply.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Neatly packaged and arrived quickly. I only used it once on my arms and face. I couldn’t tell a change. Maybe I needed to apply more than one layer. I will try again. I know it has worked great for my daughter in the past.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Love the violet undertone!!",
    "rating": "4.0 out of 5 stars",
    "content": "This produces a really nice colored tan, but I personally can't be trusted to use this product since it has no guide.  I really messed up my feet/ankles/wrists hahaha.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The tan is so pretty. The lavender base is perfect for more fair completion when other tans can look extremely green or orange. The only reason it’s not a 5 star product for me is that it takes a really long time to dry down on the skin. It might dry down better in a dryer climate, as where I live is extremely humid. I’ll keep using it despite the drying issue though because it’s a great value and I love the color.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Gorgeous Color Gorgeous Glow",
    "rating": "5.0 out of 5 stars",
    "content": "This product is amazing. It's literally clear. It goes on clear and does not stain u clothes.  The scent is nice and not overwhelming. The package I bought even came with the tanning glove (a must.) The glow spray is just that Glowy on u skin. I luv it can't say enough great things. Try it.  For the price it's worth it.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is so nice to spray on your face, chest, and top of feet quickly before heading out. It dries quickly so very convenient.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Quick and easy",
    "rating": "5.0 out of 5 stars",
    "content": "It looks natural",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just as described",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Good quick tan",
    "rating": "3.0 out of 5 stars",
    "content": "Product is difficult toget out of the bottle. I like the way the foam spreads on the skin but for something f that’s meant to be practical I’m not happy with all the work it takes to get the product in the glove. That’s the only reason for the three stars.  Otherwise it’s my first day using the product and I have no review on the color or development.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Even when applied evenly i seem to still end up blotchy. I thought once it dried there was no need to worry about rubbing against things but it seems I was wrong. The spray left my face extremely dry the next day. When it drys correctly and doesn’t blotch it has a nice glow.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Good product",
    "rating": "5.0 out of 5 stars",
    "content": "love the results",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A great tanning product that works in a short period of time and the tan comes out so natural looking AND the price is awesome!!!",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Doesn’t dispense well",
    "rating": "5.0 out of 5 stars",
    "content": "Thank",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B0888B6TBN"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You!",
    "post_time": "Reviewed in the United States on April 29, 2024",
    "pid": "B0888B6TBN"
}
]