[
{
    "name": "        Zulay Metal 2-In-1 Lemon Squeezer Manual - Sturdy, Max Extraction Hand Juicer Lemon Squeezer Gets Every Last Drop - Easy to Clean Manual Citrus Juicer - Easy-to-Use Lemon Juicer Squeezer - Gray/Lime       ",
    "stars": [
        "81%",
        "12%",
        "4%",
        "1%",
        "2%"
    ],
    "pid": "B0896ZL6FK",
    "ratings": "45,398 ratings",
    "other_info": {
        "Brand": "Zulay Kitchen",
        "Color": "Gray and Lime Punch",
        "Special Feature": "Ergonomic Handle",
        "Product Dimensions": "2\"D x 2.9\"W x 8.6\"H",
        "Finish Type": "Clear Cut"
    },
    "discount_price": "$ 19.",
    "normal_price": "$14.99",
    "about_this_item": [
        " SQUEEZE OUT EVERY DROP OF JUICE: Our 2-in-1 lemon squeezer won’t waste a single drop from your favorite fruit! We have designed this lime juicer to be easy on hands. Watch limes, lemons, and small oranges beg for mercy, even with a soft squeeze. The holes at the bottom of the citrus juicer serve as a seed filter to prevent the pulp and seeds from getting in your way.  ",
        " SAVE TIME AND SPACE: You no longer have to worry about power, replacing batteries, or even bulky juicers crowding your kitchen counter with our easy-to-store citrus squeezer. Quench your thirst by making a citrusy lemonade or margarita in seconds; simply place a half cut lemon/lime in the bowl and watch the citrusy goodness add flavor to your drink or meal.  ",
        " STURDY AND HEAVY DUTY BOWLS: This durable manual juicer is made from aluminum and is finished off with a food-grade coating, making it a perfect addition to your cocktail accessories for years to come. The ergonomic handle makes the lemon lime squeezer super comfortable for even kids to use.  ",
        " CLEANS IN SECONDS: After adding a tangy flavor to your recipe, simply toss the citrus juicer in the dishwasher for a quick clean up. Our juice press can also be effortlessly cleaned by running it under water.  ",
        " HASSLE-FREE, ZULAY GUARANTEE: We love and take pride in our lemon and lime squeezer and back it up with a lifetime guarantee. If there are ever any issues, just contact us, and we will make it right.  "
    ]
},
{
    "title": "Great citrus squeezer.",
    "rating": "5.0 out of 5 stars",
    "content": "I was shopping for a citrus squeezer because I thought I had one, but didn’t. Doing my search on Amazon for a squeezer this one stood out. It had so many positive reviews. I thought I’d give it a shot. I am so glad I did. It does the job amazingly I got every drop of juice out of my limes, it’s dishwasher safe, which I like  and it’s well built. I think it will last a lifetime. I highly recommend.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've been using the Zulay Kitchen Metal 2-in-1 Lemon Squeezer for a few weeks now, and I must say, it’s a game changer! This hand juicer is incredibly sturdy and well-built, and you can tell it's made from high-quality materials. The 2-in-1 design makes it versatile for squeezing both lemons and limes, which is really convenient.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Great lemon squeezer",
    "rating": "5.0 out of 5 stars",
    "content": "What I love the most is how easy it is to use—just place the lemon half in, press down, and you get a surprising amount of juice with very little effort. No seeds, no mess, and the pulp stays out. It truly delivers maximum extraction without having to press too hard.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Cleaning is also a breeze. I was it by hand. It does weigh a little too much in my opinion, however, I highly recommend it to anyone who loves fresh citrus juice!",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Great Product!! Makes Things So Much Easier",
    "rating": "5.0 out of 5 stars",
    "content": "Really impressed with the quality of this squeezer!!! Works great!!! Told one of our friends about it and now she's getting one!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works well, solves the purpose. Good quality.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "review",
    "rating": "5.0 out of 5 stars",
    "content": "Very convenient to have both lime and lemon press in one. Seems to be very durable.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The size is perfect. Good size meyer lemons squeeze in these fine.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Very nice juicer",
    "rating": "5.0 out of 5 stars",
    "content": "It's not too heavy, very comfortable to hold and use.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I got this to squeeze lemons and limes for my lemon ginger tea and lemon juice and I have to say that it works better than expected! It works for different types of lemons and lime sizes, and it catches the seeds for you. It’s Perfect if you want an easy tool to squeeze lemons for a variety of juices. Not too difficult to clean, and I like that it’s sturdy but also not heavy to use. It takes a little space, but You won’t have trouble finding a place to store it. Great investment that saved me time and cleaning up.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Lemon Squeezer - Easy to use, no seeds in the juice, easy to clean-up",
    "rating": "5.0 out of 5 stars",
    "content": "The Zulay Metal 2-in-1 Lemon juice extractor is a great design concept.  I first used it at my daughter's home, and the light bulb clicked that this is a fundamentally different (and better) way to juice lemons, limes and oranges. The first step is to cut the lemon in half (standard practice).  However, the next step for the user is to slice the bottom off the half lemon.  Then the user puts the trimmed lemon into the cup on the Lemon squeezer and squeeze.  The juice comes out of the bottom of the Zulay squeezer, and the seeds and plup stay in the lemon carcass.  If you wish, you can trim a bit of the pulp and put it into your juice container.  The beauty of the design is that you do not have to pick the the seeds out of the extracted juice or out of the pulp.  Clean-up is very easy.  Throw away the lemon carcasses and rinse the Zulay unit with water.  There are two cup sizes built into the unit, so that the unit can handle large and small lemons and small limes.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Does what it says and what I need it to do, juice lemons without seeds.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Great Product",
    "rating": "5.0 out of 5 stars",
    "content": "It seems very sturdy and well made.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I would recommend this to anyone that wants to squeeze lemons without getting all the seeds.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Love this tool!",
    "rating": "5.0 out of 5 stars",
    "content": "We bought 1 and loved it so much, we bought 2 more for our family members.  This item is made of quality steel and is durable.  I’ve squeezed hundreds of limes in this and have yet to have a problem. It’s dishwasher safe but the paint will chip over time.  Good value for the money.  Nice and heavy duty!",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Solid build and fills our need for lime and lenin pressing.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Good value press",
    "rating": "5.0 out of 5 stars",
    "content": "Very effective after I figured out lemons need to be turned opposite way of what the press “bowl” is duh. (Ie don’t lay the lemon round fitting in the bowl round. Lay the flat cut lemon facing into the bowl)",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Has held up for almost daily use since purchase.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "A wonderful utensil",
    "rating": "5.0 out of 5 stars",
    "content": "Recommended",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works great for squeezing lemons, limes, and Key limes (the small ones).  It would be nice if it had one or more holes in the handles for hanging it.  Very colorful and cute.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "What a glorious beast!",
    "rating": "5.0 out of 5 stars",
    "content": "Very substantial. Heavy duty…they dont make things like this anymore! Awesome..",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Robust, easy to use and seems from good material",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "As advertised",
    "rating": "5.0 out of 5 stars",
    "content": "This is well made. Easy to use. Gets all the juice out without any difficulty. Highly recommend.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love the yellow-and-green design; not only is it  cheerful and fitting for its purpose, the design helps the new or occasional user know how to use the device correctly. To make lemonade, place the (yellow) lemon half into the yellow section; to make limeade, place the (green) lime half into the green section.",
    "post_time": "Reviewed in the United States on October 18, 2022",
    "pid": "B0896ZL6FK"
},
{
    "title": "Lemon/lime juice squeezer",
    "rating": "5.0 out of 5 stars",
    "content": "When you see those bowl-shaped sections, it may seem counterintuitive but you actually place the fruit in face-down so the squeezed juice can flow easily through the holes. Ideally, pressing would cause the rind to take the shape of the bowl, completely inverting it and making the entire surface squeezable, but that doesn't quite happen. I use the Zulay squeezer first because it does cut down on the workload and changes it from totally requiring the use of the small finger and thumb joints.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I gave it 4 stars because used alone, it is not very efficient. But I will continue to use it along with the manual stainless steel juicer I have used for decades. This one looks like mine: https://smile.amazon.com/Stainless-Citrus-Orange-Squeezer-Kitchen/dp/B092VJ6V5J/ref=sr_1_24?crid=1RLICVSPV9F21&keywords=stainless+steel+manual+juicer&qid=1666046642&qu=eyJxc2MiOiI0LjYwIiwicXNhIjoiMy45OCIsInFzcCI6IjQuNDgifQ%3D%3D&sprefix=stainless+steel+manual+%2Caps%2C163&sr=8-24",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Here's How I Use This Squeezer",
    "rating": "5.0 out of 5 stars",
    "content": " My old juicer has the added benefit of allowing the capture of as much pulp as possible.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "NOTE: Pulp is precious. It is largely fiber, something sorely lacking in the Western diet. It also visually says \"homemade\" about your fresh-squeezed drinks.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Sturdy",
    "rating": "5.0 out of 5 stars",
    "content": "I also have a favorite knife for this purpose. I have the yellow one, naturally. It makes it easy to spot, a good thing. The rounded tip makes it ideal for removing citrus seeds and pushing the pulp down the channels of the stainless steel juicer without ever touching the knife's blade.  https://smile.amazon.com/dp/B0052C21HG/ref=dp_iou_view_item?ie=UTF8&th=1",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Here's my process for making excellent ice-cold lemon or lime ades or waters:",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "A Must Have",
    "rating": "5.0 out of 5 stars",
    "content": "This item should have been in our kitchen years before it was. Easy to use and clean, love the colors too.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Purchased this after getting tired of squeezing lemons into my drink. It's heavy duty and it works. Exactly what I needed.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "It does as advertised",
    "rating": "5.0 out of 5 stars",
    "content": "This works great! I have problems with hand strength and this is easy to use. I recommend it alot",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect lemon and lime squeezer. I was worried that I didn't have the hand strength to use it, but it worked easily and perfectly. Very well and sturdy made squeezer!!! Great company and awesome product!!!! My go to company for other products from now on!!!",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "works great, easy to clean",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It makes a mess",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Awesome product!",
    "rating": "5.0 out of 5 stars",
    "content": "good",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "How did I live without this with all the fresh citrus I use! This gadget gets EVERY LAST DROP out of that lemon, lime, orange…..",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Love it",
    "rating": "5.0 out of 5 stars",
    "content": "I used fresh lemon juice in my tea and water regularly. I can squeeze all the lemons I need to keep me in lemon juice for the week with this tool. Cut your lemon in half at the circumfrance (the short way around, not the long way) place it in the device cut side down and squeeze. I like to readjust the lemon after the first squeeze and give it another squeeze. I don't have any issue with the tool, but the lemons I get (all the way up in the far reaches of New England) are less than great sometimes and some seem to be more rind and peel than actual fruit. However, this tool can get some juice out of them. If you have an extremely large lemon, you might have to quarter your lemons to fit the tool, but I have had to do that maybe once or twice. A tiny seed may escape into your juice from time to time, but it's really no inconvenience. Since the lemons I get are shipped from afar I assume they are waxed on the outside, so your tool will build up a bit of wax and citrus oily residue. A scrubber sponge and some hot water does the trick. I've run it through the top rack of the dishwasher before, but the residue stayed. Comes off easier when you hand wash it.",
    "post_time": "Reviewed in the United States on June 7, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Awesome products…. Easy to use and you get all the juice!",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Very sturdy",
    "rating": "5.0 out of 5 stars",
    "content": "Love this!  Easy to use and clean",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm crushing these lemons with ease and the sturdiness of this product. Someone get these lemons aid!... get it :)",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "The Big Squeeze",
    "rating": "5.0 out of 5 stars",
    "content": "Use it daily to make lemon water",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works great. Gets most of the juice out without the seeds.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Love this kitchen tool.  I use it almost every day",
    "rating": "5.0 out of 5 stars",
    "content": "This is so easy on the hands and it gets all the juice out without seeds. I like how I can do both lemons or limes in one tool.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this to replace a different juicer that I broke the handle off. This juicer is built strong and the lime/lemon feature is a nice touch. No complaints about its functionality or durability.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Works great!",
    "rating": "4.0 out of 5 stars",
    "content": "My second one. Works great but only four stars because my last one did break. Hopefully this one lasts longer.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really like this tool.  Works great and love the yellow and green colors. Very happy with my purchase.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "I like how easy it is to use as a juicer.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product. I have been squeezing lemons for years by hand which is not the most efficient. I dreaded trying to juice lemons. This product is very sturdy and easy to use and it gets almost all the juice. I love the colors it comes in as well.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Easy to use!",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product! I made fresh watermelon lemonade for my daughter’s birthday party. I had 15 very large lemons to press and I couldn’t imagine not having this to use. I had to stuff the larger lemons in but it handled it with no problem. I like that this also has the smaller size so I can squeeze fresh limes for our guacamole. Some of the other ones I looked at don’t have it. I would definitely buy again!",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This works best with average sized lemons and limes. They fit better into the squeezing cup and then there’s less juice that escapes from the top and more comes out the bottom as it should. I like this regardless. It works.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Avoid giant lemons",
    "rating": "5.0 out of 5 stars",
    "content": "I have had it for two months and I have been using it for daily kitchen work and I use it to prepare sauces and dressings. It has made my work easier because it can squeeze both types of lemons. The only drawback is that if the lemon is too big, for example the size of an orange, it does not fit in the product.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wish I had seen this product before I bought the other product I bought.  This is a game changer!  So easy to use and you get every last drop of juice.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "good quality",
    "rating": "4.0 out of 5 stars",
    "content": "I found it easy to use.  My wife thought it was harder to squeeze.  So you need to have some hand strength to use comfortably.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very good product that is versatile and easy to use and clean. Will work for years.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Worth the squeeze",
    "rating": "5.0 out of 5 stars",
    "content": "This is the best for limes and lemons and small oranges",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nice",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Well-made",
    "rating": "4.0 out of 5 stars",
    "content": "It's a good tool, and we used it about once a week for 3 years before the enamel began to peel around the holes. I wish it would have lasted longer, but I suppose that's just the way things are made.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just the best lemon/ lime squeezer I've ever used. Very sturdy and does the job quickly and nicely",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Works",
    "rating": "5.0 out of 5 stars",
    "content": "Quality and price",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The 2-1 is a little awkward to hold/ use but it works well and cleans easily",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "A little awkward to use but works welll",
    "rating": "5.0 out of 5 stars",
    "content": "It is well designed and sturdy! I love the ease of use & yielded much better results than the electric version!",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is definitely better than I anticipated",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Well Made & Sturdy",
    "rating": "5.0 out of 5 stars",
    "content": "I use it almost everyday for fresh juice and works great",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very high quality and does exactly what it’s suppose to do .  Would highly recommend!!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Excellent product",
    "rating": "5.0 out of 5 stars",
    "content": "Very good product!",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought it for my 87 year old dad to make lemonade.  He loves the easy of use and sturdiness.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Quality",
    "rating": "4.0 out of 5 stars",
    "content": "Useful, well made",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very useful tool. Does a great job",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Best Squeezer!",
    "rating": "5.0 out of 5 stars",
    "content": "Best citrus squeezer ever! Limes, lemons, oranges - you name it. Just cut in half, load the chamber, and squeeze.  Love it!",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "There was nothing wrong with it.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Found a better one so I returned this",
    "rating": "5.0 out of 5 stars",
    "content": "No dislike love it",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Should last.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "We love our products",
    "rating": "4.0 out of 5 stars",
    "content": "I’m very happy with this and use it regularly.  I wish the juice holes were smaller or somehow prevented the seeds from passing through",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Absolutely love this squeezer!!! Super strong!!!! I don't worry that it's going to break. Did a great job with my limes. This is a keeper!!!",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "not plastic",
    "rating": "5.0 out of 5 stars",
    "content": "Does what it's supposed to do.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works beautifully.  Easy cleaning.  Very sturdy",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Sturdy",
    "rating": "5.0 out of 5 stars",
    "content": "Replacing my previous lemon/lime juicer that finally failed me. This one performs as expected and makes juicing citrus a breeze. Highly recommend.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works great and is made of real metal. Should last a long time.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "The juicer of juicers!",
    "rating": "5.0 out of 5 stars",
    "content": "I wanted lemonade without the additives, juice at a much lower expense. I needed vitamin c. So I bought lemons, halved them, popped a fork in, swished and squashed the pulp, back and forth until the juice came out, along with a lot of seeds, and getting juice on my fingers and sometimes my clothes. Used the same fork to fish the seeds out of the glass and left the rind in the glass (wanted to use all the pulp). It was a messy job. Had to wash my hands and fork.",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "With the Zulay, i popped in half a lemon, squeezed the handles and voila', juice in 2 seconds!  One tiny pip in the glass, meh. Didn't need the rind, no pulp left. Rinsed the Zulay in hot water and put it in the dish drain. This is so much easier.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "It juices very well",
    "rating": "4.0 out of 5 stars",
    "content": "It was a little hard to get used to, I do like it now.  At first the pieces kept moving and I had to lay it down to get the lemon in the area that I needed it to be.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good citrus sqeezer.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Squeezy",
    "rating": "5.0 out of 5 stars",
    "content": "I like the ease of the juicer",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really like this efficient juicer.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "We really love this citrus squeezer. It works great. It is pretty sturdy, even though it looks fragile. It’s easy to squeeze and easy to use.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was skeptical about replacing my old manual juicer with this one. The reviews were great, and the price was right, but it still seemed too good to be true. My hands hurt sometimes when I have to juice more than 1 lime or lemon using my manual juicer where I have to press down. Well, I ended up buying this little guy and I have to say I am a very happy customer!!! I am only upset I didn't buy it sooner... it makes juicing SO easy and painless. It comes with instructions and a lifetime warranty too. I love my new juicer. 🥰",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Works as intended",
    "rating": "5.0 out of 5 stars",
    "content": "Not messy!",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Holds the seeds in",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Very well made.",
    "rating": "5.0 out of 5 stars",
    "content": "Appears costly but it's not. It's a great price. Does a neat job of juicing lemons. Sturdy n sleek. Feels strong and unbreakable. Like it.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I like the different sections for the different fruits.  The only problem I have with it is hand strength.  It really doesnt take that much to squeeze and get the juice, thats why I like it, but my hands have arthritus since I am older.  But then again its a good hand excercise for me as long as I don't try to squeeze too hard too fast.",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Nice tool",
    "rating": "5.0 out of 5 stars",
    "content": "Other than that, its wonderful and would be great for anyone.",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This squeezer gets the last drop of juice from a lime like I could have NEVER squeeze before!!!  I used to hand-squeeze limes and often times left most of the juice in the lime because I just didn't have the strength but this little tool makes it FUN and efficient and I actually look forward to using it!!",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "How DID I live before this squeezer?!!! Like an ANIMAL!!  (not that animals are bad)",
    "rating": "5.0 out of 5 stars",
    "content": "I love this but the handle could be smoother",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "High quality product with ease of use.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Works great",
    "rating": "4.0 out of 5 stars",
    "content": "It squeezes the lemons and limes to get the most juice. It's much easier than hand squeezing.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This lemon/lime squeezer works great and has a decent build. Only time will tell how long it lasts, but in terms of function and feel, it is good.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Good quality",
    "rating": "5.0 out of 5 stars",
    "content": "Cast aluminum with a stainless hinge - seems strong enough.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B0896ZL6FK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Light weight is a plus.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B0896ZL6FK"
}
]