[
{
    "name": "        Elite Gourmet EFD319 Food Dehydrator, 5 BPA-Free 11.4\" Trays Adjustable Temperature Controls, Jerky, Herbs, Fruit, Veggies, Dried Snacks, Black       ",
    "stars": [
        "69%",
        "15%",
        "7%",
        "3%",
        "6%"
    ],
    "pid": "B08BSQZ2LS",
    "ratings": "8,835 ratings",
    "other_info": {
        "Brand": "Elite Gourmet",
        "Material": "Aluminum",
        "Color": "Black",
        "Wattage": "350 watts",
        "Product Dimensions": "11.4\"D x 11.4\"W x 8.5\"H"
    },
    "discount_price": "$ 45.",
    "normal_price": "",
    "about_this_item": [
        " ADJUSTABLE TEMPERATURE from 95ºF to 158ºF that foods are dehydrated at their optimal temperature and horizontal air flow distributes heat evenly and efficiently.  ",
        " HEALTHY SNACKS: Prepare 100% all-natural dehydrated foods and snacks with no added sugars, additives or preservatives. No more processed junk food, dry healthy fruit rolls, trail mix, granola, etc.  ",
        " FUN AND CRAFTS: Perfect for hobbyists to dry flowers, potpourri or dough crafts and pet lovers to prepare healthy and delicious 100% natural treats for their furry companions.  ",
        " EVEN HEAT DISTRIBUTION: using a base mounted fan promotes even drying and air circulation. Large viewing window allows you to monitor the drying process.  ",
        " SAFETY TESTED: ETL Listed at 350W of power / 120V is perfect for home use. Do not use outdoors. Dishwasher safe removable parts.  ",
        " 1 YEAR WARRANTY and U.S. based customer support team means you can buy with confidence.  ",
        " Includes 5 x BPA Free Trays that are fully immersible and dishwasher safe.  "
    ]
},
{
    "title": "Easy to use and clean",
    "rating": "5.0 out of 5 stars",
    "content": "My first batch of dried fruits didn't come out well. But I didn't do better research. Definitely going to try again.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Maybe it is because I;m new at this ,but it took 4 days to do potato\"s , I almost think I should of just done it in the oven, But it did the jib for drying herbs , and fruit.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "it's ok",
    "rating": "5.0 out of 5 stars",
    "content": "Works well but we learned that we need to cook everything longer than the times in the book",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This product is so cute. Easy to clean, very Durable, the fruits Taste great. Worth buying",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Love it",
    "rating": "4.0 out of 5 stars",
    "content": "I have used this machine many times now. It works well and has a descent capacity for the money. If you want one that holds more or dehydrates faster you will have to spend about twice as much.",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "excellent.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Love this product",
    "rating": "5.0 out of 5 stars",
    "content": "We did herbs last night and it took 6 hours for the basil. It worked amazing. Basil has large leaves so we had to go a little higher on temp. But worked well.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This device is cheap and does exactly what I need with my jerky and veggies im saving for the future in my freezer.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Works well for the value",
    "rating": "3.0 out of 5 stars",
    "content": "Received a few weeks ago. First effort was strawberries, which instructions indicated would take 8-10 hrs. Took almost twice that, rotating trays,, and never completely dehydrated. Next effort was basil. Should have been an easy one, taking just 4-6 hrs at low setting. Ran for 12 hrs at that setting, but nothing dried. Upped the temp and ran another 6 hrs. Still didn't dehydrate, so I trashed them. Not hopeful that this will ever work, but will try a few more items before I send it back.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Wondering why its such a great price? Its tiny. This might work for many people, but I wanted a regular full size one. I bought silicone fruit leather trays and they were huge in comparison to this unit. I sent it back so I cannot review functioning. Of course check diameter, like I did not. Duh.",
    "post_time": "Reviewed in the United States on April 2, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Great Budget Friendly Dehydrator",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this dehydrator because it had good ratings as a budget dehydrator.  I have used it A LOT in the few weeks I've had it.  I've made several batches of beef and pork jerky, and dehydrated fruits including strawberries, mango, pineapple, and apple.  I also have made blueberry banana fruit leather.  I love it so far.  My only comment is that I have to rotate the racks top to bottom to get more even dehydrating.",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Recieved faster than expected, product exactly as described. Make sure you read directions and let it run with no food in it, electric heat elements always burn off factory manufacturing oil when new which kinda smells like oil burning, becuase it is, and was good after 30 min on high.  Drying racks are kinda shallow but you can adjust height a little, and the top fits larger items. Works as described, would highly recomend for low end dehydrater",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "So far so good",
    "rating": "5.0 out of 5 stars",
    "content": "I got this to make deer jerky and it works perfectly. Great value for price",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Really wonderful, especially for the price. Super simple to use and clean. You can dehydrate a lot at once.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Deer jerky",
    "rating": "5.0 out of 5 stars",
    "content": "This is my second dehydrator. The first one was a Nesco. It was a workhorse and I miss it. This one takes longer but it has better temperature choices. It has worked for me. I've used it non-stop since getting it earlier this week.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "First time I used it. Tried to dehydrate turkey bacon, was disappointed how it came out. didn't eat it was worried about not getting done correctly",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Love",
    "rating": "3.0 out of 5 stars",
    "content": "Works fine. No timer. Do not follow their instructions and/or add at least 2 hrs to your time. Given the price, it’s a good value",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Compact and efficient. I have older models that are much bigger, but I like the size of this one and the fact that you can change the temperature on it.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Exactly What I Needed",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this to make healthy treats for my dog (and myself). I used it to make dried sweet potatoes, bananas and chicken jerky (in separate batches). All turned out well. The unit is compact too - important for people like me with tiny condo kitchens. It is a good choice for anyone wanting an affordable dehydrator.",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I had a bumper crop of all sorts of tomatoes and decided to get on the dehydrator train and see if I could put some aside for cooking later. The dehydrator price is so low (imho) that I thought it couldn't possibly be any good but... I'm relatively pleased with it.  I don't like the temp controls for two reasons: 1) I wish companies would stop using a small bump or arrow on a black dial, making it virtually impossible to see the setting. 2) this dehydrator has three temp ranges, not a specific temp you dial in. You want 135º for your use, nope, gotta guesstimate that on the black on black dial. It does do the job. The trays are not easy to clean but not terribly hard. Easy to access, but of course the food sticks in the holes in the trays. The biggest bummer is the stacking arrangement. The trays a fiddly to set and to adjust, not impossible, just a bit of a pain. After all that you might wonder if I'd buy it again, and yes, I would. The price compensates for the little things that bug me. :D",
    "post_time": "Reviewed in the United States on August 29, 2023",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Works....",
    "rating": "3.0 out of 5 stars",
    "content": "for now.  But is noisy.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We have an herb garden that's overflowing with Oregano and soon to be overflowing with Basil. I had a similar dehydrator like this years ago, and I used it to dry out herbs and also to make snacks (banana chips, apple slices), and preserve tomatoes.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Oh this is nice, and the house smells like Oregano now.",
    "rating": "3.0 out of 5 stars",
    "content": "Setup was easy... just needed to clean and let run for a couple of hours to burn off any \"new smell\". Then the Oregano went in and it filled the house with this  wonderful spicy smell.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great way to preserve the stuff we grow in the garden. Highly recommended!",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Works good takes some time but dries",
    "rating": "5.0 out of 5 stars",
    "content": "Works!",
    "post_time": "Reviewed in the United States on November 8, 2023",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I gotta be honest, I have always wanted a food dehydrator but I didn’t want to break the bank. This dehydrator was perfect for me. It’s quiet, easy to clean, and stores easily, especially since the trays reduce to a smaller size. It was easy to use since day 1.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Excellent for the price",
    "rating": "5.0 out of 5 stars",
    "content": "Now I’ll have the perfectly dehydrated food for my emergency supplies, and hiking trips!",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The machine is very nice. It works perfectly and I made chicken jerky for my dog. It was very easy. The trays are nice it’s easy to clean quiet. I had one like this years ago. And loved it and used it often. I have almost my culinary degree. My daughter is a personal chef. It arrived on time and it is good. I do like it a lot. I moved years ago so I didn’t have my dehydrator and I wasn’t sure I wanted to replace it but after getting it again I remember how much I missed it. It litterally pays for itself in a couple uses. Last year I bought dehydrator fruits as a gift. This machine I can make the fruits myself for presents. I cook for the police and fire department as gifts. This is chef quality product. Thank you. With my dog it cost like 11 dollars for a page of treats. I can get a whole tray of chicken for 15 dollars and have like 88 dollars of treats for that much. The savings is unreal. The quietness of the sound of the machine is perfect. It gives a white noise background which is very nice. I highly recommend. But there is no buzzer as far as I can see. The person using this divise will have to turn it off. You have the responsibility to turn off the machine after five or 6 hours. So it is for an adult.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Nice dehydration",
    "rating": "4.0 out of 5 stars",
    "content": "It does everything it ideas",
    "post_time": "Reviewed in the United States on January 2, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Works as it should, ez pz",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Awesome Machine",
    "rating": "5.0 out of 5 stars",
    "content": "This thing is an unbelievable jerky making machine. Right out of the box, I ran 2 batches of jerky through it, did 2 batches of garlic and a batch of mushrooms.  It literally ran non stop for 3 days after I opened it. Super efficient. Almost Silent. And a breeze to clean. And unlike some other dehydrators I've had over the years, this one has two tray height settings and the temperature controll is spot on. I checked it with my infrared thermometer and the temperature was consistent throughout the cycle. I was able to take my jerky down to 6% moisture (my preferred moisture content for long term storage) without any problems at all. To be honest I wasn't expecting much for the price, but I was blown away with this units performance.  I ordered a second one, and I'll have one just for meats and one strictly for vegetables. I would recommend this unit to anyone who wants to preserve foods or make jerky. EXCELLENT VALUE!!!!!!!! 👏 Bravo!",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The dryer trays don’t get dirty or stained",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "This product functions as advertised",
    "rating": "5.0 out of 5 stars",
    "content": "This has helped me keep food from going to waste. When I notice that things are not being used or about to start going bad, I prep them up and put them in to be dehydrated. This helps extend the life of my fruits, veggies, and meats.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had wanted a dehydrator and finally bit the bullet and got one. I was tired of paying the prices for beef jerky during a time when I was eating  a lot of it because of how much hiking I was doing. It is a great snack to bring along for those adventures. After getting this I have made a lot of batches of beef jerky and this is a great dehydrator for drying meat. I have done strawberries and bananas, but I am not as big of a fan of dried fruit. An item I’d like to try next year is drying tomatoes and making sun dried tomatoes in an olive oil as a way of preserving tomatoes since I usually get quite a few. It takes a little longer than other dehydrators, and you may not be able to do as much, but it is a great beginner dehydrator. This product also is not digitally controlled but it is pretty accurate.",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Great product!",
    "rating": "1.0 out of 5 stars",
    "content": "Bought this as a gift so it did not get used until after the Amazon 30 return policy and had to go to the manufacturer. It stopped heating during the second use and this is now the return policy.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Thank you for contacting us. We are sorry to hear you are experiencing trouble with your unit. Do you have the unit connected straight to a wall outlet (not to an extension cord/surge protector)? Have you tried to plug the unit in a different wall outlet with no other appliances?",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Best Beef Jerky",
    "rating": "4.0 out of 5 stars",
    "content": "For us to better assist, please provide a short video showing the problem so we can further check. We will also need clear photo of silver label underneath/behind unit and COMPLETE copy of the purchase or gift receipt/invoice showing ALL order details.",
    "post_time": "Reviewed in the United States on July 18, 2023",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Video steps - should be showing on the video;",
    "post_time": "Reviewed in the United States on February 2, 2023",
    "pid": "B08BSQZ2LS"
},
{
    "title": "DO NOT BUY AS A GIFT!",
    "rating": "5.0 out of 5 stars",
    "content": "•  Plug a different appliance/product on the outlet first, to test if it's working.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "•  Remove the trays & lid then plug the dehydrator main base to the working wall outlet (not to an extension cord). Set to MAX temperature.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Nice little dehydrator. Seriously!",
    "rating": "5.0 out of 5 stars",
    "content": "Nice little dehydrator. I ordered and received it. I didn't realize it only had 11\" plates when I ordered. I was replacing a dehydrator that had almost 13\" plates which barely had enough space for my needs so was disappointed when I saw it. It wasn't going to serve my needs so I returned it to order a bigger one. But before I sent it back I decided to test it. First I really like the feature which allows you to increase the height of the stack on each tray so the one above it doesn't sit right on top of what you're dehydrating. My old one didn't have that feature. Next I like the ability to adjust the temp. It doesn't have a thermostat. It just turns the heat on and off at variable timing like a rheostat. I used my digital thermometer to cycle through and check if it actually hit the temperature ranges as shown on the nob panel. It did but when placed on the highest setting it had to cycle about 6-7 times before hitting that range. So it builds slowly but does get there. That range being to high in my opinion to be used for dehydrating anyway. 158 degrees. So at $42 I highly recommend if you're OK with 11\" plates. I'd definitely buy a bigger one from them if they made one!",
    "post_time": "Reviewed in the United States on May 31, 2023",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect love it. Works great drying my herbs.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Great",
    "rating": "4.0 out of 5 stars",
    "content": "This is good quality for the money. I wish I read the description better, I didn't realize the temperature didn't go higher",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I make jerky and dog treats with if",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Good quality",
    "rating": "5.0 out of 5 stars",
    "content": "I dehydrate food for my two dogs instead of buying treats that are mostly grain.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It works very well and is easy to keep ckean",
    "post_time": "Reviewed in the United States on June 7, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Love it",
    "rating": "5.0 out of 5 stars",
    "content": "This was purchased for my sister. She loved it so much, we purchased 2 more for other family members that wanted it. I've never used it, but everyone else raves about them and they are constantly being used.",
    "post_time": "Reviewed in the United States on May 26, 2023",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This little machine is so straightforward to use! I’ve had it just over 24 hours, and so far have dehydrated pear (delicious), apple, strawberries, bananas and, of course, sweet potatoes for my dogs! I don’t know why I waited so long to buy a dehydrator . It’s not only fun to use, but dehydrated fruits are a much better snack than chips or cookies.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Easy to use",
    "rating": "4.0 out of 5 stars",
    "content": "The machine is quiet, doesn’t heat up my kitchen, the trays are dishwasher safe…..",
    "post_time": "Reviewed in the United States on February 8, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Bottom line: get this machine. You won’t regret it!",
    "post_time": "Reviewed in the United States on March 22, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Decent Product",
    "rating": "3.0 out of 5 stars",
    "content": "I use this mostly for drying herbs, but I have also used it for some fruit. I am not sure if the temperature control isn't good, but drying times take about 25% longer than listed in the manual.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works well- used for making fruit jerky and veggie fries",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Brother loves it",
    "rating": "4.0 out of 5 stars",
    "content": "The fan and controls have a learning curve if you expect the dehydrator to perform. The dehydrator takes several days on the lower settings and can burn items on the higher setting. There is definitely a learning curve as where to set the temp for the item being dehydrated. Over all it appears to be a good dehydrator only time will tell.",
    "post_time": "Reviewed in the United States on December 21, 2023",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely love this! I bought it to make chicken & beef treats for my Chihuahuas. I cook their food & wanted to dehydrate their treats, so they would be healthy. Unlike treats from China. I also dehydrate granny smith apples for me. Wished I'd bought this a long time ago. Easy to clean up. Highly recommend this!",
    "post_time": "Reviewed in the United States on May 2, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Learning Curve Required!",
    "rating": "5.0 out of 5 stars",
    "content": "I liked everything about this dehydrator . I’ve only used it for veggies.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I gave this to my granddaughter for her 14th birthday to go with her hydroponic herb garden she received for Christmas, she is so excited and loved it",
    "post_time": "Reviewed in the United States on January 13, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "A must have!",
    "rating": "5.0 out of 5 stars",
    "content": "This works great, I dehydrat sweet potato for dog treats.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've used this to dehydrate herbs (basil and thyme).  It was taking a long time to dehydrate at the set temp of 95, so I turned it up to at least 125.  Also bought separately the liners to put in the trays so the dried herbs don't fall through.",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "B08BSQZ2LS"
},
{
    "title": "I found that it was very easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this because the dog treats that I purchased for my dogs were getting so expensive. I have four large dogs and the treats originally were about 8.99 for a 37 oz. container. Over the course of about a year and a half, the price went up to $19 a container. I told my husband, it would be cheaper for me to buy meat and slice it, dehydrated it, and give that to our dogs. So that’s what we do. I buy meat when it’s on sale, slice it up (with an electric meat slicer I purchased), marinade it, put it in bags, and put it in the freezer until we need to dehydrate it. Our dogs love them, and they’re healthier too.",
    "post_time": "Reviewed in the United States on November 10, 2023",
    "pid": "B08BSQZ2LS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Out of the couple dehydrators I have had this one is the best I would recommend to anyone and even gift it to someone wishing to have one.very quiet makes house smell delicious with whatever is being dehydrated",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "B08BSQZ2LS"
}
]