[
{
    "name": "        COKUNST Electric Wine Opener, Battery Operated Wine Bottle Openers with Foil Cutter, One-click Button Corkscrew Remover for Home Kitchen Party Wedding       ",
    "stars": [
        "70%",
        "13%",
        "6%",
        "3%",
        "8%"
    ],
    "pid": "B08D8XHNXQ",
    "ratings": "8,554 ratings",
    "other_info": {
        "Material": "Plastic",
        "Color": "Black",
        "Brand": "COKUNST",
        "Product Dimensions": "9\"L x 2\"W",
        "Is Customizable": "No",
        "Manufacturer": "COKUNST",
        "UPC": "745672411609",
        "Number of Items": "1"
    },
    "discount_price": "$ 12.99",
    "normal_price": "$18.99",
    "about_this_item": [
        " [Powerful & Durable]: The electric wine opener is with a powerful and fast cork removal function that can open up many wine bottles at one time. 4 AA batteries required (no batteries included)  ",
        " [Easy to Use]: Peel, Pop & Push---Only 3 steps to remove the cork in seconds. The transparent shell is easy to observe when pulling the cork out. The removable foil cutter is convenient to clean the wine opener  ",
        " [Full-Automatic]: This electric wine opener features an ergonomic grip for easy handling designed to fit all traditional wine bottles, just click button and the cork remove automatically with true hands free  ",
        " [Sleek Design & Portable ]: Our wine remover features the smooth surface with good hand feeling. There is blue led indicator light when the cork being drawn up from the bottle. Small size will be more convenient to take it out and save space  ",
        " [Use for Many Occasion ]: A great design concept that can save your time and energy. A perfect gift for any occasion like home party, wedding, restaurant, bar or outdoors party  "
    ]
},
{
    "title": "review",
    "rating": "5.0 out of 5 stars",
    "content": "works great",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This takes 4 AA batteries but can say how long they will last as week just have used it one time. Love the small size, makes it easy to store in a small home.",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Compact just right for our vacation home",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and easy to get the cork off the unit once the wine is opened",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It works great! Like that it uses replaceable batteries.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Much easier than a traditional corkscrew",
    "rating": "5.0 out of 5 stars",
    "content": "This works amazingly well",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We love it",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Great price",
    "rating": "5.0 out of 5 stars",
    "content": "This wine bottle opener is a game changer! I was tired of struggling to get corks out of bottles easily, especially with arthritis  in my hands. Now I just push the button and it comes out like magic.",
    "post_time": "Reviewed in the United States on February 7, 2022",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My son and I had been talking about how much difficulty we each have in being able to open bottles of wine that have a cork. We each have regular corkscrews but couldn't quite get the hang of it without the cork breaking. In my case, I don't have the finger/hand strength to pull the cork out the regular way. Then, I saw this electric wine opener. I looked at others too but this one seemed to be the easiest one to use. So, I bought one of each of us as Christmas gifts. I have already used mine to open some wine that I needed while making Coq au Vin and it was a breeze. The directions are easy to follow and it was easy to install the batteries. I especially like have the foil top cutter at the top of the opener that you can pull off, place it around the top, turn it one full circle, and the foil top lifts right off. It couldn't be easier and I had my wine open in no time. I plan to buy more as gifts for my friends and family members too. This is definitely one of the best buys of my Christmas season and probably the gift that I will use the most.",
    "post_time": "Reviewed in the United States on April 3, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "The function of this tool",
    "rating": "5.0 out of 5 stars",
    "content": "It Works!!  I was skeptical of it being powerful enough with the battery power of 4 AA batteries, but it does a wonderful job.  Cutting the paper off of the bottle is a manual action but the corkscrew opens bottles with ease.",
    "post_time": "Reviewed in the United States on September 28, 2023",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Obviously a \"knock off \" product, but this works well.  Have opened a case of wine so far on the first set of AA batteries.  They have a rechargeable model but we don't have outlet space for yet another charger.  The foil cutter is why I got this, was shopping for a foil cutter and found this with cutter for maybe twice the price of a two pack of foil cutters.  This also conveniently stores the foil cutter so it is there when you need it.  Only complaint is that it would be better if the cutter was stored on the top instead of being on the bottom blocking the corkscrew for when  you don't need to cut the foil.",
    "post_time": "Reviewed in the United States on April 27, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Wow... it really works",
    "rating": "5.0 out of 5 stars",
    "content": "So, I should mention that I an a beverage professional (seriously I work for a Spirits and wine producer). I open a lot of wine for work and really love my traditional double step wine key. I saw this and thought it was going to be a cool novelty especially at the price point. BUT, I was surprised. This thing is the real thing and does a great job. I should point out that it is vital and important that you remove the foil first. I have seen so many people open wine the wrong way and it is bad... If you remove the foil completely that is even better. (no matter what you use to remove the cork). THe only test I have remaining is trying it out on a synthetic cork. If I do, I will report back and update this review. Either way, this really is a great product and works exactly as it should (if you do it the right way). So if you read others and they complain about this then they have no idea how it works... I will be buying these for all my wine drinking friend for Christmas.",
    "post_time": "Reviewed in the United States on July 23, 2021",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It’s great for the money but it is cheaply made. It feels like it will break soon. But so did the rabbit and it was $100 compared to this at $10",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Good enough for now",
    "rating": "5.0 out of 5 stars",
    "content": "Wanted an opener with replaceable batteries.",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Does not work for some corks (removal only). Will need to buy a more powerful one.",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Works Great.",
    "rating": "5.0 out of 5 stars",
    "content": "I love it.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Had an Oster for 10+ years that I broke so bought another same brand. Big mistake… the cork would always get stuck so returned that one  and read a review from someone else that did what I believe to be the same thing and they highly recommended this one. And boy were they right. This one is quite, fast and smooth as melted butter. Try it and you will know exactly what I am talking about. Oh and buy extras…. Perfect for gifts and you will want a couple stored away just in case you break the one you have, you will definitely want to replace it with the same one. Speaking from experience!",
    "post_time": "Reviewed in the United States on July 16, 2023",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Underpowered for cork removals",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this wine opener for a friend that has MS. She was having difficulty opening wine. This solved her problem!",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As a bartender, that works a high-volume festival every weekend. This is my best friend.! It takes about 6 to 7 seconds to open a bottle !",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Easy to use the best corkscrew opener.",
    "rating": "5.0 out of 5 stars",
    "content": "Updated post 5-stars (2022-09-08)",
    "post_time": "Reviewed in the United States on May 30, 2022",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The replacement device arrived. I put in 4 batteries. It pulled a cork out of a wine bottle. Viola! We're back in business! Thanks NHTon for your excellent customer service!",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Very easy to use.",
    "rating": "5.0 out of 5 stars",
    "content": "This is very easy to use and would be great for folks who don't have good hand strength, but who also must have their wine.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "nice size",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "works",
    "rating": "5.0 out of 5 stars",
    "content": "Good gift for Father's day",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Looks and feels nice !",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Perfect gift",
    "rating": "3.0 out of 5 stars",
    "content": "Cheaply made. Don’t recommend. Broke first time I used it.",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to use.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Good Quality",
    "rating": "5.0 out of 5 stars",
    "content": "It makes opening a bottle of wine super easy!",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Hands down the best investment.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Easy to break.",
    "rating": "4.0 out of 5 stars",
    "content": "No tiene buena potencia a la hora de sacar el corcho toca hacer mucha presión y fuerza",
    "post_time": "Reviewed in the United States on December 4, 2023",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "My mistake for not researching well enough. This thing will use batteries up pretty fast. The $ of rechargeable battery packs plus $ for this plus swapping out batteries makes the rechargeable version a bargain.",
    "post_time": "Reviewed in the United States on March 31, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Wonderful item for daily use",
    "rating": "5.0 out of 5 stars",
    "content": "It’s nice  and easy to use",
    "post_time": "Reviewed in the United States on May 5, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I only used it a couple times. I tried using it this week and it wouldn’t operate and noticed the batter metal part ( see picture ) came off. It’s too far out to return. Not happy with the turnaround.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Battery metal came off",
    "rating": "5.0 out of 5 stars",
    "content": "Small sleek attractive on counter top, does the job!",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "It works the first few times you use it. After that you’ll be throwing out entire wine bottles. It almost broke the glass when drilling it the first few times going straight down.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Compact and powerful enough",
    "rating": "5.0 out of 5 stars",
    "content": "Use a different product",
    "post_time": "Reviewed in the United States on May 23, 2023",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought my husband an Oster electric wine opener for Christmas based on the good reviews it had received.",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Ineffective & Dangerous",
    "rating": "5.0 out of 5 stars",
    "content": "It was awful!!  The corkscrew struggled to move down through the cork - it took two people to hold the bottle still as it was being opened. So I decided to try the Cokunst Electric Wine Opened because it was battery operated.  This is the one to get!  Opens the wine so smoothly and easily and you can see the cork as it moves out of the bottle.  Wish I had noticed this one instead of the Oster.",
    "post_time": "Reviewed in the United States on March 24, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Best one ever.  Also inexpensive!",
    "post_time": "Reviewed in the United States on May 8, 2023",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Works great!!",
    "rating": "5.0 out of 5 stars",
    "content": "Very simple to use and great value",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "B08D8XHNXQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought two of these while they're on sale for under $13. Worth every penny. Pulls the cork out easily. The nifty foil cutter works great and is a nice touch. The only two outstanding things for me are battery life and longevity. I've only used it a few times since I purchased so I cannot report on those two yet.",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "B08D8XHNXQ"
}
]