[
{
    "name": "        AOA Studio Collection makeup Sponge Set Latex Free and High-definition Set of 6 makeup Wonder blender For Powder Cream and Liquid, Super Soft Wonder Beauty Cosmetic       ",
    "stars": [
        "85%",
        "9%",
        "4%",
        "1%",
        "2%"
    ],
    "pid": "B08GSTPT8Y",
    "ratings": "17,665 ratings",
    "other_info": {
        "Brand": "AOA STUDIO",
        "Color": "Pink",
        "Material": "Sponge",
        "Skin Type": "All",
        "Recommended Uses For Product": "Makeup Sponge"
    },
    "discount_price": "$ 9.95",
    "normal_price": "$1.66",
    "about_this_item": [
        " ❣️Made from Latex free makeup blender sponge.  ",
        " ❣️Makeup sponges for BB cream, cosmetic foundation, concealer, powder, liquid, and etc.  ",
        " ❣️Super Soft feeling wonder blender.  ",
        " ❣️It's unique shape allows the blender to be used for many different products and easy to grip.  ",
        " ❣️Wet and dry use and easy to clean.  "
    ]
},
{
    "title": "First Time User - So Soft and Easy to Use",
    "rating": "5.0 out of 5 stars",
    "content": "I don't normally wear much makeup but since I have gotten older, I decided to try some foundation to help even out my complexion.  I wanted something to help me apply it evenly, so I researched and found these Super Soft Paw Paw makeup sponges.  After reading the reviews, I decided to try them.  They are so soft and make it easy to apply the foundation.  I also started to use them to apply my concealer and blush which I always use and normally just blended with my fingers.  The one thing I did find after washing them with a little Dawn dish soap and warm water is they still have some residue left on them from the foundation, concealer and blush.  It's not a big deal to me - I still reuse them after washing but that was the directions that were recommended.  I have another package sitting in my cart for future purchase.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve religiously used Beauty Blender for years now, but in this economy, a $20 face sponge had to be the first thing to go. These are a great, mush cheaper alternative! They have a great bounce, and actually soak up less product, meaning I use a lot less product! They don’t smell, like some cheap sponges do, and the color doesn’t run too much with the first couple uses. These are great, cheap sponges!",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Great, cheaper alternative to Beauty Blender",
    "rating": "5.0 out of 5 stars",
    "content": "Never waste your money on the name brand @ makeup stores. These little pinkies are just as good, if not better, and you get a big bunch of these beauties instead of just one sad sponge.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great dupe to the beauty blender. Will buy over and over again.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "She is pretty, bouncy and completely legit!",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to clean, soft, & affordable!",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "No fallan. Muy buenas, duran bastante.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Great dupe",
    "rating": "4.0 out of 5 stars",
    "content": "I like this beauty blender but I believe it picks up a little too much makeup.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use these to blend in my concealer. Very soft and makes my make up look really well when I get all the way done.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Best beauty blenders",
    "rating": "3.0 out of 5 stars",
    "content": "I do like them since they're really soft and come in a set of six and they retain a lot of water too. Just the problem I had was the blenders would get a weird texture once wet. Some bumps would arise once I gave it a squeeze the excess water out. Even if I wet it partially, the bumps would still appear.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Other than that it works fine but it does take a bit to wash them and some stains won't come off no matter how much you try.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Good soft basic beauty blender.",
    "rating": "5.0 out of 5 stars",
    "content": "Good soft basic beauty blender, & you get quite a few for the price. Good to have on hand so I can replace my makeup sponges more frequently.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "after trying multipleeeee sponges, this is my all time fave! Reminds me of the original beauty blender. Its super soft and great quality for the price.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "REMINDS ME OF BEAUTY BLENDERS",
    "rating": "5.0 out of 5 stars",
    "content": "These sponges are super squishy and soft…I love it",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "really wished i knew about this when i did freelance, but so nice and doesn't soak up so much product, blends everything so nicely.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Love them",
    "rating": "5.0 out of 5 stars",
    "content": "Las amoooo se consigue buena difuminacion de los maquillajes y son de muy buena calidad",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve been ordering these for years since I was in college and the quality is still the same! It’s easy to clean so I can use consistently and affordable to replace. Perfect for my kit as a makeup artist and for personal use.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "THE BEST",
    "rating": "5.0 out of 5 stars",
    "content": "These are so much better than the name brand and you get so many in a pack for so cheap it’s actual insanity.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very soft and feel better than the more expensive",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Excelente",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely LOVE these beauty blenders! They blend my foundation and creams extremely well and feel so nice on my skin. Great price for a bag of six! Ignore my bad hair day, I didn’t want to redo the video-ha!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the quantity and quality you get for the price",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Dupe",
    "rating": "5.0 out of 5 stars",
    "content": "All I can say is that these sponges are better than and more affordable than the beauty blender. My make always looks flawless and airbrushed. You get 6 sponges for less than one beauty blender. I will never spend 20 dollars on one sponge again.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are really good quality and they've never ripped on me unlike my beauty blender it was always ripping.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "The best!",
    "rating": "5.0 out of 5 stars",
    "content": "These are my favorite sponges ever! The only sponges I keep in my professional makeup kit! Highly recommend.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Me encantan, son realmente muy suaves, 100% recomendadas!",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Las Mejores!",
    "rating": "5.0 out of 5 stars",
    "content": "Increíbles las amé",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They are incredibly soft and blend your makeup beautifully. Softer than the beauty blender and real techniques.",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Súper suaves",
    "rating": "5.0 out of 5 stars",
    "content": "I've so far only used one but they are so soft I went from the beauty blender to the real techniques sponge and didn't like the quality change then to the Sonia Kashuk marbled ones and those are my",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Favorite two for seven dollars and great quality but I was watching Nikki La Rose and I believe she recommend these and they feel so soft and when I did my makeup today they were so squishy and left my cream products really seamless. I'll keep trying these and see how they hold up but so far I'm a fan.",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "These will be a repurchase!",
    "rating": "5.0 out of 5 stars",
    "content": "I love the softness of these sponges. I use them damp or dry depending on the product. I highly recommend them!",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love these sponges! I got them as disposable travel sponges because I hated packing my wet, freshly used (expensive) beauty blender in my suitcase right before closing it up. After using this brand for a couple of days I end up using these as my everyday sponges and stopped buying the beauty blender brand since these do the exact same thing. What I do now is use a new one the day I am traveling and then take the older, dry one with me on vacation and then just toss it after my last use. I haven’t had any issues with my makeup absorbing into them or anything else, but I do use a new one about every month or so.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Great inexpensive beauty blender dupe!",
    "rating": "5.0 out of 5 stars",
    "content": "These makeup sponges are great dupes to the beauty blender.  They are so easy to clean and apply makeup flawlessly!  For 6 sponges, it is a great price that can't be beat.  I love using these with my favorite foundation and they even work for pressing on loose powder after.  I will definitely be repurchasing these again in the future!",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So cheap yet so nice! I love that it’s a multi pack!",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Will buy again!",
    "rating": "5.0 out of 5 stars",
    "content": "This brand was suggested by the makeup artist I went through. I use it wet to apply my foundation so it looks like my skin. Usually lasts three weeks. I wash it after every use with Dawn.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "5/5 Stars, the best beauty blender dupes I've ever used. They are sooo soft and work so well compared to many other blender I've tried! So affordable i recommend to everyone I know",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Best Makeup Sponge",
    "rating": "5.0 out of 5 stars",
    "content": "I have been using the beauty blender for years. I picked these due to the reviews and price. Let me just say, this is a very good product. The sponge is super soft, makeup blends well , can use wet or dry and cost efficient. So , I love these and I will repurchase, AND THEY ARE REUSABLE, YOU CAN'T BEAT THAT ALRIGHT MY GIRLIES STAY BEAUTIFUL",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So great! I was a bit skeptical at first but once I tried and applied my makeup it worked just as great as the original beauty blender! I tried all the sponges from real techniques to beauty blender to elf sponges and this is the best.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "A repeat purchase!",
    "rating": "5.0 out of 5 stars",
    "content": "You get so many for such an affordable price! I def would purchase again!",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought a pack a couple months ago and fell in love I was on my last sponge when I was at Sephora and I decided to buy a $20 Beauty Blender because I desperately needed a new sponge and it was terrible I tried using it so many times and my makeup always came out looking so patchy and bad. So I ordered a new pack of these and I swear my makeup always comes out looking flawless. My under eyes always look so good after blending out my concealer. I can’t recommend these enough, seriously the BEST SPONGE out there!!",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "For my Budget Friendly Girlies",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this product because of a social media post. I bought them because I also heard good reviews about them and the price was right! They are super soft and the best part was that it doesn’t take the foundation off of my face! It makes blending foundation so seamless",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B08GSTPT8Y"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are the only sponge I use defy recommend",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B08GSTPT8Y"
}
]