[
{
    "name": " Magic Hour ",
    "stars": [
        "69%",
        "22%",
        "6%",
        "2%",
        "1%"
    ],
    "pid": "B08PW53JTD",
    "ratings": "35,987 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "Writing Magic!",
    "rating": "5.0 out of 5 stars",
    "content": "Writing Magic, that’s what Kristen Hannah does. I know her, mostly,from her more recent books and her superb writing, compelling characters, and creative plots that have drawn me in to eternal fandom.  I’ve decided to go back and read every single thing she’s written.  This story about a young child kidnapped, shackled and living in a remote forest, with wolves and other wild animals as her only companions is tragic, but an ultimately triumphant experience of the power of the human spirit to survive the unthinkable, and then finally thrive under the loving guidance of a loving and trustworthy adult. Little Alice, the “wild girl”, was so astutely created and developed, as was her progression through the pains, sorrows and fears toward the slow revelation that the world could possibly be a good place, and she might be a “good girl”.  We saw the progression and growth of every character in this novel.  Ten stars in my eyes!",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very pleased",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Magic hour",
    "rating": "5.0 out of 5 stars",
    "content": "Good book I’ll enjoyed it",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’m a huge fan of Kristin Hannah’s “weighty” books. Those have all been historical novels to date with a lot of grit, difficulty, and tragedy. This book had all of those characteristics. It was just a little light around the edges. That is why I gave this 4 stars instead of 5. But I do recommend it.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Book",
    "rating": "5.0 out of 5 stars",
    "content": "This is the most amazing story!  You won’t be able to put it down.  It will keep you waiting for the next chapter!",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The unusual subject matter of “The Magic Hour” contributed to the enjoyment of the novel.  Each character had their own demons to battle and overcome, so there was a lot to uncover and process.  The discoveries made a rewarding read.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "I loved Sarah’s character",
    "rating": "5.0 out of 5 stars",
    "content": "Quick read, this book is shorter and different than the other books I’ve read by Hannah. Intriguing story that keeps you reading to find out the truth about this young “wolf girl”.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is not the only book  I’ve read by this author. All of them kept my attention, but this one pulls at your heart stings. This is what love does, and this is what the book is about. The love of family that has taken years to conclude all because of one lost child.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "fabulous!",
    "rating": "5.0 out of 5 stars",
    "content": "What could have easily veered off into being too sappy, Hannah did a great job staying away from that line and kept the storyline realistic and authentic.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "How does she continue to write a story that you never want to leave????? Great book! I could not put it down ❤️",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "One of my favorite!",
    "rating": "5.0 out of 5 stars",
    "content": "A favorite Kristin Hannah story!",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There are a lot of different emotions throughout the story & it will tear your heart out but is so worth it. I would recommend this book to anyone who loves kids.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Best book I’ve read in a very long time.",
    "rating": "4.0 out of 5 stars",
    "content": "But still very good. Hard not to love little Alice and admire her tenacity and resilience. Lack of back story, though, on her time as a captive. Her relationship with the birds and animals was interesting.",
    "post_time": "Reviewed in the United States on April 29, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Well-written as usual and very descriptive, but not my favorite book by Kristin Hannah. It dragged on in multiple places. It focused too much on the sisters' love lives rather than the little girl.  I wanted to stop reading this book every time another chapter was wasted on Julia meeting up with Max to gaze into his eyes. But I pressed on. It was a long, tough read.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Not Her Best…..",
    "rating": "5.0 out of 5 stars",
    "content": "Kristin Hannah again made my eyes water like rain in the rain forest. This is a beautiful story of how love, patience and endurance can overcome many obstacles of the past. It’s also a story of a birth father who comes to realize his fantasy’s of fatherhood were not reality. Kristin always seems to write not only a good story but also emotions ordinary people experience.",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book. Half way through I could not put it down. I love all of Kristin Hannah’s book. This is one of my favorites.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "It was okay. Not her best.",
    "rating": "4.0 out of 5 stars",
    "content": "An abandoned feral child arrives at a small town in the Pacific Northwest with a wolf pup.  She does not speak but howls like a wild animal.  Ellie, the police chief of the small,  town brings her sister, Julia, a child psychologist to help treat the child.  A strong bond forms between Julia and the child while the search is on for her biological family.  I enjoyed the story and looked forward to the next learning adventure for the child.  Great cast of small town characters.",
    "post_time": "Reviewed in the United States on January 28, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really liked this book. It’s starts off kinda small town ish. But grows into a great story of love, kindness and human ways (good and bad). It made me laugh and cry. Could ‘feel’ the story many times. And I really just want to go live in a forest town in Washington. lol…. Thanks for the good read.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Magic Hour has a special light",
    "rating": "5.0 out of 5 stars",
    "content": "Read this in one sitting.  Bothe stand.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I usually like this author, but in this case this is a book I can easily put down.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Such a good storyteller",
    "rating": "5.0 out of 5 stars",
    "content": "You will come to love these characters so much you wish they were real. Kristen Hannah’s description of these places is so mesmerizing it makes me want to travel there.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love Kristin Hannah’s books. She might be my favorite author, but this book fell short. I honestly kept reading it hoping that some semblance of real life came through. The story just wasn’t even close to what this actual story would look like in reality. The timeline so short, all the parts coming together perfectly… had so much potential!!",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Tied Up Neatly",
    "rating": "3.0 out of 5 stars",
    "content": "Did not enjoy this one.  Story moved way too slow. Skipped to the last chapter and didn’t feel like I mossed anything.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love Kristin Hannah’s writing but this book might be my favorite.  I couldn’t put it down and didn’t want it to end….thats always the best",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Slow moving story",
    "rating": "5.0 out of 5 stars",
    "content": "Haven’t gotten around to reading this one by her but she’s never disappointing. I have other books by her.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Intriguing plot and character dynamics, super heart breaking human cruelty, and many happy tears. Great story, I couldn’t put it down.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "one of the best",
    "rating": "5.0 out of 5 stars",
    "content": "I totally loved this book, I couldn't put it down.  Alice captured my heart..such a sweet, brave, innocent little girl who won everyones heart.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Another good book.  This one maybe a tad too Disney of an ending and maybe a little too much romantic semi-nonsense, but I enjoyed it very much anyway and will probably now have to read the rest of Ms. Hannah’s book. I’m glad she keeps them coming!",
    "post_time": "Reviewed in the United States on February 14, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Great author",
    "rating": "3.0 out of 5 stars",
    "content": "I recently have become a big fan of this author and was really looking forward to reading this book. Having finished it, however, I am somewhat disappointed. The plot was very predictable, and there were many, many loose ends that were never tied up at the end. One completely inaccurate detail was \"Alice\" and her relationship with the wolf pup, and her relationship with wolves in general. The problem is, wolves were exterminated from the Olympic Peninsula decades ago and have not become re-established. Anyone who is familiar with this area, as the author of the book claims to be, would know this. Coyotes yes, wolves no. I was unable to reconcile this disconnect. As we eventually discovered the circumstances under which she had ended up being \"raised\" in the woods with little human contact, save her captor about which we were told almost nothing, many other details did not add up either. Such as, how did she end up being so influenced by wolves and other wild creatures, as well as so adept at tree-climbing and moving about in the woods, when she had been captive and shackled and tortured for nearly all of the 4 years leading up to her discovery?? Or was that not the case?? Nothing was clear about any of this. But the disappearance of her captor is what caused her to venture into town looking for food, which is when she was discovered, so one can only assume he kept her a prisoner for the 4 years leading up to that. This is but one of many questions I had as I neared the ending. I also wanted to know more about her captor, the murderer of her mother, the man who shackled this little girl and kept her prisoner. Who was he, and why did he do it?? Exactly what happened, and what were the circumstances that led up to the kidnapping? What did he do to Alice for the 4 years he had her, and why?? For me, he needed to be more than just a generic bad guy. Run-of-the-mill bad guys, who are otherwise uninteresting, do not kidnap a mother and her 2-year old daughter, kill the mother, and keep the 2-year old as a prisoner in the woods for 4 years without there being something really messed up. I would have found these details far more interesting than the few that were shared about the girl's father! The question of whether the father did it or not was nowhere near suspenseful enough to make up for what we were never told about the man who did do it. Thus,  I was left disappointed and unfulfilled, even with the happy (but predictable and boring) ending. Also, I was desperate for one more chapter, which skipped to when \"Alice\" became a young adult, to learn what sort of person she eventually became. I had so hoped for that but was left wanting. Too bad, this book could have been over-the-top excellent had these additional details been fully explored, and had the wolf shtick been omitted... unnecessary to the plot, even if there were wolves in the Olympics. As it is, three stars anyway, because like all of this author's books, you get wrapped up in the plot and can't put it down!",
    "post_time": "Reviewed in the United States on November 21, 2018",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This story had me on the edge of my seat! Made me cry! Beautiful and heartbreaking all at the same time!",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "TEN STARS!  One of her best!",
    "rating": "5.0 out of 5 stars",
    "content": "A MUST READ!!  This book grabbed me right from the beginning. I read it in 24 hours. I felt like I was there in the story with them the entire read. I actually miss the characters now that I’m done!",
    "post_time": "Reviewed in the United States on April 1, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The ending had me sobbing so much that I had to put the book down and walk around.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Magic Hour",
    "rating": "3.0 out of 5 stars",
    "content": "This is hands down one of her best books I’ve read, and I’ve read quite a bunch.  I give it 10 STARS!!",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What an awesome read!  Kristin Hannah did it again.  A book full of love and life.  I couldn’t put it down.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Enjoyed the story",
    "rating": "5.0 out of 5 stars",
    "content": "Just started a book club and someone in the group chose  this for our first read.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved the story, reminds me of the movie Nel.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "great book",
    "rating": "5.0 out of 5 stars",
    "content": "The writing isn't fantastic. I liked the character of Julia and of course Alice. Not a fan of her egotistical sister. The way they just magically had her change her personality after 1 chapter was so unrealistic.",
    "post_time": "Reviewed in the United States on January 9, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The author could have gone into more depth with the characters. Like Max, he was in it just enough to give a little romance but I never felt like we really got  to know him.",
    "post_time": "Reviewed in the United States on May 2, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Beautifully written",
    "rating": "5.0 out of 5 stars",
    "content": "Like I said, the idea and story was great, but definitely lacking in other ways.",
    "post_time": "Reviewed in the United States on May 2, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One of those books that you won’t want to put down.  I enjoyed the entire book.  You will also enjoy this book.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "deeply moving",
    "rating": "5.0 out of 5 stars",
    "content": "I really liked the growth in relationships / and there were many. Alice and Julie, Ellie and Cal, Ellie and Julie, Julie and Max. Even if a little predictable it was still fascinating to watch. Another 5 star read from Kristin Hannah!",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book is riveting. When a child wanders out of the deep forest in Washington state, a whole town joins together to teach her what love really means.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "From wild girl,to good girl.",
    "rating": "5.0 out of 5 stars",
    "content": "As a woman physician dealing with similar conditions in my profession, this book really resonated with me. The storyline is interesting and not so predictable that I instantly got bored with it.  In fact, it was difficult for me to put down. I’m glad I purchased it.",
    "post_time": "Reviewed in the United States on April 23, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kristin Hannah is a writer who is incredibly imaginative. Her writing is smooth and always leaves her reader wanting to dive into all of her stories. Her characters are well developed and so realistic.",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "loved it",
    "rating": "4.0 out of 5 stars",
    "content": "Well written and engrossing and sometimes incongruous",
    "post_time": "Reviewed in the United States on February 23, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Enjoyed it very much and highly recommended.  Typically well written by Kristin Hannah.",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "She’s done it again!",
    "rating": "5.0 out of 5 stars",
    "content": "This is a book you can’t put down.  But you need Kleenex to get through it.  It has it all :  tragedy, a mother’s love, romance, and family tried.  Excellent read!",
    "post_time": "Reviewed in the United States on April 26, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I haven’t read a book in a long time that touched my heart like this one. I cried, I laughed and I cheered as the story progressed. This is a must read! This story will remain with me for a long time.",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "A Spellbinding Tale",
    "rating": "4.0 out of 5 stars",
    "content": "This is somewhat different from her other books but I really loved it. An interesting story about family and healing. Strong characters with a great pnw setting. You will love Alice who has a lot to teach us. I was glad the author took us back to the woods.",
    "post_time": "Reviewed in the United States on September 30, 2023",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was good. Could've been better. I definitely was crying by the end. I have a daughter Alice's age so everything hit me harder.",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "wonderful book",
    "rating": "5.0 out of 5 stars",
    "content": "I liked everything about this story.  Kristin Hannah is a wonderful writer and keeps the story so interesting.  Hard to put this one down.",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One , if not the finest heart wrenching, touching, poignant books I have read….i just finished it sobbing, a beautifully written love story of love like none other, between a little girl and a psychiatrist, I can’t spoil it….Please read this you won’t regret it, I just adored it, I think I have read all her books! Now what do I read!?!? Thank you Kristin Hannah again!",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "magic hour",
    "rating": "5.0 out of 5 stars",
    "content": "A book i couldn't put down. A tale of love and family like no other. Kristin Hannah at her finest.",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "No words can explain the full range of emotions for this story. Heartbreaking, poignant, celebratory, tear jerking. This is a beautiful story that I could not put down even as my mate was waiting to go out to dinner.",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Heart warming",
    "rating": "5.0 out of 5 stars",
    "content": "My apprehension at first didn't last long as the story grew. Highly recommend to read.  You won't want to put it down.",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Was a totally surprising Kristen Hannah novel. So very different from her other books, but not ready for it to end. I enjoyed it immensely!",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "No words",
    "rating": "5.0 out of 5 stars",
    "content": "Continue to love Kristin Hannah’s books! This is my eight in that last month or so. In this book, she captured a “ Northern Exposure” vibe in each of her small town characters & the humorous dialogue was so fun! The story was unique, turn paging and satisfying to the very end. Highly recommend!",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a heart wrenching story of loss and love between adults, children, and parents.  Page turner that took a couple of chapters to unravel but so worth it.",
    "post_time": "Reviewed in the United States on April 30, 2024",
    "pid": "B08PW53JTD"
},
{
    "title": "Captivating",
    "rating": "5.0 out of 5 stars",
    "content": "Magic Hour kept me captivated! I fell in love with every character yet saw them for who they were. I had emotional connections as a counselor who loves a police officer. Both worlds often mix and to see their teamwork and love work from behind their respective desks, I connected so well with this story! And the little girl is every child, you fall in love and help them through deep, meaningful connection. It was a magical read that left me wanting more every day and getting more!",
    "post_time": "Reviewed in the United States on December 7, 2023",
    "pid": "B08PW53JTD"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So good, not was was expecting but so good.",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B08PW53JTD"
}
]