[
{
    "name": "        2024 Flying Orb Ball Toy,Cosmic Globe Boomerang Hover Ball Galactic Fidget Spinner, Hand Drone Orbit, Cool Toys Gift for 6 7 8 9 10+ Year Old Boys Girls Teens Outdoor Toys(Blue)       ",
    "stars": [
        "60%",
        "14%",
        "11%",
        "5%",
        "9%"
    ],
    "pid": "B08QTP3MLT",
    "ratings": "14,021 ratings",
    "other_info": {},
    "discount_price": "$ 32.00",
    "normal_price": "$49.99",
    "about_this_item": [
        " High-Tech Hand Controlled Drone Toy With Cool RGB Light: The flying orb toy provides intelligent flight. Different throwing angles and speeds will create different flight lines and boomerang effect.You can use your ingenuity to create your unique way of playing.The colorful led at night will make your magic ball cooler  ",
        " Lightweight And Portable: This hover ball has undergone rigorous testing, made of high-quality materials, which are soft but durable, drop resistant, lightweight and flexible.You don’t have to worry that the flying toy will be damaged easily by your kids. It will stop automatically when it hit the furniture or any other pieces of stuff  ",
        " USB Charging: About 20 minutes full charge, 8-10 working duration. It enables various charging options such as charged by computer, power adapter, mobile phone, portable charger etc. The indicator light comes on when charging and goes off when fully charged. Rechargeable and can be played over and over again  ",
        " Endless Fun with Hover Ball:Experience uninterrupted fun with USB Charging feature of this flying orb ball.Achieve a full charge in just 20 minutes and enjoy 8-10 minutes of continuous flightIt supports versatile charging options,including computers,power adapters, mobile phones,and portable chargers.The indicator light provides real-time charging status updates, ensuring you're always ready for the next adventure  ",
        " Perfect Gift: This Flying Orb Ball Toys is a fun novelty gift for birthdays, Halloween, Thanksgiving Day, Christmas. This is a great choice for Easter, Father's Day, Mother's Day gift toys. It’s a perfect enrichment gift for kids, teenagers, adults  "
    ]
},
{
    "title": "Not as advertised",
    "rating": "4.0 out of 5 stars",
    "content": "Fun but be prepared for it not to do as advertised.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "First time ordering this. It got lost in the mail. Second time it came through and I was shocked at how tiny this was specially for the price. I bought this for my five year-old nephew, and I would say this is hard even for an adult to figure out lol I think that It’s harder for children but once you can get the hang of it, I guess it could be fun. I wasn’t that into it. My nephew seem to be, but I’m not sure he was even sure what the heck was going on or what he was doing with it lol",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "It’s not what I thought",
    "rating": "4.0 out of 5 stars",
    "content": "Worked OK but it was a lot smaller than expected",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My daughter loves this but it takes a bit to learn how to pass it around and get it to go the direction you want it (even for adults). The color is fun and the kids really enjoy playing with it.  Fortunately we haven’t experienced this but I could see it sucking up kids hair and getting stuck in it. The battery life could be a little longer but honestly, kids attention spans are pretty short anyway.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Check out the advertising for the actual size.",
    "rating": "4.0 out of 5 stars",
    "content": "This was fun to use but it was very hard to learn to get it to return.  it scared my cat and the wearing noise worked well when I threw it into my yard to scare the deer from eating my shrubs.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "We had one for our son that broke and our daughter wanted one. This is for her and so far it is working and she enjoys it alot. Just have to wait and see how long this one lasts.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "A little hard to control",
    "rating": "5.0 out of 5 stars",
    "content": "A great gift for a 6 year old",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It’s easier for adults than kids. It’s taken a lot longer for the 9 yr old to play with it.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Fun toy",
    "rating": "4.0 out of 5 stars",
    "content": "This is actually a relaxing toy to fidget with! We bought it for our 8 year old and he has so much fun with it but so do us adults. I only gave it 4 stars because the battery only lasts between 5 and 10 minutes  so we have to keep charging it. But other than that we are having a blast and we recommend this orb ball! We take it outside and play catch with it and it is so fun to throw it long distance and watch it casually float to the other person!",
    "post_time": "Reviewed in the United States on May 5, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Took kids 10 seconds to figure out how it works. just make sure you let them know not to throw it hard, it could break something or knock things over in house. It does fall alot if your the only person trying it. i would recommend this to be a outside toy or not in a small home like mine. It reminds me of those cool planes they used to have when I was little you would see throwing them and coming back to them, and thats what promted me to get it.  Its fun for sleep overs and in the dark too.  Hope my review helps you??",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Gift",
    "rating": "4.0 out of 5 stars",
    "content": "Grandson loves you",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was in one of the teens Easter hunt gifts. Both teens and mom played outside with this ball. It was a lot of fun and I like getting us out of the house away from the cell phones and lap tops, even if the weather is a gray overcast day, gave us something fun to do.",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Fun",
    "rating": "4.0 out of 5 stars",
    "content": "It did take us a a short bit to figure out how to throw it so it went to where we wanted it to go. Once we did that, it was super fun. I recommend! mom.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As described",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "As described",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for my husband and boy, is it fun! It takes quite a bit of practice to learn how to make it fly but once you get the hang of it, it’s a total blast. We’re playing our own version of quidditch with it using a round trellis is our yard! Highly recommend. When we first used it, it died after about 15 minutes. The next time, it lasted about 45 minutes before needing to be charged again.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This took a little while to get the hang of it but once you get it, It is super fun for all ages.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "This is so much fun!",
    "rating": "5.0 out of 5 stars",
    "content": "It was a gift.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "My kids love it!",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "A bit of a learning curve",
    "rating": "5.0 out of 5 stars",
    "content": "I give this an average rating. Gave it to 3 kids & it was definitely fun to watch & play with. Battery charge didn't last 10 minutes but it couldn't fly with a larger battery. Not too expensive, not that well made. It's also very light weight so it does fly but would be blown away easily in wind gusts.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Purchased as a gift for autistic grandson. Everyone enjoys the bright lights and movement. Needs practice to do all that it can do..it came quickly and was nicely packaged..",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Hard to stop",
    "rating": "3.0 out of 5 stars",
    "content": "Purchased for my 5 year old grandson. No way can a 5 year old use this toy. It is very cute. Easy to turn on. Hard to turn off. My husband had to keep jerking it down.  Took a few tries to get it to stop. Fine for an adult or an at least 10-12 year old.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Takes some practice but fun to use.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Fun",
    "rating": "4.0 out of 5 stars",
    "content": "My son loves playing with it, has a rechargeable battery. Doesn't quite come back but does kind of  hover. The lights are fun.",
    "post_time": "Reviewed in the United States on April 29, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's very intriguing and a lot of fun to practice. There is a learning curve but once you get the hang of the aerodynamics of flight it's really a brilliant design and a lot of fun with kids and adults. It's made with flexible material and isn't easily damaged from falls, running into walls or falling on the floor. When is does the ball automatically turns off to protect it from any damage making very durable for continuous playtime. Hold the ball upright with the \"up\" sticker pointing upward and shake to turn on the flying Orb. Turn the orb upside down and shake to turn off the orb.",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Fun toy",
    "rating": "4.0 out of 5 stars",
    "content": "I highly recommend it for the whole family. Practice and there is a variety of things you can do and play with the orb. But the ones with an AI chip built inside. Trust me!",
    "post_time": "Reviewed in the United States on February 27, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We bought this for a Christmas gift. I was not expecting to much, I am still not sure how they do the tricks in the video but we have played hours with it and are still nowhere to the videos.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Flying Orb Ball Game",
    "rating": "5.0 out of 5 stars",
    "content": "It is still fun to play with though.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My youngest is sure that it will chop off his fingers but the cage is safe for most fingers.",
    "post_time": "Reviewed in the United States on December 26, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Great fun",
    "rating": "4.0 out of 5 stars",
    "content": "This was the hit toy on Christmas Day! Buy one - even if it's for yourself.",
    "post_time": "Reviewed in the United States on December 30, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Me encantó porque lo mantiene divertido a mi nieto que tiene 7 años.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Children thrilled",
    "rating": "4.0 out of 5 stars",
    "content": "My grandson, age 6, was delighted to play with this toy for more than 45 minutes when he received it.  That’s tremendous for his age and personality. The ball doesn’t hover above the hand as pictured in the add. It does fly in unexpected patterns and is more fun outdoors. I bought two of these and one was missing a charging cord. The seller quickly remedied the problem. You will want to check that you have this if giving as a gift even though this is a popular size for charging.",
    "post_time": "Reviewed in the United States on November 29, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My kids have had maybe a dozen of these floating ball/hover toys. Cheap ones from 5 Below. Baby yoda ones. Sky dancers and other dolls that float around. I, personally, like this one the best. All the other ones break so easily. They hit the ground, the blades snap off and crack and that's the end of that. These are encased in a rubbery plastic cage, so, it can smash off of whatever and the blades won't break. Love it. Makes so much sense. They can actually play with this one and grab it without it hurting their fingers - the other toys you can just kind of put your hand under it and watch it hover, trying to not let it hit the ground, or you can just watch it zip around the house smashing into stuff before you have to go retrieve it. At least with this one you can play by yourself boomerang-ing it back to yourself. Or play catch with someone else. It's funny watching them try to catch it - it's harder than you'd think, as it constantly wants to be moving. Trying to catch a ball that is actively pushing away from your hand moving in to catch it.",
    "post_time": "Reviewed in the United States on June 17, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Super cool",
    "rating": "4.0 out of 5 stars",
    "content": "It's a little overpriced but this is the best one of these toys I've seen.",
    "post_time": "Reviewed in the United States on August 3, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Looks cool and fun to play with, but with the prop spinning, it's pretty loud (like a cheap fan at high speed, which is basically what's inside it).",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Great toy but loud!",
    "rating": "3.0 out of 5 stars",
    "content": "If it's for kids, would highly recommend having them play with it outdoors, away from any traffic (or else in a room without much furniture or breakable things) - the thing can fly unpredictably at times and can move pretty fast!",
    "post_time": "Reviewed in the United States on May 12, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "One other thing - the fans can turn on/off with just a slight bump (supposed to shake it to start/stop), so it'll often shut off upon landing or being caught. Easy enough to turn back on, but might be nice if it didn't shut off so easily (then again, you wouldn't want to not be able to shut it off when you need to, so it's a thin line).",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Very small",
    "rating": "5.0 out of 5 stars",
    "content": "Kids had fun with,  it but is super small. The size is about the size of baseball.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Initially it worked great,  after it ran down and needed charging it went downhill, now after charging and turning it on it works once, then you have to turn it off and back on and it will work for a few seconds,  then quits,  if it continues like this I'll have to return it !  I know its a toy from China, but I expect it to last longer than that !",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Was great for a short time !",
    "rating": "4.0 out of 5 stars",
    "content": "Children love things that are colorful and also things that move on their own. This item does Both. Many toys purchased end up on a shelf or in a closet in a very short time. This one did Not.",
    "post_time": "Reviewed in the United States on May 24, 2021",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Adult supervision is a Must but my 5 year old granddaughter just loves it.",
    "post_time": "Reviewed in the United States on February 18, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "pretty good",
    "rating": "4.0 out of 5 stars",
    "content": "Pretty fun, pretty ez to learn. Just a not great battery life.",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "i had trouble with it but my grandson loved it.that is who I bought it for",
    "post_time": "Reviewed in the United States on March 31, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "my grandson loved it",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased one of these for my grandson. However, I wanted to see how it work and had great fun playing with it. Sadly I had to pack it up for my grandson's birthday. When we gave it to him, it was an instant hit with both him (aged 8) and his sister (aged 5). So much so, we purchased more for our other grandchildren",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The battery dies out faster than I would like but it is fun as long as are in a space without a lot of breakable just in case you don't control it well.",
    "post_time": "Reviewed in the United States on February 17, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Fun",
    "rating": "4.0 out of 5 stars",
    "content": "It was a lot of fun.  Pretty lightweight material.",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Not so you won’t break it, because the more energy you put in, the more it delivers. Great deal. Really fun.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Surprisingly awesome",
    "rating": "5.0 out of 5 stars",
    "content": "She loved it, but is better to use it outside.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Absolutely love this flying ball",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Air ball",
    "rating": "4.0 out of 5 stars",
    "content": "My son plays with it all the time",
    "post_time": "Reviewed in the United States on March 23, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It is so much fun",
    "post_time": "Reviewed in the United States on November 13, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "It is fun",
    "rating": "4.0 out of 5 stars",
    "content": "Bought it for my husband as he loves these kind of things.  I showed him videos on how to use.  You really need to watch them.  He is still have trouble with it, BUT. .. We learned the dogs absolutely love these things barking and chasing them when the go through the air and land, then roll around.",
    "post_time": "Reviewed in the United States on December 5, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "\"I'm absolutely thrilled with the AMERFIST 2023 Flying Orb Ball! It's been a game-changer for indoor play with my kids. The orb is so easy to control and maneuver, and the LED lights create a mesmerizing display. The battery life is impressive, and the durable design has withstood countless crashes and bumps. The kids love chasing it around the house, and it's even helped with their hand-eye coordination. Highly recommend this product for anyone looking for a fun and interactive way to get the kids moving!",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Amazing",
    "rating": "5.0 out of 5 stars",
    "content": "Grandson loved it",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My 8 year old hasn't managed to break it yet, which is incredible. The battery life isn't long, but it's rechargeable so not that big of a deal.",
    "post_time": "Reviewed in the United States on February 10, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Christmas",
    "rating": "5.0 out of 5 stars",
    "content": "Grandchildren loved them (bought 2).  Would work out new tricks.  Ages 10 and 13.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Bought this for the grandkids. It pretty much works as shown in the video but doesn’t hover over the hand like it shows in the picture. Would probably buy again.",
    "post_time": "Reviewed in the United States on January 22, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Durable",
    "rating": "5.0 out of 5 stars",
    "content": "Browsing the internet for cool/unique gifts for my nephew led me to this flying ball toy and seeing my nephew and watching him play with this toy makes me satisfied with the purchase. Admittedly there was a slight learning curve, even for adults but fear not the toy is durable... which you will be glad to see since there will be numerous crashing to the wall/floor in store for this toy. The item does require a short charging session to get it ready for play, which leads me to the only issue that I have with the toy... and that would be the short battery life. Having to stop playing at the height of my nephew's excitement to tell him that Uncle must go and charge the ball isn't really becoming of the coolest uncle in the world. However, that isn't really the Toy's fault so i still am giving this toy 5/5-star rating.",
    "post_time": "Reviewed in the United States on October 22, 2022",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I Would take the time to get used to the flying pattern of the ball first and try to understand why its flying in such trajectories before handing it off so that you can properly teach your little one how to play most efficiently. Other than that, I would say that this is a MUST have for any parent looking to give their children a special gift that they won't tire of.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Great Toy",
    "rating": "4.0 out of 5 stars",
    "content": "We all played with this toy. A gift to give when you have someone hard to buy for.",
    "post_time": "Reviewed in the United States on October 2, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The sphere is responsive to hand movement, although a bit slow to react to change in hand position.",
    "post_time": "Reviewed in the United States on December 13, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Fun!",
    "rating": "4.0 out of 5 stars",
    "content": "This ball is so much fun and surprisingly sturdy! I wish the charge on it lasted a little bit longer.",
    "post_time": "Reviewed in the United States on February 5, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I can't speak to sturdiness or battery life as we haven't seen it for several months, but when we gave it to our grandson, he was thrilled. So were the other kids and the adults in the room. We all had a lot of fun playing with this toy.",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Grandson loves it, so do the rest of us",
    "rating": "3.0 out of 5 stars",
    "content": "Its fun at first  dont use in home where it could break something as it flies fast- it is hard to control/ looks alot easier in videos n commercials then in real life  I returned ours because the middle part broke and it was too e expensive compared to other compainies n retailers",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It's unpredictable, so there's no toss and catch, but great fun.",
    "post_time": "Reviewed in the United States on March 8, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Too difficult to do like the videos",
    "rating": "4.0 out of 5 stars",
    "content": "We used this in a twenty question game. Whoever figures out what was in the box won it. Fun to have at our party.",
    "post_time": "Reviewed in the United States on January 4, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this as a b-day gift for my nephew. We charged it and went outside to try it out. As with everything, it takes some time to get it to do what you want it to but, being young and working his controller with his games he managed to get control of it pretty fast. Between learning to control it and playing with it, he had a great time, and I was a good aunt!",
    "post_time": "Reviewed in the United States on March 5, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Fun!",
    "rating": "4.0 out of 5 stars",
    "content": "These were fun eventually and we got some laughs learning the trick of it. Worth the money spent.",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Our 10 year old loves this toy!!!",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Fun for adults",
    "rating": "4.0 out of 5 stars",
    "content": "The kids love this toy! It took a minute to get used to how to hold it/make it go. But our only criticism would be how short the battery life is.",
    "post_time": "Reviewed in the United States on December 18, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought 4 of these amazing toys for my adult male family members, after all, all boys like toys.  It sure didn't disappoint as they played with THEIR children who were utterly delighted!  This amazing ball is so much fun, I would highly reccommend it if you want to have fun with friends and family.",
    "post_time": "Reviewed in the United States on March 18, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Good for the price",
    "rating": "4.0 out of 5 stars",
    "content": "Grandkids loved it. Took a while to learn how to use. Biggest con, cannot put another battery in when it has run down. Need to recharge.",
    "post_time": "Reviewed in the United States on December 30, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Fun and sturdy but hard to control. Doesn't work like video... still fun for children",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Hard to control",
    "rating": "4.0 out of 5 stars",
    "content": "The two pack isn't that much more, and while using one you can charge the other.",
    "post_time": "Reviewed in the United States on February 8, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Aunque hace muchoo ruido, no es un juguete para dentro de la casa, recomendable para el exterior, ya que un golpe fuerte puede hacer que se doble o deforme, debido a que la estructura es plastica, espero no se dañe pronto y para conectar el cargador hay que hacer fuerza para que conecte bien.",
    "post_time": "Reviewed in the United States on October 2, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Buy the two pack",
    "rating": "3.0 out of 5 stars",
    "content": "I searched multiple brands and it seems to be a normal thing for these balls to stop holding charges. This is actually a pretty cool toy when it is working. We have spent lots of time playing this the first week we got it and then it just stopped working. Luckily, it wasn’t expensive but still pretty bummed it will won’t last more than 5 mins now.",
    "post_time": "Reviewed in the United States on January 12, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It’s a fun tout just don’t think it is great for indoor use.  Too cold to try it outside yet",
    "post_time": "Reviewed in the United States on January 21, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "POR EXPERIMENTAR",
    "rating": "4.0 out of 5 stars",
    "content": "Grandson loved it! Only concern is will need adult supervision to charge and go over use.",
    "post_time": "Reviewed in the United States on December 26, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is a little tricky to learn how to make it return and do the other things that it is supposed to do, but one you play with it for a while, you'll get it and it is capable of everything that is described. Much easier than learning to pilot a drone. It charges quickly and last for about 20 solid minutes of play time on a charge. It so far seems to be basically indestructible through normal use, though it probably could be broken if you focused enough effort on doing so.",
    "post_time": "Reviewed in the United States on January 5, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "We were so excited about this toy",
    "rating": "4.0 out of 5 stars",
    "content": "We bought these for our adult kids for Christmas and we had a blast playing games.",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Seems sturdy. Kinda hard to turn on and off and to charge because of the placement. We just could not get the hang of it and we are 22, 54, 77 years old.",
    "post_time": "Reviewed in the United States on November 28, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Balls",
    "rating": "4.0 out of 5 stars",
    "content": "I can’t really give a review yet because these are Christmas presents. However, I thought the balls would be bigger and more sturdy….not made out of cheap plastic.",
    "post_time": "Reviewed in the United States on December 13, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kids loved it.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Fun fun",
    "rating": "4.0 out of 5 stars",
    "content": "Not much else to say.  If my grandson loved it, I loved it!",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My great grandson loves it.",
    "post_time": "Reviewed in the United States on January 29, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Grandson loved it",
    "rating": "4.0 out of 5 stars",
    "content": "Maybe you could hit me up after Christmas, as of now, I have no idea.  It's what she wanted, so I feel safe.",
    "post_time": "Reviewed in the United States on December 22, 2023",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "They did not function as advertised. The video showed when it is released it was supposed to return to the person throwing it our/away, it did not return but just goes whichever way it decides to go without the “return-to-thrower” functionality as shown on the ads.",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Good",
    "rating": "4.0 out of 5 stars",
    "content": "Whole family has fun with it. Only drawback is battery doesn’t last as long as you would like",
    "post_time": "Reviewed in the United States on January 16, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "It has died after six months. Will not charge or fly any longer.  I think 32 dollars is expensive for a toy that lasts six months.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "It's a Christmas gift for my granddaughter.",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this item for my niece’s three year old son.  He loves, loves it.  So do his parents.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B08QTP3MLT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This little toy goes so fast you really need to read directions before playing with it. But it’s great fun once you get the hang of it.",
    "post_time": "Reviewed in the United States on December 3, 2023",
    "pid": "B08QTP3MLT"
}
]