[
{
    "name": "        HATHASPACE Smart Air Purifiers - True HEPA Air Purifier, Cleaner & Filter for Allergies, Smoke, Pets - Eliminator of 99.9% of Dust, Pet Hair, Odors - HSP003 - 2800 Sq. Ft.       ",
    "stars": [
        "68%",
        "13%",
        "6%",
        "4%",
        "9%"
    ],
    "pid": "B08XWQ5XG6",
    "ratings": "169 ratings",
    "other_info": {
        "Color": "White",
        "Brand": "HATHASPACE",
        "Product Dimensions": "14.02\"D x 26.97\"W x 14.02\"H",
        "Specification Met": "Energy Star Certified, ETL Certified, CARB Certified",
        "Noise Level": "40 dB"
    },
    "discount_price": "$ 549.57",
    "normal_price": "$549.99",
    "about_this_item": [
        " COMMERCIAL & LARGE SPACE SMART FILTER: Our 3-in-1 filter system targets pollen, dust, pet dander, VOC’s, smoke, and odors - the H13 HEPA filter captures 99.9% of particles down to 0.3 microns. Our lightweight device is portable, allowing you to improve air quality wherever you need it. Our smart air quality sensor & touch-screen display makes the purifier easy to use & adjust your settings, & also shows air quality information.  ",
        " EXCEPTIONALLY SILENT: Designed for quiet operation, making it perfect for use in bedrooms and living rooms. The purifier's efficiency in capturing dust and particles - see just how much our air purifiers for home can assist and support the body’s natural response  ",
        " EASY TO USE & INSTALLATION: Built to easily identify, access, and change your filters - our purifier comes with multiple fan speed options, enabling you to set the pace of air filtration to suit your needs. Included is a remote to easily adjust the speed to your preference and turn the light on & off when needed - with the auto mode as well to facilitate real-time adjustments based on your room's air quality, & ITS QUIET!  ",
        " REMOVE ODORS, SMOKE, & VOC'S: Both an air cleaner & odor eliminator, our air purifier features a unique honeycomb activated-carbon filter that absorbs odors, smoke, and VOC’s. With a state-of-the-art fan and motor, enjoy clean air delivered quietly and efficiently in your home, bedroom, office, kitchen, basement, dorm, apartment, or living room.  ",
        " FIND RELIEF: Our purifiers come with a 2-year warranty, award-winning customer support 7 days a week, and the peace of mind with a brand you can trust. You can also find our replacement filters to ensure you have fresh air all year around!  "
    ]
},
{
    "title": "Does a great job!",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this whole house air purifier from a recommendation from a company that does mold remediation. It definitely purifies the air in my entire house. It is very quiet and very easy to change location if need be. Delivery was quick and I had to be home when it was delivered. I have had other air purifiers but I would rate this one the very best.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First, I want to apologize to my spouse of 30 years and my 3 children.  I apologize for all the unnecessary odors you had to endure and the  pet dander and hair all over your black clothes.  I hope you can find it in your heart to forgive me. I really thought air purifiers were a gimmick like bottled water.",
    "post_time": "Reviewed in the United States on August 26, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "I'm Sorry!",
    "rating": "5.0 out of 5 stars",
    "content": "Well, one night I was feeling a little generous....what the heck, let me spend 400 bucks on the largest air purifier I could find on Amazon. If this doesn't work, I'm kicking it to the curve with all the bottled waters. It was delivered fast...you know...that's how Prime rolls.  But let's not digress.  The box was big, and that's always a good sign. I took it out and put it by the corner window next to a air vent.  It's very nice...like it was made to be right in the corner. I was waiting to immediately smell Spring mountain air with a hint of wild flowers. Nothing like that happened, because that's just plain ridiculous...this is not a commercial.  Well, my daughter got home 6 hours later from school. She is cool because she's 17 and thinks I'm still cool... so that's good.  She asked if I was cleaning the house because it smelled fresh....her word...\"crisp.\"  You know when a teenager uses the word crisp, some seismic event occurred.  Well, I told her it was that thing in the corner that I was still suspicious of.  I took a really deep sniff of the air and it did smell slightly crisp. So I decided to go outside for 20 minutes and do dude stuff....walk around...inspect lawn....walk up and down the driveway for no particular reason, but that's what we do. I opened my wife's car and closed it right back because I'm not cleaning it again.... I reopened her car and cleaned it for the very last time- I swear! I swear too much.  45 minute later,  like SpongeBob, I walked back into the house. Nothingness never smell so sweet!!!!....and CRISP! I went around asking everyone if they could smell the sweet Nothingness? I was a proud husband and father. I saved my family from stale air that is distinctively your home when you get back from the office or a trip away from home...especially if you have pets. No More for us. Guess what I did next? I immediately signed up with the company for filter delivery...you won't catch me not having sweet Nothingness again!",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Will buy another one for my store soon",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Amazing product",
    "rating": "5.0 out of 5 stars",
    "content": "Lots of filters to change but runs almost silently.  A very nice-looking unit and as an added attraction, works well as a \"night Light.\"",
    "post_time": "Reviewed in the United States on October 11, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Takes smells out of the air when cooking.  Sucks up our old dogs farts!  I’m not kidding about that.  Lucky she likes to sleep by it too.  Cuts down on dog hair and dust in the house.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B08XWQ5XG6"
},
{
    "title": "You can hardly hear it run",
    "rating": "5.0 out of 5 stars",
    "content": "Highly recommend it.  I thought it wasn’t going to make any difference, but I was pleasantly surprised.",
    "post_time": "Reviewed in the United States on July 11, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Pretty much just be careful because this product has a builting WiFi where it shuts off automatically and is also",
    "post_time": "Reviewed in the United States on May 8, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Pulls smoke, pollen, dander, and dust out of your living space!",
    "rating": "3.0 out of 5 stars",
    "content": "Missing some cables just be careful is from a  awhat yo but from amazon reputable source",
    "post_time": "Reviewed in the United States on May 17, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have a garage workshop that I spend a lot of my time in.  Keeping the smells from invading the house was a challenge.  I am a smoker. This is the only room in the house that I smoke in.  Prior to installing the Hathaspace I had to keep the door open.  I live in a high humidity area and that presented a problem for my equipment.  This filter allows me to use my climate controls without a problem.  It doesn't remove all odors.  But, it removes them sufficiently to prevent them from invading the house.  I highly recommend this product.",
    "post_time": "Reviewed in the United States on June 4, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "It works",
    "rating": "4.0 out of 5 stars",
    "content": "Adequate",
    "post_time": "Reviewed in the United States on October 11, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I don’t know why but it won’t get over 8-9% if the air clean. My shop is 1500 sq ft. It’s a lot of money to not be at 100% clean.",
    "post_time": "Reviewed in the United States on November 19, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Doesn’t seem to work",
    "rating": "4.0 out of 5 stars",
    "content": "Changed filters when due. Keep getting alarm tone, tried to follow instructions on how to reset without success. Tried contacting customer support, no one answers. Left voice mail and sent email. I will contact Amazon to see if i can return this, after investing additional money for filters.",
    "post_time": "Reviewed in the United States on August 26, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Update: Finally received email from customer support. It helped to clear up my problem. Thx",
    "post_time": "Reviewed in the United States on November 5, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Customer support came through, finally.",
    "rating": "5.0 out of 5 stars",
    "content": "Upon turning on this unit its showing that the air quality in my room is 009 (which is considered excellent, score out of 500) … I’m wheezing, coughing up phlegm, and short of breath in the same room and if this is considered an “excellent” air quality BEFORE running the unit I’m gonna say this is a gimmick. I have only had it running for a half an hour. I saw 17,000 reviews and 4.6 stars and I really thought this purifier was gonna work so I spent $500 to buy it… extremely skeptical given what I’ve seen so far. I will update this review in 24 hours should anything miraculously change.",
    "post_time": "Reviewed in the United States on December 6, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Clean air means less stuff in my respiratory system which should not be there!  It means breathing better!",
    "post_time": "Reviewed in the United States on August 23, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Just got, still skeptical",
    "rating": "5.0 out of 5 stars",
    "content": "This works quitely and it is effective. Here in Indy 1st the Canadian smoke and then closer smoke.  Not even noticable in my house. Our kitty was having eye infection issues prior to receiving the purifier.  Not anymore.",
    "post_time": "Reviewed in the United States on December 28, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Performed as advertised. Adjustable speed allowed desired noice level.",
    "post_time": "Reviewed in the United States on May 2, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Clean air means less stuff in my respiratory system which should not be there!",
    "rating": "5.0 out of 5 stars",
    "content": "Why doesn't the owners manual explain what the functions are? What do the numbers on the front mean, what do the colors of the ring mean? We had a power outage and when the power came back on there was a purple ring lit up and the numbers were all over the place. What do the numbers even mean? When it got back to normal the numbers go from 9 to 6, they don't mean anything to me because there is nothing in the manual that explains it. We have had it turned on for over a month and we see no difference in our home. The manual mentions a sensor on the back of the machine, what is the sensor for? Does it matter how far from the wall it is? This manual sucks!!",
    "post_time": "Reviewed in the United States on May 11, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I actually have bought three over the years because they work so well.  Filter replacement is easy and the fresh air is nothing less than awesome.  Options have worked with no issues and I have had them for over a year.",
    "post_time": "Reviewed in the United States on May 19, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "It works great!",
    "rating": "5.0 out of 5 stars",
    "content": "We live in a Redwood forest area and have been plagued with dust and pollen making very difficult to keep the house dust free. Until now this unit has reduce the dust in our to almost none.",
    "post_time": "Reviewed in the United States on May 5, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's good I just wished I knew to remove plastic inside the filter before getting rid of my cat. It was a few weeks after I got rid of her before I found out the filters were still in plastic",
    "post_time": "Reviewed in the United States on March 13, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Remember to open filter and take off plastic before use",
    "rating": "1.0 out of 5 stars",
    "content": "I bought this unit before Christmas 2023. I text the company several times for the sensor PM 2.5. They told me sensor was out of stock and call back in May! Well i texted them several times more and only get formatted e-mail.  I would not recommend a HSP-003!",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My dad has extreme breathing problems.  His lungs are not healthy.  As a family we bought this unit for him and he loves it. He has noticed a considerable difference.",
    "post_time": "Reviewed in the United States on May 20, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Custermor Service",
    "rating": "5.0 out of 5 stars",
    "content": "Purchased the Hathaspace air purifier for a casino that has low ceilings and heavy smokers.  For years we’ve had issues trying to keep the air as smoke free as possible.  Minutes after installing the Hathaspace air purifiers you could tell a difference instantly.  I no longer have complaints about the area being to smoky. Highly recommend!!!!",
    "post_time": "Reviewed in the United States on May 21, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I live in Florida and have an all tile house with a small cat and a four person family.  Since getting this system the dust bunnies have really dissipated and the air feels so much cleaner.",
    "post_time": "Reviewed in the United States on March 8, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Well worth the money",
    "rating": "5.0 out of 5 stars",
    "content": "I paid 487.87 $for this, after getting it the price went down to 350.00$ am very upset sm going to call the manufacturer about it. I Spent a lot of money at Amazon",
    "post_time": "Reviewed in the United States on March 21, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We have golden doodles and our old air purifier wasn’t keeping up. This works!!",
    "post_time": "Reviewed in the United States on July 12, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Purchased for casino",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect for home. Helps during pollen season and keeps the air quality great.",
    "post_time": "Reviewed in the United States on July 7, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Very disappointed in helping with dust. I also see no difference in dog hair so they say is does.",
    "post_time": "Reviewed in the United States on December 1, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Tabs broke on screen",
    "rating": "2.0 out of 5 stars",
    "content": "The tabs that click the pre-filter screens into place broke on one side on the first cleaning. I would have given it 5 stars if this didn't happen as it surprised me at how much pet hair these caught. Screen still sits in place. Just points to this being cheaply made, hope it lasts.",
    "post_time": "Reviewed in the United States on August 18, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Really loud and no auto mode.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Return.",
    "rating": "5.0 out of 5 stars",
    "content": "It really works I can tell a difference",
    "post_time": "Reviewed in the United States on March 2, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Perfectly",
    "post_time": "Reviewed in the United States on May 8, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "I can breath so much better",
    "rating": "2.0 out of 5 stars",
    "content": "We bought two just before Christmas, one for upstairs and one for the basement.  One has already stopped working in 4 months.",
    "post_time": "Reviewed in the United States on May 1, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "QUIT AFTER 4 MONTHS AND COMPANY WAS NOT RESPONSIVE, TALKED TO AMAZON AND THEY TOOK PRODUCT BACK - AMAZON TOOK CARE OF THE PROBLEM BUT THE COMPANY DIDN'T",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Air",
    "rating": "1.0 out of 5 stars",
    "content": "I was waiting to actually confirm this worked before returning and I missed the return window and it appears it doesn’t work! My son has awful allergies to the hypo allergenic dog and it’s not even making him a tiny bit better!! At a loss, too much money to spend for no benefit!",
    "post_time": "Reviewed in the United States on October 19, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Missed the return window by a week. Worked great until a breaker popped in our house and now it won't power on at all. We checked all connections, filters and outlets but cannot get this thing running again. Very frustrating and disappointing!",
    "post_time": "Reviewed in the United States on June 26, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "We liked the operation until it quit",
    "rating": "1.0 out of 5 stars",
    "content": "We haven’t had ours for very long and it’s already stopped working. Spending $500+ on it to stop working pisses me off!!! Save your money and go elsewhere",
    "post_time": "Reviewed in the United States on March 18, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Like most people I have a constant feeling like my air isn't as clean as it could be.  I have a very small house but I thought it would be worth taking up so much space to have air that feels so much cleaner.  Right after opening it was exactly the size I was imagining but in a small house it will take up quite a bit of floor spaced so keep that in mind.  It looks expensive and feels high quality when you are touching it/moving it around.  The instructions are detailed and easy to follow.  Based on my trial and error method I was able to find a few things that weren't listed in the instructions so while I do think the instructions were easy to follow they weren't complete.",
    "post_time": "Reviewed in the United States on March 17, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Powerful purifier that does what it says",
    "rating": "4.0 out of 5 stars",
    "content": "I am quite pleased with this dual filtration air purifier. I am using this air purifier in my home, and technically this one air purifier should be able to filter all of the air in my home, although I am using an additional purifier upstairs in my bedroom since I have four dogs my my home.",
    "post_time": "Reviewed in the United States on February 25, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "really nice but way too expensive",
    "rating": "4.0 out of 5 stars",
    "content": "This HATHASPACE purifier is downstairs. The main reason I got this is because it claimed to eliminate odors, and while it focused on odors such as smoke, I was interested to see if it was effective on pet odors. It does do a fantastic job on pet fur, dander, and dust. I have noticed considerably less pet fur floating around the house since I got this. I am also sneezing less as a result of pet dander. Additionally, I have an actual allergy to dust, and I have noticed MUCH less dust on the hard surfaces of my home since getting this air purifier, as well as having much less reactivity to dust, both in terms of how much my lungs react as well as how much skin reaction I have. That’s truly remarkable!",
    "post_time": "Reviewed in the United States on February 26, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Works great for the intended job",
    "rating": "5.0 out of 5 stars",
    "content": "As for odor elimination, this air purifier does a pretty good job; I’d give it four stars out of five. I have an elderly dog who is frequently stinking up the downstairs of my house (she isn’t permitted upstairs). I can still smell her stickiness every once in a while now right after she makes a mess or gets an upset stomach and has problems, but the issue isn’t nearly as bad (or potentially embarrassing if I want to have guests over) as it used to be before I got this air purifier. Plus, my elderly dog was my one dog who gave me a lot of problems with her dander, and this purifier filters out the pet dander so well that it’s much, much easier to breathe around her.",
    "post_time": "Reviewed in the United States on March 4, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "A really solid air purifier",
    "rating": "5.0 out of 5 stars",
    "content": "This air purifier is really a great value when you consider how much it does to clean the air in your home. It’s a bigger cost up front, but the power it has in purifying the air is amazing. A+++++, definitely highly recommend, especially if you have serious allergies or medical conditions and you need a powerful purifier to clean the air you breathe.",
    "post_time": "Reviewed in the United States on February 23, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Powerful fan Double Side Vent Filtration…",
    "rating": "5.0 out of 5 stars",
    "content": "I just got this and set it up in the family room, which is the first room you walk into when coming in my house.",
    "post_time": "Reviewed in the United States on February 18, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "hathaspace hsp003",
    "rating": "1.0 out of 5 stars",
    "content": "Remember that there are filters on each side of this so you have to take the plastic off of each main filter.",
    "post_time": "Reviewed in the United States on April 2, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Powerful, effective, easy to set up. Update: excellent customer support",
    "rating": "5.0 out of 5 stars",
    "content": "It's pretty strong and puts out a nice breaze out of the top when on. It's really quiet too.",
    "post_time": "Reviewed in the United States on February 23, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Awesome unit!",
    "rating": "5.0 out of 5 stars",
    "content": "It's going to be really expensive to replace 2 main filters when the time comes and it's way too expensive to begin with since I got other air purifiers that are 1/5 of the price and can do the same size room.",
    "post_time": "Reviewed in the United States on August 10, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Love it. I've got pets and bad allergies - this helped me sleep better.",
    "rating": "5.0 out of 5 stars",
    "content": "It's easy to operate with the touch sensors on the top right corner and clearly marked.",
    "post_time": "Reviewed in the United States on May 11, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Very Quiet",
    "rating": "5.0 out of 5 stars",
    "content": "We'll just have to see how long the filters last, how much it's going to cost to replace 2 main filters at once, and if it's really worth spending 5 times the amount for other air purifiers that can do the same size room.",
    "post_time": "Reviewed in the United States on February 18, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "High Quality",
    "rating": "5.0 out of 5 stars",
    "content": "Hooked up right out of the box and have it gravity fed into my slop sink in the basement. Cycles on and off appropriately and takes care of the basement of a 2400sf home.",
    "post_time": "Reviewed in the United States on March 14, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Does a good job - great support",
    "rating": "5.0 out of 5 stars",
    "content": "We have three of these.",
    "post_time": "Reviewed in the United States on June 25, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Replacement filters",
    "rating": "1.0 out of 5 stars",
    "content": "They are quiet, lots of features and based on the look of the filters, doing a good job.",
    "post_time": "Reviewed in the United States on April 7, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Very good air purifier but seems overpriced and display is burning out",
    "rating": "3.0 out of 5 stars",
    "content": "HEPA filters are expensive everywhere.  Clean air is getting harder to come by for free.",
    "post_time": "Reviewed in the United States on February 22, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Lifesaver",
    "rating": "5.0 out of 5 stars",
    "content": "The Proscenic A9 is excellent in my opinion. The only problem is that when the filter life runs out, you can’t buy replacements. So it’s only good for the duration of the filter that comes with the machine. I’ve been trying for weeks to resolve this issue with no results.",
    "post_time": "Reviewed in the United States on February 27, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Wow",
    "rating": "5.0 out of 5 stars",
    "content": "UPDATE 4/10/2023",
    "post_time": "Reviewed in the United States on July 30, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In addition to the display being nearly burned out, our unit stated making a 'knocking' sound, which is quite annoying, especially given that we're using this in our master bedroom. This was most noticeable on the lower speeds, where the unit used to be exceptionally quiet. I contacted Hathaspace about these issues and after a few days of communications and sending them a short video clip and some pictures of what was happening, they said they were sending a whole new unit, which arrived the next day!",
    "post_time": "Reviewed in the United States on January 17, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Great value",
    "rating": "5.0 out of 5 stars",
    "content": "The new unit works, just as the original one did, but only time will tell if it develops the same problems. Unless they completly changed the display board they were using originally, I suspect it will burn out in the same manner, but hopefully the motor will not be an issue.",
    "post_time": "Reviewed in the United States on April 7, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am updating my overall rating from three stars to four because the company really stood behind their product and provided excellent service. Far better than I would have expected.",
    "post_time": "Reviewed in the United States on September 9, 2022",
    "pid": "B08XWQ5XG6"
},
{
    "title": "Great air",
    "rating": "5.0 out of 5 stars",
    "content": "UPDATE 3/7/2023",
    "post_time": "Reviewed in the United States on March 24, 2023",
    "pid": "B08XWQ5XG6"
},
{
    "title": "WOW it really works",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for our home. True, it is oversized for the square footage of our downstairs, but I do feel the difference when I come in from outside, especially during allergy seasons.",
    "post_time": "Reviewed in the United States on January 8, 2023",
    "pid": "B08XWQ5XG6"
}
]