[
{
    "name": "        Tikduck Flying Orb Ball 2024 Toys Soaring Hover Boomerang Spinner Hand Controlled Mini Drone Cosmic Globe Spinning Kids Adults Outdoor Birthday Gift Cool Stuff for Boys Girls 6 7 8 9 10+ Year Old       ",
    "stars": [
        "59%",
        "15%",
        "11%",
        "6%",
        "10%"
    ],
    "pid": "B096LVFBMW",
    "ratings": "8,598 ratings",
    "other_info": {},
    "discount_price": "$ 32.00",
    "normal_price": "$43.99",
    "about_this_item": [
        " Super Cool High-Tech Hand Controlled Drone : Our flying orb ball featuring a gyroscope and smart AI chip that promises intelligent flight. Different throwing angles and speeds will create different flight lines and boomerang effect. This cool stuff not only brings fun to play but also helps to improve children's hands-on ability, operating skills, intelligence, and creativity.  ",
        " Lightweight Body: This flying ball drone toy is made of high-grade ABS material, which is lightweight and flexible, making it able to withstand countless crashes. The propellers are safely concealed within the ball drone. The enclosed propellers cause no worry that children will be hurt by their blades.  ",
        " USB Rechargeable: Simply connect it to the USB connector for 25 minutes to fully charge. (Flying time: 8 to 10 minutes, Battery life varies individually due to environmental factors). When the LED indicator flashes, it means that the aircraft needs to charged. The indicator light remains lit when charging, and turns off when charging is complete.  ",
        " For Anytime, Anywhere Fun: You don’t need a lot of space to take off with our hand operated drone. It is fun and easy to control anywhere. It’s designed to work indoors as well as outdoors, with a smooth flight pattern and boomerang effect. It’s the perfect backyard activity, but can easily be used indoors as well. This flying ball is a great conversation piece for family, school, and holiday gatherings. It’s a simple way to teach about physics and aerodynamics, even from a young age.  ",
        " Perfect Gift: This hand-controlled drone is a fun novelty gift for birthdays, Halloween, Thanksgiving Day, Christmas. This is a great choice for Easter, Father's Day, Mother's Day gift toys. It’s a perfect enrichment gift for kids, teenagers, adults, and the elderly.  "
    ]
},
{
    "title": "Very fun encaptivating toy for kids 5+",
    "rating": "4.0 out of 5 stars",
    "content": "It actually works if you toss it in the air flat it will go up and float down right back in your hands. If you tilt it forward about 20 degrees you can toss or underhand it and it will float forward and come back. Takes some practice for sure. The leds are a huge plus because you can even play at night. Battery lasts reasonably long time similar to a drone helicopter toy however it does take some time to charge. The toy does feel sort of brittle so only thing Im worried about but it does turn off when it falls to the floor. That is actually how you turn it on by shaking it as well.",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My son bought this item after seeing a few videos of it being thrown and floating back . ( boomerang) action. It can be a fun toy to play with, playing catch with my so  or a friend is more fun than by yourself. It does have a crazy powerful motor and fan . When you start it by giving a flick with the ball in your hand activates the motor to start. When you hold the ball level you can feel how it pulls with the fan . If you angle the top half toward you , you can feel it wants to fly toward you with it at the same angle push you hand forward and let go it should want to fly back into your hand. After a few practice throws you can sense where the ball wants to go . This will allow you to preform the boomerang action of the ball. Or you can use the force the fan blades are pushing an angle the top toward a friend or in my case my son . And you can play catch back an forth. Lights are colorful. The on off button ia on the top of the motor if you have larger finger you will need something to push the button with something. My fingers are to larger to fit through the top of the ball to turn on and off. Charger is also at the top of the motor. I would warn anyone with long hair be careful. Loose hair might get caught in open fan blade . I was nervous with my wife and daughter playing toss with us . Thankfully no accidents but I questioned the open fan design and how we were playing with it.",
    "post_time": "Reviewed in the United States on March 6, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Powerful flying ball",
    "rating": "4.0 out of 5 stars",
    "content": "While my grandson hasn't received it as yet (bought for Christmas 2024) - I've seen others in action and am Fascinated ! ...  I think more adults like than kids and its very well liked and enjoyed.",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I do have to emphasize that the object's 'cage' has the openings to which fingers should NOT - EVER be poked in... especially younger children... otherwise its just FANTASTIC !",
    "post_time": "Reviewed in the United States on December 2, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "FASINATING !",
    "rating": "5.0 out of 5 stars",
    "content": "This is fun....a lot of fun. My son (4 yrs) and I have been in the yard with this thing since it came out of the box.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "There's a bit of a learning curve around throwing it but once you figure it out it's pretty cool. Softer is better...which is a struggle to explain to a 4 yr old but he doesn't really care.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Hours of fun in 15 minute spurts",
    "rating": "4.0 out of 5 stars",
    "content": "At night it's a blast....",
    "post_time": "Reviewed in the United States on January 3, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The only downside...each charge is good for 15 maybe 20 minutes.  That's a bit of a bummer but I figure because it needs to be light there isn't a lot of battery space that can be used. Upside is it charges in about 15 to 20 minutes so that's nice.",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Grandson loves it and so do I!",
    "rating": "4.0 out of 5 stars",
    "content": "Honestly might buy another one just so we can flip flop them while playing.",
    "post_time": "Reviewed in the United States on February 26, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fun toy. Would recommend. Worth 30 bucks to not have your kid want to spend a Saturday in front of the TV.",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Present for Grandson's Birthday",
    "rating": "3.0 out of 5 stars",
    "content": "I bought this for my 9 year old grandson. He had trouble being able to get the ball to follow his hand and many times crashed it and got frustrated. He liked the lights and the way it moved but it was to hard to navigate.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These were purchased as a gift for our 3 great nephews and niece for gifts for Birthdays presents. The parents said they were a big hit. We previously bought them for are grandson for his birthday in July. It was a big hit then.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Tikduck Flying Orb Ball",
    "rating": "5.0 out of 5 stars",
    "content": "This has been a fun toy for children and adults alike. Charges quickly and the charge last fairly long. Kids of course, get the hang of it quicker than the adults but we all have fun with it. Fun toys that can be used in doors or out. We like it and I've ordered three more.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My Grandson love this.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Fun toy",
    "rating": "4.0 out of 5 stars",
    "content": "Runs out fairly quickly but easy to charge , only reason I gave it 4 stars.",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "My granddaughter (9) had difficulty getting  this to perform the tricks.  She did like the flashing lights.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Fun Toy",
    "rating": "4.0 out of 5 stars",
    "content": "I am not disappointed with this purchase at all. It's a little tricky to figure out how to fly it but once you kinda get it, so much fun. Christmas morning we had the whole family from as young as 5 up to 77 playing with it. AND ITS SOFT SO IT DOESNT HURT YOU OR THE WALLS WHEN IT BUMPS. The charge definitely holds longer than listed and it charges quick to! Love love love!",
    "post_time": "Reviewed in the United States on February 11, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Es un juego donde hijos y padres pueden ejercer una actividad juntos,participando al acrecimiento relacional familiar",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Grandson loved this",
    "rating": "4.0 out of 5 stars",
    "content": "This was an excellent purchase. This hover ball is fun and sturdy. It had hit the wall and floor multiple times and still flies with terrifying speed. It’s fun for indoor and out and a great way to kids to play together. Maybe this ball can be incorporated into a new sport. The neighborhood families have been playing ultimate frisbee but I see ultimate hover ball in their furnitures maybe. It’s worth trying and much quieter than pickle balls.",
    "post_time": "Reviewed in the United States on February 3, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It’s very entertaining for kids and for the adults too! Already assembled and easy to use. It’s USB charging  takes around 10 minutes to charge but….less than 10 minutes to drain the battery. I was expecting for it to at least last 30 minutes, but it dies a few minutes after use.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Take some practice",
    "rating": "4.0 out of 5 stars",
    "content": "Bought these as gifts for our grandchildren they loved them! But it does take some practice",
    "post_time": "Reviewed in the United States on April 29, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We love the toy for entertainment value. It entertained a group of children from 5 to 7. We loved how we could use it in a restaurant and explain what boomerang means.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "The orb",
    "rating": "5.0 out of 5 stars",
    "content": "The kids I gave them to just enjoy themso very much",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for my 7 year old grandson that is usually on the sidelines.. handsome, shy, loves soccer but in a group of kids, he holds back.. When opened Christmas morning the bounce took him by surprise & brought a big smile.. then it bounced on the Christmas tree & he joyfully jumped & retrieved.. then bounce  to his cousins.. followed the random bounces.. he created his own interactive game, leading his siblings & the star of the evening.. I thereafter ordered 4 more so they could extend their interactive play,developing skill  in hand eye coordination , balance & quickness.... this bouncing ball  put bounce & enthusiasm back into my grandson’s. Life.. for this I will forever be grateful❤️Mrs. Mimi Kelley",
    "post_time": "Reviewed in the United States on January 10, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Kids be happy",
    "rating": "5.0 out of 5 stars",
    "content": "I love the accessories to this thing and it works just great! It is so entertaining to play with! The led lights is so cool! I like the design!",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My 10 year old grandson loves this!  It’s a perfect gift!  Very well made and provides hours of fun.  The lights are beautiful, sound isn’t too loud and fits your hand easily!",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Jumping for joy❣️",
    "rating": "4.0 out of 5 stars",
    "content": "Daughter enjoyed it, but it does need charged very frequently",
    "post_time": "Reviewed in the United States on April 17, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Fun doesn't live long between charges quality is marginal at best.",
    "post_time": "Reviewed in the United States on July 14, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "This is an awesome ball!",
    "rating": "5.0 out of 5 stars",
    "content": "This is a completely engaging toy. It drew in the whole family both young and old.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We played with this thing for like 2 hours when we opened it, not me and my kids my 40 yo A' and my 40 yo friends",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Which is better- AMERFIST or TIKDUCK?",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve been using it for a while now, so far no complaints.",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Grandson loves this. Takes some practice to use but it is a neat gift once learn how to use it.",
    "post_time": "Reviewed in the United States on March 25, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Bought this for my grandson",
    "rating": "4.0 out of 5 stars",
    "content": "My 13 year old loved this but it broke easily. He may have been maybe too rough with it, but still broke quickly. Was very cool how you could glide it across the room in the air though.",
    "post_time": "Reviewed in the United States on January 19, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Kids have a blast chasing after this thing",
    "post_time": "Reviewed in the United States on April 10, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Very cool, but broke quickly",
    "rating": "4.0 out of 5 stars",
    "content": "It is a little harder to control than advertised or as the videos show, but it is an interesting product that my 3 year old grand son enjoys playing with.",
    "post_time": "Reviewed in the United States on January 20, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This was a gift. But the recipient had an enjoyable time, lot of gifts and not a lot of timr to see all.",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Very fun",
    "rating": "5.0 out of 5 stars",
    "content": "Kids love it, high recommend!",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Keeps clicking off",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Takes a little practice",
    "rating": "5.0 out of 5 stars",
    "content": "Definitely recommend, my kids love it. It can go pretty far so just be aware or your surroundings. Best thrown in an open field.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My son went frenzy after the ball flying above the loving room . He was like a cat chasing ball and running everywhere. He enjoys this toy so much. The only thing I feel a little disappointed is that the head easily flips upside down so it falls so quickly that we can not catch it or bounce it again",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "My son loves it after months of use.",
    "rating": "4.0 out of 5 stars",
    "content": "Fun toy to play with.  Docked one star cause the blue paint on it rubs off on the walls when it hits them.",
    "post_time": "Reviewed in the United States on January 7, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great toy for a boy or a girl. My niece loves it. It’s very active as soon as you put it on. It’s a fun gameplay. It is very fast and the batteries last very long. It’s been through the air. It’s very fun for playing back-and-forth it is a great toy to have in the house or even play outside.",
    "post_time": "Reviewed in the United States on April 23, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "So a good active toy",
    "rating": "4.0 out of 5 stars",
    "content": "Hard to figure out how to use, but once you get the hang of it you and the kids will spend hours playing with it.",
    "post_time": "Reviewed in the United States on December 31, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Then it breaks",
    "post_time": "Reviewed in the United States on January 14, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Entertaining",
    "rating": "4.0 out of 5 stars",
    "content": "Update: the seller was really nice and refunded me the entire order. The toy is very cool",
    "post_time": "Reviewed in the United States on December 23, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Fun toy, spinning leds look great. Some of the tricks are harder than others.  I drop it a lot and it has not broke!",
    "post_time": "Reviewed in the United States on January 5, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Fun for a day or two - update seller",
    "rating": "5.0 out of 5 stars",
    "content": "This thing looks fun and cool but me and my son can figure it how to have it hover and boomerang back you",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Grandson's had fun playing with this",
    "post_time": "Reviewed in the United States on December 17, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "fun toy",
    "rating": "5.0 out of 5 stars",
    "content": "My grandson really likes this toy. It takes a little practice guiding the ball, but my 6 year old grandson is really enthralled with it.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "fun",
    "post_time": "Reviewed in the United States on November 2, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Grandsons Loved it!",
    "rating": "5.0 out of 5 stars",
    "content": "Lightweight and Durable, this light up ball kept our 12 and 9 year old grandsons amused and entertained longer than I expected. They had so much fun watching it float quickly through the air and enjoyed finding different ways to make it go places. The ball goes pretty fast and will go really far so if you’re near a body of water like we were on a walk we took, you might lose it. His landed in about two feet of clear cold water in a meandering stream that had plenty of rocks to be able to gain access to it, but after at least 10 minutes in the water, I didn’t think it would still work. It is a truly durable electronic ball! It still worked fine! The battery runs down in about 20 minutes of constant playing, but they love it and I would definitely buy it again!",
    "post_time": "Reviewed in the United States on January 13, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "These are at walmart for way cheaper (see photo) and this one is lower quality. Someone is likely buying these for a cheap price and flipping them.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Over priced! Wow.",
    "rating": "4.0 out of 5 stars",
    "content": "I gave this to my 12-year-old son (Jeff) and at first, he loved it. Now he is staying far away from it. Whenever I tell him to play with it he says \"Mom it keeps trying to kill me!\". Each time I tell him it's nonsense and to go play with it. Well, today I went to his room and it turned on by itself. It then beat me to the ground then flew out the window. I called the police and now it's the FBI most wanted after blowing up a police car.",
    "post_time": "Reviewed in the United States on December 16, 2022",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recently purchased the Boomerang Ball and it has been a hit with my kids and me! The design is clever and durable, making it easy to use and throw. The ball's ability to boomerang back to you is so much fun and adds an exciting element to our outdoor playtime. We've had hours of entertainment with it, and I love that it encourages active play and exercise. Highly recommend this product for some family-friendly fun in the sun! 5 stars and a big thumbs up from our family!",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "its alive",
    "rating": "4.0 out of 5 stars",
    "content": "My nephew enjoyed playing with this toy. It does not hover exactly like the advertised videos but still he enjoyed it very much and had a lot of fun with it.",
    "post_time": "Reviewed in the United States on November 4, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Took a little while for kids to figure out but they had fun when they did",
    "post_time": "Reviewed in the United States on January 13, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Amazing toy for the kids!!",
    "rating": "5.0 out of 5 stars",
    "content": "Update:. The seller sent a replacement promptly that works as advertised.  I have upgraded the rating to five stars since the customer service was responsive and the item now does what it is supposed to.  Plus it actually is fun!",
    "post_time": "Reviewed in the United States on November 17, 2022",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Original review: It looked like fun out of the box, but we couldn't get it to hover because it was too top-heavy.  And most of the time when we launched it, it just headed down to the floor, bounced a few times and then turned off.  Occasionally it would head up to the ceiling, bounce a few times and then turn off and fall to the floor.  We never did figure out how to toss it to someone else.  Very disappointing.  We were going to give five of them to the grandkids but thought we should just order one first to see how it worked.  Glad we did and now we'll have to find something else.",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Fun toy",
    "rating": "5.0 out of 5 stars",
    "content": "battery life could be better",
    "post_time": "Reviewed in the United States on January 22, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Bought this to entertain the kids visiting for a day. It was a hit for sure. The only down side I could see is that it could easily get lost if you let it fly too high. We were lucky that we were always able to found where it landed but it did take an unexpected flight over the house. I sent it home with them and they were sad to leave after having fun so mission accomplished.",
    "post_time": "Reviewed in the United States on April 1, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Tricky but it works!",
    "rating": "4.0 out of 5 stars",
    "content": "Initially, I thought it was defective…but it was definitely a user error lol It seemed to be too wild but as long as “UP” is facing up and you toss it upwards at a 45 degrees’ish angle, it’ll come back. The seller was super helpful with the process and provided me tips and suggestions to make sure I understood AND enjoyed my purchase. They were so patient and really helped me out.",
    "post_time": "Reviewed in the United States on July 14, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Wish the battery lasted longer",
    "post_time": "Reviewed in the United States on February 8, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Battery don't last long",
    "rating": "5.0 out of 5 stars",
    "content": "If you're ordering for kids for Christmas, we suggest that you watch videos & read how to \"play\" with these before Christmas morning. They need to be charged & definitely need to know how they operate. They can be FRAGILE. You'll possibly avoid some disappointed kids while they're charging & you're trying to figure out how to make them work. If course, it depends on the age of your kids. Ours are 6 & 8. Teenagers will probably take off with them. However, they still need to be charged up. They'll keep 'em out of your hair Christmas morning! Just watch for colorful, whizzing, sparkling orbs flying thru the air!",
    "post_time": "Reviewed in the United States on October 25, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My babies are happy with this ball. It's little beat difficult to learn to control the flying ball in the beginning , but it's really very funny and joyful .",
    "post_time": "Reviewed in the United States on October 15, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "FUN, PRETTY & INNOVATIVE",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this for my son’s birthday. He and my husband love to play with it but it spins so fast I’m worried it’s going to get caught in someone’s (including the golden retriever’s) hair and not come out! Gave it 5 stars because it’s so fun for my boys to play with!",
    "post_time": "Reviewed in the United States on March 27, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Product did not work. Contacted seller and they were quick to respond with options to replace or offer full refund even though we were beyond the return date  I had ordered in October for Christmas and waited until December to set them up and could not get them to work as advertised. Seller refunded without question that is why I gave a 3 star due to the good customer service",
    "post_time": "Reviewed in the United States on December 16, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Funny toy",
    "rating": "4.0 out of 5 stars",
    "content": "Kid friendly I purchased for grandchildren but definitely not for indoor use",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a gift to my nephew; He like it very much",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Works but could be dangerous",
    "rating": "5.0 out of 5 stars",
    "content": "Bought one for my grandson for a Christmas present. It did not work and the box went into the trash. So I made an order the other day and bought another Orb Ball for him and A Easter gift. He was happy with the color and that it worked.",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Bought as a gift. Hard for me to figure out how to work it",
    "post_time": "Reviewed in the United States on December 18, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Fragile",
    "rating": "3.0 out of 5 stars",
    "content": "It broke in 2 days.",
    "post_time": "Reviewed in the United States on April 27, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I was refunded.",
    "post_time": "Reviewed in the United States on January 2, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "May be better for an older child",
    "rating": "4.0 out of 5 stars",
    "content": "My grandson is 6+.  Within 2 hours of playing with it he managed to break it by throwing it against a wall and down the stairs.  It stayed in tact and still lit up but the fan would not work.  I think he was too young and rough for this type of toy.",
    "post_time": "Reviewed in the United States on December 11, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Will require some learned skills to enjoy at level in video.",
    "post_time": "Reviewed in the United States on July 17, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Great fun",
    "rating": "4.0 out of 5 stars",
    "content": "By",
    "post_time": "Reviewed in the United States on January 7, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "What a nice toy and really cool to watch and play with only downside is the battery doesn’t last very long, maybe five minutes before it needs to be charged again other than that really enjoy, and will buy again.",
    "post_time": "Reviewed in the United States on March 30, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Kids loved it!",
    "rating": "5.0 out of 5 stars",
    "content": "Fun but difficult to use",
    "post_time": "Reviewed in the United States on March 8, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great toy for adults only. Why? Kids get excited and then try to catch/trap it a bit reckless and it breaks.",
    "post_time": "Reviewed in the United States on January 13, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Fun",
    "rating": "5.0 out of 5 stars",
    "content": "We have a yr. and half old grandson and this at first scared him, now he loves it, one of the first things he goes to when he comes over.  We all do.  Fun to do in the house, but it can get away and be hazardous to fragile items.",
    "post_time": "Reviewed in the United States on May 2, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I did know about this product earlier but after seeing the video took chance to buy it. Its easy to learn but watch you tube video to learn technique to handle it. Fun playing it  for every age group. It fell down multiple times but did not break. One charge last for approx 10 minutes over all good purchase",
    "post_time": "Reviewed in the United States on January 24, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Lots of fun.",
    "rating": "4.0 out of 5 stars",
    "content": "Not ready to control like shown. But great fun. Last about 16 minutes per charge.",
    "post_time": "Reviewed in the United States on November 30, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Ball doesn’t hover.  Instructions are poor.  You can push it from one person to another and it flies but will not stay in the air in its own.",
    "post_time": "Reviewed in the United States on January 14, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "It’s ok",
    "rating": "3.0 out of 5 stars",
    "content": "It does hold up well to hitting floors and walls and stops spinning when it does. It’s also easy to restart",
    "post_time": "Reviewed in the United States on February 13, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's a decent product that young kids are entertained with, but I think part of that is lost after a period of time as it doesn't really \"boomerang\" as advertised. It more like, goes in the air, flies around and sometimes heads back in your direction and sometimes not. It's actually more fun to play with this in the dark, as it lights up, and there isn't any danger of being hurt as the units blades are perfectly contained.",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "It's ok, short term entertainment",
    "rating": "5.0 out of 5 stars",
    "content": "The age of the kids playing with it ranged from 4 to 12 and in a span of 30 minutes, they went from mesmerized, to having fun, to getting tired of having to continuously having to retrieve it. For an inexpensive toy, it served its purpose.",
    "post_time": "Reviewed in the United States on December 21, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "My son is almost 15. I was afraid he would lose interest in this right away, but it is so fun that we have all played with it many times already. It flies crazy high, and it is difficult to predict where it will go. I think he will enjoy it for quite a while",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "So much fun",
    "rating": "3.0 out of 5 stars",
    "content": "Bought these for my Grandsons as they seem to have everything under the sun. Now they have this for fun and all 4 can play together. I pray it does not land in their in ground swimming pool. No batteries as it charges with a small cord from any TV or PC. Just like charging a cell phone. POP POP may get one for himself. :-)",
    "post_time": "Reviewed in the United States on February 7, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Don't buy it sucks",
    "post_time": "Reviewed in the United States on December 31, 2023",
    "pid": "B096LVFBMW"
},
{
    "title": "Fun for all",
    "rating": "3.0 out of 5 stars",
    "content": "Was excited for my kid to try out. We followed all the instructions on how to use it. But the ball would go and then fall it would never come back. We had to return it.",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "B096LVFBMW"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I got these for my grandsons ages 5, 6, & 7. We also accidentally ordered an extra one. The adults were having as much if not more fun than the kids. One son (not the dad of the grandsons) confiscated the extra one, the other (no grandsons) ordered one for himself immediately! He is so excited it is coming tomorrow. These exceeded my expectations by a lot!",
    "post_time": "Reviewed in the United States on March 13, 2024",
    "pid": "B096LVFBMW"
}
]