[
{
    "name": " Lessons in Chemistry: A Novel ",
    "stars": [
        "72%",
        "20%",
        "6%",
        "2%",
        "1%"
    ],
    "pid": "B09BBK79VB",
    "ratings": "302,388 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "Amazingly timely!",
    "rating": "5.0 out of 5 stars",
    "content": "Thoughtfully written, extremely insightful and the best novel I have read in years.  For anyone with a mind for what makes us all tick, a must read.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This heartfelt novel reminds me of a time that once existed for women worldwide. I e always been in business and experienced some of the bias described in this story. However as a baby boomer, it was not as bad.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "a must read",
    "rating": "5.0 out of 5 stars",
    "content": "The story is poignant and impossible to put down.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s beautifully written and will have you madly turning pages fascinated and insisting on a happy ending.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Un-put-downable and oh so identifiable",
    "rating": "5.0 out of 5 stars",
    "content": "This book made me feel again. Before I started reading this book, I was going through my life of being a working mom with 2 kids- feeling a bit disconnected. Read a couple of pages in the beginning. But after a few chapters I could not put it down. The style of writing is factual yet intriguing. Loved the story and the lead character. We need more Elizabeth Zotts. Highly recommend.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved the characters, particularly Mad, who was the glue that held the story together. Having the dog in the story added a delightful point of view.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "A wonderful read!",
    "rating": "5.0 out of 5 stars",
    "content": "This book is probably one of the top 10 I've read in my lifetime. It's a fantastic story. The characters, especially Elizabeth and Mad, are so incredibly well written. HIGHLY recommended.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Oh, my gosh!  I didn't expect so many twists and turns in this extraordinary novel.  I loved every word and character; especially Mad and Six Thirty!!",
    "post_time": "Reviewed in the United States on December 6, 2023",
    "pid": "B09BBK79VB"
},
{
    "title": "Top 10",
    "rating": "5.0 out of 5 stars",
    "content": "Biting lyrics, feminist funny. Loved it.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Elizabeth Zott was something rare in the 1960s, she was a female Chemist, and thus she was never taken seriously as was no woman trying to succeed in any male dominated profession. In fact, Elizabeth was unable to complete her doctorate program due to being raped and then dismissed when she reported the crime to the police.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Great book",
    "rating": "5.0 out of 5 stars",
    "content": "I saw the series first on Apple tv then read book. Book us way better.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It took me a long while to get into this book! About half way through it really had my attention! Well written!",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Great book!",
    "rating": "4.0 out of 5 stars",
    "content": "So I’ve seen this book float around for the last few years and have never really taken an interest in reading it. Historical fiction is my favorite genre but something about this just never captivated my attention. I recently joined a bookclub and this was the book of the month. I had about two days to read it and completed it in less than 24 hours. I can see the hype around this book. It is super fun to read enjoyable relatable. As a mother of three kids, myself And someone who is constantly pursuing education, I can see the power that is captivated in Elizabeth’s character. She constantly advocated for herself and knew that despite society had claimed for her. I love that throughout the entire book from the very beginning she had a village, which is what motherhood is truly about. It is what being a woman is about you have your people and those people role with you through the good times and the bad times. They are constantly pushing you to be the best version of yourself and they’re constantly challenging you to reflect on the parts of yourself that could change and be better. Elizabeth’s character was very relatable and she was constantly rising up to the occasion.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is very good",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Fun Summer Read",
    "rating": "5.0 out of 5 stars",
    "content": "I’m not going to summarize this book. I’m sure other reviewers will do that. All I will say is that I thoroughly enjoyed it! I laughed, I cried, I couldn’t put it down.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Highly recommended!",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Nice",
    "rating": "5.0 out of 5 stars",
    "content": "Do you believe in equality? Read this book. Don’t believe in equality? You should read this book. Do you like Chemistry? Read this book. Don’t think you like Chemistry?  You should read this book.  Heck…..  You should read this book!  You will laugh, cry, be quiet impressed, maybe even inspired.  Recommitted.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I had tired of reading books that everyone was talking about, but am I ever glad that a new group I recently became involved with had “Lessons in Chemistry” as its next read. From the very start, I fell in love with this novel: its written style, a voice that sounded so much like the one in my own head, its main characters (intelligent and guided by a goodness that we should all hope for), a story that wrapped around me like a tight hug. I laughed out loud, and I cried. Thank you, Ms. Garmus, for such a wonderful tale and for such wonderful messages.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Delightful!",
    "rating": "5.0 out of 5 stars",
    "content": "I read this book for my book club and found it very hard to get into at first. This is why I marked it as a 4 start instead of a 5 star. By the end of the book, you are so invested into the characters of the book and will find yourself thinking about the book days after reading. I would totally recommend the book but let them know that it is NOT a page turner. You will want to take your time on reading because it is very thought provoking. :)",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I tend to stay away from bestsellers but this was an excellent read. Tied a little too neatly at the end but there you have it. The main characters were bold and imperfect. They had depth and you truly felt for them. The interview at the end with the author was hideous. I think there should be a rule against interviewers using the word “interesting.” Especially when responding to the misogyny experienced by women of this time. It wasn’t interesting. It was abominable. My generation was the one that followed and the workplace was still an abominable place for women.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "this book made me cry",
    "rating": "5.0 out of 5 stars",
    "content": "I was waiting to read this book for a while, now I’m going to recommend it to everyone",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It made me cry and smile",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Amazing book!",
    "rating": "4.0 out of 5 stars",
    "content": "In a long time I haven’t read a book that good",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Impossible to describe how much I loved this book. From the 1950’s when I was born and things were truly as depicted to the sixties when changed actually began for women. We’ve come a long way but still have some work to continue. The setting, the story and even the ending, Bonnie Garmus provided a truly amazing novel. Sequel perhaps?",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Fun read",
    "rating": "5.0 out of 5 stars",
    "content": "Diversity of cooking and chemistry",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I can't tell how much I loved each part of this book! I was caught off guard and couldn't stop reading it until the last page!!!!! I wanted so bad to know how Elizabeth Zott got what she deserved!!!!! I fell in love for her romance and was really impressed with 6:30 and Mad! I wanted to read it all over again but being reasonable, I wish I could find another thrilling book to read next!!!!",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "It caught me off guard and kept me from the beginning to the last page",
    "rating": "5.0 out of 5 stars",
    "content": "I fell in love with Elizabeth, and Calvin, and Six-thirty too.  This was nothing like I expected, but it is absolutely on my list of favorites.  I couldn’t put it down!",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's been awhile since I've read a book that stole my very sleep from me! I couldn't stop reading, I cannot wait to watch the movie now. It was so funny and cleverly written. I was absolutely heartbroken, knowing what was going to happen in the beginning, but the resolution made everything worth it. 10000% recommend!",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "what a book!",
    "rating": "5.0 out of 5 stars",
    "content": "So enjoyed the perseverance and confidence knitted throughout the book in the character of Elizabeth, and the adorable precocious personality of the character of Mad!",
    "post_time": "Reviewed in the United States on February 11, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wow!!  I was hooked right up to the very last word of this book and I was so sad when I was done reading it.  The characters, the story line, everything!!!",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Well written!",
    "rating": "5.0 out of 5 stars",
    "content": "Did not want to put this book down! Rivotting and with constant humor!",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Life is full of moments of truth th as t touch all of us!",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "If I had a book club, this would be the book.",
    "rating": "5.0 out of 5 stars",
    "content": "A must read!",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Even before I finished reading, I started telling my friends to read this. Women working in science and technology fields will be able to relate to Elizabeth's story. Ladies, we have come a long way, but still have challenges. I love how this book helps teach the importance of supporting each other.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Product review",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this book!",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed the book so much that I bought one for my daughter-in-law and she’s reading it to my son. I think anyone would enjoy this book, especially the working woman.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Important read for women",
    "rating": "5.0 out of 5 stars",
    "content": "\"Don't judge a book by its cover.\" That saying exists because of books like this one. I read it for my book club to take a chance on another genre. I was expecting the typical chick lit type of story. Something light-hearted with a few obstacles and a character arc for the protagonist.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was not expecting to go through such a rollercoaster of emotions. From happiness to sadness to elatedness to agony to anger. So many emotions felt in just one book and I loved every minute of it. I will say that the ending left me a little wanting only because I felt like Elizabeth needed something better.",
    "post_time": "Reviewed in the United States on March 30, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "A Book You Don't Want to Miss",
    "rating": "5.0 out of 5 stars",
    "content": "This was a book I wish I could erase from my memory and read again. It is a must read for every one. There are triggers you might need to look up on just in case. Other than that, I recommend this to everyone. The hype is definitely worth it, I promise.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wasn't sure about this book at first. I don't always like when a loved one dies. It hit to close to home. Then I found myself enjoying the journey more with each page. I enjoyed the quirky characters and their point if view. Each and everyone were different and very real in emotions, attitudes and personality. Many people had recommended this book to me and I'm very happy I finally read it.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Fabulous",
    "rating": "5.0 out of 5 stars",
    "content": "Wonderful read.  So well written I couldn’t put it down!  Makes you cry and laugh out loud.  Gotta love Elizabeth Zott!",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good book. Adult subject matter. Not for children.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Book club book for me.",
    "rating": "5.0 out of 5 stars",
    "content": "I laughed out loud, I cried. What more can I say? It is full of wonderful quotes. I shared it with a friend and plan to share with my grand—what happened to women this recently will seem unbelievable to people of her generation.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Tried to watch the series. Wasn’t enthralled enough to stick with it. Decided to read the book and could not put it down. Soooo, I am off to try the series again but I feel like I am late to the party. Each character stuck with me for different reasons. I’m not sure I can even pick a favorite. Was I surprised at the ending revelation? Maybe. Maybe not. But it was a great read. Having grown up in the fifties, it brought back a lot of what I grew up with. Not the least of which was the mores that kept my mom a homemaker who was able to successfully instill in her daughters the desires of her own heart….to be a Teacher.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "This book Is fantastic!",
    "rating": "4.0 out of 5 stars",
    "content": "Much has been said about Bonnie Garmus's Lessons in Chemistry.  So when my sister chose it for our book club, I was curious, albeit cautiously.",
    "post_time": "Reviewed in the United States on November 3, 2023",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Elizabeth Zott is a brilliant and beautiful chemist in mid-century California.  She seems to have everything going for her, but \"seems\" is the operative word.  Because the men she works with are awful.  What's more, Elizabeth isn't like other women, or even people.  Unflinchingly driven and uncompromising, she refuses to perform for anyone, to smile on demand or at all.  She tells the truth, even when it's ugly -- and it often is --making her seem uncooperative, unlikeable, and cold to everyone but Nobel Prize-nominated fellow odd duck Calvin Evans.  Yet at her core, Elizabeth is purely kind.  Despite having suffered loss, violence, and the most egregious sexual discrimination imaginable, she believes that everyone deserves to be treated fairly.  And it is this humanity that she brings to her cooking show, Supper at Six.",
    "post_time": "Reviewed in the United States on November 29, 2023",
    "pid": "B09BBK79VB"
},
{
    "title": "Not What I Expected",
    "rating": "5.0 out of 5 stars",
    "content": "Now, if you're wondering how a no-nonsense chemist became a TV star, then I'm right there with you. Suffice it to say that unjust events in Elizabeth's life resulted in this most unlikely of developments.  And although she's less than thrilled to be working with bowls instead of beakers, she makes the show her own, taking every opportunity to educate her female audience about not just cooking but chemistry and, ultimately, change.  Subversive and surprisingly entertaining, Supper at Six is a syndicated smash.  To me, this is where Elizabeth blossoms, her paradoxically off-putting personality, passion for science and food, and insatiable hunger for justice commingling to enable her to connect with other women.  It's exciting and inspiring and all of the things.  But this is still Lessons in Chemistry, not an uplifting romp about a reluctant but charismatic performer.  Because as I said in the beginning, Elizabeth Zott does not perform.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There's trouble brewing at the TV station, just as there was at the lab, only worse.  So some things happen, and then some more things, culminating in an ending that feels like a drop off a cliff.  And although I can see how it would be satisfying for most, to me it's anticlimactic.  Still, this isn't my story; it's Elizabeth Zott's.  She's a scientist first and in the end, she gets what she wants and needs.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Chemical Reaction Retraction",
    "rating": "5.0 out of 5 stars",
    "content": "Maybe understanding -- and respecting -- that is a lesson that this very unscientific but very feminist reader needed to learn.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Rating: 4/5 Stars",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "So refreshing and captivating",
    "rating": "5.0 out of 5 stars",
    "content": "It keeps readers captivated and going on this life rollercoaster with every page. As a woman, the appreciation of topic is also great. Some things changed, others will follow us…",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A great read with strong characters emphasizing various positions of 1960s reality. While two generations removed, in the 1980s I was one of three women engineers on a staff of 100.  My daughters find the stories I tell of that time unbelievable using today’s standards. I found this book amazingly relatable.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Great read with insight into a era",
    "rating": "4.0 out of 5 stars",
    "content": "I received new book  in very poor condition!  Very disappointed!  Book itself is a great read.  I can’t  give this as a gift in the condition it was received.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I quite enjoyed this book. All the characters are well drawn and believable, and sadly, the behavior of the people of the 1950s and 60s is quite believable. Elizabeth Zott is a delightful character.",
    "post_time": "Reviewed in the United States on March 24, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Great book",
    "rating": "4.0 out of 5 stars",
    "content": "I would recommend this book with a caveat. It is, through the development of its main character, an apology for materialism, or as Elizabeth Zott would call it, humanism. I prefer to hear more than one side of an argument presented. Certainly, it is any writer's prerogative to speak in favor of what they believe, but I know it is possible for a writer to present multiple views of a difficult issue with clarity and realism. Cormac McCarthy does this brilliantly in The Sunset Limited. I would have liked a bit more of that in this book.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Lessons in Chemistry is a move about a smart woman in the 50s who refused to be put in her place as a wife a mother only. She had a great ability for chemistry and wanted to use that ability but was fighting in a man’s world. She was born 50 years too early.",
    "post_time": "Reviewed in the United States on December 2, 2022",
    "pid": "B09BBK79VB"
},
{
    "title": "Strong writing and a powerful message",
    "rating": "5.0 out of 5 stars",
    "content": "The writing is excellent and the book flows easily. It is funny and has a lot of poignant thoughts. It not your typical book with your typical plot. The use of the “f-word” was used a little more prolifically than needed. I liked the book but was not blown away by the book hence the 4 stars.",
    "post_time": "Reviewed in the United States on January 3, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This novel follows the twists and turns in the life of the heroine: Elizabeth Zott, a brilliant research scientist who is tired of being a second-class person just because she is a woman.",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "A Joy to read",
    "rating": "5.0 out of 5 stars",
    "content": "Elizabeth is a top-grade research schemist but can't get treated as an equal [much less be lauded for being better than pretty much everyone in her department] and when they demote her and the the department head steals her work and publishes as his own she quits.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "She meets her soul mate, Calvin Evans, who treats her as an equal partner and recognizes her brilliance. They get a dog and Calvin asks what they should name it.  She looks at her wrist watch and says \"it's six thirty\" and so it was.  This is typical of her most unemotionally rational approach to everyday nonsense,  for example that women should wear comfortable clothes and all the other ridiculous (and irrational)  social \"rules\".",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Good read",
    "rating": "5.0 out of 5 stars",
    "content": "I have only made it alittle bit into book but so far so good especially if you like science terminology",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love reading hard to put down",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Very good book",
    "rating": "5.0 out of 5 stars",
    "content": "There are no words.  Just read it!  It will stay with you a lifetime.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Not sure what I was expecting.  Main character very odd and I found incredibly annoying.  Overall a well written book and did provide reflections of how women were so terribly dismissed in the work society.",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Best book I ever read!",
    "rating": "5.0 out of 5 stars",
    "content": "I have recommended this book to all who read.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Honestly, this book had me SHOOK, multiple times. Like jaw dropped, “absolutely did not see that coming” moments.",
    "post_time": "Reviewed in the United States on February 23, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Interesting",
    "rating": "4.0 out of 5 stars",
    "content": "I cannot believe this was BG’s debut novel; I feel like her writing style was so unique and well-developed that I wouldn’t have been surprised if this was her 10th published work. I was most impressed by her ability to be funny and even a little silly in ways that didn’t detract from the storyline, especially in tense moments when it would have been very easy to ruin the mood by doing so.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I think it’s important to note that if you’re in the mood for a story where the main plot is a love story, you should pick a different book. While it does have a very worthwhile and sweet, “written in the stars” love story, that is not the main focus.",
    "post_time": "Reviewed in the United States on July 10, 2023",
    "pid": "B09BBK79VB"
},
{
    "title": "Fabulous fun read.",
    "rating": "5.0 out of 5 stars",
    "content": "I HAD to knock points for the ending. It was SOOO rushed, and while I didn’t HATE it, I feel like it really failed to do some important parts of the plot justice. Another 3-7 chapters could have made quite the difference in the way things were resolved. I was sorely missing a proper denouement; it was like a slow build up/brewing of curiosity the whole book to be TOLD the ending in 3-5 pages.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Enjoyed character backstories",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Inspirational and Entertaining",
    "rating": "5.0 out of 5 stars",
    "content": "This is a story about females pushing past boundaries and expectations set for them, overcoming injustices, finding alliances in others, and strength in themselves.  Woven through the story and the lives of the female characters is a boy lost in sad circumstances who grows to become a remarkable man who is gone too soon.  He is lost and experiences loss time and again in his youth as the other characters persevere in their own right long after he has passed through their lives.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a beautifully written book with the perfect mix of historical reality and whimsical humor! Everyone should read this book as it so clearly articulates the challenges and frustrations of being a strong independent individual in a world resistant to recognizing you.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Fantastic book",
    "rating": "5.0 out of 5 stars",
    "content": "Fun, light and clever story!",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Interesting book.  I enjoyed it mostly.  There were parts that were too slow for my taste but still enjoyable book.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Loved It!",
    "rating": "5.0 out of 5 stars",
    "content": "One of the best fiction books I have read. No wonder  Apple made it into a TV movie. Looking. for her next book.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "End of the day delight, chapter by chapter twists and turns that kept me interested throughout.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "enjoyed",
    "rating": "5.0 out of 5 stars",
    "content": "There was so much wit and logic about Miss Zott, Mad, and Harriett. They were some powerful women.  Powerful and funny. I can see why they made a tv series about it. This book has everything. Its a period piece with characters who overcome loss and while using relevant issues that women deal with today.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Many social issues were addressed with humor and thoughtfulness.  The main characters are interesting and lovable.  I would love to see this book made into a movie!!",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "excellent",
    "rating": "5.0 out of 5 stars",
    "content": "The best story.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B09BBK79VB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I cried happy and sad tears. Loved Elizabeth’s story so much! 6:30 was a top tier character",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B09BBK79VB"
}
]