[
{
    "name": "        MANSPOT Manscape Groin & Body Hair Trimmer for Men, Electric Ball Trimmer Pubic Trimmer Shaver,Manscape Kit with 4 Guard,Replaceable Ceramic Blade Heads,Waterproof Wet/Dry Shaver,90 Minutes Shaving       ",
    "stars": [
        "65%",
        "17%",
        "7%",
        "3%",
        "7%"
    ],
    "pid": "B09HZTKLNP",
    "ratings": "9,577 ratings",
    "other_info": {
        "Recommended Uses For Product": "Body",
        "Color": "Black",
        "Hair Type": "All",
        "Brand": "MANSPOT",
        "Power Source": "Battery Powered"
    },
    "discount_price": "$ 39.98",
    "normal_price": "$39.98",
    "about_this_item": [
        " Ultra-Smooth Shaving: Upgrade your grooming routine with MANSPOT Groin Pubic Body Hair Trimmer. Bid farewell to traditional shavers' discomfort and pain as our anti-cut blade and high-power motor deliver a faster, smoother, and more comfortable shave. No more nicks or burns, just a clean and confident look.  ",
        " Special Care for Your Precious Jewels: The blade is made from Aerospace-Grade materials, ensuring a safer and more reliable manscape grooming experience. You deserve the best care for your most delicate area, and that's exactly what the MANSPOT manscape ball/pubic/groin trimmer provides. Stretch out your skin and go slowly and steadily for the best results, and experience a new level of comfort and care.  ",
        " Long-Lasting and Rechargeable: Welcome to the Environmental Enthusiasts Club! Save time and money with the MANSPOT body trimmer. With up to 20 uses on a single charge, it's a durable and reliable choice for all your grooming needs. Featuring electric trimmer guards with four lengths (1.5mm, 3mm, 3-6mm, 9-12mm), it suits any trimming preference. The 1.5mm guard is ideal for those who prefer a very close trim or shave.  ",
        " Ergonomic Design & Waterproof: MANSPOT manscape trimmer's sleek design ensures an easy grip, even when wet. Its waterproof feature allows for convenient use in the shower or bath, making it your go-to grooming tool for back hair, chest hair, pubic hair, bikini hair, and underarm hair.  ",
        " VALENTINES DAY GIFT FOR HIM: GQ Recommends-This Valentine's Day, delight the men you cherish with the ideal gifts that speak to their hearts. Show your significant other with a considerate Valentine's Day gift, bringing happiness and comfort into his world.  "
    ]
},
{
    "title": "Very gentle",
    "rating": "5.0 out of 5 stars",
    "content": "Really gentle around the genital area and light weight.  No nicks!  Definitely recommend.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love it and should have bought it sooner. Battery has extra-long life.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Should Have bought Sooner",
    "rating": "4.0 out of 5 stars",
    "content": "Cons- power button in wrong spot, fingers will accidently turn off while in use.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "No corta tan bien como otras máquinas y se me hace que el intercambio de las piezas para cortar no es simple",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Buena, pero no fue la mejor",
    "rating": "4.0 out of 5 stars",
    "content": "just as described, appears safe to use",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Can't quite figure out how to attach the guards. Video didn't help, but I'm still working on it.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Shaver",
    "rating": "5.0 out of 5 stars",
    "content": "Work really well has a usbc connection to usb make sure you have a usb charger great product",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So my son kept telling me too much info about his body hair and I was like done explaining how to maintain and I was worried about him hurting himself so I got these he says they are great! Very safe don’t catch on skin glad I got them and never have to have those talks anymore lol",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "A little trouble with the attachments",
    "rating": "4.0 out of 5 stars",
    "content": "Great for those sensitive ares, and clears out the trees and bushes.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Used for personaal grooming --Works great --Head is a bit too wide for close work",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Very good product",
    "rating": "5.0 out of 5 stars",
    "content": "Super smooth and very durable.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Update - after cleaning and using the trimmer for a few weeks, I am pleased with its design and function. It works well enough, holds a charge, and is easy to use. The proprietary charger is a drag but I believe they fixed that in later models. Giving 4 stars because it works as designed, but I can’t forgive the packaging snafu",
    "post_time": "Reviewed in the United States on April 13, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Feels cheap, came covered in mold - updated",
    "rating": "4.0 out of 5 stars",
    "content": "This is a first impression review, and as first impressions go this wasn’t great. The product box was covered in a type of shrink wrap that upon opening had an *extremely* strong medicinal odor. Upon further inspection the trimmer itself, box, and accessories, were covered in patches of white mold (see photos) and the trimmer was somehow wet?? This is extremely offputting for a personal care product, and speaks to the companies quality control and storage practices.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The trimmer itself has that classic Chinese plastic cheap feel, which is ironic considering how far the company has gone to present themselves as an American product, Writing “Established in Missouri” and being sure to note that the founders name is ostensibly American (Gordon) while containing a quintessentially Chinese product and broken English manuals. The trimmer also has poor weight distribution. It’s front heavy while the base of the plastic handle feels empty. The guards don’t feel like they’ll last long in that they are brittle with slight flex, but will evidently snap in half if flexed too often. I will update this review once I’ve used the trimmer several times, but so far I would suggest skipping this item, it’s Chinese junk that’s clearly been sitting in a warehouse for years.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Redeemed",
    "rating": "5.0 out of 5 stars",
    "content": "Was great at first, but quit working after about 4 months with use every couple of weeks. Contacted support and they sent a replacement quickly!",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Muy buena calidad",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Excelente",
    "rating": "5.0 out of 5 stars",
    "content": "Work Great I would buy them again..",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Got this because my wife also wanted to get a trim down there and didn’t want to use the bigger men’s version in fear of getting nicked. Works great for me, I could see how a bigger version would be nice but I’ve got no problems with the size.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Great battery life.",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve only got nicked once on a little pimple I had. It stopped bleeding before I finished my shower afterwards. My wife had a pretty big cut down there, but it was only because she wasn’t looking when it happened.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, pretty impressed with how well it works for how cheap it was. It’s not the smoothest ride on your skin (not sure how that could be solved though) but it’s not a big deal. I definitely recommend using when your skin is dry. The sticking to the skin gets a lot worse when you’re wet.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Máquina cómoda",
    "rating": "5.0 out of 5 stars",
    "content": "Muy buena calidad vs buen precio es muy liviana, cómoda, ideal para todo tiipo de cabellos y bellos.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's pretty good and it works in the shower it's 100% waterproof.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Pretty good shaver.",
    "rating": "4.0 out of 5 stars",
    "content": "I love the olive green color, it also has a great battery life. However, I was not impressed with the sharpness on the blade. I felt as if I had to go over a couple times in the same area",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Is as good as any manscape equipment",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Blades are not as sharp as I expected",
    "rating": "4.0 out of 5 stars",
    "content": "La calidad creo que está bien por precio",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I've been a practicing barber for decades.  I became one in my late teens and now I'm retired.  I know about edgers well.  The industry likes to over-charge women because they know we're used to buying beauty products and they mark intimate edgers up by 20% or more.  I know this, so I decided to try this product even though it's for men.  I was not expecting much but I'm tired of buying edgers that bite.  Even with my discount, a Wahl product is going to be $60 or more.  I'm on a budget now and have to make choices differently than I did when I was standing behind the chair.  I figured at this price, I use once and throw it out, I still got a deal.  First of all, the ergonomics of this product are awesome.  Second, I'm used to a very close shave being a barber.  I will say this will not give you that but who cares?  My expectations are not like yours are.  This still provides a close shave.  It is quiet and the power is much lower than I'm used to but it works!  My only suggestions are...be careful not to drop this.  It's got a ceramic blade and I'm not sure it would survive it.  Pull the skin with your other hand (a flat palm). when shaving for a close shave.  We're taught that in barber school.  You will have to go over a section at least three times for a close shave.  Mine did not include a brush to clean but in my industry we use several brushes... but my favorite will always be a tint brush.  It is a brush we use to apply color to the scalp.  You can put \"tint brush for color application\" in the search bar of Amazon and you can find one for a few dollars.  We're taught to clean our edgers and clippers after every client.  I would suggest you clean it with a brush after every use and store the edgers in a place where it will not be prone to dropping it, like a drawer.  My score for this product as a professional, is a \"9.\"  You won't be disappointed.",
    "post_time": "Reviewed in the United States on September 21, 2023",
    "pid": "B09HZTKLNP"
},
{
    "title": "Competitive",
    "rating": "5.0 out of 5 stars",
    "content": "It really works as advertised.  No nicks when trimming sensitive areas.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fue para un regalo.  A la persona se lo regalé, me dice es bien practico y de buena calidad.  De buen tamaño para llevar en equipaje si te vas de viaje. No ocupa mucho lugar",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Es buena",
    "rating": "5.0 out of 5 stars",
    "content": "It’s a pretty decent product, doesn’t leave a smooth shave but it works as advertised 👍🏾",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this about 6 months ago so I feel comfortable giving this an honest review. You need to take your time and have patience but this one does work. Used the 1.5 guard and haven't made the boys bleed yet. Highly recommend",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Works good",
    "rating": "4.0 out of 5 stars",
    "content": "I even used it on my downstairs and it didn't pull at all. Happy with the purchase hope the product lasts.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The only reason I didn’t give a 5 star review was because it didn’t come with a brush to clean it with. Nor the oil. However on the plus side it charges fast. Trims great. Light weight and easy to use. Not to mention portable.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Love it BUT.",
    "rating": "4.0 out of 5 stars",
    "content": "I like it 👍🏼",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nice",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Trim trimming",
    "rating": "4.0 out of 5 stars",
    "content": "Thought it died but just had to hold the button down. Does what its supposed to.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A great product especially to deal with those areas",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Nice",
    "rating": "5.0 out of 5 stars",
    "content": "Purchased trimmer for my teenage grandson.  He likes it.  His mother said, he’s wanted one.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As advertised",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Decent",
    "rating": "4.0 out of 5 stars",
    "content": "It gets the job done, but doesn't cut all in the first pass, and it takes even more with the cutting guides. Battery running time is also good",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This item is a very affordable version of those expensive ones that do not pull your body hair. very impressed.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Manscaping made easy!",
    "rating": "5.0 out of 5 stars",
    "content": "The value of this product is great! In the quality is above all others!! Super quality for the price.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve only used it once. And have really enjoyed the quality of this product. I will say to any man who wishes to stay groomed. That this is the product for him.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Close shave",
    "rating": "5.0 out of 5 stars",
    "content": "Great product and it’s waterproof which is great",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Small , compact, holds a charge. Adjustable trimmer accessories are right sized. Overall I liked product and it performed as advertised.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Use it daily.",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to clean, stays cooler than stainless steel, the size is perfect and the attachments are rather nice. I considered a higher dollar razor but I believe this trimmer has better value considering new blades can be purchased for it. The portability is really nice and we will see in the future for durability!",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Gave this to my son for Christmas, so far so good, I haven’t heard him complain about it yet!",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Worked as advertised",
    "rating": "5.0 out of 5 stars",
    "content": "I use it ever week and the charge is so long I took it on a month vacation and it was perfect for everything. I used it every 5 days and I didn’t charge it once",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Small and lightweight, great battery life, love the color. Works amazing",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "No more worrying!",
    "rating": "4.0 out of 5 stars",
    "content": "It's intended use.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First I'll say that I do like this trimmer overall. It is quiet. It hums, but its quieter than an exhaust fan. It is very sharp and cuts even my coarse chest hair with ease. I'm a very hairy person, and I don't want to be anymore. I use it with the length combs to trim my chest, my hands, arms, neck, and my legs. I use it to completely shave \"down below\". So I've learned a few things after using this trimmer a few times. First, it cuts very close but leaves stubble. So it works great for taking off a lot of hair or keeping hair trimmed with the included length combs. (I had pics of my chest, but my phone crashed and I lost them). The combs do get clogged with hair when trimming long hair for the first time. Main things I have learned; keep the head flat against the skin, go against the grain for closest cut, take your time trimming intimate areas. And the number one thing, when you are trimming your scrotum(sack, nads, whatever), go ACROSS the ridges and wrinkles. DO NOT run the trimmer with the ridge. It will draw the skin in-between the teeth and cut the hell out your sack. Even if you are using a guard. I cut myself the first time, so next time I used the short guide. Still cut me, just not as bad. Pull the skin tight when possible. Use your thumb to pull the skin and your fingers to push up on your nads to stretch the skin. Whatever you can do to keep the skin tight helps a lot. When you can not do this, trim slow and careful and ACROSS the ridges and wrinkles. I can't stress that enough.",
    "post_time": "Reviewed in the United States on February 25, 2023",
    "pid": "B09HZTKLNP"
},
{
    "title": "Very good for the price",
    "rating": "5.0 out of 5 stars",
    "content": "🌲🌲 🚜🪵🪵🪵",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Does the work.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Works great",
    "rating": "4.0 out of 5 stars",
    "content": "Works well without problems. Light and ergonomic design helps precision trimming everywhere.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This worked out well. Doesn't nick the skin and is close to shaving with no guards. It seems very quiet compared to my old trimmer.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Works great for the price.",
    "rating": "5.0 out of 5 stars",
    "content": "  There is a reason this is priced below other brands' trimmers. You must go slow for it to get all of the hair. I find myself going through the same spot multiple times. It feels like the motor is weak when holding it.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall for the price, it's easy to dismiss the imperfections.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Like it",
    "rating": "5.0 out of 5 stars",
    "content": "Everything is fine, love it",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love this shaver. It’s the best shaver I’ve ever owned",
    "post_time": "Reviewed in the United States on June 5, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Best shaver",
    "rating": "5.0 out of 5 stars",
    "content": "Use it for arm hair and privates works well literally almost impossible to cut yourself even if you tried definitely worth it and fairly priced",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Llego todo igual que en la descripción y se ve de buen material",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Review",
    "rating": "5.0 out of 5 stars",
    "content": "Very useful, convenient, easy to use.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works well in those precious zones as described",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Works like a charm",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great trimmer. Easy to use and works great. Highly reccomend",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the best shaver I ever had. I had Phillips, Andis, and other brands before, this one is by far the easiest to use, to clean, and smoothest cut. Blades are easy to clean and change, 10/10!",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Great",
    "rating": "5.0 out of 5 stars",
    "content": "This product is light weight, very quiet, and does an excellent job. My balls have never looked so good. Not one nick. I recommend it to a friend, he loves it as well.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wow. Was so excited to try this out! It works so well at cutting hair (mine is on the thicker side) and cut like butter works well in the water. And it works fantastic for the down below area.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Impressed at how good and smooth",
    "rating": "5.0 out of 5 stars",
    "content": "Nice and close shave",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Outstanding",
    "rating": "5.0 out of 5 stars",
    "content": "just as described.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a good product. It is safe and easy on the skin.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "It works good..",
    "rating": "4.0 out of 5 stars",
    "content": "When you have 1 light battery of 3 the machine loose power, it works good and slow but everything good! Thanks",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Works well, waterproof as described. Charge last a while. I only wish it would cut closer.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Good but could cut closer...",
    "rating": "4.0 out of 5 stars",
    "content": "Ordered white received pink. Works as described though.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great trimmer long battery life no nicks.  Love it. Just wish it had a wider head",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Wrong color received",
    "rating": "5.0 out of 5 stars",
    "content": "I've been using the trimmer side of an electric raZor for years and just accepted the fact that nicking the boys was the price of admission. Boy was I wrong, this razor makes it pretty much dummy proof for clearing the brush. I can knock out the job in minutes rather than a half hour of awkward poses and slicing the boys up like some amateur kill bill movie. It's also MUCH cheaper than the name brand clippers, hopefully it holds up over time but I love it so far.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In life, I always find myself comparing the Ozark Trail tumbler with the Yeti tumbler. In one hand, you have the Ozark Trail tumbler; in the other, a Yeti tumbler. The Ozark Trail costs $12 at Walmart, while the Yeti is priced at $55. Why the huge price difference when they both keep ice for the same amount of time? That's essentially paying for the brand name.",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Manspot body trimmer",
    "rating": "3.0 out of 5 stars",
    "content": "If you're looking at this product, then you most likely are familiar with the big-name brand version, which costs $90. That's a steep price, especially for something that has garnered a lot of 1-star reviews recently. Upon reviewing this product, the price makes sense, the quality appears good, and the reviews are highly favorable.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After receiving this trimmer, I tested it immediately after letting it charge. I was curious because I had seen many reviews stating it could nick the skin. Indeed, after a couple of uses, I found that if you don't take your time and be patient, it most definitely will. However, I took it slow and noticed no nicks at all. In fact, I found it hard to get one. I did end up with a nick, but only because I was rushing just to see what would happen.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "AmaZing",
    "rating": "5.0 out of 5 stars",
    "content": "This is the first trimmer I've used for 'downstairs' grooming, and I have to say it's a great choice. The fact that it's waterproof is amazing. It's quiet and has a nice design. If you're on the fence about this and the name-brand one, get this one! You won't regret it.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B09HZTKLNP"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Runs great but I am unable to avoid Knicks on anything that isn't flat... Get the drift? I am done trying.. after months, it's still pulling and out cutting skin as well.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B09HZTKLNP"
}
]