[
{
    "name": "  The House Across the Lake: A Novel ",
    "stars": [
        "36%",
        "34%",
        "21%",
        "7%",
        "2%"
    ],
    "pid": "B09J216N77",
    "ratings": "23,623 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$17.72",
    "about_this_item": []
},
{
    "title": "This book was amazing",
    "rating": "5.0 out of 5 stars",
    "content": "Just when you think you have to figure it out , the author throws a loop And really plays with your mind!  I loved the characters,, they were so exciting to read and try to figure out their story.  The story line was wonderful!!  There were so many twists and turns that I didn't see coming. This book will keep you on your toes!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Riley Sager’s “The House Across the Lake” is a murder mystery combined with a thriller. Because the promotional materials (the “blurb”) and some of the reviews so adequately describe the premise, I'm not going to summarize the plot, especially since I don’t want to risk giving away any of the twists, turns, or surprises. And there are more than a few!",
    "post_time": "Reviewed in the United States on June 21, 2022",
    "pid": "B09J216N77"
},
{
    "title": "A devilishly \"bonkers\" plot!",
    "rating": "3.0 out of 5 stars",
    "content": "As Mr. Sager states in his “Acknowledgments” at the end of the novel, this book has a “bonkers plot.” Which means it has plusses and minuses.  On minus side, the beginning of the novel seemed, in places, not believable.  Characters said and did things that had me scratching my head. The main character suffers from alcoholism that seems to have been brought on by parental neglect, if not abuse, not to mention the death of her husband, also the victim of parental abuse.  All that, combined with a glaring similarity to Alfred Hitchcock’s “Rear Window,” almost had me closing the book to move on to something else.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "But on the plus side, I found the book well-written, scenes well-constructed, the Vermont lake setting well-described and utilized, and the characters well-drawn and interesting. They include a successful “working actress” (as opposed to a glitzy movie star), her musical-comedy mega-star mother, a retired super-model, her tech-titan husband, and a hunky ex-police officer with something of a checkered past. And so, I kept going.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B09J216N77"
},
{
    "title": "What the fudge happened",
    "rating": "4.0 out of 5 stars",
    "content": "Only to find that the plot is devilishly “bonkers” and that Mr. Sager seems to delight in leading his readers down false trails as foggy and mysterious as the paths around his fictional Lake Greene.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Now, that’s not to say that readers won’t have to “willingly suspend their disbelief” sometimes, and in some pretty big ways.  The “reveal” of what’s actually going on is fairly stunning and certainly creative and original. Indeed, I don’t believe I’ve ever read or heard of anything quite like it.  Those who are able to “just go with it,” should find themselves enjoying what I ultimately thought was a very entertaining novel.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Good",
    "rating": "2.0 out of 5 stars",
    "content": "SPOILER ALERT",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "——————————————————————————————————————————————————",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Twists",
    "rating": "4.0 out of 5 stars",
    "content": "I was really looking forward to reading this book. It seemed promising. And at first it was good. The main character (forgot her name that’s how unimpressed I was) is an actress who went off the deep end and became an alcoholic after the husband dies. She becomes obsessed at watching her neighbors across the lake through binoculars (hence the name of the book). Then the wife from that house disappears and she’s trying to figure out what’s happens and she believes she’s been killed. The book switches from past to present while you’re trying to figure out who the main character is with (presumed killer). I definitely did not expect who was with her. But tbh the plot is just really confusing cause she knows who the real killer is and then there paranormal crap and this book had me in the first half but then I was just trying to get it over with. All in all, it was just ok.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Book was really good but it was hard to get through the first part of his all she was talking about was her alcoholism didn't get to any real major things until like 3/4 through the book and then all the big information comes out in the end but all in all this was a good psychological thriller with a little bit of a supernatural feel to it",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Great Read",
    "rating": "4.0 out of 5 stars",
    "content": "The twist s and turns in this book were amazing. When you thought it was over there was more.  Great read I enjoyed this book.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I truly thought I knew where this book was going and boy was I wrong. You think the first twist is the big twist but then the second twist comes and makes you rethink the whole novel!",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Twisty",
    "rating": "4.0 out of 5 stars",
    "content": "Really enjoyed reading this book. Some wild twists and turns along the way! Enjoyed some Easter eggs the author placed from his other books.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Haven’t finished, but a great book so far",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B09J216N77"
},
{
    "title": "I enjoyed this book",
    "rating": "5.0 out of 5 stars",
    "content": "Like every Sager book I’ve read this one is also a combo of things I’ve already read/watched but still great. This is Hitchcock’s Rear Window with some of the movie What Lies Beneath mixed in. That said I still enjoyed it a lot and recommend!",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I quite enjoyed this paranormal thriller. It’s like a Whodunnit with a side of crazy on a stick. Good, unexpected twists.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Good Read",
    "rating": "4.0 out of 5 stars",
    "content": "This book had enough twist and turns to make any roller coaster look tame, plus enough “ghost story” to make me be uncertain if I ever want to swim in a lake again! Casey, a fired actress and recent widow tries to drown her sorrows in bourbon while hanging out in her family’s summer lake home and pique her boredom by spying on the power couple across the lake with her dead husband’s binoculars. The story involves a serial killer, poisoning, betrayal, murder, ghosts and suicide; all blended into a who-dun-it that keeps you guessing and ultimately, family, friendship and loyalty- the “good guys” should always win!",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book quickly pulled me in and kept me hooked and entertained the entire time. A couple plot twists that were well timed and placed kept the story interesting.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Great story!",
    "rating": "4.0 out of 5 stars",
    "content": "Mystery tied in with paranormal I enjoyed the writing and plot.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really didn’t read the summary for this book, I saw a friend that had read it and decided to start it. I thought it had a great story line, I didn’t get uninterested and kept wanting to read. There were many twists and turns I never saw coming - and while I don’t know how I feel about them yet, I do love the fact that it took me by surprise. It’s a good, quick read. I would recommend!",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Great read!",
    "rating": "5.0 out of 5 stars",
    "content": "This book was a really pleasant read to lead into the fall. Riley is very good at misleading the reader right when they think they’ve caught on, and the twist + subtle hints hidden in the writing are top tier.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I was really into the first half of the book; the plot twist honestly made me laugh out loud. Everything sounded so absurd to me after the second half. I don’t necessarily hate the book but I’ve never LOL’d over a psycho thriller book before. I would still recommend this one. It’s not as bad. Like this one more than Home Before Dark.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Well…that was something",
    "rating": "5.0 out of 5 stars",
    "content": "This was just the read I needed to have. It’s so well written and beautifully executed. When you think you know… you don’t.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Without fail, I will always look forward to a new Riley Sager book. Over the years, this anticipation has fluxed between honest enjoyment to cringy disappointment. I loved his early books were clearly fun reboots of canon horror films. I loved that they had the same flashy appeal as summer blockbusters. They are quick to read, easy to enjoy, and merit more than a few audible gasps. My love of Riley Sager's work peaked at Lock Every Door and plummeted to a new low with his last book, Survive the Night. So, it was with cautious optimism that I requested an advance copy of The House Across the Lake.",
    "post_time": "Reviewed in the United States on July 19, 2022",
    "pid": "B09J216N77"
},
{
    "title": "great",
    "rating": "4.0 out of 5 stars",
    "content": "Told in a split narrative that divides the book chronologically, we follow the functionally drunk and recently widowed actress, Casey Fletcher, to her family's lake home in Vermont. There we sink comfortably into a Rear Window-style frame story as Casey spies on her neighbors from the relative seclusion of her porch. While we sit with Casey, a glass of bourbon in hand, we drift along with her stream of conscious ramblings on the past and musing on the present.",
    "post_time": "Reviewed in the United States on November 7, 2022",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This is a comfortable thriller read. By that I mean that I didn't find myself on the edge of my seat, but I was invested in the story and wanted to see where it would go. Per usual, Sager pulls no punches with his twists and layers in an element of the supernatural to spice up the mystery. Because of this, I understand why there is serious divide about this book.  While I love a good haunting, I felt like Sager didn't fully execute that portion of the story. I wanted to be more creeped out, more haunted. Instead, I was strapped with a narrator that was so focused on not being haunted that the paranormal elements fell flat. I like them, but I was not enthusiastic about them. I don't want to spoil anything, but I will say that I expected the narrator to at least ponder the haunting stories of the lake more as they would relate to the central story Sager was trying to tell. Especially since her family was one of the first to build on the lake and have consequently been there the longest. I just didn't buy it.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B09J216N77"
},
{
    "title": "I still love you Riley Sager. I will keep reading your books. But I know you can be better.",
    "rating": "3.0 out of 5 stars",
    "content": "I still love you Riley Sager. I will keep reading your books. But I know you can be better.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Many thanks to Edelweiss, the author, and publisher for providing me with an ARC in exchange for an honest review",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Quite the thriller",
    "rating": "5.0 out of 5 stars",
    "content": "I recently read The House Across the Lake by Riley Sager.  This is the story of Casey, who is a popular actress.  She has lost her husband and her grief has driven her to drink.  Her drinking caused her to lose her job, starring in a Broadway show. Casey tries to escape the gossip mill by taking an extended summer vacation at a beautiful lake in Vermont. At her waterfront home, she spends most of her time on the back porch, drinking bourbon and watching people through her binoculars. Specifically, she is watching the fancy house with loads of glass, owned by supermodel Katherine and her tech savvy husband, Tom.  Casey's spying losses it's attraction when Katherine goes missing and she suspects Tom.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book is quick moving and a true thriller.  This has that, hold your breath, something is about to happen any second feeling.  It is very successful at raising your pulse. It's really amazing the story that Sager weaves with a limited cast and setting.  I think you'll be surprised by the numerous twists.  The author is masterful at making you think you have the story figured out only to slap the back of your hand with a twist that says, \"guess again.\"",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Well, that was unexpected.",
    "rating": "3.0 out of 5 stars",
    "content": "I’ll start by saying that if unreliable, drunk narrators aren’t your thing, then stay away from this novel. Casey heavily drinks and/or is drunk for the majority of this book. She’s also alone in her lake house most of the time, which takes the unreliable factor to the next level. Also be warned that there are heavy elements related to grief and regret laced throughout the story.",
    "post_time": "Reviewed in the United States on December 20, 2022",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "For me, I found the majority of this book to be slow. I started reading it a couple months ago, but it didn’t grab me, so then I just read a couple pages here and there and I didn’t fully start it up again until last week. With that, you might find it more gripping if you read it from start to finish. I personally didn’t really connect with Casey, so I didn’t find myself engaged in the story until well past 200 pages.",
    "post_time": "Reviewed in the United States on January 9, 2023",
    "pid": "B09J216N77"
},
{
    "title": "More Horror than Mystery",
    "rating": "5.0 out of 5 stars",
    "content": "Some of the storyline felt repetitive, like I was on a merry go round of “drink, remember the past, vacillate on whether or not something bad happened to Katherine across the lake - repeat.”",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I thought I had the storyline figured out halfway through, but boy was I wrong. When part of the reveal happens, my mouth literally dropped. It was completely unexpected. But that’s also because I was expecting something logical, and was not anticipating the turn the story would take. Though I suppose I should have accounted for the possibility of this twist because it’s an idea this author has played with before in other novels I’ve read by him. I can’t say more without spoilers.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Fantastic!",
    "rating": "3.0 out of 5 stars",
    "content": "If you don’t mind lonely, drunk narrators and you’re prepared for a very slow burn that’s rewarded with an explosive about-face 3/4 of the way into the story, then you’ll probably enjoy this book.",
    "post_time": "Reviewed in the United States on December 19, 2022",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It’s hard to know how to rate this book. When I thought it was a simple who-done-it, I was planning on rating this three and a half stars. This was the first book I’ve read for pleasure in about ten years. As I made my way through the story, I was convinced that this would be a cute cozy-mystery that I would enjoy in the moment and then quickly forget. It did a great job of keeping me turning the pages. I consider myself a slow reader so I was shocked when I finished this book in three days. I had plenty of theories on how anybody could be guilty and I thought I was fully prepared for any twist.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Swimming takes on new meaning",
    "rating": "5.0 out of 5 stars",
    "content": "I was wrong.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "When you get to the last hundred pages, this story throws you on your head. It morphs from a familiar trope into something much more sinister and haunting. I’d categorize this as horror rather than mystery. This story has left me draped in an eery and icky feeling - like an unbearably itchy sweater.",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B09J216N77"
},
{
    "title": "RILEY SAGE IS AN AUTO-BUY",
    "rating": "5.0 out of 5 stars",
    "content": "In spite of my wishes, I doubt this story will fade from my memory any time soon.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I don’t like horror. It makes me uncomfortable so this isn’t anything I’d reread or even keep on my bookshelf. However, if you’re into twisted tales, I think you’d really enjoy this. It’s thoroughly disturbed me - which I now think was the goal of this book. So for that reason, I begrudgingly up it to 4 stars.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Twist ending",
    "rating": "4.0 out of 5 stars",
    "content": "I never could have imagined the ending. I thought I knew exactly where the story was headed, then it took a sharp 90 degree turn.",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Very good author",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Good mystery",
    "rating": "5.0 out of 5 stars",
    "content": "“Ah, the boat. That brings back memories.”",
    "post_time": "Reviewed in the United States on July 10, 2022",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Centuries ago, before people knew any better, it was a common belief that reflective surfaces could trap the souls of the dead.",
    "post_time": "Reviewed in the United States on June 23, 2022",
    "pid": "B09J216N77"
},
{
    "title": "Crazy Twists ...!",
    "rating": "5.0 out of 5 stars",
    "content": "People used to cover all the mirrors when someone died because any reflective surface was capable of capturing a soul.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Our souls don’t need to vanish into the ether. They’re like air, and liquid and shadow combined.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Classic Chiller!",
    "rating": "4.0 out of 5 stars",
    "content": "Slippery. Weightless. Shapeless.",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "In the still waters of Vermont’s Lake Greene, “Please don’t be dead. Please, please be alive,” Casey Fletcher intones as she makes her way to Katherine’s “blue lips, her ice-cold skin, her utter unnerving stillness.”",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Great quality",
    "rating": "4.0 out of 5 stars",
    "content": "Casey’s husband, Len, died on this very lake 14 months ago. What a pleasure it was to have a husband who knew her so well.",
    "post_time": "Reviewed in the United States on July 3, 2022",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "She won’t let that happen to Katherine.",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "B09J216N77"
},
{
    "title": "haunted lake",
    "rating": "4.0 out of 5 stars",
    "content": "As a whole, it was a page turner. The haunted lake thing was sort of far fetched and reminded me of the movie Ghost.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Riley Sager seems to be an acquired taste. Myself, I’ve loved everything he’s written. I know others don’t agree, but that’s their prerogative. He never writes the same story twice. Everything I’ve read is fascinating and scary. This one is no different.",
    "post_time": "Reviewed in the United States on June 25, 2022",
    "pid": "B09J216N77"
},
{
    "title": "Clever and Terrifying",
    "rating": "4.0 out of 5 stars",
    "content": "Casey Fletcher is the daughter of an acting legend. She has a career of her own, but at the moment, she’s too busy being an alcoholic to continue in that profession. Ordered to the family lake house by family after being fired from her Broadway play for showing up drunk and going on that way, she now wanders through said house in the middle of nowhere in Vermont, soaking herself in bourbon following the accidental drowning of her husband over a year before. One afternoon, she spots a body in the lake from her back porch and motors out to investigate. She saves the life of former supermodel Katherine Royce, who lives across the lake with her millionaire husband Tom. They become friendly, until Casey begins to suspect Tom is threatening harm to Katherine and may be slowly poisoning her. Casey watches day and night with high powered binoculars and thinks she sees a murder. But she has no proof.",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It’s a familiar-sounding scenario, most recently used in “The Woman In The Window”. An unreliable narrator, drinking heavily, who cannot be trusted. For about 2/3 of the way, that’s the way it progresses. But then, the story turns into something more sinister and the thriller you’ve been reading turns into something much different, something darker and more sinister. And you can’t stop turning the pages.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Cathartic",
    "rating": "5.0 out of 5 stars",
    "content": "It’s typical of Sager to turn the tables on you when you think you’ve got it figured out, but if you’ve been paying attention, it shouldn’t come as such a shock. And yet it does.",
    "post_time": "Reviewed in the United States on June 28, 2022",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Surprisingly apt and poignant descriptions of alcoholism. Fascinating and intriguing story that wrapped me up and kept me on the edge of my seat.",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B09J216N77"
},
{
    "title": "it was ok",
    "rating": "5.0 out of 5 stars",
    "content": "Book started out kind of slow to me but it is a good slow burn I wasn’t expecting the twist enjoyed but didn’t wow me.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Riley Sager never disappoints! The first chapter of this book is a little slow, but after that, things really pick up. The ending is a jaw-dropper with so many twists and turns I found my head reeling as I tried to keep up. I’ve read everything Sager has written, and always look forward to each new release. What makes him such a unique storyteller is that you never know what kind of book he’s going to deliver, each tale wonderfully unique.",
    "post_time": "Reviewed in the United States on July 22, 2022",
    "pid": "B09J216N77"
},
{
    "title": "Couldn't put it down!!",
    "rating": "5.0 out of 5 stars",
    "content": "Casey Fletcher, an actress suffering from recent bad press, is banished to her family’s house on exclusive and remote Lake Green after the death of her husband and her subsequent deterioration into alcoholism.  She’s a train wreck to say the least, but the perfect narrator for this unusual tale that is part crime mystery, part psychological suspense, and part supernatural thriller.",
    "post_time": "Reviewed in the United States on February 6, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The story has a bit of Rear Window vibe with Casey watching her neighbors across the lake through binoculars—a tech mogul and a supermodel who live in a lavish glass house. There’s also a former cop with a murky past who lives next door. The way in which the lives of these four characters intertwine kept me repeatedly second-guessing what I thought I knew about each. Oh, such a clever author! I love the way in which Sager introduces a plot thread only to have it corkscrew it in an entirely different direction later. Fair warning that the ending is “out there,” but for pure story satisfaction and reading enjoyment you can’t go wrong with The House Across the Lake!",
    "post_time": "Reviewed in the United States on November 9, 2023",
    "pid": "B09J216N77"
},
{
    "title": "it was ok",
    "rating": "3.0 out of 5 stars",
    "content": "This is not the typical sort of book I would read. Didn’t  realize it when I started it. It was ok but I prefer a faster pace.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "****SPOILERS***",
    "post_time": "Reviewed in the United States on March 9, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Great until it wasn’t",
    "rating": "5.0 out of 5 stars",
    "content": "I was really liking it until the whole spirits possessing a body. I just didn’t see the need for it. The story was great without it and didn’t need this added drama",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I liked how this book was able to keep my attention. It’s great for someone looking for an easy read. It definitely has multiple twists that made it so difficult for me to put the book down and get back to my daily chores.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B09J216N77"
},
{
    "title": "When you think you know, know that you don’t.",
    "rating": "5.0 out of 5 stars",
    "content": "First it took way too long to get to any good part. Then once it did the storyline took a (in my opinion) a stupid turn. It could have been so much better had the author not gone in this direction.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book kept me glued to it until the very last page and I wanted MORE. So many unexpected pot twists! I saw it described as a thriller version of The Great Gatsby and that’s exactly it. I wish I could read it again for the first time. 10/10",
    "post_time": "Reviewed in the United States on January 3, 2023",
    "pid": "B09J216N77"
},
{
    "title": "No thanks",
    "rating": "3.0 out of 5 stars",
    "content": "Casey a rather famous actress of both screen and stage, has had a setback, her drinking has caught up to her, and now she is exiled to her families lake front property. Katherine a retired Supermodel and her husband Tom a tech giant also own a home on the lake. As Casey drinks, daily, and a lot she finds an old pair of binoculars, and she starts watching the lake and her neighbors. While watching she notices something or someone on the lake. She takes her boat out to investigate, only to discover and save Katherine. What happens next is what most would think, Tom obviously is trying to kill his wife, but why. The House Across The Lake will leave you with many twists and unexpected turns. A very goid book to bring in the New Year, because this book ends on this very day.",
    "post_time": "Reviewed in the United States on June 8, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Paranormal is not really my thing so this twist was a bit cringe for me. Too bad because it could have been so good.",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Such an unexpected twist.",
    "rating": "4.0 out of 5 stars",
    "content": "Kind of slow to start out - I had a hard time getting into it at first. It picked up about 1/3 of the way through and then I was determined to finish it solely to find out what exactly was going on. The plot twist definitely “plot twisted” and for that reason, I give this book a 3.5 star rating. Didn’t love it, but also didn’t hate it.",
    "post_time": "Reviewed in the United States on October 31, 2022",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Read this book for a book club and couldn't put it down as it weaved back and forth between \"NOW\",",
    "post_time": "Reviewed in the United States on November 18, 2022",
    "pid": "B09J216N77"
},
{
    "title": "Good with a surprise to stupid",
    "rating": "5.0 out of 5 stars",
    "content": "This book started out good. A little more than half way there was a surprise. Not long after that it just got stupid with shades of the Exorcist. Even Casey, the main character, mentioned Linda Blair, who played the posessed girl in the Exorcist. By that time I had too much time invested in the book to quit so I had to finish the book. It ended with a decent conclusion. I might try another book by Riley Sager but if it gets crazy in the story line that could be the last book I read by him.",
    "post_time": "Reviewed in the United States on March 24, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I finished this book in 2 days because it was so good! Thriller/mystery book well worth the read",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Amazing Thriller!",
    "rating": "3.0 out of 5 stars",
    "content": "This book as you thinking one thing and then boom not at all what you were expecting! Definitely recommend if you can get into the far fetched idea.",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Initially, i just couldn't get into this book. Casey's fatal flaw was a little *too* fatally flawed. There were interesting twists and turns, a bit of the supernatural, some good mystery, but frustrating in how important, obvious facts vital to the story are mentioned, \"conveniently forgotten,\" ignored at crucial points, and circled back to 100 pages later. Not the Riley Sager writing I first fell in love with.",
    "post_time": "Reviewed in the United States on September 27, 2023",
    "pid": "B09J216N77"
},
{
    "title": "not what you think",
    "rating": "5.0 out of 5 stars",
    "content": "I don't really do the ghost supernatural thing not my type of reading. But this Thriller sneaked the ghost supernatural thing in the storyline when and where I never expected it and made believable and entertaining..& not too much  like some thrillers this started very slowly but when got to the twist It sped up quickly I said was wow after ever chapter until the end just not what I expected to read but in a great way I am definitely a new Riley Sager fan",
    "post_time": "Reviewed in the United States on March 26, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I had no idea the storyline before picking this book up. I saw it mentioned on Booktok and it looked interesting. The author does a great job weaving the storyline together in a way that keeps you guessing. I read this book in less than 24hrs.",
    "post_time": "Reviewed in the United States on November 23, 2023",
    "pid": "B09J216N77"
},
{
    "title": "Slow start, frustrating points, 3.5 rounded up to 4 stars",
    "rating": "5.0 out of 5 stars",
    "content": "This book made it oh so hard to be a functioning, responsible adult! I wanted to ignore everything and just read and read and read!! 😅 Highly recommend!",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Casey was so annoying that I didn't want to finish the story, despite the fact that I thought it was a good story with interesting supporting characters and a pretty good ending.  Casey was, as I've found in many books these days, an annoying main female character.  Let's see ... she's a spoiled brat, a liar, a drunk, a meddler and a lot of other things.  She made everything worse, not better, and I truly believe that her husband dying and her mother not treating her in the best way really was reason enough for her to behave the way she did.  Even though I didn't want to finish the book, I did so that I could give it a fair review.  So, let's see ... three stars ... for the supporting characters, the plot, the location and ending.  I deducted two stars for Casey's obnoxious personality.",
    "post_time": "Reviewed in the United States on August 2, 2023",
    "pid": "B09J216N77"
},
{
    "title": "Just WOW",
    "rating": "3.0 out of 5 stars",
    "content": "No spoilers here. But if you spend an entire book in a character’s head, and they’ve got a drinking problem because of guilt, they’d think of it! Therefore, there’s no way to keep that from the reader. It’s cheating to save the big twist. And it’s not fair!  But other than that huge issue, a good book.",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Came in crisp perfect condition. It's also a great book!",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Damaged",
    "rating": "4.0 out of 5 stars",
    "content": "Book arrived damaged.  Had a rip throughout several pages",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The book itself was great.  Lots of twists and turns.",
    "post_time": "Reviewed in the United States on July 19, 2022",
    "pid": "B09J216N77"
},
{
    "title": "Wild Ride",
    "rating": "4.0 out of 5 stars",
    "content": "I love Riley Sager books, and this one was no exception. It is about an actress named Casey who goes to her mother's lake house alone to come to grips with her husband's death and her alcoholism. She comes to know the neighbors across the lake, spending many evenings on her porch with a bottle of bourbon and a pair of binoculars. The first half of the book is a slow simmer. Then when the second half begins, it's like a wild roller coaster ride with twists and turns. I could not put the book down until the end. I gave this four stars because of the slow start, but it was an awesome read.",
    "post_time": "Reviewed in the United States on June 26, 2022",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Casey has returned to her family's lake house in Vermont at the will of her mother. Amidst her day drinking, Casey starts a new hobby- watching her neighbors. She meets her new neighbor Katherine and a budding friendship begins...until Katherine seemingly disappears. Casey is determined to find out what happened to Katherine.",
    "post_time": "Reviewed in the United States on September 28, 2022",
    "pid": "B09J216N77"
},
{
    "title": "Different but good",
    "rating": "5.0 out of 5 stars",
    "content": "About 2/3 of the way through, I was like \"I think I know this twist, but I can't know the twist because that's just too obvious for Sager\" and I did not know the twist. And honestly, I'd be surprised if ANYONE calls this twist because while there are some clues...it's just...well it's kind of out there...I wasn't sure how much I liked THE twist but it grew on me, and I really like how the book wrapped up. Different, but good!",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nothing breaks up a boring evening like a good mystery. Quiet, early fall darkness, a little rain, and a cup of tea...or stronger if you prefer.",
    "post_time": "Reviewed in the United States on May 31, 2024",
    "pid": "B09J216N77"
},
{
    "title": "The Exorcist meets Stephen King and Alfred Hitchcock.",
    "rating": "2.0 out of 5 stars",
    "content": "\"The House Across the Lake\" combines Alfred Hitchcock's \"Woman in the Window\" with the \"Exorcist \" and a Stephen King nightmare.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It has interesting characters, sneaky plot twists, a sort of Devil made me do it aspect, a love twist, and ends with a summer evening we would all expect at a lake house...a lot of wine and other spirits, the miscreant husband, and suspicions enough to fill the empty liquor bottles.",
    "post_time": "Reviewed in the United States on January 26, 2024",
    "pid": "B09J216N77"
},
{
    "title": "THE BEST",
    "rating": "5.0 out of 5 stars",
    "content": "In the end my desire to have a lake house and a pair of binoculars greatly increased, and neighbors who make watching them far more interesting than the nightly news.",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first book by Riley Sager and I am now HOOKED. I finished it in 2 days!😊 It is everything you want in a thriller book. 3 plot twists that you don’t even see coming! It will leave you speechless. I just order 3 more of his books! A great find. 100/10 recommend.❤️",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Good read",
    "rating": "4.0 out of 5 stars",
    "content": "This book had great realistic characters. The trouble I had was trying to believe the paranormal plotline. Otherwise, the book was well worth my time.",
    "post_time": "Reviewed in the United States on December 25, 2023",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I only give it  4 stars only because of the insanity of it all. I do not believe in someone taking over another person when they die so that part was CRAZY I have to admit, but all in all the story was good and interesting. I don’t know how to explain it .",
    "post_time": "Reviewed in the United States on September 8, 2023",
    "pid": "B09J216N77"
},
{
    "title": "VERY INTERESTING!",
    "rating": "2.0 out of 5 stars",
    "content": "I haven’t read this author before, and I didn’t realize that there was a supernatural aspect to this plot. It came way out of left field, and as soon as it was revealed it took me completely out of the story and quite honestly spoiled the book for me.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was genuinely one of the best thrillers I have ever read- and I am VERY particular with thrillers!! What an insane twist😭 5 ⭐️",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B09J216N77"
},
{
    "title": "I liked it until I didn’t",
    "rating": "5.0 out of 5 stars",
    "content": "This book was insane! At first I was not getting into it, but as I neared the half way point, it sucked me in. It sucked me in so much that it took me just under two hours to finish it. This was such an amazing book!!!! I loved the plot, I didn’t see the twists coming which is great!",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "decent book, i liked the main character. easy and quick read with a good plot twist! would recommend to a friend",
    "post_time": "Reviewed in the United States on April 2, 2024",
    "pid": "B09J216N77"
},
{
    "title": "WOW",
    "rating": "3.0 out of 5 stars",
    "content": "The first 2/3 of the book was slow and boring, the protagonist is dealing with the same stuff the same way and it gets repetitive. But then major plot twists after plot twist and a satisfying ending, so that makes it better.",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I loved this book!  Sometimes I just want an easy read, or a scary read or a different read.  This book was all three.  I read it in a couple of days.  It is a page turner.  At first glance it’s a typical thriller:  missing wife, husband a suspect, and an unreliable witness.  I thought it was going to a copy of The Woman in the Window.  But without giving anything away, it ventures unexpectedly into the supernatural which gives it an interesting twist.  The book surprised me with an unusual ending.  A very enjoyable read.",
    "post_time": "Reviewed in the United States on October 8, 2022",
    "pid": "B09J216N77"
},
{
    "title": "The Twist!!!",
    "rating": "4.0 out of 5 stars",
    "content": "A few details in the way the wow chose to write the story did not appeal to me.. for example the inner thoughts of lead character were revealed but then conflicted with what was actually happening. Without getting into too much detail, she knew the identity of the serial killer, as we find out later on the book, but yet her inner thoughts are suspecting and scared of one of her neighbors. I didn’t like these sorts of contradictions; otherwise, book was a good read",
    "post_time": "Reviewed in the United States on June 2, 2023",
    "pid": "B09J216N77"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I did not see that coming, like did NOT! I thought I had it figured out early on (though I did lean a little other ways as the story progressed) but boy was I wrong. I loved the twist. I thought it was all great, finally a book they really truly surprised me!",
    "post_time": "Reviewed in the United States on May 12, 2024",
    "pid": "B09J216N77"
}
]