[
{
    "name": "        VALITIC Kojic Acid Dark Spot Remover Soap Bars with Vitamin C, Retinol, Collagen, Turmeric - Original Japanese Complex Infused with Hyaluronic Acid, Vitamin E, Shea Butter, Castile Olive Oil (2 Pack)       ",
    "stars": [
        "60%",
        "15%",
        "12%",
        "5%",
        "8%"
    ],
    "pid": "B09MFMCTRK",
    "ratings": "37,765 ratings",
    "other_info": {
        "Brand": "VALITIC",
        "Scent": "Citrus",
        "Age Range (Description)": "13+",
        "Skin Type": "All",
        "Item Package Quantity": "2"
    },
    "discount_price": "$ 11.99",
    "normal_price": "$1.71",
    "about_this_item": [
        " Dark Spot Corrector: Original Japanese Complex for Dark Spots Correction, our soap promotes a balanced, more even tone & a healthy glow; You can use this for your face, hands, neck, bikini area, inner thighs & underarms  ",
        " Vitamin C, Retinol, and Collagen: As a combination, these can help your skin stay hydrated from the inside out with minimal sun damage, dark spots, and blemishes to get that smooth and glowing skin  ",
        " Turmeric for Skin: Skin-benefiting qualities. Our soap is formulated with skin-cleansing turmeric which helps in restoring the moisture balance and reviving your skin from sunburns, fine lines, and wrinkles; Turmeric is also known to reduce scarring; This combination of uses may help your face clear up from acne breakouts  ",
        " Rejuvenating, Exfoliating, and Nourishing Dark Spot Areas: Our soap contains Hyaluronic Acid, Vitamin E, Shea Butter, and Castile Olive Oil that penetrates, revitalizes your skin  ",
        " SLS and Paraben-Free: Perfect for daily use! This turmeric soap can be used to clean most of the skin; First, wet your skin with warm water, apply the turmeric soap evenly on the skin; Then, massage for 20-30 seconds, and finally rinse with water  "
    ]
},
{
    "title": "Good Soap! Just Small.",
    "rating": "4.0 out of 5 stars",
    "content": "The soap works great! I was having some skin issues a few scars that I needed faded and I had some sun damage. The soap brightens my skin up give me a more youthful appearance. It smells good like a light orange scent (not too overpowering) The ONLY thing is the bars are so small so if you plan on using it on both your face and body stock up.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Maybe my skin is just well taken care of to not notice a change. It smells nice and two bars for the price is almost a steal. My only gripe is how quickly the soap bars get used.  Other bars of soap lasts very long compared to these so having to replenish stock can add up over time. And for not really being able to tell if it's working for the reason I bought it Idk how to feel about this product. Tho I'll still buy it. It's in my sub and save ;) Maybe I'll come been to update this review if I happen to notice anything.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "I can't tell if it works?",
    "rating": "5.0 out of 5 stars",
    "content": "I have used this for over 5 weeks and see some difference in skin complexion but nothing related to dark spots. It might leave the skin a bit dry but you should also be careful if you spray deodorant  or use the stick. Left over chemicals can react with acid in soap and cause irritation. I had hives break out in my arm pits for like 5 mins after shower and they disappeared. I had deodorant stick residue in arms pits before taking the shower.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this soap! It does exactly what it is supposed to do. I have an issue with hyperpigmentation on my cheeks and it has simply cleared it up and quickly. I’m so pleased with how good this soap is and how fast it works when used properly. I use it twice a day and I haven’t had any issues at all with my skin. I was given a bar by a friend to try due to me having sensitive skin and after using it I knew I had to order for myself. It’s a great size and also comes with 2 in a pack. The price is also a steal for 2 bars. I definitely recommend!!",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Good and does the job but...",
    "rating": "5.0 out of 5 stars",
    "content": "I wish I had taken before photos but this is doing exactly as I was hoping it would! I have bigger thighs and they are dark on the inside from rubbing against each other. I have only been using this for one week and notice a huge difference!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have been using a gentle lotion after I shower as well to help prevent irritation from the acid and my skin has never looked better. Will definitely be purchasing again!",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Dark spot remover soap",
    "rating": "4.0 out of 5 stars",
    "content": "It has a citronella like smell and it does help your body feel cleaner compared to regular soap. Not a huge fan of citronella so each their own but i can look past it due to quality. Not suitable to use it as often though as it can cause dehydration of the skin. I have also used it for my face which i have never had the courage to do with soaps since i tend to break out but with this i have noticed i haven't. I use this along with my tea tree face cleanser and it works wonders for my face! Realistically speaking i would say that after about a month in a half or 2 that you can see the tone of your skin lighten though. Would be willing to buy down the line again but the 2 i have is lasting me a good while thankfully! Already about 2-3 months in with using it once-2x a week.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I don't know if it removes brown spots but it is a lovely soap - smells nice and leaves my face clean and fresh-feeling.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Works!",
    "rating": "4.0 out of 5 stars",
    "content": "I haven’t used it long enough to have an opinion. I do know it has an unpleasant smell.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This soap works in removing suntan in 2 days.  I had very dark hands because I worked outside in the sun but wore long sleeves.  I tan very easily so my hands were at least 3 shades darker than my arm.  In 2 times of use, my hands lightened up considerably.  The only downside for me is that is so very drying.  When you use this product make sure you moisturize afterward.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "It actually works",
    "rating": "5.0 out of 5 stars",
    "content": "Good product, but like anything else one must be persistent. I only wash my face at night before going to bed so I have included KOJIC in my routine. Now I can actually see dark spots fading after 33 days +-  ROME was not built in a day, so I will keep using this soap to get even BETTER results.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "it seems like a nice enough soap, but it will take time before I can say that it removes dark spots as advertised.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "nice",
    "rating": "5.0 out of 5 stars",
    "content": "Clear refreshing skin is what I get from using this cleansing soap. This feels like butter and luxury when using this. It does not dry out my face and I feel squeaky clean.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "There is a difference between feeling clean and squeaky clean. I bought a pack, tried it and immediately bought another pack of this product so I wouldn't have to wait for my next reup.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "BUY NOW",
    "rating": "4.0 out of 5 stars",
    "content": "I recommend you purchase this product now to see for yourself.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I really like the citrus smell of the soap and I have been using it for about 3 days in a row on some very easy to see stretch marks on my lower stomach and already I’ve noticed them lightening up. I’ve only used it once a day so far on them but I am very pleasantly surprised at how well it’s already working. I plan to keep using it there until they fully fade so I will update this with how long it takes. It does dry your skin out kind of how Dove soap does but I don’t mind that much. Haven’t had any flaking like others have said though. So far I do recommend this soap :)",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Still testing, so far so good",
    "rating": "4.0 out of 5 stars",
    "content": "I love this product I’ve been using this soap 3 times a day for a little over a week and I already see results. It leaves my face feeling clean and smooth.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this soap to help even out my skin from dark spots and scarring. I haven’t been using it long enough to see a difference but from just a cleanser aspect this soap is great!",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "It smells really good and feels good on my face. I cut the bar and keep just a small piece in the shower. After I lather up I let it sit on my skin for a few minutes. I haven’t experienced any burning sensations with this soap.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "So far I’m happy. I’ll be happier when I see those dark spots fading and then I’ll change my rating to 5 stars.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Feels great",
    "rating": "4.0 out of 5 stars",
    "content": "I love the way the soap feels even after rinsing off. Feels so clean and fresh. Usually won’t use anything other than specific all natural cleaning products for my lady bits (not plugging the brand but it’s not on Amazon) but this has been good on my goods too and no h balance issues. First bar just about gone. All is good, however I see no skin tone changes- yet. I believe in the power of the might - yet. I’ll check back in about a month or so. Stay fresh!",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great product! Lathers well… notable reduction in dark spots after 10 days!",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Turmeric soap",
    "rating": "5.0 out of 5 stars",
    "content": "I like this soap!  It smells good, has a nice firm texture and gets my face very clean.  After 10 days, yesterday I happened to look closely at my skin, which has its share of age spots and they appear to be fading.  I highly recommend it.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "At the moment 4 stars since it does feel good, however to soon to see about the faded blemishes.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Age Spot Issues",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this soap after reviews boasted its effectiveness in lightening dark spots. I’ve been using this soap as a face and full-body cleanser for about two weeks now. I initially used it twice a day on my face and once a day when I showered. I will say it definitely leaves my skin feeling clean. It is a bit drying so it’s important to follow up with a thick moisturizer afterwards. Because it’s so drying, I’ve had to cut back on facial use from twice a day to once a day to maybe once every couple of days. I see the most progress on my face but notice the results are less noticeable with decreased use. I don’t see much improvement in the hyperpigmentation on my knees and elbows, but I’m overall happy with the soap. Plus it smells really nice.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Exfoliates your facial skin without dry the skin. But still put on a moisture..",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Still testing",
    "rating": "4.0 out of 5 stars",
    "content": "I opted for the soap bar instead of the tossable face pads. The bar lasts a long time and produces good suds. leaves my skin very soft. at two weeks of almost daily use, there is some even skin tone (after a rough few days of lots of discoloration).",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have some pretty bug sun spots on my forehead that make me self conscious. I decided to give this a try in conjunction with another product. With consistent use the appearance of the dark sun spots has been lightened significantly. I used a sharp tool to break off small chunks to wash my face to try to stretch the use of this soap, which proved successful as well. The value for the money is worth it. Consistently using the product is key to seeing results. The smell is refreshing and not obnoxious. My skin feels healthy and moisturized after using it.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Decently working soap",
    "rating": "4.0 out of 5 stars",
    "content": "The fragrance is lovely, to me and My son really likes it.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It cleans the skin, but as far as all that other stuff it's supposed to do... no change after two bars used.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Smells really good",
    "rating": "4.0 out of 5 stars",
    "content": "Really good, will update",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This soap has gradually faded some of the less prominent dark patches on my face. Has a pleasant smell and has not caused any irritation. Will purchase again.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Does what it says it does over time.",
    "rating": "4.0 out of 5 stars",
    "content": "Had a spot that was rough and dark. Now smooth and skin to normal color. it did take 3 weeks but worth it. Also dark spots on face are fading as well… Only use once a day due to it dries my face. But over all glad I ordered this  soap.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "El diseño está excelente. El olor del jabón es como un árbol de limón mandarina y el diseño del porta jabón  es elegantemente tropical. Llevo solo tres días usándolo y desde el inicio se siente y se ve el cambio. Lo que sí recomiendo es usar una crema hidratante porque el jabón hace que tu piel quede muy reseca pero cumple su función de blanquear",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Helps my skin",
    "rating": "4.0 out of 5 stars",
    "content": "I have tried other soaps. This one actually works it also is not that strong and doesn’t dry my skin out after a baby. I got a lot of brown spots on my face. I’ve been using it for a week and I actually see results. I also used it on a couple of Mosquito bites scars that has lightened them up as well",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "when i tell you you should totally get this soap i’ve tried other brands and they did not do much, this has even my skin tone and removed every dark spot i am so pleased with this",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Tengo fe de que sí funciona",
    "rating": "4.0 out of 5 stars",
    "content": "I recently tried the VALITIC Kojic Acid Dark Spot Remover Soap Bars with Vitamin C, and I must say, I'm impressed with the results. As someone who struggles with hyperpigmentation and uneven skin tone, I'm always on the lookout for products that can effectively address these issues without being too harsh on my skin.",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Firstly, I appreciate that this soap contains key ingredients like Kojic Acid and Vitamin C, both known for their skin-brightening and dark spot correcting properties. Kojic Acid is especially effective at reducing the appearance of dark spots and hyperpigmentation, while Vitamin C helps to brighten the complexion and even out skin tone.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Help my brown spots",
    "rating": "5.0 out of 5 stars",
    "content": "Upon using the soap for a few weeks, I noticed a visible difference in the dark spots on my face and body. The soap lathers well and has a pleasant scent, making it a joy to use during my skincare routine. I primarily used it on my face and areas prone to hyperpigmentation, such as my elbows and knees.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "One thing to note is that Kojic Acid can sometimes be drying, so I made sure to follow up with a hydrating moisturizer after using the soap. This helped to maintain my skin's moisture balance and prevent any dryness.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "It works",
    "rating": "4.0 out of 5 stars",
    "content": "This product will most certainly fade your dark spots. In using just one bar is a dramatic improvement",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love using it. I cannot say much yet for my melasma but leaves face clean and smooth. Using twice a day and then putting moisturizer with some sunscreen.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Very good",
    "rating": "4.0 out of 5 stars",
    "content": "My dark area is always my armpits, so whenever I apply this in the morning it usually takes affect that day making the dark areas noticeably lighter. However, it doesn’t seem to keep the dark areas from coming back which was my hope. Feels good on the skin (hasn’t left any skin issues), not a strong smell, and normal bar soap size",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I've been using it for 2 months and is doing the work",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Works Well Short Term",
    "rating": "5.0 out of 5 stars",
    "content": "I love this soap. My mother, sister, cousin and bff all now use it after letting them try it. I’ve used Dove exfoliating FOREVER and will now only use this. Your skin feels amazing. No residue. Easy, quick rinse. Takes off eye makeup easily. Smooth and more even tone. Lighter sun spots and freckles. Just amazing beautiful skin!",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great product always 👌🏻",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Is working",
    "rating": "5.0 out of 5 stars",
    "content": "Antes nos creía que todo lo que vendían servia , pero este jabón es muy bueno para esas manchas .",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Cuando lo use por primera vez fue porque me lo regalaron , y me funcionó",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Buy it!! It’s awesome!",
    "rating": "4.0 out of 5 stars",
    "content": "Ahora se que es muy bueno. 😁",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the type of product that I believe one needs to use for at least a week before you can write a honest review of its efficacy. With that being said, I can confirm that it is working for me. I have noticed that dark spots in my face and body have lightened and hopefully with continued use; they will fade away. The soap lathers well and has a light lemon scent. It can be drying so be sure to moisturize regularly and please don’t forget to put on your sunscreen. Overall, I am satisfied with my purchase.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "First Time",
    "rating": "5.0 out of 5 stars",
    "content": "Well I just got my soap and Im a beginner, so will update as I see a change. My order came as expected on time and I and happy for that. I am learning how to use soap and hope I will have the same success as all have spoken of. Love the feel of it as you massage onto the face. Will give a more update and photos later.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product I’ve been using this soap 3 times a day for a little over a week and I already see results. It leaves my face feeling clean and  smooth. I will start using the soap on my elbows and knees when showering to see results. The bars are about the size of a normal bar of soap and last just as long great lather and smells refreshing. Great price for three bars and size. I will be recommending and buying more.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "Now it’s so expensive man my pocket is empty. I don’t have that money anymore. But I think it worked. My skin felt more clean and it looked shiny. So I guess I was happy for the moment",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My face feels clean and revived👍",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "I like how cheaper used to be",
    "rating": "4.0 out of 5 stars",
    "content": "I've only used this facial soap for a week and enjoy using it.  It's well made. It's bar soap so easy to use. The smell is refreshing and fits in the palm of your hand.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wasn’t sure if this soap would help my dark spots in the body. But as I read the descriptions, I wanted to give it a try!  After finished one small sized orangey color soap, some of dark spots in the body looked less darkened than before I started using this soap.  And surprisingly, i have noticed the much differences between underarms. I am expecting to see more in this for a second soap I am going to use soon. The ingredients feels natural to me with the right amount of spices (vitamin C ).",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "To me turmeric",
    "rating": "5.0 out of 5 stars",
    "content": "Been using this for about a week now, I love the smell and the way it makes me feel after I wash my face, however it's too soon to see if this product really works!",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have only been using this for 4 days and I already see my lifelong under eye dark circles disappearing. My skin feels softer and more clear, and it smells wonderful. I can't wait to see what happens in a few months!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "This makes fading the dark underarms without irritations and very natural gentle soap!",
    "rating": "4.0 out of 5 stars",
    "content": "This dark spot remover soap is a great addition to my shower.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It's packed with kojic acid, Vitamin C, retinol, collagen, and turmeric for that extra boost.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "It works good.",
    "rating": "4.0 out of 5 stars",
    "content": "It has lightened my underarms by a lot.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I like the looks of my arms after using this soap for 3 weeks.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "works for me",
    "rating": "4.0 out of 5 stars",
    "content": "Its too early to really know if its going to remove my dark spots or not but I think they are getting lighter.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this, hoping to lighten up the dark spots on my face. I haven’t had it very Long to notice a massive significance but they don’t seem as dark. I do like how my skin feels super clean after I have washed my face.  I bought a multi pack because sometimes I stay at my mom‘s house and so I have one over there and then I keep one in my travel bag for when I’m out of town.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Very Refreshing",
    "rating": "5.0 out of 5 stars",
    "content": "Effects on skin is true, I started using this product a week or 2 now and I’m telling that I’m seeing results I’m going to put up pictures later with the before and after but I would recommend everyone to get one of this soap tell your mother tell friend guys but the soap works. I’m not getting any thing to leave this review I’m just being honest.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Necesito mas tiempo para determinar si funciona o no",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Works okay",
    "rating": "5.0 out of 5 stars",
    "content": "I just started using the Valitic soap bar.  I will know more as time passes.  I do know that It lathers beautifully and and my skin feels soft!",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I used it long term. I waited until all 3 bars were completed before submitting a review, but didn't see much of a difference in removing darkspots (maybe because I have stubborn skin on my face) Except for that I love how it made my skin feel... not sure yet, but I may try something else  for my face",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "This soap works wonders",
    "rating": "5.0 out of 5 stars",
    "content": "This is a repeat purchase for me-I just refuse to stop using it. I throw this into my nightly routine for getting ready for bed and my skin always feels so fresh after using it. Some soap bars immediately make your face feel so dry, but this one doesn't! I've noticed a big difference in how my skin looks and feels-I've been using this bar with the rest of my face care routine for about 5 months. My face is brighter, retains moisture better and is smooth. I used to have crappy break outs and this has almost put a complete stop to them. Any break out I've had is realllllly minor (I'm talking a bump or two..so much better).",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'll continue to use this as long as they have it available!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Spots on Body",
    "rating": "4.0 out of 5 stars",
    "content": "Just started useing the soap",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Last summer I noticed small brown spots on my cheekbones and lack of pigmentation on my hairline.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "The dark spots on my face are gone",
    "rating": "5.0 out of 5 stars",
    "content": "This spring, the spots became very dark and the light skin on my forehead was very noticeable. Some of spots on face were almost black.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I tried retinol products, and any other product that claimed it could help.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Amazing Smell",
    "rating": "5.0 out of 5 stars",
    "content": "One of those products was this soap. It made an incredible difference.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I referred to the spots  on my face as leopard spots. They were very noticeable. They aren't even noticeable now.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Good product!",
    "rating": "5.0 out of 5 stars",
    "content": "I use it twice a day. It took about three weeks to make a noticeable difference.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "So pleased with the lather of this soap and the smell is amazing.  Skin feels so soft and smooth.  Can't wait to update after a few weeks.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Unbelievable!",
    "rating": "4.0 out of 5 stars",
    "content": "I just started using the soap, so I can't comment on it right away, but makes my skin feel clean!",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wish I would have taken a before picture because the brown spots on my face have become much lighter.  I have used many products on my melasma, but nothing worked.  I had given up on removing them, but I saw a video on this product so I decided to give it a shot. I'm so glad I did because I've used it for two weeks and have visibly noticeable results.  The product dried my face a bit, so I added an extra moisturizer to my routine and it fixed the dryness.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Lasts a long time and leaves face feeling clean",
    "rating": "5.0 out of 5 stars",
    "content": "These two bars of soap last a long time…I’m still using the first bar…and leaves my face feeling clean.  It has a very slight, mild, pleasant smell.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I use this product 3 times weekly seems to have improved my complexion and evened out my skin tone . So far so good !",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "I have dealt with dark spots on my face because I have a really bad habit of needing to pop my pimples and scratching off any imperfections on my face and I realized that they weren't going away no matter what I did or how many vitamin c treatments I rubbed into my skin. So, this was it. I know turmeric helps with discoloration and dark spots and I found this (on accident) and also because I was too lazy to try and make my kitchen a science lab for the sake of my skin care routine. This was the best bang for my buck. While this does slightly dry me out its not awful and I rehydrate my face anyway (why would you wash your face and not HYDRATE IT?) with a snail mucin-based skincare set (Peach Slices Snail Rescue) and I always start my routine with a liquid cleanser/exfoliator (Garnier Micellar gentle peeling water). I do this routine twice a day and my face has never looked better. I'm an Indian woman, I have sensitive combination skin, and I deal with oily skin. I use all of these products mentioned above with this bar twice a day, once in the morning and once before bed. I hope this review helps someone!",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Works for me with sensitive skin, leave skin smooth and moist",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "My skin looks healthier and brighter",
    "rating": "5.0 out of 5 stars",
    "content": "I only received this soap a short while ago, but can say that it sure does make my skin feel great when I use it. If it makes the age spots disappear, I will be doing super Happy Dances!!",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The smell is very nice, but it worked slowly on me.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Good on sensitive skin",
    "rating": "5.0 out of 5 stars",
    "content": "HONEY LET ME TELL YOU!! Day one my skin felt clean, by day 3 I noticed the darkness on my forehead started to look grayish, as well as the sides of my face. by day 5 a large bump behind my bang was a tiny dot which is significant because my normal skin routine would’ve take much longer to make it disappear. Today is day 7 I notice that I look brighter and my tan on my body is slowly fading. In the past I used a bar my mom gave me inconsistently for a short time and my face really got bright and clear. My mom also benefited from it well but I did tan as soon as I went in the sun without sunscreen. My skin was always soft but now it’s baby soft and this tan that hasn’t left in two years is slowly fading, I can’t to see what 3 months of use does !!",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This product was decent but it contains a toxic chemical and vitamin C should only be mixed with kojic acid in small amounts (unsure how much vendor has used). I loved smell, the lather, the way my skin felt after using it. It did brighten my facial dark spots a bit, not so much my body skin. My skin felt more \"loved\" overall after uses. After using it 1x/day x 3 or 4 days, I noticed my facial skin became kind of rashy and sensitive to touch/sun. Looking on the ingredient list, this soap contains FD&C Yellow, a.k.a tartrazine, which often causes skin irritation and allergic reaction. It has also been found to hinder embryo development and disrupt hormonal harmony in men & women. It does lighten the dark spots, but with a cost. The soap is good, and other may not have the same experience I did, but I would just be cautious of the ingredients/chemicals you are putting on your porous skin and when you notice a negative change, stop using and look for something different. I hope this works for others!",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Makes skin feel good",
    "rating": "5.0 out of 5 stars",
    "content": "I have only been using this soap for 2 weeks.  I use it on my face, arms and hands where I have 'age' spots.  I noticed the difference right away.  It makes your skin so soft and yet not dry at all.  My skin has lightened quite a bit and others have noticed yet not sure what I did.  I highly recommend this product.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B09MFMCTRK"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Mild enough for my sensitive mature dry skin.  I have to use alot of water to lather it but it hasn't missed with my constant skin problems like acne dry sensitive skin.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B09MFMCTRK"
}
]