[
{
    "name": "        SHAPERX Women's Shapewear Bodysuit Tummy Control Body Shaper Seamless Sculpting Snatched Waist Body Suit       ",
    "stars": [
        "59%",
        "15%",
        "11%",
        "6%",
        "9%"
    ],
    "pid": "B0B1HR89H4",
    "ratings": "38,151 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Slimming of the waist and lower belly",
    "rating": "4.0 out of 5 stars",
    "content": "Slimming , comfortable, and light weight! Does the job for c section tummy also go a size down for optimal coverage.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I typically don't like shape wear because it feels so confining & uncomfortable, so I wasnt sure if i wouldn't like this one. I definitely had my doubts about whether I could squeeze into it when I pulled it out of the package but I was able to work it's way on with some (but not a huge amount) of effort. It fits almost perfectly. The only drawback for me is it's doing more for my tummy area than my chest. I've always had a long torso so that one piece swimsuits either dig into my shoulders or give me a wedgie so part of that is my body shape. But this shape wear is also so comfortable on. So i will probably just wear a bra with it. For reference my cup size is 40DD (or DDD), I usually wear 1X or 2X clothing, and I got the 2X/3X size for this.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Fits great",
    "rating": "5.0 out of 5 stars",
    "content": "I was trying to find something that would help me kind of shape and hold my stomach in I had three different special events that were coming up and I've been having a hard time getting that baby weight off after having the baby. And I came across and found this and I thought at least try it out and see. It's been working out good for me, I like it! It is definitely a bit tight, and I know that the whole idea is to help keep everything in and together. For sure it definitely does that but it's still tight. I may have to go up in a size but I don't think that they go past an extra large I got to a size extra large. I do wish they would make it in a 2X but I don't think they do, unfortunately. I've been watching it in cold water gentle cycle and then hanging it up. I've worn it five different times and it gets on it is a slight workout for me. But once I get it on I get it adjusted it was able to on three different events I was able to wear it all during that time and they were long events. I did feel a bit tired and kind of squished after the next day after one event, so maybe it's not a great idea to wear all day. I do think it's going to start stretching out slightly because it does kind of feel slightly stretched out in places now. I was really embarrassed about doing this review but I wanted to give it as honestly as I could, hoping that it would help another woman out. And I know it's going to take time to get this baby weight off but I wanted to be able to still get dressed up and look nice and not look so pooched I guess you could say, I was not blessed to be one of those beautiful curved looking women I don't seem to curve, unfortunately. But for the times I've used it it's worked out for me. I'm embarrassed to say this but I used to be a size 16 I'm in 18 and trying to put certain clothes on they don't quite want to fit and I'm have to buy new clothes that are a size 20 and being able to put the song I've been able to wear some of my older clothes before the baby. So I have nothing bad to say about it, it worked for what I needed it for. I do hope that this helps another woman out it's something that will be helpful information at when she's looking at buying it. I did also find that supported the chested area better than I was expecting which that was nice. And it did help me look more flattering and prettier than I was expecting and that was nice. So I'm Happy with my purchase! Thank you!",
    "post_time": "Reviewed in the United States on March 13, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "GET IT!! I was skeptical about ordering this shape wear just because I've had other shape wear products and they are so uncomfortable and they are not cheap I was between this one and the Yahaira shape wear but I ended up choosing this one because it was a lot cheaper and I seen a tick tock review saying that it's actually a dupe comparing to the Yahaira shape wear I am so glad I ended up getting this shape wear it was so comfortable it was not rolling on me it's the first time I've ever been happy with a shapewear that I purchased I ended up getting a large / extra-large and I weigh about 188 and I'm 5'2 I didn't feel like I couldn't breathe or I couldn't move around I was able to dance in this & I was able to sit in this for a few hours I love it. It looks natural... I HIGHLY RECOMMEND.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "It's been working out good, I like it!",
    "rating": "4.0 out of 5 stars",
    "content": "I love it. It doesn't show my nippers. Its long enough in my torso. I bought to help with my back pain. I carry most of my weight in my front mid section. It's strong but elastic. The material isn't hot to wear. No holes. The ONLY thing I would change would make the straps wider because us ladies with big boots have issues with straps cutting into our shoulders. This is the only reason I'm wearing a sports bra underneath. If they were to male one with wide shoulders straps I'd be comfortable because it hold up my boots pretty good. I'm 5'3.5\" 210 lbs and the 2x/3x fit good.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Absolutely love the material but I would definitely size down when purchasing",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "OMG GET IT!!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I am 5'7 and 205.  I bought the XL based on what I had been reading.  I got it and put on a pair of jeans that were to tight to compare as all of the videos show.  I showed my husband how the jeans fit and I could not get them buttoned!  UGGHH  I put the Shaperx on (talk about tight squeeze!) and holy cow those jeans buttoned with NO PROBLEM!  It shocked both of us!  I am going to be buying more!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve gained about 80 pounds in the last year, so I’m now 5’9 and 230 pounds. Size 14/16/18 depending on brands (XL-XXL). I’ve been on the hunt to eliminate my muffin top. No matter what pants I wear I always have a bit of a muffin top and back rolls. I am a 34J bra (36 sometimes) cause I have a small rib cage but lots of fat in that area which causes digging and it’s just not good lol. This bodysuit makes me feel so sexy. As you can see there’s no muffin top, and I can even wear it under yoga pants without too much showing! That’s my main issue with most bodysuits is the digging on my hips and butt, I have large hip dips but also a big butt and it makes for weird fits. I even sized down 1-2 sizes for the snatch and it still stretches to fit me! Obviously my boobs are kinda out but that’s what happens when you wear a j cup lol. I will say, DO NOT ORDER THE THONG IF YOU HAVE A BIGGER PUNANI/FUPA/ETC. it digs in so much. Order the brief instead. I returned the thong thinking it would work in that size but I ordered the brief and I’m so glad I did. Overall, I’ve never made a review on here but I feel so confident that I had to share as a plus size girly. Also 4 stars is only because the panty area could be bigger/more inclusive, as well as the chest area.",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Great product! Worth the money",
    "rating": "4.0 out of 5 stars",
    "content": "This will snatch your waist for sure!  It will also be so tight you might spill over at the armpit, so be aware.  Also, you might be pinched in the nether region, BUT this will work wonders for that special outfit. I would get this again.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "got a skims body suit a week or so ago and it feels and is basically the exact SAME!!!!",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Size down & feel great",
    "rating": "4.0 out of 5 stars",
    "content": "Sized down to small-fits perfect & doesn't roll or shift",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The size of this coming out of the package it teeeeeeeny but it stretches and fits... once on, it holds in your belly, back and hips... it is not super tight but tight enough.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Not too much, not too little",
    "rating": "5.0 out of 5 stars",
    "content": "I brought this as a shaper since I've gained a little weight around my mid section.  I don't want to suppress my behind so i chose the thong shaper.  It works very well.  I don't have to wear a bra unless i want a more push up look.  For reference I'm about 140 lbs. and I'm about 5-6inches tall with a pudgy midsection.  I was able to wear a fitting body icon dress and felt comfortable!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love this!! I am 5'3 and 205lbs and got a large. I might size up just because my lady bits  slip out at the bottom",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "It does snatch you in",
    "rating": "5.0 out of 5 stars",
    "content": "When I received this, I wasn’t quite sure that the material would be supportive. Boy was I wrong. This garment snatches everything up nice and tight, and smooths every dimple all at the same time. It does a body good. I will definitely be purchasing another.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Honestly I had been looking for shape wear that actually snatched and looked good underneath clothes ! & OMG this does it ! everything ! just 🤌🏼",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "I wear it all the time",
    "rating": "5.0 out of 5 stars",
    "content": "the leg part does not roll up which was something that i struggled with , with other shapewear ! completely recommend to get your hands on this !",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’m 5’2 around 135 lbs and i got a size S .",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Pleasantly surprised",
    "rating": "3.0 out of 5 stars",
    "content": "I think i would definitely size down to a XS",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "i don’t normally write reviews, but i’m just so happy with this product that i had to. i was hesitant given the price, but decided to go for it based on the reviews. it feels like a hug and honestly so comfy. holds all the right places and i don’t even have to wear a bra. true to size. definitely recommend",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Tight!!",
    "rating": "4.0 out of 5 stars",
    "content": "I could not get this on! This is sooo tight and just hurt myself haha if you’re into softer shapers do not get this! Also the torso felt very short",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I absolutely LOVE this shapewear!! I wore it to a concert with a cargo skirt and the comfort level was INSANE. It's so soft and breathable, and I didn't have to constantly adjust it throughout the night. The only issue I had was that it did roll up a bit around the waist. Also, if you're a D cup like me, you'll want to pair this with a sticky bra or another supportive option. The shapewear doesn't provide much bust support, and I noticed my boobs looked a bit saggy without additional support. Overall, it was still a great choice for a fun night out and really snatched me up! Worth buying.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "LOVE!!",
    "rating": "4.0 out of 5 stars",
    "content": "It fit perfect, true size. It hold good and super confy.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "When I first got this it wasn’t very comfortable but once you get use to it you barely notice it’s there, I started wearing this under my scrubs to work after I ordered a few more and instead of having to deal with an uncomfortable bra I have to re adjust all day in the office it keeps me feeling slimmer and more confident being all held in place.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Love the shaper",
    "rating": "5.0 out of 5 stars",
    "content": "I love this shapewear. It sucks you in very well. I’m trying to buy every color. Not many to choose from. Please get more variety colors. Material is great, easy to put on, I’ve ordered size L/XL, but I would get size M from here on out, weight about 200lbs 5’5 I could wear this all day with no discomfort. Easy to use bathroom with it still clamped too.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I thought this was going to be life changing based on other reviews, and it was good. The suit does snatch, I can tuck bra pads in and they stay in place without having to wear one, and the material is on the thicker side, I’m not very gentle and haven’t managed to rip these.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Favorite daily under garment for work",
    "rating": "5.0 out of 5 stars",
    "content": "I will say, after a few months of occasional wear, they have developed those pills and little fuzz balls around the thighs.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The hole is great for quick restroom use, but still, pee with caution.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "It’s a great buy.",
    "rating": "4.0 out of 5 stars",
    "content": "I don’t think it’s very versatile unless you don’t mind wearing see through wear- most areas are shiny and have that see through effect. Last complaint - the thighs ROLL UP! And is super annoying.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The BEST thing about this shapewear - I can have a smooth shape and not worry about my pants or other clothes giving unnecessary muffin top vibes.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Love it!",
    "rating": "5.0 out of 5 stars",
    "content": "The material is such good quality. I bought this to help with post party recover. I could have bought a medium but the large was comfortable. I weighed 195lbs and got a good snatch. You can definitely wear this without a bra. I wear 36DDD and I was so confident in it. It's not hot. It's comfortable.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It makes this fatty lose 3 inches around my rotund waist. But I couldn't wear it for long. It squeezes you so much. Doubt I could sit down in that. Nearly required surgical precision to remove it from my fat self. Might need to hire someone to remove it next time. 🤔",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Squeeze!",
    "rating": "5.0 out of 5 stars",
    "content": "So I went in vacation and took one of these gems with me and I wore this for seven days  (key is, if you can not rinse it out, wear underwear :) and it stayed in it's true form and tucks everything in. One concern is I could not quite get it all away up my back. No reach advantage. Other than that for the price,",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": " it's a great deal!",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Great fit!!",
    "rating": "4.0 out of 5 stars",
    "content": "For someone who cannot wear tight clothes due to health problems this isn't terrible! It's definitely shaping but not crazy it's just enough. Extremely stretchy and can fit a lot of different body types.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Buena tela",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Flexible, and comfy",
    "rating": "4.0 out of 5 stars",
    "content": "Wow... sucks everything in! It would not have fit had I not sized up. Thick fabric. Hand wash & air dry a must.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wore the shape wear body suit underneath these outfits and it served it’s purpose! The goal is to smooth it all out, and it’s elasticity allowed me to do just that and keep my curvy shape smooth!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Bonita",
    "rating": "5.0 out of 5 stars",
    "content": "I love this so much. I wrestled with it for 5 minutes to get it on but once I did I loved it! (Don’t mind the panties. I kept them on while trying it on.) Lol One of the other reviews influenced me to get a size smaller than usual so I did. I’m about a XL/XXL but I got a L/XL. I’m 5’7” 222. Once I actually wear it I’ll update my review.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product. Hugged me in all the right places and it was so comfortable. I’m a 38-40 DDD, 185lbs and I’m 5’9”. I ordered a S/M and I’m so glad I did.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "MY HONEST A$$ REVIEW",
    "rating": "4.0 out of 5 stars",
    "content": "guys i barely write reviews but i had to hop on here and say; i weigh 180, im 5'4 and got the tan one so usually if i get any kinda clothing its a L but i went ahead and bought the S/M BECAUSE THE REVIEWS WERE REALLY HYPING ME UP. i opened it up and im like hold on bruh ya'll gotta be lying this not gonna fit me its gonna fit my 5 pound dog... BUT LORD DID SUM MAGIC WITH THE STRETCH OF THIS THING DUDE. i will say i have two warnings when buying... the girls are not covered but are supported like crazy, so wear a bra unless u going to vegas or something LOL. second thing, because of the stretch, the material becomes kinda thin so for me personally like i could see my belly button and cellulite through it. OTHER THAN THAT LIKE WE OUTSIDE THIS SUMMER WITH THIS I RECCOMEND TRUELY GIRLS.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am size medium on clothes and the small/med fit perfectly. It’s comfortable and feels like you have nothing on. Looks great under jeans. Very similar to Spanx but way more comfortable!",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "So comfortable!",
    "rating": "5.0 out of 5 stars",
    "content": "I love these! I've bought three colors and different styles! Very form fitting! Great price! Washable. Sexy with jeans and oversized pants! Gives me a better waist. Comfy! Durable. I can't say enough good things about these! Don't look any further trust me! I'm very picky! These get the job done!!!!",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wear these all the time they’re very tight and slimming but you can still breathe and move in them. Love these",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Very nice material and holds everything in! I recommend buying it now!",
    "rating": "4.0 out of 5 stars",
    "content": "I'd say it works very well, similar to shapermint tank top. Smooths you out, and does suck in, but still leaves some bumps. Like you can see the indent of my underwear band for example. I'd say if you are wanting something to feel a bit more confident in, and smooth out some curves it is nice.",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The bra and bum area are thinner material and very stretchy, so I think I would prefer a bra just for coverage. And the under clasp is simple and comfortable, just 2 hooks.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Sucks you in",
    "rating": "4.0 out of 5 stars",
    "content": "I'd also say maybe putting it on by stepping into in like shapermint, may be helpful too since it is tight(obviously. Lol) but to make it a bit easier and to have less pinching could be nice.",
    "post_time": "Reviewed in the United States on June 8, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The other downside is it is hand wash and hang dry only. So us lazy people have to make sure we see that. Lol",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Definitely sucks in, but not perfectly flattening",
    "rating": "5.0 out of 5 stars",
    "content": "Hope this helps you decide. 😊",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Surprisingly comfortable, the material isn’t too stiff, but I also don’t worry about ripping it when I put it on and shift everything around, plus you can feel the cooling. Unlike others I’ve purchased in the past, it stays in place and doesn’t just squeeze and push everything out, it somehow just sucks everything in and holds it there. I feel like I have finally found what I’ve been searching for for years and I feel comfortable wearing some items I’ve been holding off on for so long that it’s like I have a whole new wardrobe! Thanks Shapex:)",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "SIZE DOWN",
    "rating": "4.0 out of 5 stars",
    "content": "I’m a Size XXL and I should have sized down with this bodysuit…other than that, it’s a great piece!",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The breast support is also really good.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Nice material",
    "rating": "4.0 out of 5 stars",
    "content": "So it’s nice and it’s very comfy but does not snatch as much as I’d like it too",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is tight it holds you in it just needs to come higher on the back",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Does the job",
    "rating": "4.0 out of 5 stars",
    "content": "I LOVE IT Definitely buying more. I love the freedom of the breasts. It doesn't compress and look like one big boob!!! 10 🤩",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "definitely is perfect for those slimmer dresses",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Best shape wear ever!!!",
    "rating": "4.0 out of 5 stars",
    "content": "This bodysuit shapewear is impressive! It offers great support and smooths out beautifully under clothes. The material is comfortable and breathable, making it easy to wear all day without any discomfort. The fit is snug but not too tight, and it stays in place without rolling up. My only minor complaint is that the hook-and-eye closure can be a bit tricky to fasten. Overall, this shapewear is effective and worth the purchase",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had plastic surgery and was looking for shapewear I could wear every day and still experience some compression. I love this it looks great under clothes. Only thing I wish was different was that it was looser in the legs",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "very good",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this. I'm a plus size girly and I got the 1xl. I could have sized down 1 and had more of a compression fit but I wanna wear it out and about. I got black and mine is not see through, the clasps instead of buttons is amazing. I will be buying more colors now that I loved the black one. I wore mine all day and with jeans and it didn't roll up or down on my torso in any fashion.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great addition to your wardrobe. I am 5'8 - 190lbs. I ordered l/xl and it fit great. I will be buying more colors.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Snatch for the gods",
    "rating": "5.0 out of 5 stars",
    "content": "Bby it snatched me in all the right places will definitely always keep one in my closet",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great product but wish there was a better description as it is crotchless",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Great product",
    "rating": "4.0 out of 5 stars",
    "content": "I was looking for shapewear to wear under a bridesmaid dress (as well as under casual dresses to work). This one worked out great. Looks slim, but stretches easily and shapes nicely. Love that it’s a one piece with straps for extra support. The only thing I don’t like about it, is the hole in the crotch area. There’s absolutely no way you can functionally use it to go to the bathroom and I don’t like having to be mindful of it when I’m sitting on the floor, etc.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I'm usually a large in size. Ordered a S/m, it did smooth out my stomach however it did not actually flatten it and I'm not a big/ fat person, just a small postpartum tummy. Will order smaller size if I have to order again.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Works well!",
    "rating": "4.0 out of 5 stars",
    "content": "La verdad estába muy ansiosa por este producto, llego rápido solo que al momento de ponérmela se rompió y deshilo  por atrás, por en medio de los tirantes. Después de eso muy bien, me comprimio el abdomen y hace una silueta decente, es muy comoda, las tiras son ajustables,  me encantó, solo que al momento de ir al baño la parte de abajo es muy pequeña, tuve que quitárme solo la parte de arriba. La e usado unas 4 veces pero simpre debajo de mi ropa. No se rotó más, y sigue dándome la misma compresión,  creo que si ordenaria otra",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Initially I thought there was NO way it would fit!! Too my surprise, it fit perfect and was surprisingly comfortable!!! I wore it all day and had ZERO complaints!! In fact, I had compliments on my figure! I have basically given up on shapewear. They roll they dig they never feel good. I forgot I was wearing it!!! Ladies, if you are thinking about it, DO IT!!! You will be happy you did with this one!! I went a size up so I wouldn’t be stuffed. I’m glad I did. But you probably could wear your actual size with this shaper. I cannot express how happy I am with this purchase!",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Fit",
    "rating": "4.0 out of 5 stars",
    "content": "I didn't like is the crotch is a bit to narrow for my comfort. But it does what it's suppose to do. Really snatches my waist. The quality isn't as good as I hoped, but I will continue to wear it for short periods. Really not comfortable for all day wear.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I purchased a size L, i would sugges sizing up even though this is for tummy control for the comfort factor. It does a great job of synching in the waist which is a plus with shapewear. It keeps everything in place and the  clasps are easy to attach and detach.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Buena pero...",
    "rating": "4.0 out of 5 stars",
    "content": "That's it. It's very comfy too",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0B1HR89H4"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It looks so small but boy does it suck you in! I could sit down in my stand only jeans! I had to get used to the tightness but overall I found it very comfortable.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0B1HR89H4"
}
]