[
{
    "name": " The Midwife of Auschwitz ",
    "stars": [
        "73%",
        "21%",
        "5%",
        "1%",
        "1%"
    ],
    "pid": "B0B192BCF8",
    "ratings": "18,192 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "Book is highly recommended",
    "rating": "5.0 out of 5 stars",
    "content": "Such a great book.  Highly recommend",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I feel this story evoked every emotion a story that occurs during the holocaust is supposed to.  Overall it showed how love does conquer hate.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "a solid 4",
    "rating": "5.0 out of 5 stars",
    "content": "The story was both beautiful and brutal. The people came to life on the pages. It was captivating and I had to read it in one day with breaks in between",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I couldn’t stop reading this book.  There are many books about the atrocities the Nazis imposed on people, countries, and the world.  This book describes the horrors, the inhumanity, and the gross anti- Semitism the Jews, resistance, and other ethnicities faced and endured in the horrible camps.  Yet, the survival drive and hope they had was unbelievable.  God was there even though many lost faith.  Good things always come out of tragedy.  We can never allow this to happen again.  I was in tears at the courage and fight these women had.  The human spirit is so strong.  God bless them all.",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Touching story",
    "rating": "5.0 out of 5 stars",
    "content": "I know this is a work of fiction but it’s an incredible one. I cannot imagine the horror and degradation those people faced daily under German occupation. The camps were terrible things created by evil people. This novel brings that home.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "He well written story about a despicable time in the history of the world",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "hope and love are a driving force.",
    "rating": "4.0 out of 5 stars",
    "content": "You think you know all there is about the holocaust. Then, you read a book like this, and the horrors just keep piling on top of each other. My thought is that this book was written with the information of actual survivors. As we say about other things that have happened, don’t ever forget.",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a beautifully written story, based on the true story of a midwife during the holocaust of WWII. A real page turner for anyone who enjoys reading historically based works of fiction. Looking forward to the continuation of Ester in The Midwife of Berlin",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "What an amazing story!",
    "rating": "5.0 out of 5 stars",
    "content": "My heart hurt and tears fell while reading this book! I couldn’t put it down. Everyone should read this book.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a book that everyone should read to be reminded of the horrific things that happened to millions of Jewish people and anyone else who resisted the Nazis. The resilience of those who made it through it’s just amazing.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "The Midwife of Auschwitz",
    "rating": "5.0 out of 5 stars",
    "content": "If you are of a certain age you know of WWII and you've heard of the horror of concentration camps with Auschwitz being the worst. This is a telling of that life; before, during, and after.  It is a very difficult story to read due to the terror of the lives of those held captive but worth the read to understand what people lived through, how some were able to live after and a reminder to what is happening in the world today.",
    "post_time": "Reviewed in the United States on May 20, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Hard to say that about a WW2 book. But the way these women gathered around eachother and supported one another was beautiful. It was also an ingenious idea they had to reunite children with their mothers. I am sure there are many many that still never got reunited. But for the ones that did it is truly miraculous.",
    "post_time": "Reviewed in the United States on April 23, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Inspirational",
    "rating": "4.0 out of 5 stars",
    "content": "Very moving and descriptive of the horrific events that occurred at Auschwitz’s concentration camp!!!!",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Difficult to read about the innocent babies treatment and how these women endured!",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "good reads",
    "rating": "4.0 out of 5 stars",
    "content": "Well written and full of heart wrenching emotions!",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "While I’ve read many World War II nonfiction books, and a few fiction, I think this may be a novel based on fact more than any other I’ve read so far. Ms Stewart really gave it a more personal reality. I also didn’t know as much about Poland‘s part in the war. I would recommend this book to everyone. It’s heart wrenching, but it must be kept at the forefront so that it doesn’t happen again. Since I was a proofreader I found a few typos but otherwise it is very well written.",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "must read",
    "rating": "5.0 out of 5 stars",
    "content": "Knowing that is based on true story made this work all the more valued.  Their strength hope and sisterhood is inspiring.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "An amazing story based on real people and real events.  I thought the characters were very interesting and easy to become invested in their stories. Highly recommended!  I will definitely read more of Anna’s books!",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Hope even in the worst place on Earth",
    "rating": "4.0 out of 5 stars",
    "content": "This story depicts the atrocities that really took place under the God-less reign of Adolf Hitler. Families were broken up, babies stolen from their mothers' arms, beatings, starvation, and so much more. But the human spirit wins out as victims put their trust in God and hang on with faith and hope and love.",
    "post_time": "Reviewed in the United States on April 10, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was captivating from the start. I was touched by so many moments and couldn’t put down my phone while reading it. It’s amazing how a heartbreaking story can so quickly pull on your heart strings.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Heartwrenching",
    "rating": "4.0 out of 5 stars",
    "content": "This was an emotional book to read. It brings up a lot of emotions and feelings. Ana and Ester’s stories are the kind you think about years later. I’m interested in the continuation of Ester’s story in the next book.",
    "post_time": "Reviewed in the United States on April 23, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Heartbreaking and insightful.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Very well written",
    "rating": "5.0 out of 5 stars",
    "content": "This book captured me in the very beginning and I could not put it down.  As the generation that lived through WWII is slowly passing away, the importance of these stories increases so that we may never see this part of history repeated.  Although this is fictionalized, (one of my favorite genres to read is historical fiction), there is tremendous truth and reality evident in this story.  If you like historical fiction about WWII, then this is a good book for you.  Well done, Anna Stuart!",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed reading this book.  Good Book.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Some Stories Must Be Told",
    "rating": "5.0 out of 5 stars",
    "content": "This story made me cry so hard.  I love these stories of courage and hope.  Peace came to these and they flourished during and after a time that was desperately hard.  It's unimaginable the things these people faced bc of one man's hate.  My heart breaks knowing maybe this is a fictional noval but is true in so many ways.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good book that delves into the age of Hitler and the horrific concentration camps. I really enjoyed the read because of the subject matter and we as a nation need these bits and pieces of History kept alive. I do highly recommend.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Book",
    "rating": "5.0 out of 5 stars",
    "content": "I just wanted to say what a great book you wrote Anna Stewart. Thank you for writing such a powerful book enjoyed from start to finish. I read this as a recommended reading from another teacher and I definitely will be recommending it.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Thank you Anna Stuart for all the research you did in writing this book.",
    "post_time": "Reviewed in the United States on March 27, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Heartwrenchingly Beautiful!",
    "rating": "5.0 out of 5 stars",
    "content": "I learned so much more about the cruelty of the Nazi’s. This story is heartbreaking and so hard to imagine any human being could treat anyone with such contempt. The dehumanized the Jewish people and anyone who was courageous enough to stand against their evil regime. More people need to learn about the horrors of Auschwitz. Those who do not learn from history are doomed to repeat it and it breaks my heart to see this antisemitism happening all over again. This is seriously a must read.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a heart breaker!  But, also such a moving story.  I will read on this series.  We should never forget the lessons of the past!  Such cruelty took place to so many innocent people!  Such a huge loss of life!  Every life, no matter race or religion, is so precious!",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "So moving, so sad, so hopeful",
    "rating": "5.0 out of 5 stars",
    "content": "This book shook me in ways I could not have imagined. While I know a part of it was historical fiction, the parts that came from real history are terrible and terrifying to comprehend. The inhumane treatment of one group of people by another is impossible to understand. This book ends on a bittersweet note with hope for the future. I would definitely recommend this.",
    "post_time": "Reviewed in the United States on May 12, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book had me at the edge of my seat the entire read. I liked how the book switched between characters' points of view. This historical novel was very moving in the sense that Auschwitz could not dim the light of those who held onto hope and those around them. Unlikely friendships were made and in the midst of sadness and hatred. This book reminded me to enjoy the things I have in this life but enjoy the people in my life more and never take them for granted.",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Moving",
    "rating": "4.0 out of 5 stars",
    "content": "The characters were not fully fleshed out & I am surprised that there were not a lot more miscarriages or maternal deaths due to malnutrition & disease. Pregnancy wouldn't have been too easy to hide & those women would've been watched carefully, or quickly sent to their death to prevent procreation of their \"species\".",
    "post_time": "Reviewed in the United States on February 27, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Opens your eyes to the tragedy of the horrors of the concentration camps!",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Somewhat formulaic, & unreal",
    "rating": "4.0 out of 5 stars",
    "content": "Absolutely heartbreaking story. The strength of the women from this Era is beyond amazing. World War 2 was such a gruesome, evil,  devastating war. The people who lived to tell their stories are nothing short of amazing.",
    "post_time": "Reviewed in the United States on March 9, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A tru!y compelling story. Difficult to believe it happened during my lifetime. A fast page turner, you won't get bored. Well written.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Great Book!!",
    "rating": "5.0 out of 5 stars",
    "content": "I could not put this book down! It is an amazing book that puts the reader right in it. Such a horrifying time to live in,  readers could see through the eyes of each character in the book. Well written and told.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book grabbed me and didn't let me go until I finished the book in 2 days. I felt as though I were actually there.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Midwife of Auschwitz",
    "rating": "5.0 out of 5 stars",
    "content": "This book is heartbreaking but I couldn't stop reading.  Ready for the next book.  How anyone survived this tragedy is beyond thought.  Read it!!!!!and pass it on.  We must never forget the innocent.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Hard, horrible things written with honesty and grace.",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "A book that is hard to put-down",
    "rating": "5.0 out of 5 stars",
    "content": "This book gives the heart wrenching view Of Auschwitz from the inside.It pulls with raw emotion at the heart of the reader.The character development of many of the characters is so beautifully done and so fully done that the pages just seem to fly by.While this book has many ups and downs it uncovers the true dignity and spirit of mankind.",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Ms Stuart has obviously done her homework in weaving her story with what really happened in the Third Reich.  And though this is a novel, one cannot read it without recognizing that we have a long way to go before we can begin to pat ourselves on the back over the world in which we live.  Excellent job!",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Will we ever become human?",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful, but painful. A beautifully written story about a horrible time in the history of this world. I found myself laughing, crying and holding my breath. I couldn’t recommend this book any higher, or I would.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "He who forgets is destined to remember. This was a great read to remind everyone of what happened so it will never happen again.",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "beautifully written",
    "rating": "5.0 out of 5 stars",
    "content": "Florida probably banned this book. Read it!",
    "post_time": "Reviewed in the United States on March 28, 2023",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am enthralled with the  Call the Midwife television series.  I have now been reading stories of World War 2 and midwifery. I started this one and had a harder time getting started with it. But so very good reading it. it brought thoughts of my husband's Grandmother.  she was sent to America from Poland during WW2.  Her family stayed in Poland.  she never saw her family again.  The horror of life in Poland during WW2 is not what I learned in History class.This is something I hopes never happens in this world again.  If we all were reminded of the horrors hopefully they would not happen again anywhere.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "A Must-Read for Everyone",
    "rating": "3.0 out of 5 stars",
    "content": "The book is well written and the story comes to life.  The Catholic woman was easy to identify with, but so was the young Jewish woman Ester.  The horrors in their town and at the camp are easily understood.  The coming home from camp and the sadness and happiness of trying to build a life again are not often thought about but I can let my imagination try to relate to some times during my life. But never comes close to their daily hell.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "enjoy this book!",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "History becomes real",
    "rating": "5.0 out of 5 stars",
    "content": "A truly inspiring story. Let us never forget the horror, but also remember the courage and faith of those who lived through it.",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Sad situation but repeats itself",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "A moving story of a time of horrible tragedy, and incredible bravery and heroism",
    "rating": "5.0 out of 5 stars",
    "content": "I have read approximately 12 Holocaust novels and true stories. None of them so moved me as this one did.  Only one other book brought tears to my eyes.  This is a fantastic novel based on a brave woman and the incredibly brave things she did.  I would recommend this to anyone who wants to know the truth about what was done to so many by the Nazi’s.",
    "post_time": "Reviewed in the United States on March 28, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The history in this book is very accurate.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Excellent read",
    "rating": "5.0 out of 5 stars",
    "content": "This story is a reminder of the attrocities committed in war. The heartless people following hideous orders and making up their own.",
    "post_time": "Reviewed in the United States on April 24, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Not the entire ending expected so must read the next book.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "A Reminder of How It Was",
    "rating": "5.0 out of 5 stars",
    "content": "Emotional, precious, determined, and beautiful. This book is so inspiring. It actively makes me want to seek out ways to improve humanity.",
    "post_time": "Reviewed in the United States on April 24, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A great story of WWII and Auschwitz/Birkenau. I always think I can’t be shocked anymore about the evil of Nazi Germany, and than I am. The horrors are sometimes hard to believe. Good historical fiction. Hard to put down. A true page turner.",
    "post_time": "Reviewed in the United States on August 4, 2023",
    "pid": "B0B192BCF8"
},
{
    "title": "Amazing",
    "rating": "3.0 out of 5 stars",
    "content": "Well researched and based on a composite of real life characters,,the book presented what it was like to be caught up in the evils of the Nazi's. The scenes included showed the horrors, but more so how people could persevere with compassion and hope. I liked it that the main character was a Catholic midwife, as it gives a new perspective and contasts decent people with evil ones and also those in between. Although many did not make it to the end and there was much loss, a few were reunited with some surviving family members or friends. I also like that in the addendum at the end, there was more information about the real life characters the story was based on and what became of them. One of the most well written books I have read in a while.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book was a good read but a chunk of 30 pages fell out. Poor binding by the publisher.",
    "post_time": "Reviewed in the United States on April 30, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Alarming. Riveting",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this book so much. It tore at every fiber of my heart. I could not put it down and was so sad when it was over.",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It’s a tough read because of the truth of it. It’s powerful because you get the feel for what it was like living in the camp, and at that time.",
    "post_time": "Reviewed in the United States on August 2, 2023",
    "pid": "B0B192BCF8"
},
{
    "title": "powerful read",
    "rating": "5.0 out of 5 stars",
    "content": "This is a very powerful read. We all have seen and heard through books and many movies some stories. I myself didn’t realize that babies were taken and given to Germans. My heart breaks for the families who may have never found there babies.i cried a lot. This book gives a whole different story",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very disturbing, but a really fabulous read - fiction based mainly on fact.  I have passed it on to friends.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Fabulous book!",
    "rating": "5.0 out of 5 stars",
    "content": "So many ups and downs and very emotional. Can’t wait to read the next book in the series! Never forget!",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Enjoyed the book.",
    "post_time": "Reviewed in the United States on March 24, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Gripping and Heartbreaking and Wonderful all at once",
    "rating": "3.0 out of 5 stars",
    "content": "This review is hard! I like this book but it's very heavy. I do love that it's actually based on the midwife Stanisława Leszczyńska. We learn so much about the men, women and young kids during the holocaust but we don't really grasp about what happened to the pregnant women and thier babies. With that being said I am not a huge historical fiction person. So I do feel like the pace was slow and hard to keep my attention until around chapter 21.",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I very rarely give a 5 star to any book. It has to be a really good book that is beautifully written and one in which I cannot put down. This was one of those books. The two main characters are Ana and Ester and their journey from Poland to a concentration camp. Ana is the midwife and Ester is Jewish. The author does an amazing job of bringing to life the horrors of WWII and the concentration camps. There are parts that made me cry, made me laugh, and truly torn at my heartstrings. I don’t like to give away any spoilers when I write a review, I want the reader to be surprised and hopefully compelled to read a book like this. We need to always remember our history. It is important that we don’t forget and that we remember the real history, not something made up to make someone feel better, is what should be taught.",
    "post_time": "Reviewed in the United States on March 29, 2023",
    "pid": "B0B192BCF8"
},
{
    "title": "Good read",
    "rating": "5.0 out of 5 stars",
    "content": "This book was very emotional, and hard to read emotionally, but very engrossing. You can imagine the unimaginable and see what the characters and real life people went through and your heart breaks. It's inconceivable to me how brutal and inhumane the Nazis were. I can’t even imagine the horror but to read the story of how even in the Hell that ravaged the world and tore families apart, there were some brave, determined souls that helped distill the pain of their tortured reality. Very moving, emotional and thought-provoking.",
    "post_time": "Reviewed in the United States on February 11, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Reading about the horror of Nazi Germany brings to life pain that is unimaginable. Trusting God to bring good out of the bad gives hope. May we all learn from the past.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "heartfelt",
    "rating": "5.0 out of 5 stars",
    "content": "A gripping story of what Jewish people went through during a mad man's life. The details are sad, hoping for the best for defensive little ones. Babies who didn't get a choice of what was to come.",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "B0B192BCF8"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was recommended to me by a friend, so it was my first book by Anna Stuart. I couldn't put this book down. I laughed, I cried, I cringed at some of the horrendous atrocities perpetrated on the women in the German concentration camp of Berkenau. There were many pregnant women and our heroines Ana and Ester were there to help them give birth just to see their babies drown in a bucket or die due to lack of nourishment or be taken away to be Germanized in a good German family loyal to the Third Reich.  For those who want to believe that the Holocaust never happened, this book sure will prove your thinking is in error.  But in the midst of the horror, hope springs eternal and joy truly does come in the morning! I can't recommend this book enough! I'll definitely be reading more by Anna Stuart.",
    "post_time": "Reviewed in the United States on April 12, 2023",
    "pid": "B0B192BCF8"
}
]