[
{
    "name": "        SAM’U PH Sensitive Cream Mist | Daily Face Moisturizer for Men & Women | Korean Face Mist Hydrating Spray | Dewy Setting Spray for Makeup Long Lasting Fixer | Face Skin Care (3.38 Fl. Oz.)       ",
    "stars": [
        "73%",
        "8%",
        "9%",
        "7%",
        "4%"
    ],
    "pid": "B0B3MTMZCC",
    "ratings": "115 ratings",
    "other_info": {
        "Brand": "SAM'U",
        "Item Form": "Liquid",
        "Skin Type": "Sensitive",
        "Material Type Free": "Natural",
        "Product Benefits": " "
    },
    "discount_price": "$ 33.",
    "normal_price": "$9.76",
    "about_this_item": [
        " DEWY RADIANCE IN A MIST. Elevate your skin's glow with SAM’U PH Sensitive Cream Mist. Infused with Hyaluronic Acid and Ceramide, its fine mist particles provide quick and lasting hydration. Experience a natural radiance boost and moisturize your skin barrier, leaving your face soft and revitalized.  ",
        " HYDRATION ON-THE-GO. Unleash the power of a combined face cream and toner in one skincare mist. Perfect for daily moisturization or a quick post-workout pick-me-up. Centella Asiatica extracts and Allantoin work together to moisturize and soothe, fortifying the skin barrier by a remarkable 16.95%.  ",
        " REFRESH W/OUT THE RESIDUE. Our hydrating setting spray ensures no greasy feeling with a perfect pH balance of 5-6. Quickly absorbed, it preserves the oil-water balance, delivering an instant boost of hydration wherever and whenever. Ideal for setting makeup with a long-lasting fixer effect.  ",
        " HYPOALLERGENIC FACE CARE ESSENTIAL. SAM’U PH Sensitive Cream facial spray is your all-in-one skin care solution with a skin irritation index of “0.00”. This multitasking facial mist spray acts as a setting spray and facial moisturizer that gives you fresh and moisturized skin in a single spritz.  ",
        " KOREAN BEAUTY SECRET UNVEILED. Experience the luxury of Korean skincare with SAM’U pH Sensitive moisturizer face spray. This beauty essential combines the freshness and moisturizing benefits of SAM'U pH cream, providing added vitality to achieve a dewy complexion and maintain facial moisture.  "
    ]
},
{
    "title": "Love it!",
    "rating": "5.0 out of 5 stars",
    "content": "The mist is super fine and the texture feels great on my skin.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B0B3MTMZCC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this product, so moisturizing and hydrating. I double cleanse at night and use this followed by alpha ret skin better science with moisturizer on top. Really nice addition to a simple night skincare routine. In the morning I apply it after my hyacin active spray by Hdrinity. This product has never broken me out and I have combo skin. I will not try any other face mists because this is it.",
    "post_time": "Reviewed in the United States on January 8, 2024",
    "pid": "B0B3MTMZCC"
},
{
    "title": "Hydrating- non irritating. Refreshing mist.",
    "rating": "5.0 out of 5 stars",
    "content": "It’s not too thick or oily as cream base mist! It’s light feeling and it is cooling your skin. I’m glad Amazon has this product with reasonable price! I recommend to people who has sensitive skin. To get Korean cosmetic product in US takes a lot of importing tax so the cost is high for Korean cosmetic but this is not that high price for that.",
    "post_time": "Reviewed in the United States on January 3, 2024",
    "pid": "B0B3MTMZCC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the scent that it gives, and how hydrating it is on the skin. However, be careful because it can get a little sticky on your face. It creates the dewey look so I don't mind it that much.",
    "post_time": "Reviewed in the United States on February 1, 2024",
    "pid": "B0B3MTMZCC"
},
{
    "title": "Good Korean Mist",
    "rating": "3.0 out of 5 stars",
    "content": "I’ve been using this one for the last month. In the winter, my skin is too dry, and wanted to get high high-functioning mist. I think this product did not match with their explanation like long lasting moisture.",
    "post_time": "Reviewed in the United States on March 5, 2024",
    "pid": "B0B3MTMZCC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am sold. I happen to be one of those women who try all kinds of facial sprays. From drugstore to high end to make up brands. This one is special. It's hydrating, smells amazing and is worth every penny. At about $30 a bottle, it might seem steep but I will use it at night before my serums with out having to use a night cream. One less step!",
    "post_time": "Reviewed in the United States on September 28, 2023",
    "pid": "B0B3MTMZCC"
},
{
    "title": "Great for moisturizing",
    "rating": "5.0 out of 5 stars",
    "content": "It’s been a few weeks since I started to use this. My skin defines became softer and less breakouts! I can’t wait to try another PH line products!!",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "B0B3MTMZCC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's really convenient to use after washing my face. Really good!",
    "post_time": "Reviewed in the United States on November 28, 2023",
    "pid": "B0B3MTMZCC"
},
{
    "title": "Structure was good but not sure function",
    "rating": "5.0 out of 5 stars",
    "content": "Love the mist, and moisture it gives. Smells so nice and it’s refreshing.",
    "post_time": "Reviewed in the United States on October 21, 2023",
    "pid": "B0B3MTMZCC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I heard this brand from my friend in Korea. I ordered for myself and loved it! I personally think it’s one of the best face mists i ever used. I order few more for my friend’s birthday.",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "B0B3MTMZCC"
},
{
    "title": "Best for hydration!",
    "rating": "5.0 out of 5 stars",
    "content": "I have used this product since Korea.",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B0B3MTMZCC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It's great that it's sold on Amazon.",
    "post_time": "Reviewed in the United States on December 1, 2023",
    "pid": "B0B3MTMZCC"
}
]