[
{
    "name": " The Wager: A Tale of Shipwreck, Mutiny and Murder ",
    "stars": [
        "60%",
        "29%",
        "9%",
        "2%",
        "1%"
    ],
    "pid": "B0B9T7F9RR",
    "ratings": "32,043 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "Reads Like A Historical Novel",
    "rating": "5.0 out of 5 stars",
    "content": "WOW! Quite a story. This is an enjoyable and easy read. Lots of twists and turns.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Incredible to imagine that people survived such dire circumstances.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Grim, grimmer, grimmest",
    "rating": "5.0 out of 5 stars",
    "content": "Gann is a masterful writer.",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Wager is a good story about an awful experience. Shipwrecked on a desolate  island off one of the earth’s most godforsaken coasts, the crew of HM Wager, a man of war, eked out a tempestuous existence trying to survive and escape. Their numbers reduced to a fraction of the original crew, they devolved into factions on enemies with former mates. Eventually, four or five groups made their way back to England, publishing accounts of their suffering in distinct contrast to one another.",
    "post_time": "Reviewed in the United States on October 1, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Powerful Stuff",
    "rating": "4.0 out of 5 stars",
    "content": "David Grann writes well and the book is a good read but even he seems overwhelmed by the multitude of warring primary narratives. The reader is allowed to founder and is hard pressed to choose a central truth. Ultimately, it doesn’t matter whose narrative one chooses, for they are all completely grim.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Let me begin with the answer to a direct question: is this book better than KILLERS OF THE FLOWER MOON?  Yes, and by a wide margin.  This is a historical tale that draws on the powers of fictional narrative.  First and foremost, the story must be true.  Hence, the success of the story rises or falls on the quality of the historical incidents themselves, because the resulting story will directly affect the elements of the narrative that are essentially novelistic: characters, themes, setting and plot.  The story of the Wager satisfies each of those elements.  In other words, David Grann chose wisely.  And such choices are always guesses, to some degree.  Once the commitment is made to sift through mountains of documents and other evidentiary material, the die has been cast: the resulting story could be a crashing bore; key questions might never yield satisfactory answers; plot lines could end in blind alleys; themes could prove to be maudlin commonplaces, and so on.  Not in this case.  We have an array of fascinating characters, a great adventure story, a novelistic plot, a riveting setting and a sobering set of lessons learned.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "David Grann Wrote A BigDog Book!",
    "rating": "5.0 out of 5 stars",
    "content": "Basically we are in the War of Jenkins’ Ear; a set of British ships under the great seaman George Anson is dispatched to intercept and capture a Spanish galleon loaded with treasure.  The voyage involves the negotiation of the treacherous winds and waters around Cape Horn.  One ship—The Wager—is crushed against the rocks and the men must attempt to survive hunger, disease, and, as we say, insuperable odds, to somehow return to England and stand trial for their actions in Patagonia.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased the book as a backup for other books in my reviewing queue that were about to ship.  After being disappointed by KILLERS OF THE FLOWER MOON, but seeing the hype for THE WAGER, I decided to read it until more interesting books arrived.  However, once I started to read it I simply could not stop.  Only one small quibble: the book ends with what the author (SPOILER alert) considers a reflection on the evils of empire.  In other words, a dash of seasoning from the Woke shaker.  Ultimately, the story is relevant for our own times and our own preoccupation with colonizers/colonized/oppressors/oppressed, etc.  It is worthwhile to point out that every thinking writer in the 18th century (especially the putatively most ‘conservative’ ones, Johnson and Burke) were opposed to the aspirations of empire, particularly as they involved self-interested motives.  The book is being described as Master and Commander meets Lord of the Flies.  Fair enough, but the brief, third act brings everything down to the seedy world of politics.  The book does not end on some high, moral, virtue-signaling ground, but in the world that is simply all too familiar.  Bishop Sheen said he gave up on politics after Pontius Pilate.  Amen.  That does not undercut the impact of the story.  It simply reinforces the usefulness of James Ellroy’s category of ‘tragic realism’ and, in this case, the manner in which politics can dilute actions of heavily-compromised courage and determination and render them (publicly) mundane.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Incredible Story",
    "rating": "2.0 out of 5 stars",
    "content": "I absolutely loved The Wager.  As my headline suggests, I consider this to be a BigDog book.  What constitutes a \"BigDog\" book?  It has to be the right combination of Information, Amusement and Never Being Able to Put it Down.  David Grann did all three at a very high level.  I think I love this guy, David Grann.  He must have worked so damn hard on this book.  The amount of scribbles and scrabbles he was probably trying to decipher from these dumb 250 year old ship logs!  It must have been so tedious.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "But Grann did it.  He went to work and researched the tits out of this story.  And sure, there are certainly holes he must have approached in the story and realized that he would have to creatively fill those in.  That, in my opinion, is to be expected.  Not only did Grann fill those holes, he did it expertly and seamlessly.  Do YOU know why we have the phrase \"3 Sheets To the Wind\" as a euphemism for being drunk?  Well, throughout this history of the British man-o-wars, David Grann teaches you that there's more to being a shipman than knowing a few knots & phrases.  It takes guts and sometimes, even honor.",
    "post_time": "Reviewed in the United States on September 26, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "A tale of futility, extremely well told",
    "rating": "4.0 out of 5 stars",
    "content": "I'll admit that I was not particularly pleased when my book group determined to read this title, but a title I would have preferred had already been strongly resisted by another member, and I had no real objection, so I determined to get on with reading it. If nothing else, it would expose me to David Grann's writing style, which I would see quite a bit more of when I eventually get around to Killers of the Flower Moon, which has been on my TBR list for a while now. Getting into this account of an 18th century shipwreck of which I'd never heard quickly proved much more engaging than I had dared to imagine, and if the period's events, politics and people are of any interest, The Wager is well worth the time spent reading it. The doomed vessel was one of a fleet sent by the British Navy in hopes of capturing a Spanish treasure ship and avenging an injury to a British captain. The mission would involve making the dangerous passage around Cape Horn to the Pacific, and the Wager was not alone of its company in failing to reach the other ocean.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A notable element of tracing these events is how many of those involved, from the ship's captain down to a pair of midshipmen, wrote contemporaneous logs or journals of the voyage. Additionally, several accounts, from divergent perspectives, were published as various groups of survivors made it back to England. So the modern historian has an abundance of contemporary sources on which to draw, and Grann has clearly familiarised himself with most, if not all of them.  And he recounts the events of the court martial convened to determine the degree of responsibility to be assigned to the various survivors in the face of their conflicting accounts. Finally, he invites the reader to see these events in the light of history and what were the results.",
    "post_time": "Reviewed in the United States on October 16, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Grann's Gift as a Story-Teller on Full Display",
    "rating": "5.0 out of 5 stars",
    "content": "Grann’s Gift as a Story-Teller on Full Display",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In the first half of the 18th century, Britain already had the most powerful navy in the world. But financing that navy was a huge burden on the Crown and England had not yet achieved the wealth that the industrial revolution and its own colonization efforts would later bring. The answer: intercept the gold and silver that Spanish ships were bringing home from its New World colonies.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "The unbelievable hardships of 18th century sailors.",
    "rating": "4.0 out of 5 stars",
    "content": "Author David Grann is able to tell not only this larger story but also to resurrect one of the most astonishing seafaring events of the time. A ship named “The Wager” was to be part of a British fleet that would intercept gold-laden Spanish vessels in what was officially-sanctioned piracy. As the book’s cover indicates, what then transpired was shipwreck, mutiny and murder. This is also the story of unexpected survival and efforts in an Admiralty court back in England to establish the truth of what happened.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Life on board a ship at the time, so full of danger and disease that it was not unusual for as few as ten percent of the crew to survive a long voyage, meant that the Royal Navy had great difficulty manning its ships. Grann provides graphic descriptions of able-bodied and not-so-able-bodied men being kidnapped off the wharfs (“impressed”) to fill the complement of seamen just as a ship was about to sail. (Some years later the impressment of American seamen was a contributor to the War of 1812.)",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Couldn’t put it down",
    "rating": "5.0 out of 5 stars",
    "content": "The hulls of wooden sailing ships had a very short life-span due to wood-eating worms, and were susceptible to leaks and other threats to seaworthiness. Scurvy could render entire crews incapable of functioning. Other communicable diseases could cause widespread death on board a crowded, ill-ventilated vessel.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "In the case of The Wager, the author was able to find a remarkable record of its 1740 voyage and of the events to come. This was in part due to the fact that on board as a junior officer was John Byron, a gentleman volunteer and a compulsive diarist. Incidentally, he was the grandfather of Lord Byron.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "An amazing story",
    "rating": "5.0 out of 5 stars",
    "content": "Additionally, another major actor in the drama, John Bulkeley, had kept a voluminous diary which chronicled the events of the voyage. Buikeley held the position of Gunner, a crucial role in ship combat, and had many other responsibilities on board. He was an instinctive leader, physically imposing, who commanded respect.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Finally, there was the record of the court-martial proceedings themselves, in which the main actors including David Cheap, the captain, provided their own version of events. Cheap was an ambitious, younger son of a Scottish Laird who, under the rules of primogeniture, did not inherit his father’s estate. He ran off to sea at 17 and set his sights on becoming a captain, which he realized when an opening occurred on The Wager.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Nicely written book about a little remembered event",
    "rating": "4.0 out of 5 stars",
    "content": "The book is well written and well researched.  It’s definitely a handsome looking book to have about.  It’s a fairly short book that seems larger due to its large index, bibliography and notes sections at the end.  The addition of images in the middle of the book are nicely done.  If I had to nick the book I’d just say that it seems to build and build only to a rather dull and abrupt conclusion which, I suppose, is more from the actual events than the writers doing.  I’m not sure if there was more to add into the events once the characters return to England or not, but it would’ve been nice to have some more.  The lack of drama from the actual court martial was somewhat anticlimactic but since it’s a book based on facts not fantasy I guess it is what it is.  I’d still recommend it to those who enjoy military, naval or just history in general but it’s not likely a book that the masses would be particularly interested in.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The Wager, as the subtitle suggests, is a tale of shipwreck, mutiny, and murder.  It is a masterfully woven presentation of the ill-fated English campaign that set sail in 1740 during the English-Spanish conflict, the wreck of one of the English ships on the campaign:  the Wager, the years-long efforts of a small group of its seamen to survive against all odds, and  the court marshal that followed their surprising arrival back home.",
    "post_time": "Reviewed in the United States on April 26, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "A Masterfully Researched Work of Non-Fiction that Reads More Like Fiction",
    "rating": "5.0 out of 5 stars",
    "content": "The Wager is not the type of book I'd normally choose to read, but after it won the Goodreads Awards, Best History and Biography in 2023, as well as the Libby Book Awards - Best Adult Nonfiction in 2024, and was named a best book of the year by The New York Times, The Wall Street Journal, The New Yorker, TIME, Smithsonian, NPR, Vulture, and Kirkus Reviews, I had to see what all the fuss was about.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "For a work of non-fiction, the story was a masterfully written tale woven together through extensive research of journals, books, logs, and more.  The book read more like a work of fiction than non-fiction, introducing the reader to the seamen, and then pulling the reader into the ill-fated venture and the struggle of these men to hold on to life, at great physical, mental, and emotional cost.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Incredible book- fantastic narration",
    "rating": "5.0 out of 5 stars",
    "content": "All in all, I found The Wager to be a worthwhile read, even if it will likely not find its place a the top of my favorite books of the the year list.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "As a side note:  One thing that really struck me when reading was just how many of our modern day colloquialisms come from \"sea-speak.\"  Sayings such as under the weather, toe the line, and pipe down all had their start on a ship!",
    "post_time": "Reviewed in the United States on August 31, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Captivating Story",
    "rating": "5.0 out of 5 stars",
    "content": "Incredible story -- remarkable what humans are capable of enduring!  The narration on the audiobook is excellent-- exceptionally done keeping pace and excitement throughout.  Strong recommendation!",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The author obviously did a lot of research for this book and it’s is very detailed.  He goes off on a few tangents but the accounts of the ships struggle against the weather and all the hardships along the way was riveting.  The characters were well developed and you feel a sense of knowing these men by the end of the book.  Overall an excellent, but not an easy read (which is what I expected based on the subject matter).  Those familiar with sailing and nautical history will very much enjoy this.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Engaging story of survival",
    "rating": "5.0 out of 5 stars",
    "content": "\"The Wager\" by David Grann is a gripping historical account that dives deep into the harrowing journey of a British shipwreck in the 18th century. Grann's meticulous research and vivid storytelling bring the perilous voyage and the ensuing struggle for survival to life. The book expertly balances historical detail with narrative drive, making it both informative and captivating. Through compelling character portraits and dramatic scenes, Grann explores themes of endurance, leadership, and human nature. \"The Wager\" is a must-read for any nautical history buff, or anyone who enjoys a well-told tale of adventure and resilience.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The Wager was an English ship that set sail from England in 1740 during an imperial war with Spain. It was the mid-1700s, and navigational tools were primitive. Diseases among the seafarers spread rapidly, and I was incredulous, realizing how little they knew about curbing nutritional deficiencies such as scurvy. It seems absurd that in addition to not knowing about the necessity for vitamin C, insufficient levels of niacin were causing psychosis and night blindness resulting from lack of Vitamin A. After shipwrecking on a desolate island off the coast of Patagonia, the story is as much about human nature as it is about surviving on an island and attaining its mission against the Spanish. It is fascinating to read about how they discovered new food sources and what they chose to learn and ignore from natives whose cultures had thrived in the areas where the Englishmen became castaways. If they were going to continue to survive and continue their naval mission, they had to build new boats without the technology available in their homeland, and there were myriad disagreements about how to proceed and also about which path to follow when it was time to embark on the dangerous waters again. Disharmony leads some groups to set sail in opposite directions eventually. When the survivors arrived back in England, the accounts of what happened were not in sync.",
    "post_time": "Reviewed in the United States on May 3, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Well written, but mostly imagined",
    "rating": "4.0 out of 5 stars",
    "content": "It’s an amazing tale of human survival. Grann keeps the action moving, although it’s bogs down a little in the middle. My main quibble is that much of the action and dialogue are extrapolated from logs and books that were either terse or self-serving. Many times in the book, I felt like the need for drama turned this into a work of fiction, rather than n9m-fiction.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A very interesting historical narrative, about one of two pronged pirate attacks from England against Spain during the War of Jenkins Ear. One was the disastrous attack against Cartagena de Indias, where the English pirate fleet was repelled by the troops commanded by Blas de Lezo. The Wager narrative tells about another expedition that crossing into the Pacific through Cape Horn was to attack Spain in Western America and Philippines.  Many of the participants die horribly during the trip, even before reaching the tip of South America. One of the ships, the Wager sinks in what is now southern Chile. The few survivors struggle mightily, die, and eventually a handful make their way back to England. Spain remained a master of the Caribbean and Pacific. Author doesn't miss a chance to lie about Spain and its supposed cruelties.",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Spain remained a master of the Caribbean and Pacific",
    "rating": "5.0 out of 5 stars",
    "content": "Fascinating story about 1740’s and living conditions on ships. As well as survival boing around South America.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was educational but very hard to put down as well! The things the men went through and still survived are amazing.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Great Read!",
    "rating": "5.0 out of 5 stars",
    "content": "This book is about a ship wreck that the author so perfectly places in its historical context. I loved this story, and the author’s writing is spot on!",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fantastic read that really puts into perspective how hard and tragic life was for sailors in the 18th century while also telling an incredible story that’s stranger than fiction. Highly recommend.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "A page turner!",
    "rating": "4.0 out of 5 stars",
    "content": "Where goes the body, the mind and spirit follows. Testing socially our animal instincts and compassion of youth. Good read,",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Package received early. The personal card included was very touching.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "A Page Turner",
    "rating": "5.0 out of 5 stars",
    "content": "Author David Grann recounts a seafaring adventure like non other from the mid 1700’s. I loved the preposterous idea of the whole British expedition to locate and capture a treasure ship on the other side of the world in an era of basic navigation by the seat of the pants! The British scheme to hijack and capture a Spanish galleon is to be carried out by a squadron of five British warships. One of these ships, HMS The Wager, is under the command of Captain Cheap who revels in the idea that he will have battles befitting his desire to become a war hero. When the flotilla departs Britain, they are hounded across the Atlantic by warships under Don Jose Pizarro of Spain. After typhus strikes the crew and they finally reach neutral Brazil for a respite, the fleet continues south to Cape Horn despite continued disease, scurvy and malcontent among the sailors. Disaster strikes south of the Horn, separating the ships, leaving The Wager alone, damaged and essentially unable to sail, off the coast of southern Chile. When the weathered ship finally is blown into rocks off an uninhabited coastal island, she is abandoned, raided of her stores, lifeboats, weapons and gunpowder. The fragmented survivors set up camps for each faction on the island and try to survive on limpets and seaweed as summer ends and the cold Chilean winter sweeps in from the Antarctic south. What ensues is an adult real-life version of Golding’s “Lord of the Flies”, leading to near mutiny, death, starvation and feuding that eventually sends the few survivors off in tiny makeshift boats in different directions. Captain Cheap and his remaining followers headed North toward Chiloe Island governed by the Spanish. Meanwhile, the Gunner, Bulkeley and a larger group head south to weather Magellan’s Strait in hopes of reaching England. The few survivors who do make it back to Britain then must convince the Admiralty and public that they are not mutineers and subject to justice by being swung from a yardarm. The book is a masterful piece of British Naval history, and well worth the read for anyone interested in the human ability to survive under the most horrendous of conditions at sea.",
    "post_time": "Reviewed in the United States on December 17, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Interesting read",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Masterful",
    "rating": "5.0 out of 5 stars",
    "content": "The Wager: A Tale of Shipwreck, Mutiny, and Murder. David Grann.  Doubleday, 2023. 352 pages.",
    "post_time": "Reviewed in the United States on August 23, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "On January 28, 1742, a thing that could very loosely have been called a boat - more like boat-ish, washed up on the shore of Brazil. On it were about thirty barely living men who had once been part of the crew of the British ship called The Wager that had left England in 1740 as part of a small fleet off to harass the Spanish in the so-called \"War of Jenkin's Ear\" or the War of Austrian Succession. They seemed to be all that was left of a crew of a couple of hundred, and they told the story of their wreck off the southern tip of South America, their survival on the desolate landscape for months, and their incredible 3000-mile-long voyage to Brazil. But, wait, there's more! Six months later an even sadder boat washed up on the coast of Chile, with just three inhabitants, including the ship's captain, and they added a new layer to the tale:  murder and mutiny.  When the survivors finally arrived back home in England, having been away from their loved ones for 4 or 5 years, accusations flew back and forth, various accounts were published, and the public was enthralled by the mystery and drama of what exactly had happened to The Wager and its crew.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Fascinating sea saga",
    "rating": "4.0 out of 5 stars",
    "content": "David Grann is the author of Killers of the Flower Moon, and he has established himself as one of the top writers of narrative nonfiction working today. His follow-up to Killers doesn't disappoint. The reader will learn a lot about life on a 1740s British warship and about how the command structure within the navy operated, but Grann also succeeds in bringing the men to life and telling their stories and how they dealt with their tragedy and hardships.  Some men behaved more nobly than others, of course, but all suffered.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Grann also relates the story of the shipwreck and subsequent court-martial to the bigger picture: empire. This incident occurred at the time that the British empire was really in ascendancy. The British performance in the War of Austrian Succession and the possibly embarrassing public spectacle of a high-profile mutiny trial might have had a major impact on Brittania's rule over the waves, and the world.  Grann explores how all these big-picture ideas intersected with the very specific fears of some of the surviving crewmen that their careers and lives were at stake.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "a glimpse of the past",
    "rating": "5.0 out of 5 stars",
    "content": "One of the most intriguing sea tales ever written. Amazing story of survival and determination.",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Like the title says, it was a nice glimpse of the past. This book showed how life on a ship used to be. Normally, I would not be interested in a book like this but, I could not stop seeing it everywhere. I’m glad I gave this book a chance.",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Quite a tale of human survival",
    "rating": "5.0 out of 5 stars",
    "content": "This is my second David Grann book, and he's consistent with quality, engaging narrative fiction. This seemed like a non-fiction Lord of the Flies to some extent. Grann introduces the characters, gives them life, and does his best to string together the events that illustrate the breakdown of order when life becomes a struggle to survive.",
    "post_time": "Reviewed in the United States on December 10, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wow this was such an incredible, thrilling story—a definite must read. Set in the 1740’s, it’s a true story based around the HMS Wager involving a court martial where two groups of shipwrecked British sailors accuse each other of mutiny + murder.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Excellent writer!",
    "rating": "5.0 out of 5 stars",
    "content": "David Grann pulled out all the stops in this harrowing tale of the British ship Wager that embarked from England on a secret mission against Spain; to capture a Spanish galleon for it’s treasure aboard. It begins in Britain—with no sailors available to help man the ship they resorted to unfathomable acts.. (unbelievably) of paying gangs to snatch up unsuspecting men and forcing sick + (aging) invalid soldiers aboard as sailors on the ship.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "David Grann writes of the shipwrecked sailors that survived.. only to fight for survival and dominance on what is now called “Wager Island” (some resorting to abominable acts.) Two years later (1742) a patched-up boat of thirty men landed ashore in Brazil with tales of heroism—six months later another three in Chile with tales of mutiny.. this is a fascinating tell-all of the true story behind what really happened onboard the HMS Wager.",
    "post_time": "Reviewed in the United States on May 23, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "A Sea Saga: Mutiny, Myth or a Dash of Both?",
    "rating": "4.0 out of 5 stars",
    "content": "David Grann, an award winner non-fiction author, has done his best to tease out the facts of the history of the British vessel, the Wager.  Britain was at war with Spain. In 1740, the re-fitted merchant ship, Wager, joined a fleet setting out to capture a Spanish galleon loaded with treasure. The galleon had been sighted off the coast of Patagonia. Many on the Wager were enlisted naval men, but most were \"pressed\" into service and were of questionable character.  On route, typhus killed the Captain and many of the original crew.  Other sailors succumbed to scurvy.  A young, inexperienced Captain, David Cheap was put in command of the Wager.  Severe storms in the Strait of Magellan in addition to faulty navigation techniques, caused the Wager to shipwreck on a desolate island. There were sailors, who could not swim and they drowned in their attempts to swim ashore.",
    "post_time": "Reviewed in the United States on July 1, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The survivors were weak, starving and frightened.  Many were angry at the Captain and blamed the shipwreck on him.  Three sects formed: those loyal to their Captain, those loyal to the gunner, John Bulkeley, and those loyal only to themselves.  Captain Cheap did his best to keep a \"stiff upper lip\" and impose the chain of command codified by the British Navy.  Cheap shot and killed one sailor for stealing from their meager food supplies.  This deepened the rift and strife among the factions.",
    "post_time": "Reviewed in the United States on July 22, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Romance of the Sea - Not",
    "rating": "4.0 out of 5 stars",
    "content": "Separate groups sailed for home at different times and some made it to Britain.  Once the history of the Wager was revealed, a court-martial tribunal was formed against the mutineers.  If found guilty, they would be hanged. In the end, all were acquitted.  Was this a \"white-wash\" by the British naval court or a moment of compassion and contrition? Several of the survivors wrote their own accounts of the wreck of the Wager.  Between the embellishments and omissions to save their own necks and their naval careers, the sailors published their yarns. Grann deserves kudos for trying to present the many sides of this naval",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "episode.",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Intriguing  true story",
    "rating": "4.0 out of 5 stars",
    "content": "It seems to me there have often been romanticizing of sea voyages of the 17th, 18th, and even the 19th centuries.  Perhaps with exception of Mutiny on the Bounty, movies of larger than life heroes and brave captains fighting off pirates never fully depict the horrible reality of life on any of those warships.  David Grann’s detailed story of the doomed Wager voyage quickly puts an end to any romantic fantasies of life at sea.  Ships then were crowded , dark and filthy. Living",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": " quarters were extremely small, cramped, hot and putrid smelling, infested with rats and other vermin.  They were often leaky with constant need to pump seawater out.  Stouthearted hardworking sailors in those days endured such",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Solidly Researched but 3 1/2 Stars...",
    "rating": "4.0 out of 5 stars",
    "content": "things, as well as, poor and sometimes rotten food, They often became gravely ill with scurvy.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the backdrop for an ill fated mission and a series of bad decisions, unimaginable violent storms, and a stubborn mission blinded captain who won’t concede to the reality of  failure once the Wager is shipwrecked.  Despite the desperate living conditions and having no ship, he irrationally pushes to find a way to continue the mission of capturing a treasure laden Spanish galleon. The tedium of the crew’s brutal fight for life in it’s excruciating detail as days, weeks and months pass bring the reader into a fuller understanding of the conditions and what they endured.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Surviving a shipwreck",
    "rating": "5.0 out of 5 stars",
    "content": "A number of men, including the captain, eventually survive.  In various separate small groups each with their own first hand versions of the events eventually stagger back to England where they face Court Marshall.  The intricacies of the Court",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Marshal, its final decision and what happens to the individuals make for a gripping ending.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Truth is always stranger than fiction!",
    "rating": "5.0 out of 5 stars",
    "content": "This well-written page-turner depicts the humanity of 1700s sailors as they fight the engulfing elements, the black sea, and their fellow man in the poorly-planned expedition of an empire.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The Wager is more than a shipwreck tale. It about human heroics, adventure, leadership, perseverance, survival and hope. It also about the shadowy dark-side of humanity.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "The Wager is a page turner",
    "rating": "4.0 out of 5 stars",
    "content": "This book was really so good. The author does such a great job of retelling the story of these men and really making you feel what it is then endured I. Their time away from England. It makes you wonder what you might have done e or who you might have sided with given the opportunity.",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Enjoyable.  The author makes you feel like you are actually on the ships, in the storms and stuck on that horrific island.  He shows the many sides to the story.  Well done",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "definitely recommend!!!",
    "rating": "5.0 out of 5 stars",
    "content": "First of all, great book!  If you like Eric Larson, you will certainly like David Grann.  Well researched history wedded with the heart of a story teller.  Nothing dry and dusty here.  Other people have elaborated the merits so now for my main issue.  Some people prefer to read without the interruption of footnotes.  Some like to consider the additional information as they read.  I am in this later category and my comment is for those who feel likewise.  In formatting this book for Kindle, the publisher does not use numbered notations accessible in the main body of the text.  When a reader has finished the last chapter, IF choosing to page through what follows, there are additional treasures, among these, the \"notes.\"  Supposing the reader scans through these, and finds something of interest?  One can link BACK to the text ( and then, back to the \"notes), but there is no way to come upon the \"notes\" WHILE READING THE MAIN TEXT.  I guess I just like a little more foot in my notes, thank you very much.  I don't believe it's too obtrusive to have that little number woven into things.  Readers who don't care for the diversion can just glide by, so what's the deal???  Sigh.",
    "post_time": "Reviewed in the United States on October 8, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Ok.  One other \"noteworthy\" ( HeHeHe) item: I read this on a Fire tablet and on a Paperwhite and in the Paperwhite the pagination ended with the main text and \"book complete\" appeared instead.  I'm not a fan of this.  I get that some folks want credit for finishing a book without the hassle of paging through a host of addendums, but really, must the rest of us do without?  Gaaaah!",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Fascinating Read",
    "rating": "5.0 out of 5 stars",
    "content": "This book will give you a detailed sense of serving in the British navy during the",
    "post_time": "Reviewed in the United States on March 31, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "18th century. It is a harrowing tale.",
    "post_time": "Reviewed in the United States on September 9, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "A comment on the \"notes\" in the Kindle version",
    "rating": "5.0 out of 5 stars",
    "content": "Not a fan of such stories it rolled up in our book club. So I dove in like a good student and began the struggle. At times Fascinating and also over bearing, i plowed on like the good seamen of its tale. At times I took a break yet was nudged on by others also on this journey.",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Constantly impressed by the rigor and detail provided me, I was immersed at sea, learning, battling huge waves, hunger, set back after set back. Yet before long I was impressed at the many who struck out on uncharted waters to discover our seas as they really are...not what was assumed at the time,",
    "post_time": "Reviewed in the United States on March 14, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "good read about British navy in 1700s",
    "rating": "5.0 out of 5 stars",
    "content": "\"The Wager: A Tale of Shipwreck, Mutiny, and Murder\" by David Grann is a gripping narrative that delves into a remarkable historical episode. Grann, known for his meticulous research and compelling storytelling, shines in his exploration of the 1741 Spanish expedition led by Captain Juan de Amezquita. The book unfolds the harrowing ordeal of the crew aboard the shipwrecked vessel, \"The Wager,\" including their struggles for survival, the mutiny that ensued, and the subsequent descent into murder.",
    "post_time": "Reviewed in the United States on November 13, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Grann masterfully weaves together the historical facts with vivid descriptions, bringing to life the desperation and lawlessness that prevailed in an era of maritime exploration. His narrative is both educational and engaging, providing a window into the challenges of 18th-century seafaring and the human spirit's capacity for both heroism and depravity.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Historical fiction based on true events.",
    "rating": "4.0 out of 5 stars",
    "content": "What stands out in Grann's writing is his ability to humanize the historical figures, turning them from mere footnotes in history into complex characters. He examines their motivations, fears, and the moral dilemmas they faced, adding depth to the story.",
    "post_time": "Reviewed in the United States on April 30, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The book also sheds light on the broader historical context, including the geopolitical tensions of the time and the perils of maritime exploration. Grann's thorough research is evident throughout the book, and his storytelling prowess ensures that the narrative is not just informative but also incredibly engaging.",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "good read",
    "rating": "4.0 out of 5 stars",
    "content": "Overall, \"The Wager\" is a testament to David Grann's skill as a writer and historian. It is a fascinating, well-researched, and compellingly told story that is sure to captivate readers interested in history, adventure, and the complexities of human nature.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "While this book is based on the true event of the Wager's shipwreck, the author makes it more relatable by placing the reader in the scenes. It is easy to \"see\" how this shipwreck could have happened and the subsequent events that happened. No doubt the author researched the shipwreck and based the shipwreck on facts and the repercussions of the shipmates' actions.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Interesting Read",
    "rating": "5.0 out of 5 stars",
    "content": "It is unimaginable the difficulties that the men faced on these long sea voyages. The ones that survived had amazing stories to tell. I was surprised that the British would sail half way around the world to engage the Spanish ships.",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The Wager is a great historical tale.",
    "post_time": "Reviewed in the United States on December 30, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Purchased as a gift",
    "rating": "5.0 out of 5 stars",
    "content": "This is an account of which I had never heard. It was so interesting to learn about the life of a seaman during this time.  It is amazing that anyone survived at all to tell the story.",
    "post_time": "Reviewed in the United States on May 31, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "She liked it.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Fascinating story",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent story telling. Easy to get wrapped up into it. Book arrived in great condition.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A great maritime novel based on true events.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "A great read.",
    "rating": "4.0 out of 5 stars",
    "content": "I just finished reading the book the \"Island of the Blue Foxes\" which is a tale of the Bering expedition from Siberia to Alaska.  One of two ships the St. Peter gets marooned on what is today known as Bering island off the coast of Kamchatka.  The stories are extremely similar in terms of how the hierarchical order on the ship was abandoned in the society created on land. What's more amazing is that the stories involve literally the same year 1741 and 1742.  Instead of being shipwrecked in Patagonia, this group is shipwrecked in the Artic!  Both groups take the remnants of the former ship and create a new boat which takes them to safety.  It would be interesting to read these books back to back to note similarities and differences in the stories.  Leonardo Di Caprio, probably could have purchased the screenplay for this book for much less and it is equally if not more exciting than the story of the Wager.",
    "post_time": "Reviewed in the United States on September 1, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve been an avid reader my whole life but I’ve been having trouble finding books that hold my interest lately; I feel like I’ve read it all before. This one I had no trouble enjoying every moment and detail, and the most outstanding part was that it’s all true. I’ve been recommending this book to everyone. The audiobook narrator was excellent as well.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Blue Foxes I'll Wager",
    "rating": "5.0 out of 5 stars",
    "content": "Highly recommend this riveting tale of life on the high seas in the mid 1700’s. Incredible obstacles confronting men of all ages and backgrounds. Heartbreaking and inspiring at the same time.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The author does a great job of setting the stage and keeps things engaging. Every time I thought things could not get worse for the crew, it became that much worse.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Absolutely loved it",
    "rating": "4.0 out of 5 stars",
    "content": "My husband enjoyed it.  First book I’ve ever bought him that he liked!",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A gripping novel, masterfully told. I wish that it were longer! The courage required of the men to undertake these voyages is inspiring!",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Utterly Fascinating",
    "rating": "5.0 out of 5 stars",
    "content": "The Wager is a gut-wrenching story. The living conditions aboard the ship are terrible. The storms in that latitude are incessant. The crew is ravaged by disease, and the reader becomes inured to casual death. The ship’s young captain, through no fault of his own, misses the best season to round Cape Horn but is obliged to try, since his commanding officer has apparently succeeded, albeit in a larger, safer, and better crewed vessel. Critically, accurate navigation is impossible due to the inability, at that time, to accurately calculate longitude. The fact that the ship is wrecked is in the subtitle so it’s not a spoiler. But what happens after that is, well, the reason the book is selling better than, say, Endurance or Resolute. Whatever the phrase “against all odds” means, this book redefines it to the most improbable extreme. The outcome of the court martial in the final pages is so unexpected it might have come out of a novel. The Wager is a thrill to read but it may give you nightmares. If it doesn’t, try sailing around Cape Horn yourself in the wrong season.",
    "post_time": "Reviewed in the United States on December 28, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm no book critic so all I can say is that I was captivated by this true story, albeit with perhaps a little creativity. It's truly difficult to imagine what it must have been like to be onboard but the write does a great job of immersing you in the conditions.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Incredible well told tale of desperate actions",
    "rating": "5.0 out of 5 stars",
    "content": "This is simply a great read, a page-turning educational adventure story similar to Mutiny on the Bounty and most similar to Nathaniel Philbrick’s great seafaring whaling book, “IN THE HEART OF THE SEA, the Tragedy of the Whale Ship Essex”.  The Wager is about a small ammunition ship assigned to a squadron that sets out from the UK to take on the Spanish (and steal some plunder). The route is around the Great Horn’s intense storms and unmapped route.",
    "post_time": "Reviewed in the United States on May 5, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": " What is intensely interesting in Grann’s telling is how a warship in 1742 was fitted and the number of bodies needed to keep it afloat. The Wager had a crew of just over 250, but it was not unusual that larger ships needed well over 500. Not soon after departing Southampton the crew began to die off from Scurvy. The Wager then was caught in a violent storm after going around the cape still determined to chase Spanish treasure… the ship was pushed and wedged between two rocks onto a desolate island off the coast of Patagonia. The surviving crew became castaways… and enemies in separate groups, primarily pointing fingers at the ship’s captain's incompetence. Survival was nearly impossible; then came desperate ideas of their fate causing a mutiny… leading to several attempts to sail back to the UK all the while trying to avoid becoming Spanish prisoners. Amazingly, several groups did over several years get back to tell their stories. From these various published versions David Grann has woven his increasable tale of the sea and survival.",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "enjoyable read",
    "rating": "5.0 out of 5 stars",
    "content": " Simple a great read and just a must if you like your history narrated by artistry.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great account of naval history on the seas in the early 1700’s.  And how all order fell apart as the men became desperate.  Well written.  Informative and a good read.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Historic",
    "rating": "4.0 out of 5 stars",
    "content": "Good read. Couldn’t put it down. Found myself doing research on events written in the book",
    "post_time": "Reviewed in the United States on June 2, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "An adventure true story that deservedly has been a best seller for many months. Our book club discussed it for 3 weekly meetings and all 20 of our members thoughly enjoyed It.",
    "post_time": "Reviewed in the United States on May 3, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "A very well written and researched true adventure.a",
    "rating": "5.0 out of 5 stars",
    "content": "I like stories of the sea and have myself crewed on a tall ship.  I can only imagine the conditions under which the men in these stories must have experienced.  There are three or more groups that develop once the Wager wrecks -- the Captain and his followers, the Gunner and his, and some miscreants who didn't follow either.  They each try to escape their solitude of the shipwreck with sickness and hunger, and most of the major book characters actually make it back to England eventually.  Many of them tell conflicting stories or write popular books about their experiences.  The English Naval courts find the whole matter troubling, and basically let everyone off.  I expected dramatic court proceedings that would clarify, in my mind, who were the real heroes of this book.  In the end, all were victims of an imperialistic government that sent such men to their doom so many times on ill-fated expeditions.  It is a tribute to human endurance, and the skill and fortitude of British seamen, that a fraction of those that set out actually survived with a story to tell, embellished as necessary to save their careers and their necks.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you wish to leave your world for a couple of days be sure to buy this book. Okay, I'm thinking we are going to have a shipwreck and then a mutiny or both. That is way too simple. Mr. Grann told this story by putting the reader at the scene. It felt like many times I was just there watching this story evolve around me.",
    "post_time": "Reviewed in the United States on July 16, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "An Earnest, Thorough Effort to Tie Together Disparate Stories",
    "rating": "4.0 out of 5 stars",
    "content": "Then again, just when one believes he knows where the story is going, off you go in a totally different direction.  This story has it all, intrigue, suspense, plot twists and an ending I didn't see coming.",
    "post_time": "Reviewed in the United States on April 18, 2023",
    "pid": "B0B9T7F9RR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "History is always interesting but when one tells it with flair while using exact quotes, well one is surely going to be entertained.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0B9T7F9RR"
}
]