[
{
    "name": "        Magic Bullet Mini Juicer with Cup, Black and Silver       ",
    "stars": [
        "72%",
        "13%",
        "5%",
        "3%",
        "6%"
    ],
    "pid": "B0BF2T71GS",
    "ratings": "2,737 ratings",
    "other_info": {
        "Brand": "Magic Bullet",
        "Color": "Silver",
        "Special Feature": "Dishwasher Safe",
        "Product Dimensions": "7\"D x 6\"W x 11.5\"H",
        "Finish Type": "Silver"
    },
    "discount_price": "$ .",
    "normal_price": "$69.99",
    "about_this_item": [
        " A powerful 400-Watt motor extracts all the juicy nutrition from your favorite fruits and veggies.  ",
        " A roomy 2-inch feed chute fits larger chunks of your favorite ingredients. Translation: less chopping, more juicing.  ",
        " We keep it tidy with top-rack dishwasher-safe attachments and a silicone spout cap that catches drips before they hit your countertop.  ",
        " Juice directly into our 16-oz cup, which comes with a twist-on to-go lid for spill-free sipping and portability.  ",
        " This juicer takes up way less space than standard models, making it a breeze to keep on the countertop or tuck away for later.  ",
        " Includes 1 year limited warranty.  ",
        " NOTE: Refer to User Manual before use  ",
        " Product built to North American & Canadian Electrical Standards  "
    ]
},
{
    "title": "Juicer",
    "rating": "4.0 out of 5 stars",
    "content": "Love the juicer!!!",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Dislike the cleanup",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Great little juicer!",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and clean. Juices ginger and turmeric very well.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to get out, use and clean!",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "just the right size!",
    "rating": "5.0 out of 5 stars",
    "content": "The juicer is easy to assemble, use, and clean.  It's a great choice for me.  Minimum clean-up time is a plus. This was a great selection because I'm trying to get healthier, and this product makes it easier with no complicated steps to use.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve had so many juicers. This one is easy to clean and compact. If you have a fast paced lifestyle this is what you need for fast and easy morning juice",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Wonderful product!!!!!",
    "rating": "5.0 out of 5 stars",
    "content": "Great for the price compact and awesome",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like this because it saves on counter space and fits neatly into my cupboard. Not too many parts to assemble, and cleanup is easy. The hardest part of cleaning is cleaning out the filter of course, which takes some hard brushing. But in total, it takes me about six minutes to throughly clean everything and put it away, not bad.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Highly recommended!",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve put carrots through it, apples, cucumbers, celery, and kale. The kale wasn’t so great and didn’t extract much juice. The others had plenty of juice. I will keep trying different fruits and vegetables.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wow, I wasn’t expecting much with this. What a powerful little juicer. Perfect for my needs. Works wonders. Totally recommend if you don’t need to juice tons of things. I use it for making Ginger, turmeric, lemon, orange shots.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "It’s ok",
    "rating": "3.0 out of 5 stars",
    "content": "I got this specifically to make green juice to get more greens and it doesn’t handle leafy greens well even if you squish them into a ball like the instructions say it just spits a lot of them out without getting a lot of juice. It should say not recommended for leafy greens imo bc it’s not that effective for them is a waste of money to try to juice kale etc.. and not get juice. It works well w other fruits and veggies it’s way easier to clean than other juicers and it’s small so those are the benefits don’t recommend it if you want to use leafy greens though",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wasn’t sure about buying this since it was a little on the cheap side. I wanted something strong… and let me tell you… I was wrong!",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Little but mighty",
    "rating": "5.0 out of 5 stars",
    "content": "This one is small but very durable! I did my juices in no time and cleaning the parts aren’t has hard! It’s also small so you can put it anywhere’s",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very strong , does its jobs , don’t regret buying it. would recommend",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Love it",
    "rating": "4.0 out of 5 stars",
    "content": "I wanted to try juicing so I ordered this one because its compact in size and relatively inexpensive.  I was amazed at how easy it was to assemble and use.  Also, it was easy to wash and clean the parts after use.  But, I quickly found out that juicing requires a larger than expected amount of fruits and veggies to make a decent cup of juice!  I was going to try celery juice and a full head of celery cut up and juiced didn't even produce a full cup of juice so it would take a LOT of produce to get enough juice - could get expensive for frequent juicing!  So juicing may not be my new hobby but the machine works great!",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like how compact this product is.  It does juice well, but veggies get stuck easily, and at times I don't feel as though it could juice or extract the juice as well as I expect it too.  But using only a few times, I feel it gets the job done!",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Good machine but juicing not for me...",
    "rating": "5.0 out of 5 stars",
    "content": "I got this to replace a Jack LaLanne juicer that I gave away several years ago.  The LaLanne was too big and I didn't enjoy getting it out, setting it up, etc.  This unit is small, easy to set up or store, and perfect for a single person or couple.  I have been looking for a juicer that would be efficient, getting all the juice from the pulp, without making a mess/leaking.  So far this hasn't leaked at all.  I tested the pulp with a ham press.  After juicing several oranges, I put the pulp in a ham press and let the spring power compress the pulp for several minutes.  Not a drop of juice came out.  I am hooked.  And clean up was simple.  Pour out the pulp, and run under water.  The shredder basket is, of course, the most difficult - but with the included brush it's still pretty simple.  If you're looking for something small, simple, but that is worth the money?  This is the one you want.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love it! Remember it’s a “Mini Juicer” so it only makes about 32oz total before it need to be cleaned. If you are the type of person who doesn’t like to clean things this is not for you. You MUST clean this after every use. Works great! Can’t wait to try the next recipe",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Product as is",
    "rating": "4.0 out of 5 stars",
    "content": "It is small but has a great power for making juice",
    "post_time": "Reviewed in the United States on March 18, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is my first juicer so hard to compare it to others. I have no issues with it - it juices quickly and efficiently. I find that leafy items like spinach or cilantro seem to just run right through it and end up in large chunks in the garbage bin, but I know those don't have a ton of juice in them to begin with. It is a little cumbersome with all the pieces and having to get the sieve clean with a brush, but no real issues.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Less of a juice, more of a smoothie",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this juicer as an alternative to my Jack LaLanne Power Juicer. We were looking for a juicer that was less clunky, easier to clean/use, and more lightweight, but would still juice efficiently.",
    "post_time": "Reviewed in the United States on October 30, 2023",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Pros: This juicer is compact, lightweight, and easy to use and clean. The directions are straightforward and it is easy to assemble.",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "It's a mini juicer",
    "rating": "4.0 out of 5 stars",
    "content": "As far as juicers go, it’s quieter than our bigger one. I like that it comes with a brush to help clean the juicing blades. The little rubber spout is also easy to clean and detach, and helps with splashes. It also works quite fast  and is powerful and the suction cups on the bottom help stop the juicer from vibrating all over the counter.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Cons: The juice that comes out of the juicer is quite thick and pulpy. There is a visible layer of flesh that sits on top of the juice. The flesh the gets discarded in the bin is also quite heavy with juice, so it feels as though there is quite a bit of waste. I can squeeze quite a bit of juice out of the discarded remains with my hands, so it is not the most efficient juicer in terms of getting all the juice out.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Good for everything except ginger",
    "rating": "5.0 out of 5 stars",
    "content": "The product is sleek, compact...it's a mini juicer. Mine did not leak, nor stain when juicing fresh beets, carrots, and other vegetables. From previous juicers I've  owned, I have learned to wash or rinse equipment asap, and to stop leakage...don't force or stuff the shoot....it's a little mini juicer. To me the noise level is low for this type of a juicer and the price. The one issue that I do have....it doesn't extract all of the juice like I would prefer, but they all don't.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Won't juice ginger but it works well for everything else.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "I juice everyday with this!",
    "rating": "5.0 out of 5 stars",
    "content": "10/10 great juicer and I use it daily for my celery juice!",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have had many juicers before but this one is the best of them.  Came assembled.  Nice manual although everything is so intuitive.  Compact, light weight, easy to clean, overall a very well designed machine.  The pulp canister is large relative to its size so I can make juice for a few days on one operation.  I really like it.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Best juicer I have had",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve already made juice 10 times. I went from beginner juicer to making juice multiple times a day. Very easy to learn and VERY EASY TO CLEAN. That’s not something I say often because I have no dish washer but it’s safe and easy. LOVE!",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It may be loud but it gets the job done! I've been using this for a couple weeks now and I love it. And cleaning this bad boy is super easy and I can store it perfectly in its own little spot☺️",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Too much waste",
    "rating": "3.0 out of 5 stars",
    "content": "Not too sure that I'm getting the juice for the bucks",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I like the juicer but not all the liquid comes from the fruits.  I have to use a mesh strainer to get almost a glass of juice from the pulp.  I wish the juicer produced more.",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Not all the juice",
    "rating": "5.0 out of 5 stars",
    "content": "I have the Jack LaLane power juicer, but it's big and bulky. I needed something small and sleek. This juicer stands 11\" high. Truthfully when I took if out of the box, I immediately thought this was going to be a return.  I was thinking it will take 5 minutes to juice a glass.",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I was shocked. This mini juicer has as much power as my classic Jack LaLane. I juiced an 8 oz glass of carrot juice in about a minute.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Power horse of a mini juicer",
    "rating": "5.0 out of 5 stars",
    "content": "It's compact and lightweight which was a plus as I have limited counter space. Hard vegatables are easily pushed down the chute which is a generous size. Parts are small and easily rinsed off after use. It has suction cups so it adheres to the counter, but it's easily movable.",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Pleased with the purchase.",
    "post_time": "Reviewed in the United States on February 13, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Great buy for price",
    "rating": "3.0 out of 5 stars",
    "content": "Doesn’t filter all juice a little pulpy.",
    "post_time": "Reviewed in the United States on June 10, 2023",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My husband and I are doing a health reset and stopped drinking alcohol. After our first month, we've realized that many of our friends are social drinkers and it's been difficult to stay dry during social gatherings. I bought this to make mocktails so we can feel \"included\" at parties. We love taking this out to make watermelon mint mocktails. Our friends love it too since they can just add liquor to theirs.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Great for mocktails",
    "rating": "5.0 out of 5 stars",
    "content": "The only thing I would not juice are mangos since they have larger fibers and we didn't get much juice out of it.",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Other than that, I highly recommend!",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Great juicer for beginners!",
    "rating": "5.0 out of 5 stars",
    "content": "Not looking to start a juicing business, but want to make fresh-squeezed juice for your home? Look no further! The Magic Bullet juicer is incredibly easy to assemble and use. I have not noticed a lack in juice extraction- there is definitely pulp left in the machine but it's not loaded with wasted juice, unlike some other juicers I have used in the past. The picture is what I got from about 3/4 of a standard-sized bag full of oranges. All the parts do need to be individually washed after use, so that's why I knocked a star off \"easy to clean\". Other than that- 5/5 stars!",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What I liked about this juicer.  EVERYTHING!!!  I'm a long time owner of juicers:  Juiceman (really liked, but lid was somewhat tricky to clean , Juice Lady (stainless, but lid abd spout hard to clean, Norwalk (too much work) - and now Magic Bullet - THE BEST!  Love it's compact size.  Wonderful lid, EASY to clean with NO hard to clean narrow crevices.  I give that a PLUS PLUS,PLUS.  Plus the lid hooks to the pulp bin so there is no vibration gap and no leaks.  I also use a plastic bag in that for super easy clean up.  The sieve basket for me is also easy rinse and clean up.  I don't need the handy little brush as my netted wash rag cleans any residue off the blade basket.  And again, the container for the blade basket is really easy clean up.  I was at first concerned it was a 4HP instead of 5, but it is super powerful with no drag when juicing carrots and apples.  And, oh yes, the drip spout.  Totally great idea as it makes cleaning the spout easy and possible, as on my other machines that was mission impossible.  The feeding tube is plenty wide and the handy juice storage cup is actually a nice thought.  Particularly that it has a round bottom to it, again, for EASY cleanup.  I have nothing but good to say about this juicer so far.",
    "post_time": "Reviewed in the United States on August 15, 2023",
    "pid": "B0BF2T71GS"
},
{
    "title": "Wow!  Perfect!",
    "rating": "5.0 out of 5 stars",
    "content": "Love the size of the unit, not as large as other juicers. It's pretty loud but tolerable. Easy to clean after use. My only gripe which is my own fault, is that the juices I get come out very frothy. I didn’t realize that the speed of the rotations plays a factor in the juices that come out. I think I’d prefer a slow speed centrifugal juicer instead. It’s not a big deal and I’ve read there’s ways to minimize the froth like freezing the juice and scooping the froth off the top after it rises, etc. overall, a great product so far.",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Lo considero muy útil, de buena calidad, excelente tecnología. Lo uso para  frutas y vegetales… lo recomiendo.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Great product BUT",
    "rating": "5.0 out of 5 stars",
    "content": "I have been using this for a long time and the quality is amazing. It's compact and powerful.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I just got my juicer today and am quite impressed by the quality of the product, ease of use and cleanup isn't too bad.  It juices beautifully.  It's a little noisy, but overall for the price - I highly recommend!",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Su utilidad.",
    "rating": "2.0 out of 5 stars",
    "content": "I own a few Ninja products that worked great for me, so was excited to get this juicer, primarily because it is compact.  However, I was disappointed in this one.  First, there is a defect in design where plastic parts don't fit together all that well when assembled.  As a result, juice sprays from the side of the juicer when in use.  No matter how many times I reassembled it, making sure everything is where it should be, it kept happening.  When I was done juicing my four apples, I realized that the end product was very pulpy.  On the other hand, the collector was empty.  All the remaining pulp pooled at the bottom of the juicing tray, and it was very wet.  It continued to happen after I cleaned out the juicer and tried again.  Overall, I would not recommend this one.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love it!!",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Practical and good quality",
    "rating": "5.0 out of 5 stars",
    "content": "Cool",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0BF2T71GS"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Brought this for my husband and he totally loves it!  He creates various different juices for both of us.  Highly recommend this product",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B0BF2T71GS"
}
]