[
{
    "name": "        QCen Juicer Machine, 500W Centrifugal Juicer Extractor with Wide Mouth 3” Feed Chute for Fruit Vegetable, Easy to Clean, Stainless Steel, BPA-free (Aqua)       ",
    "stars": [
        "64%",
        "14%",
        "7%",
        "4%",
        "11%"
    ],
    "pid": "B0BG4XHPCX",
    "ratings": "11,819 ratings",
    "other_info": {
        "Brand": "QCen",
        "Color": "Aqua",
        "Special Feature": "Manual",
        "Product Dimensions": "13.7\"D x 12.01\"W x 7.76\"H",
        "Finish Type": "Stainless Steel"
    },
    "discount_price": "$ 37.23",
    "normal_price": "$48.99",
    "about_this_item": [
        " Upgraded 500W Motor - Centrifugal juicer machine with upgraded 500W high speed motor, more efficient and powerful than cold press juicer maker, last much longer than other competitor. 3” wide mouth will save your time on cut everything into small sticks.  ",
        " Dual Speed Juicer Machine - Juicer Machine with 2 speed control(12000-18000 RPM), \"1\" low speed for soft fruits and veg, such as watermelon, orange, strawberry etc. “2” high speed for some hard fruits and veg, such as carrot, celery, apple, pear etc.  ",
        " Centrifugal Juicer with Wide Mouth - Centrifugal juicers have a wide mouth to feed your fruits and veggies into, Save your time on chopping and cutting the fruits and vegetables before juicing.  ",
        " Safety Design and Easy to Clean - Juicer Extractor with locking system arm, it will not work without cover locked into place. Overload protection system will switch off machine once overheating occurs. Detachable parts makes it easy to clean!  ",
        " To remove filter basket, please grasp the edge of the filter basket and pull up. Notice: Avoid trying to juice things with a low water content.  "
    ]
},
{
    "title": "Excelente",
    "rating": "5.0 out of 5 stars",
    "content": "Muy buen producto! Pense que era un poco mas grande! Pero funciona perfecto",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The product works well and the price was great.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "El producto cumple con cada una de la especificaciones de su publicación",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Este producto llenó mis expectativas",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Excelente calidad",
    "rating": "4.0 out of 5 stars",
    "content": "I only rate this product a 7/10 because of the amount of times I had to continuously strain my juice after the initial juicing",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use this juicer mostly for making carrot juice which i mix with orange juice.  Easy to use, clean and assemble.  But it does take up quite a bit of space.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Excelente producto",
    "rating": "4.0 out of 5 stars",
    "content": "Works well! Little bit of a task to clean all the parts but it was at a great price. Only struggle is the growing cost of groceries 😆",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Gave as a gift. He said it does what it’s supposed to do",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "7/10",
    "rating": "5.0 out of 5 stars",
    "content": "Workers amazing",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Bought this on Prime Day and glad I did. Going to try to be healthy and drink what I should be eating. Much smaller than the original Jack Lalane juicer 😉.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Me gusta mucho hace su función y es muy práctico",
    "rating": "5.0 out of 5 stars",
    "content": "Muy bueno",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent work,must have machine",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Juicing with the machine, I am in another higher level now",
    "rating": "4.0 out of 5 stars",
    "content": "Easy to put together and take apart .Doesn't takes up lots of space. it makes juicing so easy .Very easy to clean .Gets the job done and the noise level is bearable",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A little smaller than expected",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Easy to clean",
    "rating": "5.0 out of 5 stars",
    "content": "This little juicer can handle the work. I put it through the grinder with the 5x5 cleanse. 40 oz of carrot juice for 5 days. You do have to clean it through half the batch but that is pretty straightforward.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love it especially the color. I haven’t use it yet but will update further once I do",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "It does what it says but a little smaller than expected but great for the price",
    "rating": "5.0 out of 5 stars",
    "content": "Love the ease of use. Easy to clean and store. I’m enjoying the delicious drinks. Worth the money for sure!!",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Extrasctor silencioso, buen desempeño, buena calidad",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Gets the job done",
    "rating": "5.0 out of 5 stars",
    "content": "to stay healthy...",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Hard to clean",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Great Juice",
    "rating": "5.0 out of 5 stars",
    "content": "Great juicer !!",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Wanted to try juicing but did not want to invest a lot as a new beginner. Does well for an inexpensive juicer. Cleans quickly and easily.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Works well and simple to use.",
    "rating": "5.0 out of 5 stars",
    "content": "(Types of juice in pics are in this description) This juicer is our first and it's fantastic for the price!! We have juiced so many things and it's great that all the parts are dishwasher safe (except to motor of course!) So far we've made Celery/ginger/lime/green apple juice topped with ground cayenne pepper (first 2 pics) Grapefruit/lime/jalapeño juice (second pic). Carrot/orange juice/lemon juice. Red apple/green apple/strawberry/green grape/lime juice. Everything goes through perfectly! I am a juice fiend at this point!!",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Muy practico y facilito para limpiar",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Great juicer!!",
    "rating": "4.0 out of 5 stars",
    "content": "Easy to use and clean. It doesn’t juice wheatgrass as much as I’d hoped. The safety lock is hard to take off, and now mine doesn’t stay up unless I hold it up. I do feel healthier after a week of juicing",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My husband loves it, we got it for our new health journey.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Lo recomiendo",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this juicer about a month ago. I have used it numerous times to ensure that I write a knowledgeable review on this item. Aesthetically, the juicer is lovely. I have the one in the blue color and it is very pleasing to the eyes. However, this is my first juicer so I dont have a lot of experience with juicing but I feel there are a lot of parts to it and its discouraging for me to use because I have so much to clean and air dry but that's just me. As far as the juicing abilities is concerned. I believe it juices very quickly, which is a double edge sword.",
    "post_time": "Reviewed in the United States on August 22, 2023",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "On one hand, quick juicing may be very convenient when you are on the go; however, so much of my juice is with the pulp that I still need to strain my pulp or just take the container with the pulp in it, turn it upside down and slowly pour the juice from that container into the container with the extracted juice. I know you get what you pay for and I didn't know about masticating juicers until after I purchased this one, but I still  believe for what you pay, you shouldn't have to extract juice from the pulp container, but that's just me. So what I do is, I strain the pulp to extract the rest if the juice and at times, I save my pulp, put it in the freezer and use it for either fruit and vegetable smoothies or slushes.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Good",
    "rating": "4.0 out of 5 stars",
    "content": "Overall, this is a good beginner friendly juicer. Its pretty tonlook at and not complicated to use, but honestly, if you don't plan on spending more money in the future to buy a more proficient juicer (like a masticating juicer), save yourself the money, and put it all toward a masticating juicer. Otherwise, this one will do. I hope someone finds this to be helpful. Be blessed!",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I only used it once juicing carrots and it worked great. It was easy to clean. It’s not heavy and it seems sturdy enough. It is a little loud for my liking.",
    "post_time": "Reviewed in the United States on April 13, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Good juicer for beginners!",
    "rating": "5.0 out of 5 stars",
    "content": "I love my juicer! I'm new to juicing and that's is a perfect introduction. Its easy to clean and works very well! Its kind of loud but that's expected. It juices mostly all fruits and veggies without any issues.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s a good kitchen appliance I have no problems",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "It’s doing a great job",
    "rating": "5.0 out of 5 stars",
    "content": "After struggling with uncontrollable cravings, I decided it was time to embark on a cleanse journey, and I'm thrilled to share my experience with the Qcen Juicer.  Three days into juicing with one meal, and I'm feeling absolutely awesome! My energy levels are through the roof, I've incorporated daily walks into my routine, and best of all, I've shed 8 pounds. Needless to say, I am immensely satisfied with this juicer.",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Pros:",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "\"Juicing Made Effortless: Unleashing Wellness with this juicer",
    "rating": "4.0 out of 5 stars",
    "content": "Easy Setup: Setting up this juicer is a breeze, allowing me to jump right into my juicing routine without any hassle.",
    "post_time": "Reviewed in the United States on February 21, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Inexpensive: Despite its affordability, this juicer delivers top-notch performance, making it an excellent investment for anyone looking to kickstart their health journey without breaking the bank.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Good",
    "rating": "5.0 out of 5 stars",
    "content": "Low Noise: Unlike other juicers that can sound like a jet engine taking off, this one operates quietly, ensuring a peaceful juicing experience.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Quick: With its efficient design, this juicer extracts juice in record time, perfect for those busy mornings or whenever I'm in a rush.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Would recommend, would buy again",
    "rating": "5.0 out of 5 stars",
    "content": "Generous Juice Yield: I was pleasantly surprised by the volume of juice produced from various fruits, ensuring that I get the most out of every ingredient.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0BG4XHPCX"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Easy to Clean: Cleaning up after juicing is a breeze, thanks to its user-friendly design, allowing me to spend less time on maintenance and more time enjoying my freshly squeezed concoctions.",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "B0BG4XHPCX"
}
]