[
{
    "name": "        Bella Coterie Luxury Silk Pillowcase for Hair and Skin | 30 Momme | 100% Pure 6A Mulberry Silk | Super Soft | Perfectly Plush [Standard, Silver]       ",
    "stars": [
        "79%",
        "9%",
        "4%",
        "3%",
        "6%"
    ],
    "pid": "B0BHXXJLPW",
    "ratings": "248 ratings",
    "other_info": {
        "Brand": "BC BELLA COTERIE",
        "Pillow Type": "Bed Pillow",
        "Material": "Pure 6A Mulberry Silk, 30 Momme",
        "Size": "Standard",
        "Product Dimensions": "26\"L x 20\"W"
    },
    "discount_price": "$ 54.99",
    "normal_price": "$69.99",
    "about_this_item": [
        " FAREWELL FACIAL CREASES-Your skin will glide effortlessly across the ultratight 30 momme weave of our luxurious silk pillowcase, fighting wrinkles while you sleep.  ",
        " DITCH THE DRY SKIN-Skip cotton or satin covers that steal moisture. Our superiorly soft silk pillowcase helps you retain moisture for the secret to glamorous, glowing skin.  ",
        " BYE BYE BREAKOUTS-Fight acne while you snooze with the natural amino acids found in pure mulberry silk. Our ultra soft pillowcases, made of natural fibers, won't irritate skin or clog pores. Hello beauty sleep!  ",
        " NO MORE KNOTTING-Sleek hair starts with your sleep! Proteins in 100% organic silk threads keep your hair moisturized, while the super smooth finish prevents knotting and breakage for effortlessly luscious locks.  ",
        " THE BC GUARANTEE-Here at BELLA COTERIE we're on a mission to level up your beauty sleep. Treat yourself to our silk pillowcases risk-free for 30 days with our 100% customer satisfaction guarantee. Once you sleep in the lap of luxury, you'll never go back!  "
    ]
},
{
    "title": "As Advertised",
    "rating": "5.0 out of 5 stars",
    "content": "This pillowcase is as advertised- true color, real silk, soft-luxurious fabric. I got the light sage green color and it’s beautiful.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": " It doesn’t slid off my bed, the zipper encloses the pillow. The standard case fits my standard pillow.",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Beautiful and thick",
    "rating": "5.0 out of 5 stars",
    "content": "Time will tell if it truly helps with my hair-but I’m optimistic.",
    "post_time": "Reviewed in the United States on May 28, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If it does, I’ll probably order a few more for my girls.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "High quality for the price",
    "rating": "4.0 out of 5 stars",
    "content": "Don't trust the 5-star ratings for pillow cases that are below 25 momme.  I suspect people just haven't tried the higher ones and don't know how comparatively better they are.  This pillowcase is 30 momme and feels incredible against your skin.  The color is gorgeous.  It does wrinkle, stains are visible if you're a drooler, and it's a bit of a pain to have to wash separately with gentle detergent (I put mine in a vented washable laundry bag), and then you do have to iron them in a particular way.  But all silk pillowcases suffer from this, and I think it's worth the effort for a cool night of sleeping and better hair in the morning.",
    "post_time": "Reviewed in the United States on September 19, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After reading reviews on sizing problems, I decided to get queen-sized, as my pillows are standard-sized, but they're thick, high-quality foam cooling pillows, so I was concerned that the standard-size pillowcases offered by this company might be too small. Getting the queen-size was the right choice. There will be extra pillowcase material (around one to two inches worth) if you size up, but these are zippered, so I had no concerns about them falling off the pillows. If you don't mind pillowcases that aren't snug against the pillow, sizing up might be an option for you, of you're concerned about the pillowcases not fitting.",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Love These",
    "rating": "5.0 out of 5 stars",
    "content": "I use silk pillowcases, as my hair is prone to \"bird nesting\" during sleep. Silk pillowcases definitely help with this. I cannot say anything about any supposed skin benefits, as my skin has always been pretty blemish-free. I still get the occasional blemish, because life, regardless of what pillowcase material I use.",
    "post_time": "Reviewed in the United States on February 16, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They're real mulberry silk. The zipper is well-constructed. The dye used to dye the silk did not leach when I hand-washed. I used my dryer's air fluff setting, and the pillowcase came out nice and wrinkle-free, without any defects.",
    "post_time": "Reviewed in the United States on November 13, 2022",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Very nice",
    "rating": "5.0 out of 5 stars",
    "content": "For the price, these are really high-quality. I've bought cheaper silk pillowcases, and while they work, you can really feel the difference. My old silk set felt less silky, and not as buttery-smooth as this new pillowcase. I only paid $60 for TWO of my old pillowcases, which is the price for ONE of this company's pillowcases, so it's definitely a \"You pay for the quality you receive\" scenario. Yes, these are expensive (but certainly not the most expensive), but you can feel the difference, and the quality is definitely there. This single pillowcase feels and is made just as well as the top-of-the-line (think $1k plus) silk bedding set I received as a wedding gift, without the shocking price tag.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like this one so much that I have another one on the way!",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Color and feel",
    "rating": "5.0 out of 5 stars",
    "content": "Love the color and they aren't hot in the middle of the night.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am very pleased with the sheets.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "They are soft and definitely cooler than regular sheets.",
    "rating": "5.0 out of 5 stars",
    "content": "I have to say this was the very best pillowcase I have ever rested my head on. Fast delivery and customer support was excellent. I’m going to order two more later today because my guest room is important  I strongly recommend these!",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are the only 30 momme 100% Grade 6A Mulberry silk pillowcases that can be tossed in the dryer and don’t need ironing. I have tried a few other brands of supposedly the same quality but nothing else compares. These are thicker and softer than all of the other brands and well worth the price. Love love love these!",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Sleep Aide",
    "rating": "3.0 out of 5 stars",
    "content": "I received my silk pillowcase quickly.  The navy color was spot on and the thickness was as described and actually very sumptuous.  Was happy to find the zipper worked very well for a hidden zipper (no catching the fabric) as this was one of the two factors I wanted.  The problem: there was an odor immediately upon opening the package which did not dissipate over days.  Smelled like someone’s sweaty head. There were also several dark spots that looked like oily stains, and two whitish flecks on the surface of the case.  I have hand washed the pillowcase twice with Woolite and I believe the sopts are no longer visible.  The odor is gone too.  Had I not been exhausted from a holiday of online orders and some returns, I would certainly have sent this back immediately.",
    "post_time": "Reviewed in the United States on January 9, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The packaging was lovely, delivery timely, and the pillowcase itself just what I wanted.  But without being sure of better quality control, not sure I would order again.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Best Silk Pillowcases Ever",
    "rating": "5.0 out of 5 stars",
    "content": "Love the color and quality.",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Treat you or someone you care about to a soft, smooth sleep ever experienced. The hidden zipper is tucked away and it laundries so soft. Your hair will remain silky and you will no longer wake up to dry hair.",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Closer inspection needed",
    "rating": "5.0 out of 5 stars",
    "content": "Comfortable, beautiful, regulates temperature, luv it!",
    "post_time": "Reviewed in the United States on December 18, 2022",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Yes, I was confused when I received these because the quality was so great that I legitimately thought these were dupes. Due to the higher and denser weave, the material is thicker with a shinier sheen. The inside of the fabric also feels different than all my other lower momme mulberry silk items. I own many silk pieces but none in 30 momme so I was really excited to buy two sets of these 30 momme silk pillow cases in gray and white. The colors are as shown. It’s well sewn and appears to be of high quality. What sold me on these being real was I cut a few small pieces of fabric from the inner corner seams and it pass the burn test. It also smelled like human hair when burned, and it turned into a fine dust with no balling or anything to indicate plastic or other material. I am glad I got these now that I feel more confident that they’re real.",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "A pure real silk",
    "rating": "5.0 out of 5 stars",
    "content": "If you are looking for a good quality pure silk pillow cover than this is it. I usually don't write reviews about products in amazon but i think it helps people to find the right product if i make some contribution. This is a real pure silk. Trust me. U wont regret buying it.",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are so much nicer than any other silk pillowcases I have purchased!! I could immediately tell how much thicker and nicer these are!! I will be ordering more!!!",
    "post_time": "Reviewed in the United States on April 3, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "The BEST",
    "rating": "5.0 out of 5 stars",
    "content": "Bought a cheap one. Immediately stained and not soft or thick.  This one comes in a beautiful gift box.  Is thick and comfortable.",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely LOVE this pillowcase. I spent so much time researching good silk pillows and I can tell you do NOT buy one just because it’s less expensive!  This one is the REAL deal!!!  My skin and hair definitely feel softer. It’s well worth the extra money!",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Worth the money",
    "rating": "4.0 out of 5 stars",
    "content": "This is a great quality silk pillow case. I received this as a gift from family. I love sleeping on it. Especially in the summer. It’s cool to the touch.",
    "post_time": "Reviewed in the United States on October 5, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It was a tight fit with a standard pillow, which increased the pillow's firmness but overall? I would recommend!",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "So soft!!!",
    "rating": "5.0 out of 5 stars",
    "content": "Really like my Silk Pillowcase.  Good Quality.",
    "post_time": "Reviewed in the United States on March 28, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great Quality.",
    "post_time": "Reviewed in the United States on November 8, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Nice quality. Cool to sleep on.",
    "rating": "5.0 out of 5 stars",
    "content": "This pillowcase is wonderful! So soft. It's so good on your skin & hair. I am really sick & in bed in most of the time. It's very hard on your skin & hair. This pillowcase is amazing & it helps me in many ways. This is more than a pillowcase!  THANK YOU",
    "post_time": "Reviewed in the United States on January 28, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like the feel of the pillow case , nice and soft. I wash it by hand once a week and it has held up perfectly !",
    "post_time": "Reviewed in the United States on February 5, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Was not at all comfortable.",
    "rating": "3.0 out of 5 stars",
    "content": "These were not comfortable to either myself or my wife.",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They did nothing for our hair.",
    "post_time": "Reviewed in the United States on March 15, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "It has a zipper.",
    "rating": "5.0 out of 5 stars",
    "content": "Very soft and well made!",
    "post_time": "Reviewed in the United States on December 27, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this in a King Size. The quality of the silk is thick, soft and worth the money. I'll probably purchase another pillowcase in a different color.",
    "post_time": "Reviewed in the United States on July 27, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Excellent Quality",
    "rating": "5.0 out of 5 stars",
    "content": "I puchased this pillow and I am very happy with the product and the company as well. The pillow is so soft and silky and is great for my hair and skin.  The cutsomer service was also exceptional.  I had an issue with the color of my pillow case and they fixed it right away with no questions asked.  I would highly recommendn ordering these silk pillow cases; they are great!",
    "post_time": "Reviewed in the United States on December 22, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Have washed this many times and it still looks great and is so soft.  Liked it so much I got another one.",
    "post_time": "Reviewed in the United States on January 15, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "So SOFT and SILKY",
    "rating": "5.0 out of 5 stars",
    "content": "So I've tried a few different brands that were way cheaper price wise and I definitely got what I paid for. The price for this is steep HOWEVER, when I compared it to the cheaper brands, you can absolutely feel the difference. This pillow case is a much thicker feeling and is so silky smooth even after washing it. The other cheaper brands were thin and became rough after washing. I high recommend spending the extra money for this pillow case!",
    "post_time": "Reviewed in the United States on January 26, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Best stocking stuffer! The girls LOVE them!",
    "post_time": "Reviewed in the United States on February 7, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Love it!",
    "rating": "5.0 out of 5 stars",
    "content": "I've used a silk pillowcase for years.  It was utterly worn out...so I bought this.  One thing I find is that colors are limiting (last time I had gray)...but I really like this color and smile each time I see it (even though it doesn't go with any other bedding).  Packaging was nice enough that I would reuse if it wasn't covered in branding (note to manufacturer: always consider reusability).",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Could not ask for it to be better!",
    "post_time": "Reviewed in the United States on February 19, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Bella couturier silk pillow case",
    "rating": "5.0 out of 5 stars",
    "content": "I really the Bella couturier silk pillow case’  does exactly what it states.  Great for hair as well as your face. Very excellent service and also very friendly if there if ever a need to reach out to Bella coterie!  I really like the pillow case!! The Best!!! It’s  definitely worth it. Have tried others but this one is the best!!!",
    "post_time": "Reviewed in the United States on February 27, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Purchased for my husband, it is soft and cool. I love the color. There was a small pull by the zipper I will inspect to ensure it will not cause further damage but he really likes it!",
    "post_time": "Reviewed in the United States on June 24, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Very soft, fits my Purple standard pillow perfectly",
    "rating": "5.0 out of 5 stars",
    "content": "I've been using this silk pillowcase for over two weeks now and it has helped my skin and hair so much! I was skeptical at first but my acne has been clearing up. The pillowcase came in beautiful packaging and is perfect to gift to anyone. It's also super easy to wash. I highly recommend purchasing this as a treat for yourself or a loved one!",
    "post_time": "Reviewed in the United States on November 28, 2022",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nice fit and finish. The silk is lovely. Follow care instructions and all will be well.",
    "post_time": "Reviewed in the United States on October 11, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Highly Recommend!!",
    "rating": "5.0 out of 5 stars",
    "content": "I tried other highly rated silk pillowcases, 25 momme and 19 momme and they just don’t compare. I didn’t want this one to win because it’s the most expensive, but you get what you pay for. If you want the best silk pillowcase, this is it!",
    "post_time": "Reviewed in the United States on February 17, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are luxurious. Gave a pair of king size pillow cases for a birthday gift. Now want some for me. Expensive, but worth it!",
    "post_time": "Reviewed in the United States on September 6, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "It is exactly what it says it is.",
    "rating": "5.0 out of 5 stars",
    "content": "The pillowcase is amazing!!!!! Worth every penny!! I will be buying more!!!!! I’m never using a regular pillowcase ever again! I’ve noticed a huge change in my hair and in my face when sleeping on this excellent quality silk pillow case!!! Excellent customer service too!!!",
    "post_time": "Reviewed in the United States on May 4, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have no idea why I haven’t bought these sooner. Totally worth the price! I don’t usually do reviews but this is such great quality that I am going out of my way to review this. Thank you for making these — I’m sleeping better.",
    "post_time": "Reviewed in the United States on April 18, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "I tried 5 of the best. This one wins! It’s expensive but the quality is superb.",
    "rating": "2.0 out of 5 stars",
    "content": "I LOVED these when I first got them and thought they were worth the price. I have washed them twice. After the first wash they were still okay, after the second, they are no where near the same and have lost their silky smooth texture and feel. I’m very disappointed and saddened after spending so much money on them.",
    "post_time": "Reviewed in the United States on February 5, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Bought one made for standard pillows but it just barely fit.",
    "post_time": "Reviewed in the United States on March 29, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "LOVE THE THICK SILK!",
    "rating": "5.0 out of 5 stars",
    "content": "Quality zipper, silky softness, perfect for cooler months!",
    "post_time": "Reviewed in the United States on October 9, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As a replacement for an older silk pillowcase, it is a big improvement. Generous size and hidden zipper closure are good features.  The silk is very soft and a pleasure to sleep on.",
    "post_time": "Reviewed in the United States on June 3, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Quality product",
    "rating": "5.0 out of 5 stars",
    "content": "This pillow case is exactly what I needed to stay cool through the night. Not only does it keep me cool, it is super soft and maintains my curls.",
    "post_time": "Reviewed in the United States on February 28, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "It’s exactly as pictured and described. Love it!!",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Superior pillow case",
    "rating": "5.0 out of 5 stars",
    "content": "NOT silky smooth like the Mansphil and SLIP silk pillowcases I ordered, even though they're priced comparably to the SLIP brand pillow cases. It catches the tiny dry areas of my fingertips, which the others don't, not even the less expensive, silk Mansphil pillowcase I bought (Mansphil is as not as smooth or silky as SLIP, but it is definitely smoother and silkier than this Bella Coterie, high-priced 'imposter'. I could feel the difference immediately.",
    "post_time": "Reviewed in the United States on April 9, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is the best silk pillowcase I have bought and I have bought many. So soft, cool and high quality. Thank you for making a high quality silk pillowcase!",
    "post_time": "Reviewed in the United States on January 22, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "NOT  a $60 pillowcase!",
    "rating": "5.0 out of 5 stars",
    "content": "Good quality, soft and washes well.",
    "post_time": "Reviewed in the United States on June 15, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent pillow case. I can’t yet speak about the hair and skin but they look good and the texture is great! I’m happy.",
    "post_time": "Reviewed in the United States on December 28, 2022",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Love love love!!",
    "rating": "5.0 out of 5 stars",
    "content": "I just cannot say enough great things about this luxury silk pillowcase. The quality and feel are superior to any other silk product I have ever owned. Just buy it! You won’t regret it.",
    "post_time": "Reviewed in the United States on November 13, 2022",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "The care in the packaging is amazing.  Wonderful gift, ready to give. The pillow case is made of quality silk and with impeccable sewing. Zipper closure glides with no effort. The color is beautiful!!!",
    "post_time": "Reviewed in the United States on May 25, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Llegó un poco deshilachada y no se siente tan suave",
    "rating": "2.0 out of 5 stars",
    "content": "Si llega deshilacha , que puedo esperar para después de usarla….",
    "post_time": "Reviewed in the United States on February 21, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "No es tan suave como otras almohadas de seda que ya tuve .",
    "post_time": "Reviewed in the United States on March 13, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Outstanding quality",
    "rating": "5.0 out of 5 stars",
    "content": "Love the feel & quality  of this silk pillow case & the price was less than others advertised 👍👍",
    "post_time": "Reviewed in the United States on March 23, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I always wanted a real silk pillow case, just too sheep to buy one. I love it.",
    "post_time": "Reviewed in the United States on February 14, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Very soft",
    "rating": "2.0 out of 5 stars",
    "content": "Worth the price, such good quality. I’ve purchased silk pillow cases before but nothing as nice as this.",
    "post_time": "Reviewed in the United States on December 11, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I says it helps to keep your hair style, I guess it helps if you don’t move around a lot. Not worth the price for me, but it does stay cool.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Great quality",
    "rating": "5.0 out of 5 stars",
    "content": "Does not stay on the pillows do not like it",
    "post_time": "Reviewed in the United States on November 21, 2022",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The quality is truly the best out there! It has been incredible for my skin and hair.",
    "post_time": "Reviewed in the United States on April 12, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Doesn’t help with the hairdo",
    "rating": "1.0 out of 5 stars",
    "content": "i really enjoy sleeping on these pillow case",
    "post_time": "Reviewed in the United States on December 21, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "While these pillow cases are soft, and almost as soft as my $300 set of sheets from Boll & Branch — there is no way that these are silk. Not by any stretch of imagination.",
    "post_time": "Reviewed in the United States on January 25, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Great pillow case",
    "rating": "5.0 out of 5 stars",
    "content": "Soft pillow case - very nice!",
    "post_time": "Reviewed in the United States on December 13, 2022",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I’m definitely not impressed with the material.. it feels generic and like they would be hot to sleep on.. the material on the inside is so scratchy.. not worth what I paid for them.. I’ll be sending them back..",
    "post_time": "Reviewed in the United States on June 4, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Not impressed",
    "rating": "2.0 out of 5 stars",
    "content": "Disappointed. Returned. Advertised with hidden zipper closure.  Came as a standard open end pillowcase. No zipper.",
    "post_time": "Reviewed in the United States on May 9, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Washed once as soon as it arrived so I could use it that night. Dried completely rough and no longer felt smooth and soft. Washed in a cold gentle cycle.",
    "post_time": "Reviewed in the United States on December 20, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Not as advertised",
    "rating": "1.0 out of 5 stars",
    "content": "I wasted over $100. The pillow cases do not keep you cool nor do they keep you from having bad bed hair. I have purchased cheap satin pillow cases and those worked fine, no issues. I wanted to treat myself with quality pillowcases, I guess I have to keep looking.",
    "post_time": "Reviewed in the United States on April 29, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Definitely not 30 mommne mulnerry  silk more like satin. A bit rough",
    "post_time": "Reviewed in the United States on March 24, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Material not soft after washing",
    "rating": "1.0 out of 5 stars",
    "content": "After two hand washes not soft anymore  Do not buy!",
    "post_time": "Reviewed in the United States on March 24, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I used to buy 19mm till I learnt about silk grades and the best starts at 22momme/mm. Bella pillow cases are perfect and thick luxurious. I wish they had more colors red, emerald, nudes , pastel colors.",
    "post_time": "Reviewed in the United States on December 30, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Waste of money",
    "rating": "4.0 out of 5 stars",
    "content": "I am pleased with the quality of this pillowcase. Very well made and luxurious feel. I noticed an improvement in the softness of my skin right after the first nights sleep! I like the color. I haven’t washed it yet  but so far It seems well worth the money!",
    "post_time": "Reviewed in the United States on April 26, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I can only compare this to a satin pillowcase that i still own and use for guests. This is much stronger and more dense, when hand washing the two together its very obvious the materials and construction are top notch. Its less scratchy than the satin when dry. Takes a bit longer to drip dry in comparison obviously. But there's also the \"fall asleep\" factor, if you struggle in that area this pillowcase will help to knock you out, for that alone it's worth the price. Less frizz and knots upon waking. Anyway can't put a price on better sleep. Would definitely recommend.",
    "post_time": "Reviewed in the United States on March 31, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "What's not to Love? Soft, cooling and top quality",
    "rating": "5.0 out of 5 stars",
    "content": "Insanely soft and so comfortable to sleep on. I wasn't aware this would be more cooling than what I was using. It's top quality silk and the hidden zipper is well constructed and slides easily. Bought 2 and was so pleased that we gifted another to a person who travels all the time. She loves it and now takes it on all her trips.  Buy these for yourself or definitely worthy of a gift.  Repeat  buyer and will be for life.",
    "post_time": "Reviewed in the United States on December 29, 2022",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Really beautiful, drapey fabric, rich color, fine quality workmanship. Reasonable price for this high quality.",
    "post_time": "Reviewed in the United States on February 25, 2023",
    "pid": "B0BHXXJLPW"
},
{
    "title": "Beautiful Pillowcase! Heavy Silk!",
    "rating": "5.0 out of 5 stars",
    "content": "This silk pillowcase does as advertised for hair",
    "post_time": "Reviewed in the United States on January 3, 2023",
    "pid": "B0BHXXJLPW"
}
]