[
{
    "name": " The Heaven & Earth Grocery Store: A Novel ",
    "stars": [
        "61%",
        "25%",
        "10%",
        "3%",
        "2%"
    ],
    "pid": "B0BPTKTBB2",
    "ratings": "61,777 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "a novel dealing with racial and ethnic justice.",
    "rating": "4.0 out of 5 stars",
    "content": "Our book group will be discussing it in October.  I am enjoying reading it, especially because it seems to be seeking justice for Jewish and African American groups.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I held my breath for what seemed like chapters, rushing into the words as fast as I could gulp them down…I needed to know. My whole body depended on learning the outcome of this family, reading late into the wee hours of the morning. I’m beyond words with this book…this journey took me into familiar history and then wound me around, through and into new and surprisingly untouchable or untold places in history …beautifully crafted, multi layered and these characters were everything!",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Captivating",
    "rating": "5.0 out of 5 stars",
    "content": "So heartfelt and well written, of course it was McBride! Every character and storyline tied up at the end. I was drawn into the detail of the settings and the times, and very much satisfied with the ending. Definitely recommend",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kindle requires twenty words for a review. This book is about love .  My word for it is brilliant. The End.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Excellent story!!",
    "rating": "5.0 out of 5 stars",
    "content": "I thoroughly enjoy this book. It is beautifully written with a story line that has interesting twists and turns, though the story is secondary to the well crafted narrative. Not a page turner, fascinating moments the less.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A tale as rich and deep and tangled as the land that birthed it. The intertwined lives of the Black, Jewish, melting pot immigrant population of Pottstown, PA, USA. Brilliant writing. Characters who will live in your head long after you’ve turned the last page. A truly magical novel.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Beautiful Book",
    "rating": "5.0 out of 5 stars",
    "content": "Great book. It made that period harsh yet hopeful. As I was familiar with the area I found it full of memories",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Though I’m not much of an audio book reader, I’m glad I listened to this one. The first several chapters had me on my toes because I had to really pay attention to figure out how McBride was layering the characters. Each chapter seemed to throw in some information about some person that would be necessary down the line. Once I figured that out, it kept me listening closely. I was grateful for the audio reading and the distinct voices that helped me imagine being closer to the situation. I will say, some parts were very hard to listen to because of the troubling content, but that was part of the storyline. Overall, a really great read.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "wonderful read",
    "rating": "4.0 out of 5 stars",
    "content": "Not an easy read. Struggled through it at times….but did finish it",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I didn't love this one as much as I had previous McBride books. No one character pulls the story together and there are altogether too many characters. Perhaps it is because Chicken Hill and its grocery store are meant to pull the story together. Dodo and Monkey Pants, who don't appear in the early parts of the story, are the most compelling characters. I didn't like the writing style as much as other McBride books. The sentence length rivals Faulkner's to the point where you think the author forgot what a period was for.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "An absorbing tale",
    "rating": "4.0 out of 5 stars",
    "content": "Well written and compelling tale of ordinary people being extraordinary.  A diverse cast with so much in common and so many differences.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved the story line and the message.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Wonderful read. Well written and the story was amazing.",
    "rating": "4.0 out of 5 stars",
    "content": "HEAVEN AND EARTH GROCERY STORE gives us a slice of a Jewish/black neighborhood in Pottsfield, Pennsylvania called Chicken Hill.",
    "post_time": "Reviewed in the United States on October 27, 2023",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "From the title of the novel and the synopsis we expect this to feature a grocery store run by Chona and Moshe Ludlow, but there are numerous other characters who sometimes steal the show. Moshe runs a theater in the neighborhood that often caters to the black element. His right-hand man is Nate Timblin, a black man who seems to be a saint. Nate becomes a central character when a young deaf black boy is sent to a hospital/asylum for something he didn’t do. Chona was assaulted during what appeared to be an epileptic fit by Dr. Roberts who had been rejected by her. Dodo, the black boy, came to her rescue, but her hospitalization and ultimate demise was blamed on Dodo.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Heart-Warming at Times, Puzzling in Others",
    "rating": "5.0 out of 5 stars",
    "content": "It was then a veritable phalanx of characters enter the story. There’s Paper a beautiful black woman who functions as a newspaper, hence her nickname. There are Fatty and Big Soap, a black man with a thing for Paper, and his not too bright partner. They plot to get Dodo out of the asylum. Nate is integral in the plan and actually carries it out.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "But not before the climax of the story when Nate confronts the other villain (besides Dr. Roberts) who is known as “The Son of Man” at the asylum. He’s an orderly there but no one has the guts to confront this child abuser (Would the whole staff ignore a child abuser?). Poor Dodo is about to become a victim when the action swings in his favor. While at the asylum, Dodo is placed in a bed near a boy with cerebral palsy whom Dodo calls “Monkey Pants”. Monkey Pants can only communicate with one finger, using a form of Morse Code when he “talks” to Dodo. Author McBride has a facility with these minor characters, Monkey Pants being the most original. Monkey pants also has an original way to deal with TSOM when he tries to assault Dodo. Too original. He can only use one finger.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Wonderful storytelling!",
    "rating": "4.0 out of 5 stars",
    "content": "I had a problem with the climax scene. The Egg Man shows up at the hospital to deliver eggs and coffee to his multiple customers at the sprawling institution, only to be confronted by the villain, The Son of Man. They get into a tussle, Nate coming to the rescue as TSOM abuses the Egg Man with a sock loaded with lead. Author McBride needs this guy to be there but there’s no reason for TSOM to be there other than for Nate to rescue The Egg Man and get him to take him to find Dodo. That’s called author intrusion and McBride does it more than once. McBride also needs TSOM to be there to reveal nice guy Nate’s lurid background.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A great book with a moving story! I could not put this book down!  I highly recommend this for ages 16 +.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "A tour de force",
    "rating": "5.0 out of 5 stars",
    "content": "A wonderful novel that heals all souls. A story of love and compassion that emerges from the very best and worst of American life. McBride makes us think about race, our history, and what divides us but what can also bring us together.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have read three books by this author and each has been a well told story with a poignant view of the lives of his characters. This book takes a good look at the inhabitants of Chicken Hill--a place near Pottstown, PA-- that is home to \"Negroes, Jews, and immigrants who cannot find a place to live\" in the town. The title is an accurate description of the grocery store up on Chicken Hill; but it is a reference to the inhabitants some of whom are heavenly in their generosity and concern for their neighbors and others who are down right lowlifes--mean, selfish, and leaning towards true criminality. The book deals with all of them but centers on the misfortune and the attempt to save a very bright young boy who is smart, but deaf. (He has taught himself to read lips and can speak.) It explores how the people of the town look at the inhabitants of the Hill and how the inhabitants eke out their lives by helping each other.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Awesome",
    "rating": "5.0 out of 5 stars",
    "content": "LOVE IT...",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Does the USA elect a woman as President in 2024? Is it possible? Diversity is on display in this complex narrative, does it help us understand better the importance of acceptance and cultural adaptations?",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Cultural Scaffolding",
    "rating": "4.0 out of 5 stars",
    "content": "The writing flowed easily enough, that I was able to finish the book in 4 sittings.  I found myself slowing down my reading in order to keep pace with all the characters introduced in the book.  Perhaps the author might have restructured his storyline so that there were not too many characters, principal and incidental, for the reader to track.  In the end though, the book left significant loose ends about what would have happened next in the lives of the principal characters.  Ultimately, I felt let down as a reader.  It seems that the author wanted to convey that as difficult and fraught life is, there is basic goodness and redemption that sprinkles the person at different points in his/her life.  While the book indeed dwelled on the characters' difficulties and fraught lives, the author (for me) failed to also narrate redemption in its proper context.  There was a summarized, indirect reference to some level of victory in the end, but its emotional impact was far too downplayed to a brief, hurried epilogue. The ending failed to make me smile, which I suspect is what the author would have hoped for his reader.  Because I felt that the author failed to explore (or narrate) what would have happened to the characters after the \"climax\", the book did not give me a sense of closure; the story felt like it was not on balance.  I could not say that this was one of the best books that I have read.  But by no means is this work uninteresting.",
    "post_time": "Reviewed in the United States on February 21, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I read this novel for a book club. The one thing I did not like was the first chapter. The chapter is basically a summery of the book, but it left me confused. after reading the book I went back and reread the first chapter and it made much more sense.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Good read .... until its anticlimactic finish",
    "rating": "5.0 out of 5 stars",
    "content": "Admittedly, this was not my favorite McBride book, but he is the best writer going right now.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "great storyteller, great emotion, great characters, engaging plot and storyline.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Overall a good read",
    "rating": "4.0 out of 5 stars",
    "content": "highly recommended.",
    "post_time": "Reviewed in the United States on January 26, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved this book. Excellent writing and character development and stoeyline. One of my fav reads so far in 2024",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Best Living Author on the Planet",
    "rating": "4.0 out of 5 stars",
    "content": "My favorite section of this book was the author’s acknowledgment of Sy Friend, the retired director of The Variety Club Camp for Handicapped Children in Worchester, Pennsylvania, an apparent beacon of love and humanity in the world.",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I had known nothing of Pottstown, Pennsylvania, with its Jewish immigrant families in the late twenties and early thirties and its African-Americans who had moved to the northern states from the south.  I learned about tallits, jook joints and the prevalence of dance halls for entertainment during that era prior to the Second World War.  I got an in-depth snapshot into the way people lived and engaged each other in the struggling neighborhood of Chicken Hill. I learned about the informal segregation of class, religious culture and race in small-town Pennsylvania and the ominous presence of the Ku Klux Klan and its annual march that was pretty much tolerated quietly by all.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Interesting read",
    "rating": "4.0 out of 5 stars",
    "content": "I start by saying I liked this book.. It seemed a little scattered  as books go,  The characters were all well developed and as a reader I definitely knew who was good and bad.  For a while I wasn't sure where it all was headed, but in the end we all got there with the culmination of dodos life. The guy in the well was literally left hanging and Addie apparently found her way down south. There were things  left unresolved d or unexplained",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This novel is set in Pottstown, PA, a grimy eastern Pennsylvania factory town, not far from where I grew up. The characters (in the 70's) are the town's black residents and Jewish immigrants living on \"Chicken Hill\" which is the \"wrong side of the tracks.\"  The town's chief doctor marches feebly disguised as the Grand Wizard of the Klan (and as you know they aren't any fonder of Jews than black folks) and people are going through that struggle to create a business and make a go of life in the United States, away from the horrors of Europe or the Jim Crow South--and creating their own heaven-or hell on Earth.",
    "post_time": "Reviewed in the United States on August 24, 2023",
    "pid": "B0BPTKTBB2"
},
{
    "title": "McBride has another stunning novel",
    "rating": "4.0 out of 5 stars",
    "content": "The book has an almost fairytale or fantasy quality to the story telling, the characters are roughly drawn with larger-than-life attributes; an ability to tell the future, a hunchback or lame leg, a boy deafened by a domestic accident. The quality of the storytelling is also rather timeless--it could have been set in the 19th century, as well as the mid 20th.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I started reading and couldn't put it down for a minute--grabs you page one. So if you love any other of McBride's books or the stories of Alice Walker or Toni Morrison or E. Annie Proulx, you'll love this too.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "stay with it for the satisfying ending",
    "rating": "4.0 out of 5 stars",
    "content": "It took me awhile to become engaged as characters seemingly came at me in all directions. However, I appreciate character development and that is done richly here.  Being different is what makes us the same. That is a common theme in storytelling and it comes to you here as well but in a way like no other.",
    "post_time": "Reviewed in the United States on February 10, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This book was beautifully written, and I felt very connected to the characters and I highly recommend it!! I did not want it to end",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Beautiful And Heartfelt Story",
    "rating": "5.0 out of 5 stars",
    "content": "The story starts with a little history from the 1930s in Pottstown, Pennsylvania an impoverished community consisting primarily of poor Blacks and immigrant Jews known as Chicken Hill. Like everywhere, the people in this community have their secrets - secrets kept from neighbors and from friends, from the authorities and by the authorities.",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "In present day 1970s, while working on some city water pipes a skeleton is discovered at the bottom of a well. Who this person is and how he got there is the basis of this interesting novel. It is only when the truth about the dead man is discovered and the involvement of the white citizens is revealed that the secret is fully disclosed.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "a story of poverty and friendship",
    "rating": "4.0 out of 5 stars",
    "content": "A novel full of fascinating characters with equally fascinating (and fitting) names like- Monkey Pants, Dodo and Big Soap. Friendship with the lead female character, Chona, is a prize valued by everyone. Chona inherited the Heaven and Earth Grocery Store from her father.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Although there is sadness in the lives of the people of Pottstown and in their struggles to get by, there is also love and humor and camaraderie, as they do what they can to support one another. ⭐️⭐️⭐️⭐️",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Uplifting, heart-rending!",
    "rating": "5.0 out of 5 stars",
    "content": "Beautifully written, engrossing. A novel bursting with the lives of many deftly crafted characters. Thank you, James Mc Bride, for this wonderful book.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "James McBride's range of understanding, humor, intelligence, historical contexts make reading all of his books a joy, a discomfort, a reward.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Another McBride winner",
    "rating": "4.0 out of 5 stars",
    "content": "Not my typical historical fiction grab with medieval twists and turns, but turned out to be a great story spanning across culture and religion.  Characters and backgrounds caught me off guard and turning the pages. 100% recommend.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this book by James McBride. I find his writing style to be very unique and musical! I highly recommend it!",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Awesom",
    "rating": "4.0 out of 5 stars",
    "content": "This book was a Book Club selection, not one I would have just picked up and read on my own accord. Score one for book clubs!  I found “the story” easy to follow in anticipation of finding out what happened in this community. The author was able to weave many individual characters and their stories into “the story” in a manner that allowed me to see both their virtues and faults. The book also makes clear any faults or shortcomings we may have ourselves if we truly examine and question some of our beliefs. I was disappointed in the conclusion of the book. It seemed very rushed and tidy from this reader’s perspective. Maybe not life changing, but certainly thought provoking. Highly recommended!",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I found this a complex book in the beginning perhaps because I know little about Judaism and struggled to determine the importance of the the numerous religious references to the story narrative. I found myself enjoying the book more and more with every passing chapter. An analogy might be seeing all the different color threads apart and watching them being woven from all corners towards the completion of a pattern in the middle. Nor could I guess how the story would end and was surprised at the way that the ends were finally tied. The events that occurred at the asylum brought back very mixed memories from 30+ years ago when I first had a college practicum and later employment at the state institution in Columbia, S.C. Sadly, very realistic portrayal.",
    "post_time": "Reviewed in the United States on April 24, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "a great author and an enjoyable read",
    "rating": "5.0 out of 5 stars",
    "content": "Awesome complex story with rich characters, historical context, and intensity.  This is my first McBride novel; and it won't be my last.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Even in impossible situations, those with kindness and love in their hearts prevail. The Heaven & Earth Grocery Store: a Novel moved me deeply. The injustice of prejudice and racism lives on today. But the lessons we learn from good and decent acts gives us hope for the future.",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Very interesting read …",
    "rating": "4.0 out of 5 stars",
    "content": "This story will keep you “winkin and blinkin.”Not exactly a linear plot. Actually, I kept pulling on threads to see if there was a plot; there are SO many subplots and secondary characters who move in and out of the story. Keep a diary while you read it. But there was something unforgettable here. It’ll get you going.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "When I started reading this book, it was at the end of the day, when I was tired and reading for relaxation. But after several very interesting chapters I realized this was a book that demanded attention. I could choose to set it aside and read other novels mindlessly, or I would need to commit to paying attention. I chose the latter. I’m glad I did.",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Engrossing, Enjoyable and Satisfying",
    "rating": "5.0 out of 5 stars",
    "content": "This book quickly pulled me into the world James McBride created; the characters were so fully drawn by the prose, they became real people to me.  I only read at bedtime and came close to staying up all night more than once.  I found myself thinking about the story during the day while I was doing my routine tasks; it was like a soundtrack playing in my mind all day.  I highly recommend this compassionate, sometimes funny, always truthful in spirit, look at people who belong to different cultures than I live in.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book sat in my TBR pile for months.  I repeatedly shied away from it not in small part because of comments I'd seen in reviews:  too many characters to keep straight, story rambles on and on, easy to lose track of the story... and so on.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "An Excellent Read",
    "rating": "5.0 out of 5 stars",
    "content": "When the title was selected as our book club read for August, however, I knew it was time to pull it from the shelf and give it a try, and am I ever glad I did!",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I found The Heaven & Earth Grocery Store to be a literary masterpiece full of beautiful prose, memorable characters, and a story that will keep you wanting to read one more chapter simply to meet more of its interesting characters, folks with names like Fatty, Paper, Dodo, and Monkey Pants, with personalities as bold and well-developed as their names might suggest.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "A GREAT READ",
    "rating": "5.0 out of 5 stars",
    "content": "There was nothing that I disliked about this book.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s a story of acceptance, trust without regard for race or religion. A story of the struggle of Jewish immigrants in a small rural town.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Historical mystery.",
    "rating": "5.0 out of 5 stars",
    "content": "I would definitely recommend this book to friends.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great read!",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Colorful story, well told.",
    "rating": "5.0 out of 5 stars",
    "content": "Characters were well described and the plot evolved at a good pace.  The historical context was essential and educational.  Easy to like this novel and author.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "McBride captures the richness of American cultural diversity in a well woven tale of love, honor, and duty in the everyday lives of ordinary people struggling to become Americans. Through his telling we can see more deeply our own place in the great promise of the American dream and the tragedy of each our own racial and cultural biases. He is masterful in metaphor and simile as he weaves the tale beautifully together.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "All the pieces fit.",
    "rating": "5.0 out of 5 stars",
    "content": "I truly enjoyed this book. I cared about the charecters. Their lives were real to me. They felt like family. The complex blend of shared cultures felt natural and right.  The sorrow of them trying to deal with life in the 1930's, was made even more difficult by the readers knowledge of what was yet to come.",
    "post_time": "Reviewed in the United States on December 4, 2023",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I feel regret that there were no strong, positive \"white\" characters.  And that their absence was natural. There has to be some white folks in PA that aren't hateful monsters.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Rich language",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed the complexity of the African-American and Jewish communities. How they further divided and segregated themselves into their own subgroups. How once there was a larger African, Jewish, Hispanic cultures which had shattered into many fragments and were trying to gather the pieces back together here in America, while trying to figure out how they fit into Americas all consuming nation of cultures.",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "My one big complaint, all the loose ends got tied up except one. What happened to Moshe? Couldn't we at least have him partner up with Isaac and start a new life in Philadelphia? I hate the idea of him sitting along in the upstairs apartment of the closed down grocery store.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Unexpected Thriller",
    "rating": "5.0 out of 5 stars",
    "content": "My final comment is about special needs kids.  When I was a boy, back in the 70's, they were still hidden. Institutionalized. Now they are more accepted, not hidden away. This is because of public schools and inclusionary practices. We need to support our public schools and make sure that our special needs kids are not hidden away in shame ever again.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The days of places like Pennhurst must go away and never happen again.  Light must shine on every at risk person, to protect them from the monsters that lurk in the shadows.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "enjoyed.",
    "rating": "5.0 out of 5 stars",
    "content": "Read every day, and read for fun!",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Four stars because of the engaging plot, the rich characters, and the humanity that it expressed.  And he’s great at giving characters such colorful speech. “Paper,” for example.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "𝑻𝒉𝒂𝒏𝒌 𝒚𝒐𝒖 𝒎𝒐𝒏𝒌𝒆𝒚 𝒑𝒂𝒏𝒕𝒔...",
    "rating": "3.0 out of 5 stars",
    "content": "One star is missing, because the evil characters seemed irredeemable and single-faceted, with no virtues whatsoever.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved “The Good Lord Bird” and this one and will certainly read more of his work.  Marcia",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "\"It boils down to one thing.  Love.\"",
    "rating": "5.0 out of 5 stars",
    "content": "If I were to break this down to a simple theme, (although simple is far from this book!) I think the best description would be \"LOVE\".",
    "post_time": "Reviewed in the United States on December 17, 2023",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Not just the love between two romantic partners or one night stand, but what is most important to you?  What do you value more than other things?  What are you willing to do for what, or whom, you love?",
    "post_time": "Reviewed in the United States on January 6, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "I hung in there!",
    "rating": "5.0 out of 5 stars",
    "content": "That said,  this novel is one of the best historical fiction novels I've ever read.  So many truths about the times and lives of those living in Pennsylvania USA in the 30's.  I knew of the Jewish turmoil with Prejudice.  And of the blacks at that time.  However, I had no idea, or rather, it never occurred to me that they also distrusted each other and held prejudices against each other.  And, each \"group\" had factions within as well.",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "But not just them.  Anyone who had any sort of disability,  physically,  mentally, emotionally.  They were set aside, mistreated, ignored, abused,  and ignored.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "The Heaven & Earth Grocery Store: ANovel",
    "rating": "4.0 out of 5 stars",
    "content": "The \"us vs them\" mentality is a heavily represented  troupe as well.  As well as the \"anti-immigration thoughts\"; that all these peoples, from all these different cultures and countries,  are \"soiling America's pure soil\".",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This mindset aggravated me and made me sick.  🤬  I just don't understand how people can think that way.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Hauntingly beautiful.",
    "rating": "5.0 out of 5 stars",
    "content": "I enjoyed this book.  It made me truly think and it opened my eyes on many things.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A quote in the book says:",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Interesting book by an honored black author",
    "rating": "5.0 out of 5 stars",
    "content": "\"But American history is not meant to be pretty. It is plain. It is simple. It is strong and truthful. Full of blood. And guts. And war.\"",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B0BPTKTBB2"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I highly recommend this book!",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0BPTKTBB2"
}
]