[
{
    "name": "        GuruNanda Coconut Oil Pulling, Fresh Breath & Whitening Mouthwash, 7 Essential Oils & Vitamins for Healthy Teeth & Gums, Alcohol-Free, 8 oz       ",
    "stars": [
        "73%",
        "13%",
        "7%",
        "3%",
        "4%"
    ],
    "pid": "B0BVFXGMLW",
    "ratings": "28,336 ratings",
    "other_info": {
        "Brand": "GuruNanda",
        "Product Benefits": "Bad Breath Treatment",
        "Liquid Volume": "8 Fluid Ounces",
        "Flavor": "Coconut Mint + Vitamins",
        "Age Range (Description)": "Adult"
    },
    "discount_price": "$ .",
    "normal_price": "$17.98",
    "about_this_item": [
        " GuruNanda Pulling Oil is a natural, pre-brush rinse inspired by Ayurvedic wisdom, with lower density than coconut or sesame oil. It comes in an 8 fl oz bottle with a tongue scraper inside.  ",
        " It contains 100% pure coconut oil, essential oils (Tea Tree, Peppermint, Clove, Oregano, Fennel, Spearmint & Cardamom) & vitamins D3, E & K2. Hydrophobic & lipid-inspired, it enhances your oral care.  ",
        " Pulling Oil aids in saliva production & plaque removal and supports healthy teeth & gums & fresh breath. It's not a substitute for professional dental care but rather a preventive measure.  ",
        " Pour 10-15ml of oil pulling, swish for 2 minutes with the provided measuring cup, & gradually increase to 10 minutes. Discard the oil into the trash to avoid clogging pipes. Pull on an empty stomach every morning for optimal results.  ",
        " It's proudly made in the USA with international & domestic ingredients. Free from fluoride or added preservatives, it is safe for use by children 12 years of age & up (with supervision) and adults.  "
    ]
},
{
    "title": "good brush & tongue scraper",
    "rating": "4.0 out of 5 stars",
    "content": "love the brush & scraper! didn’t see much of a difference when using the pulling oil.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The coconut and mint isn't an overwhelming taste and it is a thinner consistency so it's easy to swish around. Please read the instructions .My mouth felt  fresh after using and the included tongue scraper is a nice addition. I highly recommend this product. Not for sure about the whitening.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Maybe it works love the breathe afterwards",
    "rating": "4.0 out of 5 stars",
    "content": "Product true to description.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I really like these products. The flavor is good and my teeth always feel so clean after using them. The only reason I’m giving 4 stars instead of 5 is because the lid was broken when I received it",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Tongue scraper is great",
    "rating": "5.0 out of 5 stars",
    "content": "love this product, mouth & teeth feel so clean and fresh after using and I have less gum sensitivity.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Pro- Slightly whitens. I didn't notice a big difference but hey, I'm whiter than when I started.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "I love this",
    "rating": "5.0 out of 5 stars",
    "content": "Pro- I've been getting laser treatments at my dentist every 3-6 months to help me fight my gum disease. After using this once daily for 3 months and changing nothing else about my routine, my dentist saw a MAJOR improvement. I got it for the whitening but I'm buying my 2nd bottle because of the dental care.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Pro- Since you're not supposed to spit this down the drain, I walk out front and spit it on any weeds I may have in my yard. I'm not sure if it's the Arizona sun cooking the oil on the weeds but my spit has been killing my weeds lol.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "teeth feel so clean!",
    "rating": "4.0 out of 5 stars",
    "content": "Con- The taste makes me gag and shiver. every. single. time.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Con- Because of the taste, the length of time you have to swish this kills me. I've worked my way up to 10 minutes but I'm crying inside the whole time.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Love this!",
    "rating": "5.0 out of 5 stars",
    "content": "Actually saw this all over tik tok and got it off here. Great product, I actually love the feeling of the tooth brush. The tongue scrap works really well.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I've only been using it for a few weeks but it feels like my mouth is cleaner",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Taste is strong",
    "rating": "5.0 out of 5 stars",
    "content": "Yes I like but haven’t used long enough to give honest opinion .",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I received this today and noticed when getting out of the box oil on the outside of packaging. After I took off all the wrapping I noticed as I went to open the cap the lid is split and the product is leaking everywhere. Not sure what happened in the manufacturing process with the lid but I believe it’s defective.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Breath is refreshing gums fells really good!",
    "rating": "4.0 out of 5 stars",
    "content": "The product itself is great and works really well after oil pulling and brushing my teeth feel cleaner then just brushing alone. It’s been a week since I received it and have noticed my teeth getting lighter.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I contacted customer service and they were amazing to work with and sent me a replacement.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Great product but not sure what happened to the cap",
    "rating": "5.0 out of 5 stars",
    "content": "Makes my teeth look whiter and feel cleaner",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been using this product for a long period of time and it has been great using it. It whiten my teeth and also chancel bad breath❤️💕",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Great product",
    "rating": "4.0 out of 5 stars",
    "content": "I really love this product. It has helped with my gums and teeth. I had to get a tooth pulled recently and the dentist complimented me on how great my overall teeth looked. I oil pull in the shower every morning and has become a way of life now. I think the ingredients in this product make it better than others I’ve tried when this one is sold out.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "La compra llego bien y sin derrames. El sabor del aceite ayuda a tolerar mejor el tiempo de tenerlo en la boca, el limpiador de lengua y es fácil de limpiar y el cepillos es de una suavidad extrema y a pesar de eso limpia los dientes con gentileza sin lastimar las encías. Lo volveré a comprar sin dudarlo",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Game changer",
    "rating": "5.0 out of 5 stars",
    "content": "Noticed a difference within a week. Get it. Try it. Love it",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have very sensitive teeth and gums. I’m very sensitive with how stuff feels to me and always had trouble finding a good toothbrush. This toothbrush is the most softest toothbrush ever I love it so much! Good product!",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "The tooth brush!!",
    "rating": "4.0 out of 5 stars",
    "content": "I used the Guru Nada Pulling Oil for about two weeks but I didn't notice any significant whitening of my teeth. It's an okay product, but there might be better options out there. I was hoping for more noticeable benefits. It's alright, but didn't quite meet my expectations in terms of overall results.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I definitely recommend this. Definitely gets your teeth white. Definitely go and get this. If you do decide to purchase this do not I repeat do not spit it in your sink or toilet. Spit it in a disposable cup",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Not quite as expected",
    "rating": "5.0 out of 5 stars",
    "content": "I swear by this stuff. It does an excellent job whitenng your teeth. Your gums are refreshed afterwards.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It brightening your teeth quickly",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Must have 10/10",
    "rating": "5.0 out of 5 stars",
    "content": "I love that it has all you need for oral care.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I've always had bleeding gums, and when I heard about this product I had to try. I'm glad I did!!! Now when I brush my teeth, my gums are not bleeding as much. I started noticing the change in about a week. But it's a big improvement from when I started. It is an oily greasy texture but if your consistent with it and follow the directions it should work.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Pulling oil",
    "rating": "4.0 out of 5 stars",
    "content": "I am impressed by this product. Helped remove plaque and whitened my teeth",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I didn’t notice a color difference but my mouth does feel cleaner after I use it.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "TikTok find",
    "rating": "5.0 out of 5 stars",
    "content": "Saw this on TikTok and it works great. Already see a difference after using it three times!",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Seems to work as advertised. Just give it some time.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Seems to work as advertised",
    "rating": "5.0 out of 5 stars",
    "content": "i found out about it on tik tok and had to get it. the taste is gross to me and it’s hard to keep doing bc you can’t spit it in the sink",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Want fresh breath and whitening of your teeth? Get this!!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "saw it on tik tok",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this thinking it wouldn’t help in the oral care of my teeth drastically",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": " but astonishingly I was proven wrong. I had read somewhere online about oil pulling and the benefits it does for your teeth and oral care and as I’m getting older and age, I thought hey why not try it out to see if it works .I didn’t really think it would work, couldn’t hurt to try. i’ve been having some like receding gum, line issues to my teeth, and after about a month of the oil pulling, I swear it is helped my oral care so much my gums are not a sensitive anymore. It also has the benefit of whitening your teeth as you do it. The taste of the oil is gross, but you do get used to it. In my opinion totally worth the money it’s a repeat product for me!!",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Mouth rinse",
    "rating": "5.0 out of 5 stars",
    "content": "Ive been using for over 4 months now and I really like this brand definitely leave your mouth feeling clean and minty. but also leaving you teeth white and breath fresh",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good effective pulling rinse. Cleans the mouth & freshens breath.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "SUPER AWESOME!!",
    "rating": "5.0 out of 5 stars",
    "content": "This pulling oil has improved my receding gums and the health of my gums.  It is now a daily part of my routine.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This stuff helped my teeth so much and I will forever be a grateful customer !",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Gum health ✅",
    "rating": "5.0 out of 5 stars",
    "content": "This is a game changer to your gum health. You can’t afford not to buy this.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have always had issues with my teeth. Bad oral hygiene as a child, but as an adult I became very meticulous with my oral hygiene. Try as I might, and were talking flossing at least once a day, water pick a few times a week and teeth cleanings every 4 months, I just didn't feel like my teeth were as clean or as white as they could be and my gums were continuing to recede. I do not do whitening strips as they can be hard on my enamel. I could see results within days of using this product.",
    "post_time": "Reviewed in the United States on March 5, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Best product I have tried in years and I have tried so many!",
    "rating": "5.0 out of 5 stars",
    "content": "So much so that other family members were so impressed they started using it as well. The first thing I noticed was my mouth still felt fresh and clean when I woke in the morning. I rub my tongue over my teeth and they still felt clean. Keep in mind I have to sleep with a CPAP machine for Sleep Apnea and that requires me to wear tape over my mouth when I sleep. This usually causes a significant increase in \"socks\" on my teeth and bad breath. Now.....I have NO socks on my teeth and my breath is still fresh and clean.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use it before I brush and floss my teeth. I started with swishing it for 2 min, I now swish for 10 minutes. I just play a game on my phone while I swish. Don't swallow.  No big deal.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Excellent",
    "rating": "5.0 out of 5 stars",
    "content": "The results are far beyond what I expected. I can't wait for my next dental cleaning to see and hear the Dentist's reaction. She is always impressed with how well I take care of them, but I believe she will be stunned at how clean and bright they are. I don't even mind that due to scheduling issues my cleaning had to be pushed out a month because I believe this will keep the plaque and tarter off my teeth and gums.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you are looking into Oil Pulling or to have cleaner, brighter teeth and fresher breath, this product is amazing and gives great and consistent results.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "I use this 3X weekly, a game changer for healthy teeth and gums!",
    "rating": "5.0 out of 5 stars",
    "content": "I have it set up as subscribe and save to make sure we always have it on hand.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve been using for a few months and my gums are significantly better. This product literally pulled my gums up and tight on my teeth. This works. All I did was swish this around my mouth once a day then brush and wow. Amazing results.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Good quality",
    "rating": "5.0 out of 5 stars",
    "content": "After spending money on different coconut oils for oil pulling I was getting frustrated with no results. The dentist said I have a few cavities I needed to have worked on, so I thought, how can I heal my teeth and gums naturally? This is a tasty, organic product that actually works! Grateful I switched from plain coconut oil to GuruNanda. Your teeth will thank you.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really like the quality of the product.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Great product and fast delivery",
    "rating": "5.0 out of 5 stars",
    "content": "Great product and fast delivery",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Me deja un aliento fresco",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Me encata",
    "rating": "5.0 out of 5 stars",
    "content": "very refreshing and minty!",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to do",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "YES!",
    "rating": "5.0 out of 5 stars",
    "content": "Breath smell so good",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Came in Great condition!",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Fresh mouth & gums",
    "rating": "5.0 out of 5 stars",
    "content": "Saw on tik tok and gave it a try. Really awesome. I like the ashwaganda and neem one best but this one is great. My oral health has improved.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I cannot believe I was over 30 years old before i learned!!!! Oil pulling will change the health of your gums teeth and health of your mouth I recommend this brand you can also make your own!!!",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "I love this product",
    "rating": "5.0 out of 5 stars",
    "content": "Gurunanda can do no wrong in my book!  My teeth are not sensitive anymore and my gums are healthier.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Me gusta mucho",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Works",
    "rating": "5.0 out of 5 stars",
    "content": "A must have",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's waz great",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Works gd",
    "rating": "5.0 out of 5 stars",
    "content": "10/10 def Recommend",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this product",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "10/10",
    "rating": "5.0 out of 5 stars",
    "content": "This stuff is the best and is not an imitation",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Use it daily or every other day and you will have no issues with your teeth.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Product works",
    "rating": "5.0 out of 5 stars",
    "content": "A+++",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have a broken tooth and need a root canal and since using this, I have no pain in my mouth, idk if it's doing anything else but I know that I don't have to use numbing cream or anything else and I can chew on both sides of my mouth.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified product",
    "rating": "5.0 out of 5 stars",
    "content": "Not sure if the oil is doing anything bc I'm not consistent using it but the toothbrush is the highlight for me. So soft on my gums and suds a lot with lil toothpaste. Never felt a toothbrush like this. I enjoy brushing, feels like a massage in my mouth. Will be ordering more of toothbrush.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0BVFXGMLW"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried oil pulling multiple times and have always failed. This coconut oil for oil pulling has helped me be a success at oil pulling!! Its minty taste makes it so much easier to use. I love this product.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0BVFXGMLW"
}
]