[
{
    "name": "        GE Bathroom Scale Body Weight: Digital BMI Weight Balance Scales FSA HSA Eligible Heavy Duty Measuring Scale for People Accurate Bluetooth Weighing Scale Electronic Weigh Scales, Black       ",
    "stars": [
        "84%",
        "11%",
        "2%",
        "1%",
        "2%"
    ],
    "pid": "B0BW3N71LT",
    "ratings": "2,134 ratings",
    "other_info": {
        "Brand": "GE",
        "Color": "Black",
        "Recommended Uses For Product": "Humans",
        "Special Feature": "Large Display, Precision Balanced, High Weight Capacity, Auto Shut Off, Bodyweight",
        "Display Type": "LED"
    },
    "discount_price": "$ 28.79",
    "normal_price": "$39.99",
    "about_this_item": [
        " Up to 500lb Capacity: 4 high-precision sensors accurately provide your weight metrics down to 0.1lb/0.1kg increment with an extra high 500lbs / 226.8kg capacity. It can easily weigh light items from 0.4lb too. GE quality standards ensure the reliability and consistency of our smart scale  ",
        " Easy to Read: GE SC-500 bathroom floor scale choose a LED screen rather than blacklit LCD that most scales use, for its many better features, like larger visiable angle very suitable for elderly, wider platform for bariatric/weight loss human, higher brightness, visibility in longer distance or under intense light. It is much brighter and easier to read your weight, a must have in your bedroom and home, or as a gift  ",
        " User-Friendly App for Whole Family: The free app \"Fit Profile\" is simple to use with auto connection via Bluetooth, and supports an unlimited number of users. It is compatible with Fitbit, Apple Health, and Google Fit so you can keep everything in one place. Please be assured Fit Profile will never share your information with any third parties  ",
        " Customer Oriented: Its elegant look makes it fit any room decoration. The large platform (11.8\" x 11.8\") provides a more comfortable weighing experience. 6mm tempered glass allow it to weigh over 400lbs. GE scale is made to high standards for everyday uses, pefect gifts for fathers day gifts or any other festivals  ",
        " US-Based Customer Support: Our team in Texas are all professionals, ready to help you solve any problem when using the GE scale. We will make sure that all your concerns are addressed and all issues resolved, and want you to have a wonderful experience from the beginning to the end  "
    ]
},
{
    "title": "GE Brand - better than those unknown brands!",
    "rating": "5.0 out of 5 stars",
    "content": "I bought a digital scale previously from Amazon. It's a no-name brand made in China. In just one year, it stopped working. I didn't even use it that much. It was just stored away most of the time. (Based on my experience, items made in China without a brand name break down FAST and now I'm avoiding any no-name brand items - you definitely get what you pay for!) I'm hoping this branded scale from GE will last longer. If this breaks down sooner than expected I will update my review. So far, so good.",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It did not take me long to write this review for these digital scales, as I received them only 3 days ago. We had the bathroom scales that had the numbers and lines on the circular part that moved around. I am 71 and while I still do not need glasses, other than readers, it was hard for me to see the numbers and lines on the old scales. I could be 10 pounds off. Not with these though. The red numbers are easy to see with the sunlight pouring in through the windows or at night with only a night light on. To me, they are easier to read than the backlit dark LCD numbers",
    "post_time": "Reviewed in the United States on October 27, 2023",
    "pid": "B0BW3N71LT"
},
{
    "title": "Accurate and easy to read",
    "rating": "5.0 out of 5 stars",
    "content": "I checked the accuracy with some barbell weights that had the weight marked on them and it is spot on. I took them to my primary doctor's office to compare them to the big ones he uses. Slightly less than 1 ounce difference. Oh, I have these scales on the bathroom tiles that are not perfectly smooth, they have a texture to them. Makes no difference. I only wish that the red number reading displayed when I step on them was about 20 pounds less : )",
    "post_time": "Reviewed in the United States on March 19, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very happy with this scale. We’ve had it for about a week now. It feels sturdy and big enough (speaking as someone with big feet). Big numbers with good contrast for easy read. But above all, the ACCURACY IS ITS BEST FEATURE! We had a Greater Goods scale before this one. And when this one arrived, several people in our household stepped on each one side-by-side on the same flat surface without moving either scale. The older scale kept giving different numbers. BUT This scale gave the same number each time. i stepped on it step on it three times in a row and get the same number.",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Reliable and Accurate Weighing Scale",
    "rating": "5.0 out of 5 stars",
    "content": "Needless to say we are pleased!",
    "post_time": "Reviewed in the United States on April 17, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great for monitoring weight via the app and keep up with your progress.  Much better than the scales we have purchased in the past.",
    "post_time": "Reviewed in the United States on July 16, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "Well, if this is accurate, I am real happy since it shows a good weight loss. If it is lying to me, I am going to be really mad. But seriously, this is a great scale. When I first weighed myself, it was real close by the Dr's scale. off by a pound. I weighed myself about 3 times the same day after a few hours and it showed the same weight.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A great product with Bluetooth access!",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "It's a Scale",
    "rating": "5.0 out of 5 stars",
    "content": "Ok the scale is good the app fat shames I don’t mind it gives me more motivation to work harder.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Just put the batteries in and you’re good to go!! Light weight and easy to read.",
    "post_time": "Reviewed in the United States on January 6, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Simple to use & no sharp edges!",
    "rating": "5.0 out of 5 stars",
    "content": "I appreciate the ease of use. Just give me my weight, that's all I want, and it is wasy to read too. Plus, it has no sharp edges to catch your toes and will be easy to clean. Great scale!",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was looking for a new bathroom scale that would go higher than 400 pounds as my husband is a big fella and is trying to lose weight and needed a scale that would weigh him.  When I found this one, I saw that it went up to 500 pounds and was a good price.  The scale is very nice, very sturdy, and very accurate.  My husband can easily use it and he has lost 8 pounds since putting it in the bathroom so win/win!",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Great bathroom scale",
    "rating": "4.0 out of 5 stars",
    "content": "This scale is working well although I have only been using it for about two weeks. The numbers and large and clearly visible. The numbers appear for an adequate amount of time for you to read them.",
    "post_time": "Reviewed in the United States on March 19, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Finally, a new scale!  Received promptly and it was packed so well there was no damage. I have very recently diagnosed with diabetes 2 and having a scale that was accurate became a necessity.  The old one which wobbled and tipped would no longer do.  I gave up the freedom of choosing from a wide selections of possible weights to settling for one digital score which is the same even if I step on it twice in a row!  I highly recommend this product which is very well constructed and convenient to store.  Thank you General Electric.",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Sleek and modern looking",
    "rating": "5.0 out of 5 stars",
    "content": "It has extra large foot space allowing my size 12 feet to fit and still have extra space to spare. The  scale is accurate and gives you the same correct weight each time. Other scales I tried gave a different weight if I stepped off and the stepped right back on again. This scale is consistent.  The dial is large enough my 69 year old eyes can read it without my glasses! Nothing to dislike about this scale. The black color makes it disappear even if leaving out in an obvious space. Buy it, you won't be disappointed!!",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "There are a lot of scales on the market. Many are less expensive than this one. But this scale is  very well made. It is extremely accurate and easy to read. It is well worth the few extra dollars to get this scale instead of a cheaper and less accurate model.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Easy to read, accurate display",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use as well",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am pleased with the quality and durability of this scale, as well as the high weight limit!",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Awesome scale",
    "rating": "4.0 out of 5 stars",
    "content": "As much as I love this scale and am using the Bluetooth feature, the fact there isnt a way to toggle the Bluetooth off is an IoT security/privacy issue.",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I honestly think this is a great scale. It lines up exactly with my doctors scale and helps keep me on track. It's still sad when I see the brightly illuminated numbers at the top of it but that is not the scales fault. Its low profile dark design makes it easier to hide when company comes over so that way we can avoid the shame. But it's accurate, easy to read, and the app is cool but I dont mess with it at all.",
    "post_time": "Reviewed in the United States on March 1, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Great value",
    "rating": "5.0 out of 5 stars",
    "content": "Quality scale that’s easy to read. Takes three triple A batteries. Can also download an app by scanning QR code to use with scale.",
    "post_time": "Reviewed in the United States on June 5, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works well and shows correct weight",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Nice scale",
    "rating": "4.0 out of 5 stars",
    "content": "Not a bad scale but the feet are kinda weird, they flop around which make me worry one of them will eventually break when I slide the scale around.",
    "post_time": "Reviewed in the United States on February 26, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Due to health issues I must monitor my weight daily. My new G E scale is about perfect for me with a large lighted reading area for aged eyes to easily see, set low to floor so it doesn’t tip when I step on it, large foot pad good for old unsteady feet. Made in the USA, just what the doctor ordered.",
    "post_time": "Reviewed in the United States on February 22, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Weird feet",
    "rating": "5.0 out of 5 stars",
    "content": "Before buying the GE Bluetooth-capable scales, I was forced to endure the digital drudgery of remembering my weight, then tapping keys on my phone to enter it. No one should have to go through all that! This is, after all, the 21st Century.",
    "post_time": "Reviewed in the United States on February 10, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "All kidding aside, these scales automatically upload my weight and BMI to the free \"Fit Profile\" app and keeps track of changes in both. The app will also chime when the measurements are complete. The unit also has a sleek, low profile that works well with my modern bathroom design.",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Excellent choice",
    "rating": "5.0 out of 5 stars",
    "content": "10/10",
    "post_time": "Reviewed in the United States on February 22, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this scale!  Has an old school RED LED display that I can actually read!!!  No unlit LCD that you need to look at sideways and upside down to get a strong reading.  Phone app is great!  Just open it, step on the scale, the phone dings and your weight is recorded.  App has many features.  I had slim hopes but loved the price, and am extremely happy with it!!",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "I can't be lazy anymore",
    "rating": "4.0 out of 5 stars",
    "content": "Honestly, there are features on this scale I doubt I'll ever find, much less use. It's a technological marvel.",
    "post_time": "Reviewed in the United States on February 11, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What I use it for is just to keep track of my weight and it does that perfectly. I like the easy to read digital display and the sturdy construction.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "great!",
    "rating": "4.0 out of 5 stars",
    "content": "We all like it and it fits in our smallish bathroom.",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This weight scale has truly transformed my approach to health and fitness. Its sleek design and accuracy make it a standout product in the market. The scale's precise measurements provide me with the confidence and motivation I need to track my progress effectively. The ease of use and clear, easy-to-read display make it a seamless experience every time I step on. Additionally, its durable build ensures longevity, making it a reliable companion in my wellness journey. Overall, this weight scale is a fantastic investment for anyone seeking a dependable, accurate, and stylish tool to monitor their weight and health goals.",
    "post_time": "Reviewed in the United States on December 14, 2023",
    "pid": "B0BW3N71LT"
},
{
    "title": "Excellent Scale",
    "rating": "5.0 out of 5 stars",
    "content": "After medical problems I needed to start watching my weight. I don't need all the other measurements. Just wanted a nice, simple digital scale for weight management. Bonus is with the app it'll record it",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Weight works really well. Doesn't fluctuate up and down like our old one. Only used it a few times but I'm happy with purchase. It does look nice and I'm a big man, so I'm happy it's not super small like some scales either. It doesn't always turn on from lightly touching it though like our old one but it turns on if you stand on it so that's OK. Just how it works I suppose.",
    "post_time": "Reviewed in the United States on February 1, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Simple digital scale",
    "rating": "5.0 out of 5 stars",
    "content": "It holds, 400 pound butt with ita complaint. The sounds it makes tho... even if I lose weight, due to my BMI, is childish wompwomp type sound.",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I check my weight regularly and wanted an accurate scale that is comparable to my doctor’s scale.  This one fits the bill. It hits my accurate weight in seconds and does not change if I get on and off the scale again.  It has a clear easy to read display. It sets up immediately after the batteries, which are included, are installed.  I also like the fact that it syncs with the app associated with the scale when I weigh and keeps track of my weight and my BMI on the app.  (Note: you have to have the app open when you weigh for it to register your data.)  I highly recommend this scale.",
    "post_time": "Reviewed in the United States on October 25, 2023",
    "pid": "B0BW3N71LT"
},
{
    "title": "Works as intended",
    "rating": "4.0 out of 5 stars",
    "content": "It does in fact weigh you...accuracy is... iffy. And the app is mostly garbage. It's not actually a \"smart scale\" which can read your body fat percentage. The app gives you manual-data input options to then attempt to \"guesstimate\" your BFP. And I got on and off the scale about ten times over the course of as many minutes and the readings varied by several pounds in both directions. Not thrilled with it. But now that Amazon makes you pay to use the previously convenient free return shipping, I guess I'm stuck with it.",
    "post_time": "Reviewed in the United States on November 12, 2023",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've never had a scale like this one. The design is nice and is able to weigh smaller items under 50lbs. I went to a doctor recently and weight was about 8lbs off but I can't say which scale was accurate/wrong. That's not a huge difference but you want accuracy. Hoping this scale can be used for years to come!",
    "post_time": "Reviewed in the United States on March 13, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Truly bariatric",
    "rating": "4.0 out of 5 stars",
    "content": "Appears well made.  First weight attempt was right on the expected weight.  I have a goal to lose 10 lbs. This scale is my tool to help meet this goal.",
    "post_time": "Reviewed in the United States on February 1, 2024",
    "pid": "B0BW3N71LT"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My last scale had an LCD (the black segmented lettering) readout and it was difficult to see if the lighting conditions weren't exactly right.  This LED readout (giving off its own light) is way more legible.",
    "post_time": "Reviewed in the United States on March 31, 2024",
    "pid": "B0BW3N71LT"
}
]