[
{
    "name": " The Women: A Novel ",
    "stars": [
        "81%",
        "14%",
        "3%",
        "1%",
        "1%"
    ],
    "pid": "B0C4QD5VPB",
    "ratings": "190,187 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "An excellent and touching depiction",
    "rating": "5.0 out of 5 stars",
    "content": "I really appreciated that this book did not sugar coat the wartime experience of the women and men who served. The author mentions in the notes that all of the places and hospitals are real, and that many of the events in the book are compiled from actual experiences of women who served in Vietnam saving the lives of grievously wounded soldiers and airmen.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I also appreciate that the author accurately depicted the very mixed and sometimes cruel treatment that veterans endured upon returning. The PTSD that plagued them but was not in the DSM until years later. WWII veterans were treated as heroes, but Vietnam veterans were treated as pariahs.",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "The Best Book: It Has it All!",
    "rating": "5.0 out of 5 stars",
    "content": "This book depicts the good and the bad: the camaraderie of those who served, but also the flippant disregard of people who used money or influence to shield themselves from serving. Vietnam, like many wars, was a war largely fought by the poor. There were many people who preferred to pretend that the war didn’t exist. I appreciated that even among the descriptions of people being horribly wounded and dying, there are the stories of hope. Soldiers who save each other. The two who carry their friend for miles through the jungle to get him to a hospital. The nurses who hold soldiers hands and give comfort and help the doctors who save lives on the operating table. The lengths that people will go through to help support their brothers and sisters in arms.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My generation didn’t fight in Vietnam, but we did fight (and die) in the longest war in US history - Afghanistan. I pray that we have learned our lesson from Vietnam and that we never ever treat our veterans as abominably after a war as Vietnam veterans were treated. They were asked to serve their country, and they did, and they deserve the appropriate amount of support upon return.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Hard to write when you're crying",
    "rating": "5.0 out of 5 stars",
    "content": "To all of those who served, in Vietnam or otherwise, thank you for your service. You are not forgotten.",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kristin Hannah can write - I already knew that! I did not know any one could make you see life with all its ups and downs (we've all had our share of those).",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "a Vietnam veteran’s daughter",
    "rating": "5.0 out of 5 stars",
    "content": "What makes this particular book so special is the way Hannah lets the reader identify with the main character to the point where her triumphs, failures, and disappoints (a/k/a Life) teaches valuable lessons.. The storyline is so incredible, one doesn't fully take in the magnitude of these lessons until they read the final chapter - at that point I personally felt I was capable of achieving anything!",
    "post_time": "Reviewed in the United States on March 24, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I served in the military but right after Vietnam was over.  I was just a bit too young.  I remember having F#$% the Army yelled at me because I was in uniform. Even 10 years ago someone went ballistic about my DV plates.  I love how that author brought in the flavor of the time it was.  Brought back so many memories.  I wonder if any women who didn't serve in the military will read this book and understand? It brought back memories of the TV show \"China Beach\"  and memories of the music and the political atmosphere. And it brought tears, lots of them, for what was lost.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Must Read",
    "rating": "5.0 out of 5 stars",
    "content": "Thank you, Kristin Hannah. I felt like I was given a glimpse into the lives of my parents. My father served 3 tours in a heavy attack squadron. My mother was our hero at home. They sent tape recordings to each other so we could all hear each other’s voices. When missing him became more than my mom could endure, she packed up my sister and me and we moved to the Philippines to be closer. The squadron came to the Philippines regularly and we went to the Officers Club for dinner and watched our parents dance together and then all the kids were seated in front of a big screen to watch Startrek. We woke up, went to church and kissed him goodbye again. I’m incredibly proud of their service and it breaks my heart to read how badly they were treated when they came home. He’s still with us at 91 and loved his wonderful service in the Navy. I could not be prouder.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Kristin Hannah has long been my favorite author. Time and time again she renews my love of history. Emotional read but so worth every page. I am thankful what when I mentioned this book to my dad (a wounded Vietnam Veteran), he said there were lots of women in Vietnam. Thank you to the author for writing a raw, powerful book about brave women and the adversity they and all veterans went through. She truly painted pictures of the reality of war, the conditions in-country, and the division within the United States.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "A fabulous rendition of a female nurse in the Viet Nam War",
    "rating": "5.0 out of 5 stars",
    "content": "This is a story of one woman who became an army nurse in Viet Nam. She comes from a wealthy family living on the West Coast whose son was killed in Viet Nam. Elizabeth decides she wants to serve her country by becoming a nurse serving in the war. She has no idea of what she is getting into. From the get-go, she is taxed with medical procedures she had not trained for and winced at being ordered to just do it. She does and does it well. She works long hours in miserable unclean conditions. She makes friends with other nurses, and parties when peace allows with both doctors and nurses.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The description is so good you feel you’re there working alongside her. She falls in love with one of the doctors who is engaged but wants her. She’s a good Catholic girl and suppresses her emotions.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Great Book",
    "rating": "5.0 out of 5 stars",
    "content": "She has to work to exhaustion. Even when it’s clear a soldier will not make it she and her team give it their best. Often they have to triage.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Her parents didn’t approve of their female daughter going off to war despite exceptional pride in their son’s service. Elizabeth and her brother were close and she felt that in part she was continuing his service. Her parents attitude was extremely hurtful.",
    "post_time": "Reviewed in the United States on March 28, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "One of the best books I've ever read",
    "rating": "4.0 out of 5 stars",
    "content": "Elizabeth falls in love with a second doctor and makes close friends with several nurses. She reups making her parents even less understanding of her choice. When she finally returns to a country who doesn’t believe nor appreciate her service in the now unpopular Viet Nam, it made it difficult for her to find a new self. In fact she flounders for years, including two love relationships.",
    "post_time": "Reviewed in the United States on July 3, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Finally, she finds comfort running a ranch in Montana and helps other female Viet Nam nurses reenter ordinary laugh.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Such an amazing and beautiful book!!",
    "rating": "5.0 out of 5 stars",
    "content": "This book has to be one of the best that portrays life fighting in Viet Nam. Tears trickled down my cheeks in the last chapter where The Women were honored.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The book provides an accurate depiction of what life was for nurses before and after they served in Vietnam. It provides insight into the struggles nurses endured while in Vietnam and maybe more importantly their struggles returning home. Just like their male counterparts they did not come home to a hero’s welcome. They were spat on, cursed at, called baby killers, shunned, and treated like they were the enemy instead of nurses that did their very best to keep our husbands, sons, brothers, and dads alive. They provided medical care, but more importantly they provided hope for the wounded. They held the hands of the severely injured until they took their last breath.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Women Weren’t There?",
    "rating": "5.0 out of 5 stars",
    "content": "If you are looking for a book “and they lived happily ever after,” then don’t crack the cover of this book. But if you want to read about the life of a young woman serving in Vietnam and her life thereafter then I highly recommend this book to you.",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book was truly amazing and fascinating! My uncle fought in the Vietnam War and I can remember conversations with my dad, who is i think 8 years younger, telling me how rough it must have been for him fighting and coming home to people protesting the War, my father being one of them. I think their choices divided them to a degree for several years but I'm so grateful that they have mended their relationship. I love that this book was told from the women's perspective and in their honor. What a triumph!",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "This is an excellent book filled with emotional stress.",
    "rating": "5.0 out of 5 stars",
    "content": "This book shows how mankind often is ignorant of the truth of a situation.  Kristen has a way of bringing out the truth of how various attitudes and bias can change the outcome of a situation.  Having lived during the Vietnam war and seeing how it affected many friends and acquaintances, I found this to be a very moving story.  The research behind the novel must have been enlightening.  Our society chose to ignore what was happening to the lives of those who served -especially the women.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved reading this book and until now never thought about the woman who serve our nation. Remembering the war, the protests and President Johnson decision not to run again brought tears to my eyes and wished I had been more thoughtful about our veterans. I know women are the last to be remembered and I hope and pray it will change for the women of today, and the future women of tomorrow. Most men do not understand what courage and strength we have.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "remembering",
    "rating": "5.0 out of 5 stars",
    "content": "A friend suggested this to me as her ex-husband was a Vietnam vet and so was I and she thought the story was a good read.  Well, I couldn't put it down. I read about the first third of it the first night and had to force myself to close it and go to sleep.  (I read before bed.)",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "For years I have had friends and family tell me I should write down what happened to me there, tell my life story, and time and again I have tried, but I'm not a writer. Now I don't have to.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Brought back vivid memories",
    "rating": "5.0 out of 5 stars",
    "content": "Ms. Hannah nailed my life story.  Yes, I said my life story. From the family's reaction to her enlistment to the trauma of coming home and told what I did wasn't important or real. It took years to overcome the PTSD and sadly this book brought a lot of it back (50 years later) BUT it was also healing.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It's one of the most accurate stories I've read about that time and place and the feelings and events that shaped who I am today.  It's an exceptional piece of work. And I highly suggest that anyone curious about that time and place, READ it.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "From a retired nurse",
    "rating": "5.0 out of 5 stars",
    "content": "Couldn't put it down . a real eye opener. I was never involved in war but did live through the Vietnam era. This story had all the components of  an award winning novel. I felt all the emotions of these nurses,, outrage,futility,sadness,compassion,profound grief, and the sense of joy and accomplishment achieved when one is able to help another individual through the worst time in their lives. The personal struggles of Frankie were heartfelt and brought tears to my eyes",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": ",",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "I lived the war!",
    "rating": "5.0 out of 5 stars",
    "content": "P",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My daughter and I wrote to two nephews who were sailors during the Vietnam war.  This novel brought back those memories.  Bob wrote about having to kill a Vietnamese who claimed up the side of his ship and tried to kill him.  He threw up over the side of the ship after!  Bob brought my daughter a doll  and we were afraid to let her play with it because it might contain a bomb.  Their homecoming was very sad.  I have a bracelet with a major 's name on it.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "As Good A Book As I Have Read in Years.....",
    "rating": "5.0 out of 5 stars",
    "content": "As someone who came to adulthood during the VietNam era, there were aspects of this story that were somewhat familiar to me. I could certainly place it comfortably in that era.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "What was NOT familiar to me was the story told here about the nurses who supported the military hospitals (often no more than a tent with no running water) and saved the lives of so many servicemen, even at risk to themselves.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Extraordinary",
    "rating": "5.0 out of 5 stars",
    "content": "It moved me to tears to realize that the women who served in VietNam were  ghosts to so many. The continued denial at the highest levels that there were women serving in this particular war zone was one more  burden these women suffered.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The politics of the era would probably have forced these women out of the picture altogether. The war was deeply unpopular, with waning support at the highest levels as it continued. To allow that women had participated in the trenches, even as support staff to the soldiers, would have blown the lid off what little support remained.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "There were no women in Vietnam",
    "rating": "5.0 out of 5 stars",
    "content": "As badly as our soldiers were treated, our women nurses were treated worse. It is ironic that these women had military titles, but were not considered active duty military.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This very well written book was a deeply satisfying read, even as it was unsettling. I highly recommend this to one and all.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Such a hard read for me",
    "rating": "5.0 out of 5 stars",
    "content": "A remarkable book telling it like it was. The characters are so well drawn and the plot reveals the tragedy of the forgotten veterans who returned home to hostility and were made to feel ashamed. The same thing happened in Australia and New Zealand as well.  PTSD was unknown back then and most of them received no help for their trauma. But there is hope and redemption as well. The real tragedy is that have been so many wars since - Iraq, Afghanistan, Ukraine…..On and on. It never stops.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Frankie McGrath, a seasoned combat nurse is home suffering from PTSD.  Only they didn't call it that then.  She's seeking assistance from friends,  family,  and the VA.  Everyone tells her there were no women in Vietnam.  Even her upper-crust family told their friends she was studying abroad.  The whole country is angry at returning veterans and booing them in the media and on the streets.  Hannah weaves a tale about one woman's journey and how she copes or doesn't cope.  There's passion,  romance,  betrayal,  death,  grief,  and incredible frustration in these pages.  But you need to read this!  It's a story about the women who were in Vietnam,  who patched the wounded and held the hands of dying men,  all while shells exploded around them and the rat-tat-tat of guns.  These women didn't run except toward landing choppers full of wounded and dying men.  Their days were endless and the war was grinding on relentlessly.  They formed friendships that lasted lifetimes and later discovered that maybe their friends were the only hope they had in the face of an ungrateful nation.  This was a dark stain on our nation's history and this story drives that home.  Hey!  Kristin Hannah writes amazing books and tells an awesome story.  This is one you won't put down and will stay with you long after the last page.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Love and Remembrance",
    "rating": "5.0 out of 5 stars",
    "content": "Though I did not serve in Vietnam, I am considered a Vietnam era vet. Many of my friends came back deeply changed. They were further damaged by the treatment meated out to them by the society to which they returned. This book was, therefore, hard to read for me. My empathy ran deep and strong. I feel Hannah did an outstanding job capturing the world, the emotion, the angst of what is known as the Vietnam War. I recommend reading this to help you grasp the time and era.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This book brought to life the story of a young, idealistic woman who basically only wanted to make her parents proud. What Frankie (and all Vietnam vets) went through was a travesty. The war that never should have been fought… The book was well written and hard to put down. What I didn’t like was the reminder of just how badly Vietnam vets were treated, and I had no idea that nurses were treated with so little respect after serving. I also always thought that Agent Orange was a chemical. Had no clue that it was a herbicide. The story definitely needed to be told! I would recommend this book to anyone who loves to read and is not afraid of a few tears. This is a book I will probably read again after I’ve had time to process the whole thing. There is a lesson to be learned about how important family and love is, and know that each and every one of us can make a difference in someone’s life, even if we’re not aware of it!",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "I had to put it down for a while",
    "rating": "5.0 out of 5 stars",
    "content": "Frankie’s story really hit me in a way that I wasn’t expecting. To the point where I had to walk  away for a little while. Nursing can often be a thankless job but to read about women whose service was denied by the men they served was especially hard. When I picked it back up I was so filled with pride for Frankie and a happy ending. I will be stopping by the women’s memorial next time I’m in DC",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "this is a great book! I, also wore a POW/MIA bracelet and only took it off when I entered a college nursing program. In clinical U were only allowed to wear a wedding ring or engagement ring. I asked to continue to wear my MIA bracelet and powers that be in my program refused therefore it spent many decades in my drawer at home. When the POWs came home and watched every program for the owner of mybracelet. He is still MIA.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Excellent",
    "rating": "5.0 out of 5 stars",
    "content": "I was in high school when the Vietnam conflict started. I got married at 20 years old to my pharmacist husband. As soon as he passed the state board, he was drafted as a medic. When he went to serve at Ft. Sam Houston in San Antonio, TX he was told he was overqualified and wound up teaching in the Medical Field Service School. We lived through the misinformation during those years that was handed down from the government.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Ft. Sam's Brook Army Hospital treated many soldiers that had been horribly burned during the conflict.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Fortunate Military Assignment",
    "rating": "5.0 out of 5 stars",
    "content": "This book was very descriptive of the medical treatment and, subsequently, the lack of respect for military personnel when they returned, including women caring for the wounded. My husband was very lucky during his tour of service. Thank you for researching and writing a very thought provoking novel!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I couldn’t put this book down. It was so well written and it made me feel like I was really there with Frankie through all the twists and turns in her life. Her heroism, heartbreaks, breakdowns, betrayals, her painful losses, and I found her incredible resilience to be an inspiration. This book celebrates the power of female friendships, especially those that were forged through the toughest trials in our lives. Each of us has fought a battle that gives us a window into another person’s struggle, and sometimes finding ourselves depends on our willingness to inspire others.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "excellent read!",
    "rating": "5.0 out of 5 stars",
    "content": "This was our era. We grew up and came of age with the Vietnam War. In “The Women” , Kristin Hannah tells the story of not only of Frankie, but also her two best friends and all of the women in combat in Vietnam and their struggles afterward.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Imagine trying to find help for the nightmares and flashbacks you’ve been having and being told by the VA that there were no women in combat when you served in a MASH unit just behind the front lines! Read this!!!",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Must Read for Women 65-75",
    "rating": "5.0 out of 5 stars",
    "content": "I LOVED this Kristen Hannah novel (the first of her novels I've read), and really appreciated that it tells the story of women nurses in Vietnam. There have been so many books and movies about the male soldier's experience in Vietnam, and as far as I know, none about the women who served. Easy, compelling read that I enjoyed very much. Will be reading other novels by this author. Also listened to it on Audible and thought the narrator was terrific!",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I loved this book. I could not have imagined what it must have been like to be a nurse in Vietnam,but in reading this book I became one with Frankie, the richly drawn heroine and narrator of The Women.",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "She took me there",
    "rating": "5.0 out of 5 stars",
    "content": "I'll just say it flat out: this is a book for women. I'm a woman, a woman born about the same time as the main character.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I remember the social cataclysm around the war. I remember sitting on the edge of the bed watching the lottery play out, determining which men would be drafted, and praying it wouldn't be my husband. I remember when a single woman could not buy birth control. Hannah's writing took me back there.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "An accurate account of the horrors and aftermath of the War in Vietnam told with honor and respect.",
    "rating": "4.0 out of 5 stars",
    "content": "Because The Women is historical fiction, young women who read it will understand something more about the Viet Nam War era than they did before - something more of what it was like to be a woman in the 60's and 70's.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Also, I'm a nurse and I've seen some chaos in my time. So the parts of the narrative that deal with medical crises were very real to me, and are not for the faint of heart.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "A young woman comes of age during the horrors af Vietnam war.",
    "rating": "5.0 out of 5 stars",
    "content": "While I can relate to some of the criticism about the plot and writing style, once I got to the 2nd chapter, the power of the storytelling overcame all else.  5 stars for enjoyment level.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A former employer of mine had served as a Neurosurgeon on a hospital ship off the coast of Vietnam, and this book accurately mirrors part of the experience that he was willing to share with us.  Most especially, he continued to have nightmares about \"incoming.\"  Additionally, our office was across the street from our hospital that employed a helipad, and he shared that each time he was aware of an incoming chopper, his initial reaction was to run to help.  As the book reveals, we who did not serve in that place cannot possibly understand what they lived through then and even now.  They'll always deserve the highest respect.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Well done, Kristin Hannah!",
    "rating": "5.0 out of 5 stars",
    "content": "A story of the horrors of the Vietnam conflict from the experiences and perspective of a female nurse.  Declaimer, I’m not a veteran but the descriptions of the living conditions, the horrific wounds suffered, and the emotional toll are believable.  The prose is a straightforward story of an inexperienced and naive young nurse “Frankie” that leaves a privileged life and goes off to the combat zone because her brother and his friend (later to become her lover) went, and she is told “women can be heroes”.  Roughly the first half of the book is about Frankie’s experience dealing with wounded and dying in combat, the second half her struggles adjusting to a return not welcomed by society or really her family.  Her life begins to devolve into broken relationships, madness and addiction, and her eventual reconciliations and recovery.  The prose and the plot are straightforward if occasionally contrived and at times predictable, but the author is effective in engaging the reader with Frankie’s struggles.  I wouldn’t put it up with “The Things They Carried” (Tim O’Brien) as a masterpiece of historical fiction about Vietnam but certainly a worthwhile read. A NYT #1 bestseller.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is so well written that I had to remind myself that I am NOT Frankie, that this was her experience and I was just reading about it.  I felt like I was there, amidst the pain, the anguish, the beauty, the tears, everything that was written so masterfully.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Moving",
    "rating": "4.0 out of 5 stars",
    "content": "I remember seeing a POW/MIA bracelet on the wrist of a friend’s older brother.  That memory flooded back to me, and reminded me  of that crazy, crazy time.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0C4QD5VPB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I wish I could have helped them return to the US as heroes, they certainly deserved a heroic welcome.  Thank you to any and all that have served. Your service was not given in vain.  I honor you and am sending love from my heart to yours.  God bless you, everyone.  🇺🇸",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0C4QD5VPB"
}
]