[
{
    "name": "        Nilight TPE Floor Mats for Hyundai IONIQ 5 SE Standard Range SE SEL 2022 2023 2024 Movable Console,All Weather Custom Fit Heavy Duty Floor Liners       ",
    "stars": [
        "87%",
        "7%",
        "4%",
        "0%",
        "2%"
    ],
    "pid": "B0C5T1F8FQ",
    "ratings": "79 ratings",
    "other_info": {
        "Color": "Black",
        "Brand": "Nilight",
        "Product Dimensions": "25\"L x 5\"W x 20\"Th",
        "UPC": "840323907583",
        "Global Trade Identification Number": "00840323907583",
        "Manufacturer": "Nilight"
    },
    "discount_price": "$ 109.",
    "normal_price": "",
    "about_this_item": [
        " DIRECT FIT - These custom made floor mats are perfectly tailored to compatible with Hyundai IONIQ 5 SE Standard Range SE SEL 2022 2023.  ",
        " DURABILITY - Nilight's heavy duty mats are constructed from high-quality TPE can stand up to years of wear and tear especially compared to less sturdy cloth mats.  ",
        " SEAMLESS PROTECTION - Nilight's floor mats protect your upholstery from big spills as well as the smallest sand particles. No matter the damaging effects of water, mud, snow, ice, dirt, sand, pet fur, and debris.  ",
        " FAST CLEANING - You can wash off messes that end up on your floor mats in seconds with soap and water. In some cases, a simple spray of the hose will do the trick.  ",
        " LIFETIME SERVICE - Everything is made to order with our advanced CNC cutting machines and applications so you can make certain your floor mats are created just for you to your preferred specifications. Your order will also include all the required clips and fixings to fasten your mats to your existing car fixings.  "
    ]
},
{
    "title": "Perfect Fit",
    "rating": "5.0 out of 5 stars",
    "content": "These fit perfectly in my 2021 Santa Fe. I was going to get the weathertech mats but I thought I would give these a try first since they were less than half the price. They fit with no overlapping and are not oversized at all. I pull them out every week when I clean my car and wipe them down. Easy to put back in. They are not the cheap hard plastic that don't sit right. Soft plastic that is easy to clean. They haven't hardened in the cold either which is nice.",
    "post_time": "Reviewed in the United States on November 2, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just perfect...fit, quality, ease of use. Nice looking!",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Perfect fit!",
    "rating": "5.0 out of 5 stars",
    "content": "We had WeatherTech floor mats in our last car, but didn’t want to pay out that much money for our new car.  Read the reviews and went with these.  Some reported theirs arrived creased, our did not.  One lip was slightly out of whack, but once it sat in the car awhile, it fixed itself.  Fits perfectly in the car and seem very durable.  Time will tell, but I would recommend them.",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Fits perfectly for my car and keeps out sand and mud that gets tracked inside the car especially if it’s raining",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Nice durable mats.",
    "rating": "5.0 out of 5 stars",
    "content": "I am so happy with these floor mats! I wasn’t expecting much because they cost less than a set that I had to return due to failure to fit. The combo of the quality and the price is fantastic. They are a flexible,",
    "post_time": "Reviewed in the United States on April 2, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Semi-thick rubber/plastic. They fit perfectly in my 2024 Palisade XRT. It doesn’t include a cargo mat for the back, but still well worth it!!!!",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Excellent floor mats",
    "rating": "4.0 out of 5 stars",
    "content": "I think this was an amazing buy. It was such an amazing buy also bought my mother some they fit well they fit just like the more expensive ones that they offer online. I love them. You can vacuum them and they clean well you can wipe them off they keep your car so clean great buy for your vehicle.",
    "post_time": "Reviewed in the United States on February 6, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nice fit, easy in-and-out, and non slippery (getting in-and-out when wet).",
    "post_time": "Reviewed in the United States on March 8, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "The combo of the quality and the price is fantastic!",
    "rating": "5.0 out of 5 stars",
    "content": "These are awesome.  I just put them in last night and they fit like a glow.  The holes lined up perfect with the hooks so they will certainly stay in place.  The second row did not seem to fit at first, I had to stretch it to get the hooks to line up.  This is only because they were fresh out of the box and had not settled from the folds.  The quality is excellent , I am sure they will prove to be durable and easy to clean.  The color is deep black with a texture, so they look really nice.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These mats fit perfectly in my 2023 Hyundai Palisade XRT!! I love them, definitely recommend!!",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Good fit",
    "rating": "5.0 out of 5 stars",
    "content": "I just installed these today, and the fit looks pretty good. The mats feel substantial, I had to lay them out last night to help them flatten out from being folded during delivery. Easy to install and fit well in my 2024 Ioniq 5, which has the moveable console.",
    "post_time": "Reviewed in the United States on March 24, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Nice fit at good price",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Nice fit",
    "rating": "5.0 out of 5 stars",
    "content": "Couldn't have been easier. They practically flew out of the box and into the car unassisted.  I will say the box thay shipped in was Size of a freezer.",
    "post_time": "Reviewed in the United States on April 3, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "They are very nice but I sent them back because the wouldn't fit 2024 Santa Fe XRT",
    "post_time": "Reviewed in the United States on March 30, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Fits like a glove.",
    "rating": "5.0 out of 5 stars",
    "content": "BUT,  I'll still rate a Five because of quality.",
    "post_time": "Reviewed in the United States on February 14, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have purchased Weather Tech products before I found these and they are great for the price compared to Weather Tech. They are definitely a great price for a great product.",
    "post_time": "Reviewed in the United States on February 27, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Did not fit 2024 Santa Fe XRT",
    "rating": "5.0 out of 5 stars",
    "content": "These are well made and fit the vehicle perfectly…great for the price and would definitely recommend",
    "post_time": "Reviewed in the United States on February 16, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are better quality than others and they do fit the 2024 hyundai tucson pretty good.",
    "post_time": "Reviewed in the United States on March 8, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Great Fit",
    "rating": "5.0 out of 5 stars",
    "content": "Great quality",
    "post_time": "Reviewed in the United States on January 11, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Have used weathertech in past. Figured take a look at these. As advertised. Price is rite.Fits my 2023 Santa Fe perfect.",
    "post_time": "Reviewed in the United States on January 17, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "perfit fit",
    "rating": "5.0 out of 5 stars",
    "content": "I bought for my Santa Fe, the fit is perfect, glad I bought this brand",
    "post_time": "Reviewed in the United States on December 20, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I think the mats are hard if they were softer they would fit even better",
    "post_time": "Reviewed in the United States on October 23, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Fit great",
    "rating": "5.0 out of 5 stars",
    "content": "I reluctantly made the purchase for my 2023 Hyundai Tucson. I typically purchase Weathertech, but wanted to give this product a try. The mats were a perfect fit and they are durable. The price was right (much less than the competitor) and will buy again for future vehicles we buy.  I highly recommend!",
    "post_time": "Reviewed in the United States on April 21, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Extremely pleased with our purchase. They fit well in our 2024 Tucson.",
    "post_time": "Reviewed in the United States on October 3, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Very Impressed",
    "rating": "5.0 out of 5 stars",
    "content": "Fit great and I like them",
    "post_time": "Reviewed in the United States on September 3, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very happy with the rubber weather liner for my 2023 Tuscan.",
    "post_time": "Reviewed in the United States on July 7, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Perfect Fit",
    "rating": "5.0 out of 5 stars",
    "content": "Great floor mats!!",
    "post_time": "Reviewed in the United States on July 30, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Buena calidad súper recomendados ajustaron super en mi Tucson 2023, Highly recommended for a Tucson 2023",
    "post_time": "Reviewed in the United States on April 13, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Like them",
    "rating": "1.0 out of 5 stars",
    "content": "These were folded in the box and kept the crease.  They won't lay flat",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Note: In my excitement i skipped over the part saying for moveable console version. Mine is fixed, but it only leaves a small gap of carepet revealed in the back middle portion. Other than that the fit is still perfect so im using with no issues.",
    "post_time": "Reviewed in the United States on November 19, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Fit but still a little lumpy",
    "rating": "4.0 out of 5 stars",
    "content": "These are great floor mats for the Ioniq 5, very durable and they fit perfect but they come folded and bent in a box so I'm still waiting for them to flatten completely (but I think they will).  They're very durable and thick and well made.  No garish designs or big logos on them, nice and plain.",
    "post_time": "Reviewed in the United States on October 1, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Ok fit with some wrinkles on the sides though",
    "rating": "4.0 out of 5 stars",
    "content": "Installation was easy but the mats were jammed inside the packaging box, and was hard for them to return to original shape. Instead, I found wrinkles here and there, and after installation, wrinkles still present and made the mats not able to cover all sides. FIt was OK, and coverage is pretty good except for areas with wrinkles.",
    "post_time": "Reviewed in the United States on September 16, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Floor Mats that Fit and Are Durable",
    "rating": "4.0 out of 5 stars",
    "content": "Ill need to wait and see how long it will take the mats to become wrinkle free. I will follow up then.",
    "post_time": "Reviewed in the United States on September 10, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "What a robust and attractive floor mat!!",
    "rating": "5.0 out of 5 stars",
    "content": "i just purchased a new Ioniq 5 and was looking for floor mats to protect the carpeting. These floor mats are perfect. They fit snugly in the front and back floorboards. The mats are made of heavy-duty rubber and are easy to remove for cleaning. The mats have an anti-slip quality to them to prevent your feet from slipping off the pedals while driving. These are quality floormats that are highly functional and look good in my car.",
    "post_time": "Reviewed in the United States on December 2, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Mixed feelings!",
    "rating": "4.0 out of 5 stars",
    "content": "I acquired this mat for my wife’s 2022 Hyundai Ioniq 5. The factory installed ones were permeable to liquids and were virtually impossible to clean. These are impervious to liquids, are easy to clean and the fit is perfect. My wife loves them and also highly recommend them. In addition, the cost benefit is very high. A must for anyone driving an ioniq 5.",
    "post_time": "Reviewed in the United States on August 28, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Fits well on 2023 SEL trim",
    "rating": "5.0 out of 5 stars",
    "content": "THE GOOD: 1st row mats, work great. They fit, they protect floor, they feel sturdy and I would recommend these mats for anyone looking for 1st row mats.",
    "post_time": "Reviewed in the United States on August 30, 2023",
    "pid": "B0C5T1F8FQ"
},
{
    "title": "Perfect fit for 2023 Ioniq 5 (SE RWD)",
    "rating": "5.0 out of 5 stars",
    "content": "THE BAD: The floor mats that were on the picture were not the same floor mats that we received. As you can see by the picture, the 2nd row mats do not fit the 2nd row on our IONIQ 5.",
    "post_time": "Reviewed in the United States on August 29, 2023",
    "pid": "B0C5T1F8FQ"
}
]