[
{
    "name": "        e.l.f. Halo Glow Contour Beauty Wand, Liquid Contour Wand For A Naturally Sculpted Look, Buildable Formula, Vegan & Cruelty-free, Light/Medium       ",
    "stars": [
        "71%",
        "14%",
        "9%",
        "3%",
        "3%"
    ],
    "pid": "B0C6C8Q228",
    "ratings": "5,113 ratings",
    "other_info": {
        "Item Form": "Cream",
        "Finish Type": "Natural",
        "Coverage": "Full",
        "Brand": "e.l.f.",
        "Color": "Light/Medium"
    },
    "discount_price": "$ .",
    "normal_price": "$16.99",
    "about_this_item": [
        " MAGIC CONTOUR WAND: Give your complexion stunning definition with this magic contour wand. With an easy-to-use cushion tip applicator, this sculpting tool lets you contour like a pro! Allure Best of Beauty 2023 Winner  ",
        " CREATES RADIANT, NATURAL-LOOKING DEFINITION: The lightweight liquid formula is infused with hydrating squalane to add natural-looking definition and a glint of radiance. BUILDABLE & BLENDABLE FORMULA: Buildable contour formula effortlessly blends into skin.  ",
        " BUILDABLE & BLENDABLE FORMULA: Buildable contour formula effortlessly blends into skin.  ",
        " CUSHION-TIP APPLICATOR: Gently squeeze wand and use the cushion-tip applicator to apply to your hairline, temples, sides of your nose, hollows of your cheeks, and jawline, then blend in color with a bronzer brush for a naturally sculpted look.  ",
        " SKIN-LOVING INGREDIENTS: All e.l.f. products are made from skin-loving ingredients you want, minus the toxins you don’t—all at good-for-you prices. All e.l.f. products are 100% cruelty-free and Vegan.  ",
        " Allure Best of Beauty 2023 Winner  "
    ]
},
{
    "title": "I like it",
    "rating": "5.0 out of 5 stars",
    "content": "Dries a little quickly, other than that it’s great! No odd smells or textures, this cream/liquid contour is my favorite. It’s got a cooler tone hue, and it’s easy to blend (just do it quickly!). It’s good with or without a full face and looks nice.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great contour.  Just dab and blend.  Its perfect!",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Love This!",
    "rating": "5.0 out of 5 stars",
    "content": "Gives a nice sunkissed glow and blends seamlessly!",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "E L. F. Is killing it lately with their incredible products that rival brands three times their price! Was looking forward to trying this Halo Glow Beauty Wand Contour since it came out recently. I have fair/light skin tone and have a hard time finding a complimentary shade of contour at any price range. Most contour is too dark or has an orange tone to it that looks like mud on fair skin. I really liked the color of fair/light in the picture on Amazon and decided I had nothing to lose for $9. I ordered it last night around 10 pm and it arrived this morning at 8:30 am just as I was applying my makeup for church. The color is perfect! The fair/light shade is the most complimentary color for light skin tone I've ever seen. It was a light brownish-nude color that blended beautifully and easily for a subtle but definite contouring effect and it's buildable. Instead of standing out, it was more of a shadow on the skin that was natural and beautiful instead of a dark, glaring, muddy look. Great applicator, easy to use and no mess or spillage. I used a brush to blend. It's very creamy and didn't fade at all in the four hours until I took it off. It doesn't have a matte or luminous look, just very natural looking and didn't make my skin look dry and cakey. Excellent product at a great price. Best contour I've ever used and I've tried them all. I'm ordering the Halo Glow Beauty Wand blush immediately. I also ordered the E. L. F. Holy Hydration Cleansing Balm and was blown away. See my review for that too. No promotion, I paid full price for both.",
    "post_time": "Reviewed in the United States on October 8, 2023",
    "pid": "B0C6C8Q228"
},
{
    "title": "👍🏼",
    "rating": "4.0 out of 5 stars",
    "content": "I recommend getting the light/medium shade for bronzing (warmness) & the fair/light for strictly contour (very cool toned). I like the warmness of the shade I bought because it's not overwhelming or orange. It can be a little tough to blend if you let it sit too long because it dries down so I use a damp beauty blender almost immediately after applying & that does the trick!",
    "post_time": "Reviewed in the United States on May 5, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This product is great for dry skin. I had no issues with it, the color is very warm and it lasts all day.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "E. L. F. does it again!",
    "rating": "5.0 out of 5 stars",
    "content": "Me agradó",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "A little darker than I wanted but good quality",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Dries down quick!",
    "rating": "4.0 out of 5 stars",
    "content": "This product is cheap and easy to you the color is a little too orange. However for the price it’s a super convenient bronzer if you’re on the go. And easy to blend!",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to apply! Lasts all day. Easy to blend! Easy squeeze tube for fast application!!",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Elf Halo contour beauty wand",
    "rating": "4.0 out of 5 stars",
    "content": "It was a gift that was on my granddaughters list.She loves everything Elf .I think it’s a little pricy but she likes it all so I guess you use what you like best .",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love this bronzers, took me a while to get since it was also sold out in stores. Definitely did not disappoint once I tried it. I have oily skin so naturally my go to bronzers are powder! but this bronzer for sure is an exception! Love it!",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Perfect bronzer for all skin types",
    "rating": "4.0 out of 5 stars",
    "content": "I loved it the shade and everything it js dries quick so if you dont blend within i would say 5 seconds after applying, it will be patchy",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "use this every day and it’s super easy to blend!!",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Drying",
    "rating": "4.0 out of 5 stars",
    "content": "The quality of this product is average. Not sure if I just didn't get a shade that best matches my skin tone, or if this product is very sheer on purpose. I did not see much pigment when applied to the skin. I don't think i would repurchase this.",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am fair skinned with neutral undertones and this shade is perfect!",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "love!!",
    "rating": "5.0 out of 5 stars",
    "content": "I like that it's cool toned and didn't leave my looking orange. I'm very minimal with my make up and it's very easy to use and blend out.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have purchased this several times -it does work well, but  not amy favorite there are others that are in the drugstore category that work much better. I prefer a stick contour or blush because you are controlling the amount on your face more. I also don’t think the product stays on as long as the sticks. It is a product worth buying especially if you get it on sale. I gave it four stars because it’s not the holy Grail, but I was thinking it would be when I purchased it due to viral views. It might work for you a little better.",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Product Arrived as Expected",
    "rating": "4.0 out of 5 stars",
    "content": "I prefer powder products, or cream to powder for my contour/blush/bronzer. I'm getting older so I'm trying to use more cream products, but I struggle to blend liquid products properly and it just seems like more work than necessary. Many times liquid can look muddy. Maybe it's just a matter of practicing.  Still, more time consuming to blend than just placing powders exactly where I want them and easily blending out.",
    "post_time": "Reviewed in the United States on March 18, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Me encanta como de difumina y lo fácil q es de usar también que deja la piel con un glow bien bonito",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "ADDS THE PERFECT GLOW",
    "rating": "5.0 out of 5 stars",
    "content": "Great product that is vegan friendly! As a sufferer of many allergies, vegan products are the best fit for me and this beauty wand does not disappoint!! It is easy to apply, very light to the touch, does not look cakey and adds the perfect pop of color!",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I like the color and it stays all day but it dries so quickly that it can be hard to blend. I have dab it on in one area and IMMEDIATELY blend it. I can’t dab around my entire face then blend. I find that a bit annoying when using. If I miss the window, I have to wet the area down so it’s not a dark streak on my face.",
    "post_time": "Reviewed in the United States on March 30, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Dries too quickly",
    "rating": "5.0 out of 5 stars",
    "content": "For the price I thought why not try it, when I ordered the e.l.f. Camo CC.  Immediately after trying this product I loved it.  I have been using just a bit of powder bronzer along sides of nose, but this was amazing.  it works so well, just enough tint-- no chance of overdoing it and looking bad.  I am so glad I found this.  Did not even know I needed it.  I have applied by jawline, hairline, and it really enhances.  I would recommend to anyone who uses contour but wants lighter, especially for summer. I live where there is extreme heat and humidity and worked well.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Good for daily use",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Did know I needed this, love it!",
    "rating": "5.0 out of 5 stars",
    "content": "I was worried about the color but I blends out so nicely!",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very good shade for someone pale. They blend out super quickly and nicely with both a brush and a beauty blender.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Very nice",
    "rating": "5.0 out of 5 stars",
    "content": "I really like this contour. It is easy to apply and it blends well with my skin. I had been using a stick before and the liquid is easier to apply in specific spots!",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This contour honestly does its job but if you touch it at all even with setting spray it splotches and the color fades pretty fast leaving your cheeks kindve splotchy looking.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Great color",
    "rating": "4.0 out of 5 stars",
    "content": "The formula of this product is amazing don’t get me wrong. But the packaging in this gets really messy after using it. It gets full of the product and overall looks kind of gross. Other than that the formula is amazing and would definitely buy again. The only downside about the formula is it’s a little bit hard to blend if your beauty blender isn’t wet.",
    "post_time": "Reviewed in the United States on March 14, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Not a fan of it",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "It's Ok",
    "rating": "3.0 out of 5 stars",
    "content": "I'm not much on makeup but this did the job. Not great but will work in a pinch!",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have not been able to establish a satisfying relationship with a contour until now.  In the winter I'm VERY fair, and my skin is neutral in tone and things seem to oxidize warm on me after application so finding makeup products that don't end up orangey or muddy or weird is an uphill process.  This product, however, is a delight.  No orange cast that makes it look like I'm trying too hard to look tan in winter, sheer and blendable as can be, the texture is really lovely and it carries just enough pigment to create the most natural shadow contour.  The sponge tip offers more precision than any other product I've used, and the tiny hint of jowling I've developed is thankful for that; nothing's ever going to make it look like my jawline is snatched, but it makes it so that's not the first thing that draws the eye. Honestly, this product has impressed me so much that I'm really motivated to try the Halo Glow blush and highlighter as well.",
    "post_time": "Reviewed in the United States on December 23, 2023",
    "pid": "B0C6C8Q228"
},
{
    "title": "Just wow!  The first contour I really, really love for fair skin",
    "rating": "4.0 out of 5 stars",
    "content": "Wonderful product. Easy application. Easy on the pocket.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Amazing contour",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Elf never disappoints",
    "rating": "4.0 out of 5 stars",
    "content": "I saw these on social media and immediately wanted to try them, but they were out of stock at all my local drugstores and CVS/Walgreens so I ordered them here. This product arrived quickly, and while I like the blush versions (they blend well and offer a cute pigment/shine), the contour isn't as pigmented as I would like. When I dot it on my face it looks like it will be a good pigment, but when I blend it out using a blending sponge the pigment is not strong enough for effective contouring. Overall it's not my favorite, I'll be sticking to the NYX contour sticks for my contour but will consider these Halo Wands for blush.",
    "post_time": "Reviewed in the United States on November 21, 2023",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very pigmented so this product has lasted so much longer than I thought! This is my go to liquid bronzer/summer time contour!",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Love",
    "rating": "5.0 out of 5 stars",
    "content": "I’m extra fair skinned and the lightest shade is perfect for me. I was using Kevyn Aucoin’s contour powder or NYX in “so taupe” because of their “grey-er” base color, but this is my new go to when I wear liquid makeup. Very easy to blend and no “redness”. Basically, it doesn’t look like a fake tan, it looks like a light shadow, which is what contouring should be. This is a new staple in my daily makeup kit. Big fan!",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to apply and feels light. Perfect bronzer!",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Lightweight but not very pigmented for contouring",
    "rating": "4.0 out of 5 stars",
    "content": "Easy to use and good coverage. I normally use Kat von Ds contour kit but when I cant find it, this does the trick.",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use a lot of ELF products. This is by far the best contour I have ever used.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Cool color tone is on point",
    "rating": "4.0 out of 5 stars",
    "content": "The cool color is great. Not orange. Still working on application with this.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Lovely color! Will buy again.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Nice!",
    "rating": "3.0 out of 5 stars",
    "content": "Es buen producto calidad precio",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Let me say that I love this product... perfect sheer texture, perfect applicator, perfect shade for fair skin BUT.. every time I use it I break out. And I am not prone to break outs at all.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "No defraudar",
    "rating": "4.0 out of 5 stars",
    "content": "Took me a few weeks to realize I was suddenly only breaking out along my hair line and jaw line ;/",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Hi, I just want to tell you guys a little bit about this product. It is really awesome for mature skin. I am 44 years old and as you can see in the review video the only thing I have on my skin is my skin care my eyebrows were done, and the Elf Halo Glow. It does not settle into lines. It just looks so good on its own and makes your foundation look even better.",
    "post_time": "Reviewed in the United States on April 4, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Great Product... that made me Break Out",
    "rating": "5.0 out of 5 stars",
    "content": "Works perfectly, blends easily, it doesn't leave a greasy sensation and lasts long enough.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Surprised how light this can be and great for building up. This color matched my skin a little too well so I could’ve gone a shade darker for a better contour effect. That being said, I can still get that effect with a little bit more product and have a more natural sun kissed look.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Elf Halo Glow is great for mature skin!!!",
    "rating": "5.0 out of 5 stars",
    "content": "definitely would recommend! no complaints!!",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0C6C8Q228"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just what I needed",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B0C6C8Q228"
}
]