[
{
    "name": "        Food-Dehydrator Machine 12 Stainless Steel Trays, 800W Dehydrator for Herbs, 10.9ft² Meat Dehydrator for Jerky,190ºF Temperature Control,24H Timer,Powerful Drying Capacity for Fruits,Yogurt       ",
    "stars": [
        "78%",
        "12%",
        "4%",
        "2%",
        "4%"
    ],
    "pid": "B0CCXWK7CC",
    "ratings": "422 ratings",
    "other_info": {
        "Brand": "Cercker",
        "Material": "Stainless Steel",
        "Color": "Silvery",
        "Wattage": "800 watts",
        "Product Dimensions": "12.4\"D x 16.5\"W x 17.7\"H"
    },
    "discount_price": "$ 215.",
    "normal_price": "$158.99",
    "about_this_item": [
        " 【HIGH EFFICIENCY TECHNOLOGY UPGRADE】Cercker 12 trays food dehydrator madchine adopts a rear 2 row drying fan & air circulation technology upgrade.Wind speed of 2 m/s,1600 rpm. Provide a heat evenly distributed and efficient food drying process  ",
        " 【STAINLESS STEEL DESIGN】This food dehydrator is made of 100% BPA-free food-grade stainless steel. It’s corrosion-resistant & fire resistance is good.It is normal for stainless steel to have an odor. Please open the door and ventilate for 1-3 days  ",
        " 【DEHYDRATOR 12 TRAYS】Commercial food dehydrator have 12 layer food grade stainless steel trays 11.5 in, with a wrapped design,used for dishwasher. Large capacity, allowing for drying of vegetables, fruits, meat etc, while retaining nutrition in the food  ",
        " 【ELECTRONIC THERMOSTAT & TIMER】This dehydrator can adjust the temperature from 70℉to 190℉ (increments 5℉) and timer have 24h ( increments 0.5h) It can ensure the efficiency of drying various foods.Light control on the back button of the machine  ",
        " 【SAFE,INTELLIGENT,LOW NOISE】Intelligent shutdown function of the 800W, 120 V food dehydrator starts immediately after the timer ends. Once the dehydrator machine reaches 120 °C (including surroundings), overheating protection will be start & noise ≤50 dB  ",
        " 【CERCKER SERVICE】Cercker 12 trays food dehydrator set have recipe, door handle, drip tray, silicone gloves, screwdriver and food dehydrator user manual.If you have any questions about product.We will provide you with unconditional support and assistance  "
    ]
},
{
    "title": "The size of your dehydrator",
    "rating": "4.0 out of 5 stars",
    "content": "I got this one, but I don’t like it didn’t come with silicone trays works good. I tried it out. Dehydrating garlic made my own garlic granulated very quiet easy to use problem. Is it too narrow should’ve got a wider one and not as tall. I think I liked around ones.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It works, but the controls just do not make any sense. There are two on/off buttons, and none of them turns off the whole thing. When the timer ends the cycle, the vents stops, but the lights are always on. Or if you turn the switch on the back, the lights turn off, but the vents still working. I had to put an extra power strip to have the plug. And it is not energy-efficient at all, no thermal isolation or heat recovery. It is basically, a tin can with shelves, heating element, and a fan.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "The controls are bizzare, but it works.",
    "rating": "4.0 out of 5 stars",
    "content": "Works great, but it is made of parts with very sharp edges, so be careful!",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "this dehydrator is quiet, efficient, and reduces an impressive amount of garden tomatoes, peppers, and chives to shelf stable perfectly dried flavor bombs that keep th late season glut from going to waste. sturdy dishwasher safe metal mesh trays clean up easy, an although she's a little bigger, she looks classy on the counter.  fantastic!",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Edges are very sharp",
    "rating": "5.0 out of 5 stars",
    "content": "We like that there are 12 trays and the thing is so quiet. There is no interior light though and that would be a nice feature.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Simple yet sturdy design and the racks are so well made! Super happy with what I pulled out of the box. Now to make jerky!",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "a great workhorse",
    "rating": "4.0 out of 5 stars",
    "content": "Arrived on time. Runs quiet. Works great! I’ve made fruit leather and beef jerky already.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The only complaint I would have is that the light stays on when it’s plugged in, even when it’s powered off.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Big, but awesome for the most part",
    "rating": "4.0 out of 5 stars",
    "content": "N/A",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Due to it being on the smaller end and odd dimensions,  there aren't any accessories that fit. I.e trays for fruit leathers.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Beeps every few minutes",
    "rating": "4.0 out of 5 stars",
    "content": "It is a great size, I got the 12 tray one.  I dry herbs mostly, some of the leaves got sucked between the fan/cage area I can't get to them to clean them out.  but my main issue with it is that it beeps every three or four minutes.  I have it set at 100 degrees F.  I've only had it a couple of days though and i hope the beeping stops.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I was so excited about this dehydrator. Would power ON but would not power off. Going to send back and try a replacement. Hopefully, it will work properly on the next try.",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Update part 5",
    "rating": "4.0 out of 5 stars",
    "content": "Make sure you test it before you put on the handle, unwrap the trays and clean everything.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "———————————————————————",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Works as should",
    "rating": "5.0 out of 5 stars",
    "content": "Part 2 Review Update:",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Received the replacement - it did the same thing. Unable to power off the machine with the power button on the machine. HOWEVER - if you plug it into a GFCI Outlet - you can push the outlet button to kill power to that circuit, thus resulting in turning off the machine safely.  It is a good work-around for the machine not powering off at the power button. Unsafe to pull a plug while anything is still on - but most know that already.",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Great dehydrator!",
    "rating": "5.0 out of 5 stars",
    "content": "Other than that, a wonderful machine. I LOVE the two fans, 12 trays and not having to move the trays mid cycle.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the third dehydrator I have owned and (so far) other than the power-off button not working, I LOVE this unit!",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "I NEEDED THIS A LONG TIME AGO!!",
    "rating": "5.0 out of 5 stars",
    "content": "Strawberries (organic only) are in season and it is the perfect time to dehydrate them!",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "———————————————————————",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "🙂",
    "rating": "5.0 out of 5 stars",
    "content": "🙂",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "👍",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "👍",
    "rating": "3.0 out of 5 stars",
    "content": "This dehydrator is small very cute, very quiet, I don’t know It’s good or bad sometimes don’t even know if is turned on lol. The way it dry my meat is too dry and stick to the trays it’s very hard to pull the meat off. By the time I’m done my meat was cracked not pretty looking.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am using it almost everyday and very happy with the result. I now do not throw and fruit or veggie  crabs away I dry them keep in air tight container until full and grind it, which makes my own organic herbs and spices. The smell is not the same as store bought herbs or spices. If you have the time and love homemade organic food I recommend buying this dehydrator. The fruit crabs I dry I use for ice tea when dried it has so much more flavor.",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Very beautiful dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "This is a  SMALL  Food-Dehydrator Machine with 12 Stainless Steel Trays, 2 fans. The trays are smaller then the average size.  I am sure with the 2 fans the drying would be faster, but if you have a lot to dry, not the way to go.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely love this dehydrator. Easy to use and holds lots of produce. I'm low on freezer room and can't pressure can squash or zucchini, so this is perfect to preserve my harvest.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "So Far I Love it",
    "rating": "5.0 out of 5 stars",
    "content": "The only thing I'm not happy with is the light stays on when cycle is complete. I have to unplug it each time, but that's probably for the best anyway.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I started making beef jerky and decided to get this one because for the price you got extra shelves and dual fans in the back it is an awesome product I place about 11 lb of eye of the round beef in it at a time it makes enough jerky for a few weeks. I would recommend this product to anybody that wants to dehydrate!",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Has  2 fans",
    "rating": "5.0 out of 5 stars",
    "content": "This is a good product, works well and has lasted.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use this all the time. It dries evenly without moving trays around, cleans up fast and lite enough for me with spine injuries to put away without help.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Upgraded To This Dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "I have had a plastic round tray dehydrator for a number of years that I like but I wanted to do more at once and have a quieter machine, could clean easier, and could control the temperature. This met all those requirements. I make a lot of carnivore jerky and this does a great job. I also like to make carnivore chips and the drawback with this is the ultra thin meat dries into the grate. I needed to cut parchment paper for each tray which is not cost effective and a bit time consuming. I recommend this dehydrator come with mats to precent this. Additionally, adding parchment paper helps to maintain more of the fat and thus a more buttery flavor to your jerky and meat chips.",
    "post_time": "Reviewed in the United States on April 30, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a high quality product. I’ve been using it for all sorts of herbs.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Awesome dehydrator.",
    "rating": "5.0 out of 5 stars",
    "content": "Very good product support. We contacted and solved my problem!",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this to dry filament and it works very well.  Very quiet, accurate temperatures, multiple trays and looks very nice.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "The fan makes strange loud noises sometimes!",
    "rating": "3.0 out of 5 stars",
    "content": "Everything about this dehydrator is great except for the grates.  Everything sticks to them like crazy.  I have tried to season them and spray them every time I use it now but other dehydrators I own don't have this problem.  The holes on them are tiny, they are not ridged and when scrubbing them they feel like they are going to bend and break apart.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've been using plastic stacking tray dehydrators for years but it was time to upgrade. I mostly make thinly sliced meat for dog treats and had to rotate the trays half way through. With two fans, the meat all dries evenly.",
    "post_time": "Reviewed in the United States on January 14, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Accurate temps",
    "rating": "5.0 out of 5 stars",
    "content": "Things I was concerned about with this being metal was the external temp in case it's touched. Even at 195F setpoint,  it's not over heated. The sound level while running is so much quieter than what I had.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The trays fit so much better in my dishwasher than the large round ones. They aren't smaller in surface area and I can fit the same amount on each tray.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Not bad but the grates are awful",
    "rating": "5.0 out of 5 stars",
    "content": "I appreciate the internal light that turns on and off. The vent holes allow me to put a temperature probe in it to tell when the meat is to temp so I can lower temp to just dehydrate.",
    "post_time": "Reviewed in the United States on May 23, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I just hope it lasts a long time!",
    "post_time": "Reviewed in the United States on April 27, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Excellent dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "I use this to make jerky.  It's huge, maintains temp and is very solid.  the sides and back to get hot to the touch so be careful especially if you have children or curious furry friends.",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, I absolutely love this.",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Great dehydrator, but WATCH THE EDGES! OW!",
    "rating": "5.0 out of 5 stars",
    "content": "I've used the dehydrator for chicken, beef and bananas so far, and all came out perfectly! Very easy to use, simply time and temperature setting. The fan cane be a bit loud sometimes, but we set it up in the basement and we don't hear it upstairs, and the sound isn't loud enough that we are bothered by it when we're in the same room with it. The only major drawback is that EVERY bit of metal that has an exposed, cut edge is *insanely* sharp. After moving it into its home and opening the door, I'm sporting several new bandages and pretty gnarly cuts. It's worth the potential maiming though, it's a great dehydrator and the dogs are bonkers for the dried treats its cranking out.",
    "post_time": "Reviewed in the United States on May 15, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "very good dehydrator.",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "recommended dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "my first time making Beef Jerky, the machine worked perfectly fine, was simple and easy to use.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "just check your electric network to see if you need any adaptors, note that the machine works at 120V with an American cable.",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Absolutely love it!!!!!!",
    "rating": "5.0 out of 5 stars",
    "content": "to sum this machine - easy to use, easy to clean get the job done. shipment was fast.",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "thanks.",
    "post_time": "Reviewed in the United States on December 2, 2023",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Quality Product",
    "rating": "5.0 out of 5 stars",
    "content": "It is a fantastic dehydrator.  The heat and air are very evenly distributed. It is a snap to clean.  The first thing I dehydrated was MARSHMALLOWS!!!  They came out delightfully crunchy like the lucky charms cereal marshmallows.  Yummers!!!!  The pics are fresh carrots beginning the dehydration process. I give this product two thumbs up!! 👍👍",
    "post_time": "Reviewed in the United States on December 6, 2023",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use, easy to clean.",
    "post_time": "Reviewed in the United States on December 24, 2023",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Holds more than it looks",
    "rating": "5.0 out of 5 stars",
    "content": "This machine is terrific! My old machine took up to 10 hours for beef jerky, this one finished in 4-1/2 hours. Washes beautifully in the dishwasher & inside is a breeze to clean. I highly recommend this dehydrator!!! It's also a good price.",
    "post_time": "Reviewed in the United States on April 23, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Have used it for dehydrated fruits and lots of deer jerky. Holds way more than you think. Runs very quiet and I really like the light. Can see what's going on through the night.",
    "post_time": "Reviewed in the United States on May 6, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Have used for close to 100 hours with no issues.",
    "rating": "5.0 out of 5 stars",
    "content": "This is the first time I have used a dehydrator. This does the job. So far I have dehydrated vegetables and apples. I am looking forward to dehydrating herbs and more foods. The temperature is set in increments so I have set it to the closet temperature I want. I have had no issues with this dehydrator.",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I loved it but I returned it because I make a lot of fruit roll ups and jerky and none of the optional trays for that type of thing fit it. There aren't any that I could find even with help of Amazon.",
    "post_time": "Reviewed in the United States on March 28, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Works great",
    "rating": "5.0 out of 5 stars",
    "content": "This was a gift for my daughter that I live with.  She has been practicing drying fruit.  The apples are a real favorite. Drying brings out the sweetness.  Overall we are very happy with the purchase.",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy set up turn on 15 min and BEGIN set it forget it…2 batches of jerky down and need more dehydrators",
    "post_time": "Reviewed in the United States on April 26, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Large and well made",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator is worth the money! Easy to use easy to clean and can do a large amount at once! It's a real game changer for our family who raises and grows most of our own food!",
    "post_time": "Reviewed in the United States on March 24, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This food dehydrator is amazing, it is working great and you cannot even hear it when it's on. The lights do shut off when the timer is up. Hoping is durable but only time would tell. Otherwise, I highly recommend it.",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Works great",
    "rating": "2.0 out of 5 stars",
    "content": "This dehydrator is nice, reasonably small, fan works well, the temperature guide is super handy.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "But in my test run with a thermometer in it, it never came to the temperature I set it to, it was around 30° off.",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Love it!",
    "rating": "5.0 out of 5 stars",
    "content": "This thing is a tiny little BEAST!  I’m very satisfied with the temp control, and the evenness of drying.  Solid win.  Yes, it costs more than others…….bit I feel it’s totally worth it!",
    "post_time": "Reviewed in the United States on January 22, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Don’t bother with the plastic screen old school stuff.  This is leaps and bounds ahead!",
    "post_time": "Reviewed in the United States on December 22, 2023",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Worked great",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use! Easy to clean! Love it!",
    "post_time": "Reviewed in the United States on January 31, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works good! I am a jerky junky! This is in my arsenal with my smoker. Works as it should. My only gripe it the temp control is in 5 +- degrees adjustment. But I can live with that.",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "A step up from a 35 year old dehydrator!",
    "rating": "3.0 out of 5 stars",
    "content": "Love the stainless steel racks.  They’re easy to clean.  Just drop them in the dishwasher.  It’s worth the money.",
    "post_time": "Reviewed in the United States on March 23, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just received it so am about to try it, it's quite you can't hear it. but one thing if y'all can tell me if the light should work because it doesn't seem to turn on. If light doesn't work I'll be returning it back to get another one.",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Clean ability and durability",
    "rating": "5.0 out of 5 stars",
    "content": "Wonderful Dehydrator",
    "post_time": "Reviewed in the United States on April 9, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great dehydrator, works great and holds quite a bit.",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Light not working",
    "rating": "5.0 out of 5 stars",
    "content": "Dries out my Kohakutou in the half time making my fulfillment time for orders much faster. Will probably order two more as my business grows.",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I didn’t realize how long it takes to dehydrate food, so I had to send it back",
    "post_time": "Reviewed in the United States on January 15, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Jerky",
    "rating": "5.0 out of 5 stars",
    "content": "Works great so far! Definitely less time than the others I have used in the past.",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You need this unit",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "Works great",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a fantastic dehydrator, I dehydrated sourdough starter and apples and they both turned out great!",
    "post_time": "Reviewed in the United States on March 8, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Works awesome",
    "rating": "5.0 out of 5 stars",
    "content": "Temperature controls, timer.",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Easy to use.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Works great",
    "rating": "5.0 out of 5 stars",
    "content": "This machine is great. I love the controls and the ease of use. Cleans up super easy.",
    "post_time": "Reviewed in the United States on February 5, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "The fans are terribly unbalanced. The whole machine rattles and the shelves actually bounce from vibrating so much. If you have a garage or shop to put it in then it might not be so bad. But you definitely don't want to use it on your kitchen counter.",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Jerky King",
    "rating": "5.0 out of 5 stars",
    "content": "This unit looks nice, I was excited when I opened the box! The build quality is not there. Cheaply made for how much they are charging...",
    "post_time": "Reviewed in the United States on December 25, 2023",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Made apple chips. It worked great. Easy to operate",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Well made",
    "rating": "5.0 out of 5 stars",
    "content": "Works great",
    "post_time": "Reviewed in the United States on January 4, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "It worked literally 6 or 7 times. I've had it for less than 2 months. No way of contacting for warranty replacement. Absolutely a waste of money at this point. It will turn on then start beeping and the screen goes blank.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Waste of money- ONLY worked a handful of times",
    "rating": "1.0 out of 5 stars",
    "content": "If you plan to dehydrate liquids such as eggs, stay away from this machine.  Your silicone trays options are limited to one because of the off size and they aren’t firm enough to compensate for the patterns inlaid in the metal shelves. VERY disappointing",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "One of the fan blades is unbalanced causing a terrible vibration and a loud squeak, I can’t keep it inside the house it’s just to loud. I was hoping that spending more money would get me a better product  “It works”  but I’m sadly disappointed in the quality.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Trays DO NOT lay flat",
    "rating": "1.0 out of 5 stars",
    "content": "Not worth the price. Flimsy and cheap I could build it with heat duct and small space heater for about 35 bucks",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Dont purchase.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Sadly disappointed",
    "rating": "1.0 out of 5 stars",
    "content": "Unit has no UL or CE testing identification on it. I return it right away",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Would not recommend to anyone",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Not worth the money",
    "rating": "1.0 out of 5 stars",
    "content": "Don’t buy this for fruit leather. There’s no silicone mats or trays that you can purchase for this size. Not even the company that makes it offers any option.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B0CCXWK7CC"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The tiniest thing ever!",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0CCXWK7CC"
}
]