[
{
    "name": "        KAHI Wrinkle Bounce Multi Balm Facial Moisturizer | All-in-One Hydrating Lip Balm Eye Cream Neck Cream Make Up Base & Face Mist Moisture Balm Stick | Daily Face Moisturizer Stick (0.32 fl oz)       ",
    "stars": [
        "64%",
        "15%",
        "10%",
        "5%",
        "6%"
    ],
    "pid": "B0CGX76DV1",
    "ratings": "6,576 ratings",
    "other_info": {
        "Brand": "KAHI",
        "Item Volume": "0.32 Fluid Ounces",
        "Age Range (Description)": "Adult",
        "Special Feature": "Travel Size",
        "Active Ingredients": " "
    },
    "discount_price": "$ 22.",
    "normal_price": "$71.84",
    "about_this_item": [
        " ✅ ALL-IN-ONE BEAUTY BALM ESSENTIAL. Indulge in the luxury of an all-in-one multi-balm that combines the benefits of moisturizing lip balm, eye cream, neck cream, makeup base, and face mist! This simplifies your beauty ritual while saving you time and effort in your daily skin care.  ",
        " ✅ ELASTICITY & RADIANCE REVIVAL. Infused with Salmon Complex and Collagen which improves your skin by reducing fine lines and giving you a radiant complexion. KAHI multi balm stick Korean enhances skin elasticity in the cheeks and upper eyelids and supports recovery from pressure marks.  ",
        " ✅ UNWAVERING 48HR HYDRATION GLOW BALM. This skin balm offers a strong lifting effect and moisture shield for the forehead, between the eyebrows, around the eyes, nasolabial folds, neck, and lips. It provides long-lasting hydration for up to 48 hours which gives you a fresh and vibrant look all day.  ",
        " ✅ JEJU'S FACE CARE NOURISHING SECRET. Enriched with Jeju's natural fermented oil, this face balm stick deeply penetrates your skin while refining and purifying your pores and diminishing the appearance of fine lines. It leads to a youthful appearance with increased skin brightness and reduced yellowness.  ",
        " ✅ ON-THE-GO SOOTHING BALM. Take this face and body balm stick with you wherever you go to ensure that your radiant glow is never out of reach! Its convenient size and packaging make it an ideal companion for your on-the-go lifestyle to indulge in its transformative effects anytime and anywhere.  "
    ]
},
{
    "title": "Works Well for Me👌🏻",
    "rating": "5.0 out of 5 stars",
    "content": "I have been looking for a very good moisturizer that will lessen visibility of my forehead wrinkles. I am surprised that with just one use, my skin is well moisturized which lasted for 8 hours and the wrinkles aren’t that too visible since face it well-moisturized and leaves a glass skin texture as well. Will definitely repurchase once mine is all used up.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My make up last more than it use to be. Aldo my expression lines are less visible.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "My make up is much better with this primer",
    "rating": "4.0 out of 5 stars",
    "content": "The aqua balm applies velvety smooth like a dream!! It doesn’t cause me to break out and is a great carry on item for plane trips. However, I used it up really fast — after about a month of daily use I was scraping the rest out with my finger.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It does help with the dry patches on my face.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Works well but not a lot of product",
    "rating": "4.0 out of 5 stars",
    "content": "I really like how it feels on my skin and that it is easy application. It is also versatile in its use on eyelids and lips as well as cheeks. I just wish the color was a deeper peachy undertone color than bright pink. I don't think this feels greasy at all and kept my skin moist all day. No smell. Good size balm stick.",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have used this for a month now all over my face and neck. Its great to use on really dry areas. It does have a scent, so if you are sensitive to smells this might be strong. Its kind of floral. I use it around my eyes when i'm feeling dry and as a lip balm. I have sensitive skin and i haven't had any issues with it. It goes on so easy. It is a little heavy feeling, so I wear it more at night",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Still trying this out",
    "rating": "5.0 out of 5 stars",
    "content": "I love this! I can put it on over my makeup and it really helps moisturize on my flights! I totally notice a difference - it’s delicious!!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Highly recommend this product to keep under eye hydrated!  Great price. Will reorder. Works as well as ROC products",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Feels amazing",
    "rating": "5.0 out of 5 stars",
    "content": "Dewey in a stick! Great for moisturizing on the go. Perfect for lips eyes and face when you need to touch up make up, during the day. Love it! Easy to carry in a purse. I couldn't be without it!",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just get it you will see your skin dewy and plumped",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Feels hydrating",
    "rating": "4.0 out of 5 stars",
    "content": "This product is easy to apply, no mess, absorbs quickly.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Been using for less than a week but I do like how it feels on my skin.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Been using for less than a week",
    "rating": "4.0 out of 5 stars",
    "content": "My wife said it is \"good\"",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy application",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "It is OK",
    "rating": "4.0 out of 5 stars",
    "content": "It’s thick and if I rub it in, it works fine, but it is kind of nice to have a quick moisture stick where you need it",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great product, but the price is over priced.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Love it, lasts long",
    "rating": "4.0 out of 5 stars",
    "content": "I LOVE that this gives a soft dewy glow. It has a pleasant rosy smell to me. It does feel a bit sticky on my skin, but I only apply it to just on top of my cheekbones and if my collarbone is exposed. Once it has absorbed into the skin it feels soft and hydrated. Definitely will buy again!",
    "post_time": "Reviewed in the United States on November 28, 2023",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I wanted to come back several months later to add more to my review. The product is a good value for the money as it lasts quite a long time. I still have my original purchase. As I said before, I add it like a highlighter to add a bit of shine at the top of my cheekbones and collarbone. It is glossy and wet looking at first, but once the skin absorbs it in there is an effect of a glow from within. I've found when younger (gen x) we were pushed to make our oily teen skin look matte to appear more mature, but now that we are this recreates that youthful luminosity to the skin precisely where it is applied. I've also put this under my eyes and noticed a reduction in puffiness, but definitely apply it a bit before you need it to give it time to absorb.  I get compliments on my skin almost every time I wear it.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "It’s thick and doesn’t absorb",
    "rating": "3.0 out of 5 stars",
    "content": "I use before I go to bed. Very oily and moisturizing balm, I use around eyes and forehead where I get wrinkles the most. Works great so far.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I guess I'm just more butt hurt that the casing makes it look like more than it actually is. I used it for about a month on a daily basis and it ran out.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "40+ Makeup bag MUST have",
    "rating": "4.0 out of 5 stars",
    "content": "Had seen this going viral on social media & thought I’d try it out. I am a sucker for multi use products that can make my travel life easier. This beauty stays in my makeup bag now. Glides on smooth, absorbs well, hydrates instantly and gives the look of healthy, glowing skin the moment it is applied. Great mid day hydration touch up for those of us with combo skin. Can be used for face, eyes, neck & décolleté  areas.",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I NEVER right reviews. I added this to my cart in a whim during prime day thinking it would be easy on those nights I was too lazy to do all the skin care. I put a little on around my eyes. I’m newly 40 with two toddlers, I normally wake with some puffiness to the eyes. My u def eye looked tighter and smoother than I had seen in a while. I added it to my every day skin routine and bought more for my friends",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "AMAZING",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this on Prime Day on a whim. I do not regret! I love that Asian glass-like skin. My skin loves it and it gives me dewy soft skin without it being greasy. It absorbs well and feels light. I live in Florida and the humidity here can be crazy and even so, it feels nice. I love using it on frankly cleaned bare skin to see that healthy glow. Buy it!!! I am ready to buy all the other ones! ❤️ For reference, first picture is no makeup on after skincare routine ending with the stick balm; second picture is using balm underneath makeup.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Me encantó es super hidratante",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Glowy dewy skin for the win!",
    "rating": "4.0 out of 5 stars",
    "content": "Compré este producto porque estaba viral en tik tok, más que todo por mis ojeras, pero realmente no elimino líneas de expresión de párpados ni ojeras, sin embargo lo recomiendo full para los labios, los deja tersos y jugosos súper humectados y en un tono natural.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product! I am 71 years old and use this under or over makeup on my face. My skin looks radiant and not dry at all. I highly recommend this product to everyone at any age.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Lo ame",
    "rating": "5.0 out of 5 stars",
    "content": "I usually hate products with SPF, but this does not smell bad or make me feel dirty. I feel pleasantly moisturized, just as advertised.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I've been needing a good product with skin protection for a long time, and this definitely exceeds my expectations.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Realmente funciona?",
    "rating": "5.0 out of 5 stars",
    "content": "I like the nice packaging it is very minimalistic and pretty. Although it looks nice this is not a good balm moisturizer to use at night. It is very sticky. If used in the morning before makeup it can be a good primer for makeup prep. Definitely a morning only product for me. I can't stand products that doesn't absorb into my skin after awhile. I feel as if it can easily transfer on bedding. I did not like it enough to continue use so I don't have an opinion on the anti-wrinkle agent in this product.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "El stick tiene un buen tamaño, cuando lo usas no debes precionarlo sobre tu cara duramente, solo se gentil y superficial porque usa bastante producto, ya que es suave. Lo puse justo debajo de mis ojos y hasta ahora no sentí ninguna molestia, eso es bueno para mí, porque otros prodcutos me causan un ligero dolor o incómodidad en los ojos. Mi piel es mixta, esto deja mi piel brillosa como si fuera aceite, pero luego con el tiempo se absorbe y el brillo disminuye. Se siente ligero en el rostro, pero al tocar las partes en donde te lo pusistes, el producto se tranfiere y se siente como crema un poco aceitosa. En fin, Me gusta, pero no me encanta. Lo seguiré usando porque no me molesta en los ojos y se siente ligero en mi piel, eventualmente lo probaré antes del maquillaje.",
    "post_time": "Reviewed in the United States on November 29, 2023",
    "pid": "B0CGX76DV1"
},
{
    "title": "Social media hype",
    "rating": "3.0 out of 5 stars",
    "content": "I discovered this on an influencer’s reel on social media. It looked amazing on her. Unfortunately, the reality (at least for me) was that it just looked greasy and wet, not hydrated and glowing. It didn’t blend well with other makeup. I’m not saying it’s bad but it was overhyped and not for me.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Nice scent and very silky. Use it for under eyes before bed and provides extra hydration. A little on the pricey side",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Nice Scent",
    "rating": "4.0 out of 5 stars",
    "content": "hydration and smoothness",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I’m using this a few days and don’t get the point. It has structure as a regular lip balm, it makes your skin wet which even makes the wrinkles more visible. Don’t like it at all",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "just started using",
    "rating": "5.0 out of 5 stars",
    "content": "Goes on nicely and not sticky",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "No he visto muchos cambios, pero si se siente la suavidad en el rostro al usarlo.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Like any lip balm but they say it from eyes wrinkles",
    "rating": "5.0 out of 5 stars",
    "content": "Exelente para hidratar la piel",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I use it and feels my skin smother than before .",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Will purchase again",
    "rating": "5.0 out of 5 stars",
    "content": "This product is wonderful for my confused 38 year old skin. I have to skin routine, I'm terrible about that. I sometimes have breakouts but otherwise pretty dry skin. This did not make me breakout or feel greasy. My skin feels great after a week of daily use. The smell is floral but very light and smells great.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a nice shimmer beauty stick that is easy to use and versatile.  Gives off a nice Dewey kind of look and has a nice texture it's subtle but pretty.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "A",
    "rating": "3.0 out of 5 stars",
    "content": "Este producto lo compré por la viralidad  q tiene en las redes sociales donde todo el mundo afirma q es lo mejor verdaderamente no es para tanto creo q tiene un precio muy elevado para lo q hace q es ponerte grasiento el rostro obviamente es un bálsamo dudo q realmente hidrate tanto la piel como dise si da un efecto pero es claramente un bálsamos y contiene aceites q dan ese efecto el producto no está mal aclaro  ,pero si está muy sobrevalorado en las redes sociales para lo q realmente hace .Utilizarlo en el contorno de ojos estaría bien pero para encapsular tus cerum o contornos de ojos q te apliques y con este producto encima creo q si retienes la humedad y esto mismo para otras partes del rostro o para dar un toque de luz y en rostro y de la impresión de hidratación ,utilizar el producto en pocas cantidades para q el rostro no esté demasiado brillante",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Nota : el producto no está mal pero el precio muy elevado para lo q hace ,creo q otros bálsamos más económicos harían lo mismo q este",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Nice but casual breakouts",
    "rating": "4.0 out of 5 stars",
    "content": "Good idea but made my face breakout every time I tried. Still good for other parts of the body that have less pores. Also adds a slight light tinted film that may not work with your palette if it not in the right color family for you.",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Overpriced.  I would buy it again, only if it was reasonably priced.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Love it",
    "rating": "5.0 out of 5 stars",
    "content": "It’s smaller than I thought.",
    "post_time": "Reviewed in the United States on April 24, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "For my really dry skin, it’s perfect. As of today I can’t say it reduces wrinkles but it keeps dryness away, so I thinks it might prevent it.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Good",
    "rating": "4.0 out of 5 stars",
    "content": "I wouldn’t recommend it for normal or oily skin because it is like if you apply Vaseline stick to your skin, it’s that oily.",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "This is my second one and it won’t be my last! If you’ve never tried this product and on the fence too buy it or not…. Iv been in the skin care industry for over 30 years I’ve used the very best like Chanel , YSL, la Pari and many others  including cosmeceutical‘s not any of those do what this does! Use it on problem areas like close to the under eye, around the mouth and neck…. You can use it on your entire face however you’ll use it up fast, you can use it on the back of your hands. Anywhere you feel your skin needs firmness the stuff works! I have the gel serum and face spray it’s just all in all amazing products. Just don’t use it on breakouts or any where you have broken skin like where you might have removed a pimple ext. when you do use it give it around 5 minutes to soften your skin before you go to your next step. Words cannot describe what this product dose you have to try it!",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "CANT LIVE WITHOUT IT!",
    "rating": "5.0 out of 5 stars",
    "content": "Smells lovely but the fragrance is not pleasant for the lips. Works best for other errands of the body.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B0CGX76DV1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I don't love this product as much as I thought I would. I figured I'd swipe it on like I'm the lead of a kdrama and turn instantly dewy, instantly flawless. I didn't. I haven't experienced any noticeable results other than moisturized. It's very lightly scented, but that scent comes out a lot stronger in taste when I use it as a lip balm. I'm glad I finally tried it, but I wouldn't stock up on it or repurchase.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0CGX76DV1"
}
]