[
{
    "name": " Eruption ",
    "stars": [
        "54%",
        "26%",
        "13%",
        "5%",
        "3%"
    ],
    "pid": "B0CKNM2RS7",
    "ratings": "23,367 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "$14.95",
    "about_this_item": []
},
{
    "title": "Good read",
    "rating": "4.0 out of 5 stars",
    "content": "Good plot that could really happen. Well written with interesting characters and interesting subject matter. I would suggesting it be read.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "As a fan of both Patterson and Crichton, I fully expected this to be something very special, because the book’s premise instantly creates anxiety and fear that this fictional event really could happen in our lifetimes.  Add to that the enormous talents of Crichton and Patterson, and how could this book do anything less than keep me on the edge of my seat?  The truth is, the book is missing something, and I can’t quite put my finger on it, but I think it’s timing - or pace - that’s off.  And the suspense doesn’t build like I would have expected.  Other than that it reads well, and the characters were likable.  Would I recommend it?  Yes - just don’t expect “very special.”",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Good read - just not quite what I hoped for.",
    "rating": "4.0 out of 5 stars",
    "content": "Good character development with friend, family, work and military. The story is technical yet understandable. I like the writer’s style of the development of the story line.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A few good men(and women) save the world and few will ever know what they",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Eruption review",
    "rating": "4.0 out of 5 stars",
    "content": "sacrificed and risked to save it. Are there some things the government should hide forever?",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Read the book to find out for yourself",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Another week in Paradise.",
    "rating": "4.0 out of 5 stars",
    "content": "Very interesting read but not an all nighter. Crichton and Paterson have different but effective styles, The book is well written and works well. The ending is a little weak in my opinion. Still, if you like either or both authors it is worth the money, at least to me.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "All I had to see was the collaboration of Michael Crichton's manuscript with  James Patterson and the title \"Eruption\"!  Perhaps no one can perfectly replace  Mr. Crichton, but this was a heart pounding novel for me.  There's only been one other novel that after I finished I re-read immediately.  This is the second one.  I will enjoy this for years to come!",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Good coordination between writers",
    "rating": "4.0 out of 5 stars",
    "content": "disasters are not what I usually want to read about.  This one kept my heart pounding as it progressed .  chapters are short and w characters well defined.  Four stars and my heart is still pounding!",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good story, great characters, consistent flow (pun intended) that made for a very enjoyable read! Michael and James have done it again!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Great Concept... but maddeningly massive logic gaps and weak characters drag it.",
    "rating": "2.0 out of 5 stars",
    "content": "I really wanted to live this story. Crichton's passion project?!? What's not to love?",
    "post_time": "Reviewed in the United States on July 2, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Kudos to Patterson for writing in Crichton's voice... no small feat.  However, this feels like a second draft that is in need of 3-5 more rewrites before it's there.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Enjoyable.",
    "rating": "5.0 out of 5 stars",
    "content": "The characters feel 2 dimensional and there are maddeningly huge gaps in logic.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "As a result, reading this became more of a chore than enjoyable.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Super awesome",
    "rating": "4.0 out of 5 stars",
    "content": "**SPOILER ALERT** - I reveal story points below, so read on at your own risk.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "1. The main plot device was easily solvable.  There is a chemical created in the 40's that could destroy all life on the planet.  Despite this... they decided that the BEST way to store it was in GLASS canisters.  ?!?  And for some reason... in 80 years... no one in the entire military thought to create NEW canisters that the old fragile ones could fit into.  *face palm*",
    "post_time": "Reviewed in the United States on June 10, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Easy read",
    "rating": "5.0 out of 5 stars",
    "content": "2. There's a \"renegade\" helicopter pilot who breaks a no fly zone to take a journalist over the volcano.  But, shockingly, it causes them to crash and the pilot is inches from death.  Yet, a few days later, a billionaire offers him money to fly over the now ERUPTING volcano and he does it.  And, shockingly... they crash.  AGAIN.  And he nearly dies.  Yet... 2 days later, when said billionaire wants to go up over the even BIGGER erupting volcano... the pilot agrees.  There is not a SINGLE person on planet earth that would almost die TWICE... in a matter of days... who would then do the exact same thing that nearly killed them a THIRD time.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "3.  The fate of the world is at stake... yet right in the middle of it all the main character stops everything and GOES SURFING.  What. The. F***?!?!?",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Just okay!",
    "rating": "5.0 out of 5 stars",
    "content": "4. The fate of the world is at stake and is dependent on two people getting to an observatory to set up some explosions.  They're only a few hours away... and instead of going straight to the observatory... they instead go up the mountain CLOSER to the eruption \"just to look.\"  Of course, the lava blocks them and they can't get back to the observatory.  There is not a single person on planet earth who... when the FATE OF THE WORLD IS AT STAKE... would go CLOSER to the eruption!  What. The. F***?!?!?",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "5. Finally... absolutely everything they do doesn't matter because it doesn't work and then the Volcano does something unexpected that ends up saving everyone and the fate of the world... and it's sort of like a \"oh.  Didn't see that coming.\"  So basically... all of the stakes that were set up through the entire story DON'T MATTER.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Great Read",
    "rating": "5.0 out of 5 stars",
    "content": "A roller coaster ride that grabs you and pulls you through the story to a dramatic conclusion.  Could this be based on experience?",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought 'Eruption' as soon as it came out and was really excited to read it.  It was a great story.  I am glad it got to be published considering the author was deceased.  James Patterson is an extra ordinary author and the book was special.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "The book was well written and information just flowed.",
    "rating": "5.0 out of 5 stars",
    "content": "I was so sad when Michael Crichton passed away. His books never disappointed me, and I read nearly all of his books so quickly I surprised myself. I see myself as a fairly slow reader, but I tend to retain what I read too. I always had a problem putting Michael's books down, they are all very engaging. This book was no different and James Patterson did a perfect job making it feel like a Michael Crichton novel. I have never read much James Patterson, but that might change after this book. I have always loved how Michael would play right at the edge of reality versus fiction. He was always able to spin his story and employ just enough current science to make the unbelievable real in the mind of the reader. I am sorry he is gone, but I cannot thank his wife and James Patterson enough for giving all us fans one more wild ride. Thank you",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "!",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "A perfect last book",
    "rating": "4.0 out of 5 stars",
    "content": "Let me begin by saying I’ve liked everything I’ve ever read by Michael Chrichton.  The Andromeda Strain scared the living bee-jeezus out of me every time I read it.  Jurassic Park got me so hooked I read all the sequels and saw every movie multiple times.  This is not those books",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "There’s nothing particularly wrong with it.  Chrichton had certainly done his research and the stakes were high enough to give anyone chills.  However, with very few exceptions, I didn’t care much about any of the characters.  Not sure if that’s because they didn’t have enough  screen time’ so I couldn’t get a feel for personalities or what but there only a few people whose fates meant anything to me at all.  Probably a good thing because dang there sure were a lot of people dying in this book.",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Definitely NOT Chrichton's best",
    "rating": "5.0 out of 5 stars",
    "content": "One little chapter I really did enjoy was when the President is sitting in the Situation Room watching the eruption.  “The  President kneaded his forehead and thought about all the crises he’d faced, often on a daily basis.  Terrorism and the Middle East and Russia and China and whatever new virus had popped up that day.  His job was to defend this country against all of it, with aggression when necessary.  He had promised to leave a better and safer America to his successor than his predecessor had left him.”  I can’t help wondering about the VP being a guy from Louisiana and trying to figure who Patterson is casting as the President.  I know who I would and it’s sure not the guy who’s sitting there now.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Sorry Mike and Jim, but not keeping this one.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "This book was written to be a movie script",
    "rating": "4.0 out of 5 stars",
    "content": "I liked the volcanology and the vivid picture of trying to observe eruptions that are unpredictable and very dangerous. However, I had to remove a star for some very illogical things, stuff that Crichton would not have written had he been the sole author. Why would anyone mix a biological unknown with nuclear waste? No matter who screwed up, one would never store nuclear waste in a geologically active place! Why all the dangerous helicopter flights? Surely the super-rich, Elon Musk stand-in has a fleet of drones, right? Nuclear waste I understand, but the black goo plague that is some kind of dehydrating agent seems to be trying too hard to be scary. I suppose I will see the movie if Nicholas Gage plays Mac.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Plausible problem for 2024. I thought this was a well written story with excellent suspense. The only reason I didn’t give 5 stars was a weakness in the characters. They just didn’t have enough depth.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Should have been proof-read by a scientist",
    "rating": "3.0 out of 5 stars",
    "content": "The author allegedly collaborated with the scientists.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm a chemical engineer. At some point, the book says that sulfur dioxide (SO2) reacts with water to produce sulfuric acid, which is toxic when inhaled.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "could not put it down",
    "rating": "5.0 out of 5 stars",
    "content": "SO2 reacts with water to produce sulfurous acid, much weaker but irritating. I knew it in maybe 8th grade:",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "SO2+H2O->H2SO3 (not H2SO4)",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "I couldn’t put it down!",
    "rating": "4.0 out of 5 stars",
    "content": "Later the author said SO2 smells like rotten eggs. It doesn't. H2S, another sulfur compound, smells like rotten eggs.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is just a trivial example. This makes me question other science in the book, things I don't understand as well as chemistry... Is the geology, volcanology, biology, entomology, and microbiology sound?",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Fun & fast paced",
    "rating": "4.0 out of 5 stars",
    "content": "As someone else pointed out, the threat described here could have been neutralized by using a small nuclear device, or by other means, especially when life on earth was at stake. We chemical engineers always look at the NBA (next best alternative).",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I'm not a biologist but i took a graduate-level course in microbiology. The growth rate of the pathogen seems unrealistic.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Good book but didn't like the ending",
    "rating": "5.0 out of 5 stars",
    "content": "The human body contains some 70% of water. It's unrealistic to expect that some agent can cause what almost looks like spontaneous combustion. An enormous amount of heat would be required to evaporate the water.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I don't want to be picky. I normally don't read popular fiction unless the scenario, whether science culture, geography, or history, is meticulously researched.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "My High Expectations Were Met!",
    "rating": "5.0 out of 5 stars",
    "content": "Crighton & Patterson write a book?  I was willing to pay full price to read it right away & it was worth every penny.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The action was so intense & nonstop that this Adrenaline Junkie loved the ride.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Good summer read",
    "rating": "4.0 out of 5 stars",
    "content": "I enjoyed the read but I thought that ending was s bit contrived. It was like \" how am I going to end this book?\" Not much thought went into it, I suspect.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Well written you can definitely tell we’re crichton left off and Patterson picked up the ball I liked the notes on fort Derrick and possible story as to why the building on base was closed down and bricked over,good story",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "James Patterson to the rescue",
    "rating": "4.0 out of 5 stars",
    "content": "When I read Michael Crichton’s novel had been completed by James Patterson I had to read it. It was everything I had imagined. Suspenseful, intriguing, sadness and joyful. Hope you enjoy this book.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I miss Michael Crichton he never disappointed,",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Eruption - worth reading",
    "rating": "5.0 out of 5 stars",
    "content": "I do not read Novels only non-fiction but my wife reads a lot of novels and said to say it was very good.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The majority of this novel was written by Michael Crighton, thank goodness.  It was very interesting, well plotted and a page turner.  The last few pages were obviously written by James Patterson; gory and violent.  My husband threw the book to the floor at this point and it was several days to before he picked it up to slough turn to the end.  The end?  A perfect example of \"Deus ex machina\".  Patterson introduces a huge element at the very end that seems impossible",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Very Good",
    "rating": "5.0 out of 5 stars",
    "content": "Get ready to remain on the edge of your seat, white-knuckling it and hanging on for the ride.  I had to read this in small doses as it was quite a story and lots of detail to take in. Whoohoo!",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0CKNM2RS7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I live in Honolulu and have discovered the Big Island and LOVE it, the volcanos and the town of Hilo, so I was very interested in reading this  book. I am a huge reader, at least a couple of books a week, my favorites authors are Robert Galbraith (JK Rowling), Sue Grafton, Alison Lurie, Carl Hassain to name a few. Had this book not been about Hawaii, the volcanoes and Hilo, I would have stopped reading at about 30 to 50 pages, as I usually do when a book is disappointing. I trudged on, bored as I was with the simple writing style  and I will admit I did eagerly return to the book till it was finished only because I wanted to hear what happened with the volcanos, Hawaii and Hilo, that is the only reason. No spoiler alert but I think they could have beefed up the ending, like go into more detail about what happened.  I think the character development could have been better and I couldn't really understand the background info on the eruption and I know a lot about volcanos. I never read Crighton nor Patterson but I know they both are very successful and have devoted fans so they don't need me. I picked up another Crighton book, \"Airframe\" and it was better written, maybe Patterson is getting old and tired. Anyway, just manage your expectations.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0CKNM2RS7"
}
]