[
{
    "name": "        Shower Caddy 5 Pack,Adhesive Shower Organizer for Bathroom Storage&Home Decor&Kitchen,No Drilling,Large Capacity,Rustproof Stainless Steel Bathroom Organizer,Shower Shelves for Inside Shower-Larger       ",
    "stars": [
        "76%",
        "12%",
        "5%",
        "2%",
        "4%"
    ],
    "pid": "B0CLL8G3NY",
    "ratings": "30,362 ratings",
    "other_info": {
        "Specific Uses For Product": "Toiletries, Utensils",
        "Material": "Stainless Steel",
        "Special Feature": "Durable, Rust Resistant",
        "Color": "Light Grey",
        "Brand": "EUDELE",
        "Finish Type": "Painted",
        "Product Dimensions": "5.5\"D x 12.72\"W x 4.13\"H",
        "Shape": "Rectangular",
        "Package Type": "Flat Free Package (FFP)",
        "Number of Items": "4"
    },
    "discount_price": "$ .",
    "normal_price": "$36.99",
    "about_this_item": [
        " 5 Hanging Shower Organizer Set for Sufficient Bathroom Storage Space:The bathroom organizer comes with 5 pieces for different uses, including 2 shower caddies, 2 soap holders,1 toothbrush holder and 5 adhesives. Accommodate wash supplies or cooking seasonings easily with large capacities to make full use of space and facilitate your life; ideal for the dorm/bathroom/kitchen/toilet/tool room.  ",
        " Durable Stainless Steel,Whole Hollow Design:Built with 100% premium SUS 304 stainless steel, each shower shelf is durable, rustproof, waterproof, and scratch-proof, thanks to its high-temperature baking paint process. Last for up to 8 years, even under humid conditions. A hollow design allows for good ventilation and drainage, easy to clean.This will be the most durable product you’ve ever used.  ",
        " 40-Pound Bearing Weight,Reliable and Stable:The newest upgraded transparent traceless adhesives give ultra-strong reliability with up to 40 lbs of bearing weight, which is tested by professional institutions. Keep the tins and bottles in the bathroom shower caddy, and make them easy to fetch and use. Never worry about falling issues after proper installation.  ",
        " Stronger Adhesive for Easy Installation,No Drilling:Installation only takes a few minutes, requiring no drilling holes or any tools and doing no damage to the wall. Clean the surface, stick the adhesives to the wall, and hang the shower shelves to use. Suitable for smooth surfaces like tiles/marble/glass/metal, but not for uneven surfaces like painted walls.  ",
        " Efficient Storage Solution for Kitchen/Bathroom:Perfect for Bathroom Decor. It’s a perfect choice for keeping the bathroom or kitchen items well organized and within easy reach, which is widely applied in the kitchen or bathroom. These bathroom shelves feature rounded edges to ensure they won’t scratch your skin.  "
    ]
},
{
    "title": "Actually works",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried a few different shower caddy brands and almost all do not stick well especially if the kids for get to take it out of the shelf to apply 2-1 pumps hair/conditioner bottles they will always crash but with these installation was easy & actually sticked 100% left it over night & another day before I started loading them up and they held firm!Not going to lie the only way these stay up is by taking whatever you have in there to apply to your hair/body if your looking for something that will stay even if you pump it on the shelf your best bet is a corner spring loaded caddy or 1 that hangs over your shower door or fixture but that could lead to a pipe breaking :/",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Really good shower caddy set, holds all my bottles and has room for more! Have had it over a month now and havent had any issues. Pretty easy to put up too, although make sure the sticky tape is facing the right side up when you stick it to the wall for when you hook in the caddy.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Ease of use, durability",
    "rating": "5.0 out of 5 stars",
    "content": "Absolutely love these! This is my 2nd time getting them and I love how easy it is to install. They also last a very long time (3years) before I changed them out. As with anything they do get dirty and soap scum on them. I could have just cleaned them but I wanted different sizes this time.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Bought this multipack to add some extra storage to both showers in our house. So far theyre all holding up well with their weight using the adhesive hooks that come with the set. No sign of rusting so far either and theyve been used for a couple weeks now. Overall a good value and solution :)",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "So easy to set up",
    "rating": "5.0 out of 5 stars",
    "content": "That's too many pieces for one bathroom so I split it over two. They're strong, and stay on the walls. I never waited. As sticky as those adhesive stickers were I slapped the big bottles in it immediately and didn't wait overnight like it suggested. They didn't budge. When I want them off I'll have to dig them off and clean the residue with non-acetone polish remover. 👍🏼 They do the job well.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely love this shower caddy! It’s sturdy and fits perfectly in my shower without slipping or tilting. The design is sleek yet functional, with plenty of space for all my bottles, soaps, and even some extra room for razors and smaller items. The hooks at the bottom are a game-changer for hanging loofahs and washcloths. It also has drainage holes that keep everything dry and clean, so I don’t have to worry about mildew or rust. Overall, this caddy has made my shower experience more organized and enjoyable. Highly recommend!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Good product",
    "rating": "5.0 out of 5 stars",
    "content": "My wife got multiple of these and they work perfectly. no slipping, they don't fall, they hold well on our tile shower sides.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Only thing we have been careful of is to not push to hard on pumps for the larger baskets as the bending bothers us..",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "I split this set over two bathrooms",
    "rating": "5.0 out of 5 stars",
    "content": "they work well to hold mirrors/razors/luffas!",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm always skeptical of products that promise to stick to the walls of my shower, mostly because none ever do. I am pleased to report that these have not budged since they were placed three months ago AND they are holding up to use by my tweens and all the heavy/large product bottles we have. Getting all the product bottles off the bench in my shower has been amazing. Love these.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Awesome Shower Caddy's!",
    "rating": "5.0 out of 5 stars",
    "content": "This shower caddy's are very sturdy and nice looking. Have had them in our shower for over a month and they have remained residue free and the adhesive is still holding strong.  Love ALL the hooks along the front, and the width can't be beat.  Best shower caddy's I have ever purchased.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Es excelente, sin peros.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Genial",
    "rating": "5.0 out of 5 stars",
    "content": "De hecho, el vendedor de este producto es tan genial, ellos quieren saber si todo esta bien con el producto después de casi dos meses de haberlo comprado. (GARANTÍA), Y si pasó algo como que no funcionaron los adhesivos,  alguna pieza se óxido o juego incompleto. Ellos van a resolverlo.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Gracias por ello, espero que dure mucho pero de ser necesario lo compraría otra ves👍",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "12/10",
    "rating": "5.0 out of 5 stars",
    "content": "I LOVE these!! I was hesitant to order because the price seemed too good to be true but I ordered two packs for master bath and kids bathroom. Install was so easy and it’s aesthetically pleasing in both showers. Tons of storage and customization was really nice. So much better than your normal shower caddy.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I used extra pieces for under sink organizer on the cabinets and It looks beautiful.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Fantastic",
    "rating": "5.0 out of 5 stars",
    "content": "These are fantastic.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We needed extra storage in our shower and these are perfect. Not only do the look sleek and nice, but they're also durable.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Sturdy and good looking",
    "rating": "5.0 out of 5 stars",
    "content": "We've had no issues with the adhesive and all of the baskets are full of shower products. They seem super sturdy and strong.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Highly recommend these!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Actually stick to my walls!",
    "rating": "5.0 out of 5 stars",
    "content": "We have ceramic tile in our bathroom and I have had trouble with so many types of adhesive & suction cups with no success. These are so strong and stick so well! I do wish the larger baskets were the same size but that’s just my ocd. Overall awesome product! 🙌🏻",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Ordered the set in light blue for daughter’s college dorm bathroom. They stick on the wall easily and best part is they stay! We had tried a suction cup caddy but it wouldn’t stay on the textured wall but this one did! Highly recommend. Also great value for getting 5 pieces.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Great caddies that actually stick to wall",
    "rating": "5.0 out of 5 stars",
    "content": "I wasn't expecting the adhesive to go beyond just the clips and is a whole clear rectangle, but now looking closer it is shown in the picture. Just something to be aware of, but this is just what I needed for my shower in a rented apartment to organize my things.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this 5 pack set on Prime Day for amazing price and I am so glad I did!  I highly recommend this to anyone with large liter bottles of shampoo and conditioner that need extra room in their shower.  I currently have 4 full liter bottles in my shower and these have organizers have not fallen at all.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Had them up for ~2 weeks, still very stable",
    "rating": "5.0 out of 5 stars",
    "content": "I even moved one caddy for my liking by heating the sticky strip with a blow dry and then pulling it off.  I did purchase the replacement sticky strips to do this because it didn't come with any extras.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "When apply these strips, make sure you press hard and then leave it alone for 24 hours to ensure it's set before placing anything in the caddy.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Does Not Fall!",
    "rating": "5.0 out of 5 stars",
    "content": "I installed (adhesive) product caddies and soap caddies in my shower and also in my guest bath on July 23, 2024.  I’ve showered in both bathrooms many times and the caddies are still intact.  The product caddy holds several bottles of product with ease.  They are better than I expected!",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are so great I have so much more space in my shower and the price is excellent just make sure you clean the surface area before that way it sticks and follow the directions it says not to put anything in the baskets for at least 24 hours after putting them on the wall and make sure there's no air bubbles in them use like a credit card or your finger from the middle outwards to get all the air bubbles out and you're good to go. Minor filled up and still very sturdy",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Easy to install and holds several shower products.",
    "rating": "5.0 out of 5 stars",
    "content": "This makes my shower/bathroom look so much nicer! I have several different shampoos and conditioners so this helped organize all of them nicely along with my soaps and other items. Also a really good value for all of the shelving that you get. Haven’t had any issues with the adhesive or sliding",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recently purchased this shower caddy, and it has completely transformed the organization in my bathroom. The shelves are sturdy and can hold multiple bottles of shampoo, conditioner, and body wash without any issues. I love the sleek design – it fits perfectly into the corner of my shower and makes everything easily accessible. The only thing is once you place the sticky part you can unstick it without wall harm but you cannot restock it a second time, just FYI. It is a great product so far.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Exceeded my expectations!",
    "rating": "5.0 out of 5 stars",
    "content": "I was worried that this might fall off the shower wall.  But so far, one week later,  It is still holding up my three containers.  The soap bar holder is awesome too.  I hated the scum the soap bar would leave on my tub.  This solves that problem perfectly.",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered this and it arrived on time. There was a small error on the order page that showed a picture but listed a different color. So I thought I ordered the silver but initially got the brown. I reordered immediately (careful to matche the text description and not the picture while I returned the other. My new product arrived on time as did my refund. Super happy, instal was so simple and it compliments my bathroom and elevates the look. Love it!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Simple install, elegant looking",
    "rating": "5.0 out of 5 stars",
    "content": "I love how well made and versatile this caddy is. Rather than having something hanging at the front of the shower, I was able to organize it at the back and sides of the shower and organize the pieces that best fit my needs. I would recommend this product. I may even by another!!",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After buying a rack to hang over the shower head, that didn't work and didn't hold much... I resorted to zip tying it to the silver bar in the photo. My husband got a little tipsy and broke my set up. Which turned out to be a blessing in disguise 🥸.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Sturdy and Versatile",
    "rating": "5.0 out of 5 stars",
    "content": "I found the lovely racks on a  Facebook reel, and thought I'll never need those, but I wish I would have found those before I had brought the other set up.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "After trying to fix up the old setup twice... I thought I better order those shelves or my husband is going to have to have a shampoo bottle removed by surgery.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Shower changer.",
    "rating": "5.0 out of 5 stars",
    "content": "Now the are installed, he has his items and I have mine, everything is cute and we have more room in the shower now.",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So ladies, the moral of this story is, just go ahead and buy what you are shopping for on Amazon... you'll need it. You will love it and he will be glad that the shampoo bottles no longer jump out of the racks to attack him.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Very nice!",
    "rating": "4.0 out of 5 stars",
    "content": "These are actually very nice, the green color is a beautiful dark green and fits my bathroom perfectly. The adhesive pads that come with them are extremely strong. They seem to be sturdy and are able to hold all of our shampoos and soaps without a problem. The only negative I would say (and it’s not really a negative) but the one holder for toothbrush or toothpaste isn’t the same “design” as the others. Overall I think they are well made and worth the price.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "about what we needed ... we questioned whether it would hold ....",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Space saver!",
    "rating": "5.0 out of 5 stars",
    "content": "These stick to my shower wall so well! I have all of my shower products in these and it all fits perfectly. The basket clicks right into the attachment and it doesn't move. it is still mounted in the same spot. This is so much better than a hanging shower caddy.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm really impressed at how well made and strong these are. I have bought so many different shower caddys that failed because the suction/adhesive didn't hold and just collapse, causing all your bath products to crush your feet and causing you to whimpse in pain. I have put several heavy bottles in them and accidentally bumped into them a few times and they didn't budge. This is the first ones that I have found that actually do what they're meant to do. I definitely recommend giving them a try if you're tired of bottles of shampoo painfully falling on your feet due to product failure.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Well Made, Strong, and Does What It's Supposed to Do!",
    "rating": "5.0 out of 5 stars",
    "content": "I was debating on buying this product or not. I was glad I did! Definitely makes the tub less cluttered. It’s nice to have somewhere to put everything and it look nice. The adhesive I would say is strong! Just make sure to clean off the surface before placing it.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Having tried many shower holders I finally found one that actually works and doesn’t fall off the wall like the ones that use suction cups. The shower holder actually stays even with the weight as you see in my picture on it. Congratulations. So I easily give it five stars",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "BUY IT!",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to install. Wanted to wait a while to see if the shelves held up while using the shower. The high heat and steam did not loosen them. They look nice, easy to keep clean and most of all hold all the shower items with ease. Highly recommend this purchase.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My bathroom is extremely small, so I am always looking for a good way to incorporate storage, and these things are fantastic! I wanted so badly to never have to use the shower pole storage option again, and these were the perfect solution. I also have one on the wall above my sink and it has worked out great. I purchased additional to share with family.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "A great shower rack",
    "rating": "5.0 out of 5 stars",
    "content": "Love this product. The instructions were very simple and easy to follow for installation. The product fits great in my shower and holds all of my items perfectly, even my heavy pump shampoo and conditioner. My daughter used my shower and now she has ordered this set for her own needs.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was not sure this would work for my shower because it is a natural stone instead of a smooth tile but this has held up great! I used all three and there is no sign or any damage, sliding, or falling. Purchased because it was recommended by Go Clean Co.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Highly reccomend",
    "rating": "4.0 out of 5 stars",
    "content": "Bought these to declutter the shower and boy did it work! These Caddies keep the bottles from falling onto the floor. They work well even if you have bottles with pumps they hold strong to the wall. Not only are they functionable but they look astatically pleasing as well. This product is very easy to install as well! The color matches our bathroom perfectly! These are great for those who need to keep clutter down while looking good!",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0CLL8G3NY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I don’t normally write reviews but I think this one deserves one . I bought this shower caddy a few months back and love it . It holds up well and looks nice . The other day the customer service reached out to me via email and wanted to know how I liked it and if it was damaged or any rust or anything . I let them know that there was a little rust and they offered me a full refund or a replacement. I choose the replacement because I love it so much . I recieved it in the mail yesterday and let them know . They are very fast to respond as well I highly recommend",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0CLL8G3NY"
}
]