[
{
    "name": "        Mini Bag Sealer, USB-C rechargeable Bag Sealer, 2 in 1 Bag Sealer Heat Seal with Cutter and Magnet, Mini Bag Resealer Machine for Plastic Bags Snack Bags. Authorized Seller: Luke X       ",
    "stars": [
        "37%",
        "12%",
        "14%",
        "11%",
        "26%"
    ],
    "pid": "B0CQT52K18",
    "ratings": "273 ratings",
    "other_info": {
        "Brand": "LX IntMfr.",
        "Material": "Acrylonitrile Butadiene Styrene (ABS)",
        "Product Dimensions": "3.74\"L x 1.38\"W x 1.57\"H",
        "Item Weight": "1.28 ounces",
        "Power Source": "Battery Powered"
    },
    "discount_price": "$ 6.",
    "normal_price": "",
    "about_this_item": [
        " 【Our Core Advantage】This mini bag sealer is the only one on the market that charges via USB-C port. This unique feature eliminates the hassle of searching for cords, as opposed to other similar products that use Micro-USB or batteries. With the USB-C interface, all your devices can share the same charging cable, making charging much more convenient.  ",
        " 【2-in-1 Sealer and Cutter】This sealer is an indispensable kitchen accessory, capable of cutting and resealing plastic bags and food storage pouches, providing a more efficient solution than bag clips. It is compact and easy to carry, making it convenient for use on-the-go.  ",
        " 【Seal Various Bags】The heat sealer is suitable for various types of bags. It can quickly reseal food storage bags, chip bags, fruit bags, and candy bags in seconds, keeping them airtight. Please NOTE that SUPER THIN PLASTICS, such as cling film, are NOT SUITABLE as they will melt directly.  ",
        " 【Instant Heating】Much better than bag sealers powered by AA batteries, this lithium battery-powered sealer features a powerful and efficient heating element unit that can rapidly heat up within 1 second and seal the bags immediately upon reaching operating temperature, saving time effectively.  ",
        " 【Keep Food Fresh】Resealing food bags helps to keep vegetables, fruits, and grains fresher for longer periods. Reducing food waste is environmentally beneficial and can help save on grocery costs.  ",
        " 【Compact and Portable】The high-quality mini 2-in-1 sealer and cutter are perfect for carrying on-the-go, handheld, and portable, making it ideal for travel, camping, and hiking trips.  "
    ]
},
{
    "title": "There is a learning curve.",
    "rating": "5.0 out of 5 stars",
    "content": "It works very well. The learning process is, if you go to slow, it will cut through. Speed is of the essence. It takes a little practice. I do recommend, and I would purchase it again. Great for putting it in a camper because it's small. However, I also use it in the house.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I attempted to reseal 4 different products and none of them were resealed. The device gets too hot and instead of resealing the product it will rip open a new seal. The functionality of this product sucks",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Just Bad",
    "rating": "3.0 out of 5 stars",
    "content": "It seals fine but the blade sticks out just a little bit. That blade snags the bag and doesn't let you glide the sealer. When pushed in the blade isn't really sharp enough to cut the edge. It's not easy to use. It heats up quickly and the magnet makes it easy to stick on the fridge. It seems to be good quality and portable but I would rate this higher if the blade wasn't sticking out all the time.",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Tired of using and keeping track of bag clips just so your chips and items still become stale. Well no longer as you can pick up this product that will reseal and standard bag with its safe heating mechanism. Additionally, there is an on off switch that allows for the resealing of many bags with the lengthy battery life. Additionally it is extremely easy for anyone to use as you just need to hold down one button or the other if you want to use its bag cutting mechanism which cuts a standard bag well.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Sealer works but...",
    "rating": "4.0 out of 5 stars",
    "content": "I bought this to use at my job (warehouse) to seal small bags for small parts orders. It takes some finesse to get it to seal properly:",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "- push down too lightly or move too fast, doesn't seal",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "This item is super useful and great value for what you get",
    "rating": "1.0 out of 5 stars",
    "content": "- move too slow or push too hard, melts the plastic",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Once you get the feel for it, it works pretty well! One thing to note is that it takes a minute or two to heat up to be effective.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Takes some finesse, but works (in a warehouse too!)",
    "rating": "4.0 out of 5 stars",
    "content": "Downsides:",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "- It has a magnet on the bottom, but don't expect much from it as it is really weak.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Does not work on...",
    "rating": "3.0 out of 5 stars",
    "content": "All bag types .. so like your microwaveable bags do not work with this sealer. Other than that it's amazing.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "While my wife thought it was stupid to buy. And honestly it’s doesn’t say how to close the whole bag and that it easily pulls apart after you seal it. After a while it has some value but it’s not as easy as it shows in the video.",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "It works",
    "rating": "3.0 out of 5 stars",
    "content": "Does the job of sealing. But I was hoping to be able to seal a bag with some open ends left. This sealer is so hot, it seems, that it seals and then whatever open end of the bag will break off at the seal. There is no instructions so I don't know if I am doing everything right. It is also difficult to run a straight line with such a small hand-held sealer.  Better for a quick seal for not too wide an opening.",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It’s a little bit too small and it catches the edges and you have to adjust the position to run and seal.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Too hot?",
    "rating": "4.0 out of 5 stars",
    "content": "Works ok, you have to trim bag so it has a straight edge or it won't close.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It works but is easier to clip shut than use.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "It’s so so",
    "rating": "4.0 out of 5 stars",
    "content": "Seems to be a good device",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Works great, but unsure if I really need this as my chip clip works just as well.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Ok for money.",
    "rating": "2.0 out of 5 stars",
    "content": "It is extremely hard to use, when sealing the blade from the cutter which sticks out catches the bag and tears what was sealed. With practice it could be of limited use, but would not recommend to any friends or family, but if I wanted to frustrate a rival I’d send them one for Christmas",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This has saved me so many bags of chips. My only complaint is it made for thicker bags. Thin ones seem to melt when trying to seal.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Great idea!",
    "rating": "3.0 out of 5 stars",
    "content": "I have trouble getting it to seal the bag smoothly.  But it does keep the food fresh once you get it across the bag. It's hard to hold the bag together for the seal it smoothly.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I was really banking for a sealer that would give me a little less than a centimeter of sealed bag. But it’s only a line. Mind you it does its job of sealing bags and magnetizes to the fridge, but I was hoping to use it for sealing cards.",
    "post_time": "Reviewed in the United States on March 25, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "It’s okay; burns a thin line rather than thick like in images",
    "rating": "2.0 out of 5 stars",
    "content": "Sadly that doesn’t work well. I’ll just opt to use it at it was intended.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I also like that it is small and portable as well as rechargeable.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Almost impossible to get a perfect seal",
    "rating": "3.0 out of 5 stars",
    "content": "This thing basically burns the plastic, so you have to drag it across your bag with the exact perfect speed. Too fast and it won't seal, too slow and it'll burn right through.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "You can't start at the edge of the bag because you have to grab the back tightly at the edge in order to pull this thing across. Grab it anywhere other than the edge where you're trying to seal from and the bag will just fold and ruin your glide. So then after doing half the bag, you have to try and seal from the center to the other edge and make sure to join your lines.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Not great!",
    "rating": "2.0 out of 5 stars",
    "content": "It's just way too finicky to be practical.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "The blade to cut the bag is too close to the sealing part of the tool. It's difficult to use properly. I would t recommend it.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Sellador para bolsas de plástico",
    "rating": "2.0 out of 5 stars",
    "content": "La calida del producto es buena,  sin embargo la capacidad para sellar las bolsas un poco gruesas le es complicado.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Awesome",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "nice",
    "rating": "4.0 out of 5 stars",
    "content": "nice",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I was really expecting this product to do better. It did not. If I would’ve thought about it soon. Would’ve kept the box and sent it back overall not great. I would not recommend this product. The only reason why I give it two stars rechargeable.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Doesn’t work nowhere near as good as they say it does",
    "rating": "2.0 out of 5 stars",
    "content": "Reseals your unfinished snack bags and keeps them fresh for later. The unit doesn’t seem to hold a charge for extended times without needing a recharge though. Overall pretty good though",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Tried several times but it is really hard to get it to seal as you have to move slowly and steadily which is hard to do on a bag that isn't smoothe.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Great product for keeping your snacks fresh after opening the bag. Now you can seal it like new!",
    "rating": "5.0 out of 5 stars",
    "content": "Works well",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "It's not very easy to use it's easier to seal the bag than to use the slicer to cut it open but it's still is not very easy to seal the bag",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "So far hasn't been able to seal anything well.",
    "rating": "5.0 out of 5 stars",
    "content": "Saw this on tic tok and it works as good as stated. Love not having to look for bag clips which fall off and allow clips to go stale. Inexpensive and easy to use",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "I might just need more practice, but it either doesn't make a seal or it melts the top off. I must find the happy medium.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Handy",
    "rating": "2.0 out of 5 stars",
    "content": "Received and immediately charged overnight.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Tried multiple times to seal different bags but it did a poor job. Decided to return item. “Free return “ is not really free as you have to pay for postage. Item was over $9 but postage was $7. Hardly worth the trouble.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Seal Bags Easy",
    "rating": "5.0 out of 5 stars",
    "content": "This perfect for resealing chip bags that often go stale. Easy to use, also has a cutter to open bags. Useful for chip lovers.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works like a charm! I love this thing and it makes my chips last much longer!",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Get it!!",
    "rating": "5.0 out of 5 stars",
    "content": "Like the product, it actually  works..☺️",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I only used it 2 time and it worked great both times. Then when I tried to use it a week later, it wouldn't work. I charged it up thinking that was the problem. Nope. Still doesn't work. Now it's a week past the deadline for sending it back, so i wasted my money.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "👍",
    "rating": "5.0 out of 5 stars",
    "content": "It might be small, but it can seal any bag that you want to seal",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "It cuts your bag when you try to seal it",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Stopped working",
    "rating": "5.0 out of 5 stars",
    "content": "el producto funciona bien",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "High quality!",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Great little sealer",
    "rating": "1.0 out of 5 stars",
    "content": "I really wanted to like this product but it’s just awful. I tried multiple bags I tried different plastics. I tried over and over again and the heat part would just cut throw through where it was supposed to fuse. I tried different pressures, both buttons. Single button. Just bad. Spend a little extra and get a better device",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "we got this because we needed to seal my dogs food and it doesn’t even seal correctly. you think it works at first but it opens with literally anything. it doesn’t seal anything.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "LX IntMfr. Mini Bag Sealer, USB. Authorized Seller: Luke X",
    "rating": "1.0 out of 5 stars",
    "content": "This product didn’t work like the advertised I supposed to return it but I was out of town didn’t get back until today and the return date is over now I can’t return it !! Hate this product",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I've had it for a few weeks now and have yet to get it to seal a bag. It is a waste of money, the idea is good, but the execution is not there. Save your money and just roll the bag the old school way.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Waste of money",
    "rating": "1.0 out of 5 stars",
    "content": "This device was working fine! I wouldnt say the greatest but it stopped working all together! Attempted to charge it and then charge it overnight with the same result it is not working",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "First one stayed charged for 2-3 days, would plug in when not in use. Suddenly stopped charging at all. Second one did the same after a few weeks.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Stopped working",
    "rating": "1.0 out of 5 stars",
    "content": "Me too I made sure it was charged. Everything was done, but it worked only once and that was it try it again charging it didn’t work so it’s a bad product.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works great very impressed",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Horrible. Won’t stay charged.",
    "rating": "5.0 out of 5 stars",
    "content": "This small machine does its function, it’s practical and really easy to use. I really like it.",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Está súper fácil de usar y sella muy bien",
    "post_time": "Reviewed in the United States on June 1, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Worked once",
    "rating": "5.0 out of 5 stars",
    "content": "Works great. It takes a little bit to get used to.",
    "post_time": "Reviewed in the United States on June 2, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "All I have to say is....THIS THING IS AWESOME!!",
    "post_time": "Reviewed in the United States on May 31, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Seals the bags",
    "rating": "5.0 out of 5 stars",
    "content": "Does what it is made for. Great product! Highly recommend",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've bought some other brand it didn't workout for me all the time. I'd recommend this product.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Product does as it was subscribed.",
    "rating": "1.0 out of 5 stars",
    "content": "I had high hopes for this little gadget but was disappointed as it doesn’t seal at all. The blade works and does a rough tear and that’s about it.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Only work one time and i didn't have the time to seal 10 mini plastic bag",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Doesn’t work",
    "rating": "1.0 out of 5 stars",
    "content": "Charged the bag sealer overnight but the red light didn't stay on as indicated in the instructions and in the morning it didn't work at all; even tried just holding it in one place on the bag to see if it was hot, but nothing happened.  Will be returning.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "To small. I can’t seal a bag without it cutting it at the same time. The cut blade don’t retract out of the way. Worthless!",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Don't waste your money",
    "rating": "1.0 out of 5 stars",
    "content": "This thing didnt work at all, way to much trouble",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "don't waste your money. this product doesn't work well. it doesn't even glide over the area making it difficult to seal.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Didn't hold a charge",
    "rating": "1.0 out of 5 stars",
    "content": "Just didn’t have a successful seal.  🤷",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Not as advertised , doesn't seal properly and waste of $",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "keep looking",
    "rating": "1.0 out of 5 stars",
    "content": "trash broke on the first day. sure it was cheap but its not worth the hassle of trying to return.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "muy bueno facil de usar vale la pena comprar",
    "post_time": "Reviewed in the United States on April 17, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "muy bueno",
    "rating": "1.0 out of 5 stars",
    "content": "Product was easy to use however after about three uses it stopped working so I cannot recommend this product and it seems like it is not holding a charge.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "The replacement device's blade doesn't fully retract so it also cuts below the seal. The til of the blade is plainly visible.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Didn't work for more than three uses",
    "rating": "1.0 out of 5 stars",
    "content": "I hoped this Mini Bag Sealer would work because I dislike chip clips. However, despite numerous attempts, it consistently failed to seal the bags. It either burned through the plastic or left the bag unsealed, occasionally causing tears. As a warning to those considering using it for sealing cereal or chip bags, I recommend against bothering with this item. Unfortunately, I waited past the return deadline.",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Just received the sealer use it twice with no problem",
    "post_time": "Reviewed in the United States on April 7, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "The replacement device's blade doesn't fully retract.",
    "rating": "5.0 out of 5 stars",
    "content": "Works to extend the life of my leftover chips. USB-C charging is a good touch.",
    "post_time": "Reviewed in the United States on March 9, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I would not recommend this product. It’s cheap and doesn’t work",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "One of my worst Amazon purchases ever.",
    "rating": "1.0 out of 5 stars",
    "content": "Heat pad did not get hot enough to seal one line from one side to the next.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Does not seal chip bags at all. Total gimmick, should be taken off Amazon completely.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Just use a rubber band.",
    "rating": "1.0 out of 5 stars",
    "content": "This device has the hardest time making an ACTUAL seal.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Lovely",
    "post_time": "Reviewed in the United States on March 6, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Great product",
    "rating": "1.0 out of 5 stars",
    "content": "It just rips the bag, doesn’t seal it",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Absolute POS.",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Doesn’t seal",
    "rating": "1.0 out of 5 stars",
    "content": "cancel this order",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "No seal",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Garbage",
    "rating": "1.0 out of 5 stars",
    "content": "It never worked, never got hot  I charged it still nothing",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Waste of money years to many bags",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "never buy",
    "rating": "1.0 out of 5 stars",
    "content": "Complete JUNK!",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Cheap and very flimsy and barely worked",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Chip bag sealer",
    "rating": "1.0 out of 5 stars",
    "content": "This was horrible. This would not even slide and my back go ripped spots.  Do not recommend",
    "post_time": "Reviewed in the United States on May 2, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Not worth the money!",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Piece of junk",
    "rating": "4.0 out of 5 stars",
    "content": "This is a point sealer rather than a line sealer.  Therefore to seal the line across the top of your bag, so that the bag is sealed, you have to drag the tool across a line from one side to the other, and there should be no gaps in that line.",
    "post_time": "Reviewed in the United States on March 3, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is not too hard if you have a single thickness bag (so total of 2 thicknesses in the sealer, to be sealed together.  If you miss an area, you have to go back and retrace through it.  As the instructions say, make sure the new line intersects the old ones.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "It works, but it takes some effort",
    "rating": "3.0 out of 5 stars",
    "content": "I had difficulty because my bag has accordion folds on the sides.  It's a bag that's designed to be heat sealed.  You open it, pour in the contents, and seal across the top.  Then there's a ziplock on the side that you can open to get at the contents, and seal that back every time you open it.  To open wide to accept the initial filling, it has accordion folds on the sides.  Unfortunately, this puts four thicknesses rather than two in the heater, and I had to go very slowly, and it seems like maybe I sealed it, or at least nearly sealed it so that if I fold the bag over, it will leak air very slowly.",
    "post_time": "Reviewed in the United States on April 3, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Better than competitors",
    "rating": "4.0 out of 5 stars",
    "content": "I've never tried the sealer that does a whole line at once, but I am imagining that that type can seal these bags more easily.  But they take more space, they're not battery powered, and they don't attach magnetically to your refrigerator door.  This heat sealer also has a cutter, in case you want to seal, then cut off the seal.",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Efficient Cutter, Mixed Sealing Performance",
    "rating": "3.0 out of 5 stars",
    "content": "The instructions are almost microscopic.  Bring good eyesight or a magnifying glass.  But it's pretty self explanatory, and I just told you most of what it says.",
    "post_time": "Reviewed in the United States on March 13, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "It seals and cuts",
    "rating": "4.0 out of 5 stars",
    "content": "Works great. Better features than others, includes charging cable",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "Works...Kinda",
    "rating": "4.0 out of 5 stars",
    "content": "I had a bit of a mixed experience with this bag sealer. While its cutter performs admirably with clean, precise cuts, the sealing function falls short of consistency.",
    "post_time": "Reviewed in the United States on March 13, 2024",
    "pid": "B0CQT52K18"
},
{
    "title": "3.5 stars",
    "rating": "5.0 out of 5 stars",
    "content": "Sealing Functionality:",
    "post_time": "Reviewed in the United States on May 9, 2024",
    "pid": "B0CQT52K18"
}
]