[
{
    "name": "        Self Tanning Lotion, Tube Squeezer Reusable for Easy Use, Body Hydrating Self Tanning Cream, Streak-Free, Fake Tan & Quick Tan for Natural-Looking Bronzer Glow for Women & Men       ",
    "stars": [
        "77%",
        "11%",
        "0%",
        "0%",
        "11%"
    ],
    "pid": "B0CRVGQBQC",
    "ratings": "17 ratings",
    "other_info": {
        "Item Form": "Lotion",
        "Skin Type": "Normal",
        "Material Type Free": "Hypoallergenic",
        "Brand": "Bff Beauty Garden",
        "Product Benefits": "Hypoallergenic"
    },
    "discount_price": "$ 10.14",
    "normal_price": "$1.66",
    "about_this_item": [
        " Embrace Your Glow in Two Shades: Choose between medium and dark tones to achieve a fake tan on your body that complements your natural skin color. Equipped with a reusable tube squeezer for efficient use and minimal product waste  ",
        " Nature-Inspired Radiance: Our self-tanner lotion for body delivers more than just a fake tan. Infused with organic aloe vera, shea butter, and a select blend of plant extracts, it promotes a sun-kissed glow while providing hydration benefits  ",
        " Skin-Friendly Formulation: Crafted with a lightweight, non-greasy, and fragrance-free blend that's gentle on the body. This self-tanner is free from harmful additives or dyes  ",
        " Smooth and Streak-Free Application: Our fast-absorbing self-tanning lotion is smooth and gentle, ensuring a seamless experience. With careful usage, it won't stain your sheets or clothes, promising a hassle-free tanning experience  ",
        " Sustain Your Sun-Kissed Look: Enjoy a lasting tan for several days with our sunless tanning lotion. With adequate care, you can maintain your beautiful glow without the need for traditional sun exposure  "
    ]
},
{
    "title": "This works!",
    "rating": "5.0 out of 5 stars",
    "content": "I shave my head and have put this on it once a day for the past week and it looks great!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CRVGQBQC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve tried at least 10 other options and this one really does make you look healthy from head to toe.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CRVGQBQC"
},
{
    "title": "Good quality",
    "rating": "1.0 out of 5 stars",
    "content": "Good packing and quality",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CRVGQBQC"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Unlike most other reviews; i was orange. Even my hands and wrists were stained after washing them thoroughly.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0CRVGQBQC"
},
{
    "title": "Horrible",
    "rating": "5.0 out of 5 stars",
    "content": "This tanning lotion is white without any of the dark guide colors that rub off on things. It goes on even and haven't gotten any streaks from using it. It's a nice subtle tan that can be used everyday. The odor is very faint and different from that of other tanning lotions that I find more appealing.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0CRVGQBQC"
}
]