[
{
    "name": "        Juicer Machines, ECOSELF Cold Press Juicer with 4.35\" Large Feed Chute Fit Whole Fruits and Vegetables, Easy to Clean, Masticating Juicer Self Feeding Effortless for Batch Juicing, High Juice Yield       ",
    "stars": [
        "70%",
        "11%",
        "5%",
        "3%",
        "11%"
    ],
    "pid": "B0CSFY1MLV",
    "ratings": "270 ratings",
    "other_info": {
        "Brand": "ECOSELF",
        "Color": "Black",
        "Special Feature": " ",
        "Product Dimensions": " ",
        "Finish Type": " "
    },
    "discount_price": "$ 99.99",
    "normal_price": "$189.99",
    "about_this_item": [
        " Large Feed Chute & Compact Design：Our juicer machines upgraded 4.35\" inch large feed chute and 40oz capacity is larger than normal, while the size is smaller. You can juice whole fruits and vegetables without chopping. Moreover, the slow juicer doesn't take up too much space on a kitchen counter, which fits for a small kitchen, and can be carried to any part of the kitchen easily.  ",
        " Powerful Motor & Efficient High Yield：With a High-power motor, our cold press juicer separates the pulp from the juice well, providing you with better-tasting, purer juice. Cold press technology maximizes the retention of nutrients and reduces oxidation, extracting a high yield of vitamins for your satisfying juicing experience. Enjoy fruit and vegetable juices such as apple, carrot, orange, watermelon, ginger, celery, tomato and more!  ",
        " Easy to Assemble & Clean：Our ECOSELF masticating juicier features a hopper & screen integrated design, which can be easily assembled and disassembled in minutes, and is also easy to clean. Except for the motor base, other parts can be quickly cleaned with water, with an included brush for a hassle-free cleanse.  ",
        " One-button Operation & Safety Design：It is easy to operate with a simply rotating button. You can enjoy fresh juice with ease. And the reverse function helps prevent clogging. The juice maker will automatically stop working if the cover is open accidentally while juicing, which is safer for children.  ",
        " Protection Service & Brand Story：We provide 24 months of Repair and Replacement Service. Get in touch with us whenever you need. We will reply to you within 24 hours. ECOSELF is committed to providing customers with better service and shopping experience.  ",
        " Troubleshooting Steps：The juicer can only be powered on and work normally after it is fully assembled. Rotate hopper clockwise to align Guidemark with Lock symbol, then close the hopper cover, and ensure full assembly before powering up the juicer.  "
    ]
},
{
    "title": "Easy Peasy!",
    "rating": "5.0 out of 5 stars",
    "content": "I  was hesitant to get into juicing again.  My last juicer was a nightmare.  I cant say enough about the ease of use and clean up for this product.  The juice output is amazing and clean up is a breeze. I read the 1 star  reviews and very confused if they got the same product as I did?",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The product works very well! It was very simple to assemble. When juicing it crushed everything and it was easy to clean. It comes with 2 cups, one for the pulp to discard and the other with the fresh juice. It was perfect and fresh. I would definitely recommend this because it’s small compared to other juicers I’ve seen on the market. What you see in the picture made 3 glasses of juice. I hope this helps :)",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Very Simple to Put together, Easy clean up, Loved everything about it! :)",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is very easy to set up, taking only about 10 minutes. The juice extraction performance is excellent, and it’s a great tool for fresh, healthy juices. Highly recommended for anyone who loves juicing!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recommend this blinder because it is very easy to put together and take apart. The only not so great part is that it was a little difficult to take the peel out of the machine. It also doesn’t take up a lot of space which is great for my kitchen! The juices were amazing and it was a easy clean as well!",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Easy to Set Up and Excellent Juice Extraction",
    "rating": "5.0 out of 5 stars",
    "content": "Very nice quality! Love the black color and it doesn’t leave stains from the vegetables. Easy to take apart and easy to wash as well. Buy it!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I wish I can give a at five stars but I can’t. I wish they have a half a star I will give it 4 1/2 the juice is good it juice The fruits and vegetable that I use. when it comes to  celery That’s a whole Another question because it does cut up the celery but the When it comes out the little hole on the side, it gets a little clog Not all the way through, but it does that’s why I lead the celery to the end",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Great!",
    "rating": "5.0 out of 5 stars",
    "content": "Fantastic juicer  easy to put together east to clean..  very quick.. I would say this os the best yet..",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love using this juicer. I am able to empty the cup containing the dryer vegetable and fruit waste into my compost and the unit is easy to clean",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Love",
    "rating": "5.0 out of 5 stars",
    "content": "Just say you don’t have spend your money on very expensive cold pressed juicers this works just fine.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to juice a variety of different types of fruits and vegetables",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Sooooo easy to clean!",
    "rating": "5.0 out of 5 stars",
    "content": "I am a beginner; like this is my 1st juicer & I just made my 1st 32 Oz of juice. It was so easy. And clean up took 5 mins.  I literally just rinsed it out & then cleaned with soap. I'm so happy. Everyone said cleaning was the hard part & this juicer said, \" I got you!\" It's not overly loud either. Excellent Xmas gift!",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works very well love it",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "Didn't regret buying it",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I just got this juicer and was excited to open it and start juicing.  Right away, I love it due to the size.  I don't have much space in my small kitchen and this juicer doesn't take up too much space.  It was easy to assemble together and juicing my carrots was just as smooth.  The major plus for me was that cleaning it is a breeze.  I've hesitated over getting a juicer because the clean up after is a mood killer.  But this was truly a quick clean up and all set for the next juicing session.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Works perfect",
    "rating": "4.0 out of 5 stars",
    "content": "I just used few times but now it did not work",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have had a good experience so far I'm new to the juicer crew I know there big and better but to start off I think it's great. I do have to cut up my fruit/vegetables before putting  it but I'm okay with that. And I enjoy the book that comes with it and also there not so much pulp.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Easy to use, easy to clean",
    "rating": "5.0 out of 5 stars",
    "content": "It’s all great so far. I’m really in love with the quality of the juice I was able to make this morning. Very concentrated juice! I did get a tiny bit of foam but nothing like when I had my N.B.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to use & clean. Easy to put together & take apart. No big mess to clean afterwards with all sorts of parts. The lid must be closed in order for it to function. You can open it (while it’s on) to add more fruits/veggies. But the motor will pause. Once you close the lid it will start juicing again. I paused it and put the juicer in REV to get any leftover fruit that was sitting around the chamber.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Something wrong with machine",
    "rating": "5.0 out of 5 stars",
    "content": "My mint stems are currently stuck in the chute. Hopefully the cleaning brush can help with that. You will not regret it. Make sure to read the directions and the labels on the juicer itself.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this juicer for the value of money I spent due to the other competitors. It's not very noisy to use and the speed of the machine is very surprising for being a cold-pressed juicer. It's not very messy to use due to the two simple compartments being used for the juicing process. The performance of this product holds up just about to any fruit or vegetable and doesn't lag behind. I'm glad that it is easily portable and doesn't take up a lot of space in my kitchen",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Amazing product",
    "rating": "5.0 out of 5 stars",
    "content": "I like that the juicer is not loud. It’s also super easy to clean. It comes with a brush and easy to assemble and disassemble to clean it. I have made lots of juices and I’m super satisfied with this product. It is a perfect juicer doesn’t take up a lot of space in the counter.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've been using this juicer for about more than 2 months on a daily basis and it never fail it's  been working pretty good is very small that sometimes a take it to my Office with me when I have long hours or work and can't be a Home, I wanted to wait a bit long time to try it out and see if something happened to write a decent review but it works like a charm my wife loved it . I have tried several juicer machine but this compact size is the perfect for me.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "AFTER 2 MONTHS DAILY USAGE.....",
    "rating": "3.0 out of 5 stars",
    "content": "I love this juicer, but the juice extractor cracked, and I threw it away, because I figured I could order a replacement part. but it appears there is no place to order replacement parts. This item is only 2 months old. Is there anything you can do to assist us in replacing this juicer with paying full price for it.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a slow masticator therefore it will take time to extract all the juices, it’s good quality for the money you do not need to reprocess the pulp, but it has little and big components to clean and they provide you with a brush. The mouth is big so as you open the top, it’s not necessary to cut in small pieces. Overall excellent purchase!",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Cracked juice extractor",
    "rating": "5.0 out of 5 stars",
    "content": "I have never juiced before and bought this based on reviews and pricing. It is very simple to use, seems to juice anything I put in and cleans up very nice! I am pleasantly surprised. I have used it about 8 times so far with no issues and it comes out very clean. Great value!",
    "post_time": "Reviewed in the United States on August 8, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Good to do your juices it work fast",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Gets all the juice out",
    "rating": "3.0 out of 5 stars",
    "content": "It's not working properly.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "We never had a good experience with juicers and we were skeptical but decided to purchase this juicer. So far we are very impressed with it. It is easy to use and easy to clean.  Love the fact that it is dishwasher safe and all the pieces can be separated and cleaned.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Love it",
    "rating": "3.0 out of 5 stars",
    "content": "Think pretty well but the juice is not tightly squeezed. It's quite moist. And please let me know if it is normal that the body move when it works. Need to be replaced?",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love it its super easy to use and cleaning it is easy!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Well built and works great!",
    "rating": "5.0 out of 5 stars",
    "content": "There are many juicers on the market, however found this one not too expensive not too cheap either. Extremely happy with the product. Well built, quality parts, high yield juice, plenty of power and works great. I haven't experienced any issues thus far and I use it 4 to 5 times a week.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Juices a little slow,  noise not too bad, cleanup simple.. Not much foam",
    "post_time": "Reviewed in the United States on June 6, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "Removes 99% of the pulp, but struggles with celery strings.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recently purchased this juicer, and I am thoroughly impressed with its performance.  It is incredibly easy to use, with intuitive controls that make juicing a breeze.  Cleaning the juicer is a quick and simple process, thanks to its detachable parts and dishwasher-safe components.  Assembly is straightforward, and the clear instructions ensure that you can have the juicer up and running in no time.  Overall, this juicer is a fantastic addition to any kitchen, providing convenience and efficiency for all your juicing needs.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Quality",
    "rating": "5.0 out of 5 stars",
    "content": "I have this machine for a couple of months now and it’s very easy to use and also has a good grinder for grinding and squeezing out all the juices from my veggies and fruits.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This press is way better than blending frozen fruits and vegetables. The drinks are just as good as store bought juices. The recipe book included makes great suggestions.  This unit has already increased my fruit and vegetable consumption! Ready to clean and store. The unit is made high quality.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "you don’t want to over crowd it with veggies. Especially celery.  But it’s a great Mac.",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and to clean just what i wanted just got it today hope it last long lol i will be positive but  i love itttttt",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The juicer machines is useful and my mom really likes it! Overall it's easy to assemble and use if follow up the instructions. Also, it's quick to make the fruit juice and easy to clean after use. Last but not least, the sound level it's not very loud and can not wait to this blender next time!",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Awesome nutrition!",
    "rating": "5.0 out of 5 stars",
    "content": "The juicer is easy to assemble and works well. Noise level is fine, better than my blender. Cleaning is simple too. I use the little brush to push out the residue.",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I have tested on mango and corn. Corn juice is amazing; if you juice mango then you get a cup of mango juice and a cup of mango smoothie. Also tested on soy trying to get some soy milk, didnt work😂",
    "post_time": "Reviewed in the United States on April 28, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "Great easy to use easy to clean",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is amazing! It's so easy to use, I can't believe how quickly I've incorporated juicing into my daily routine. Cleaning and reassembling it are such a breeze, I never dread doing it. I even got one for my best friend's birthday, and she loves it too. It's the perfect gift for health-conscious loved ones. Five stars all around!",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Effortless Everyday Juicing！A Gift That Keeps On Giving!",
    "rating": "2.0 out of 5 stars",
    "content": "I was excited to see a slow masticating juicer with a wide chute for inserting vegetables and fruit and hoped it would make the juicing process more efficient. Sadly, what I found was the vegetables, especially leafy ones like chard, simply got pushed to the side and were not pulled down  into the masticator. The plunger part only pushes directly down through the circular hole in the lid, so it is of no help. To press the plant matter down, the juicer must be turned off, lid opened, and then manually repositioned. Any time saved by stuffing the wide mouth feeding container is lost by having to scrape down the sides. This might be a fine juicer for just apples or carrots, but it is impractical for leafy greens. I returned it.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Durable and handy, will not occupy a lot of space in your kitchen unlike other juicer.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "I really wanted to love this",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer works well. I tried carrots and celery, it beats my expectation.  it's small and quite. Very easy to clean and take with me. If you like juicing and don't love cleaning a huge machine just for a morning boost. This is a great option for me to have more green and carrots to stay healthy. Make sure to open the top lid and turn the container. Watch the vedio on the page if you can't get it inserted.",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Funciona perfectamente es muy práctico me encanta utilizarlo a diario",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Durability and portability",
    "rating": "5.0 out of 5 stars",
    "content": "Its been great",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use it to drink homemade juices, for my health.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Easy to use and works great",
    "rating": "5.0 out of 5 stars",
    "content": "It does it job. Quite, slow but great.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Really liking this after a few test runs. Not too big on the counter. Perfect for full apples and oranges and other smallish fruits and veggies. I like that its easy to clean. Makes me more likely to actually use it regularly. Doesn't clog up easily like my old juicer either. Use cold fruit and it doesn't warm up too much while running so no need for ice in juice afterword. Overall its a nice package without breaking the bank.",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "I highly recommend this juicer",
    "rating": "5.0 out of 5 stars",
    "content": "Good price for this juicer. I like the size, the ease of use and dismantling. Works quietly. Easy to clean and great for my fruits and vegetables cold pressed juice in the morning. Juice taste great!",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "It’s ok. I suppose there is not a perfect one. Clogs easy on celery.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Average",
    "rating": "5.0 out of 5 stars",
    "content": "I am in love with this juicer! I just received it yesterday and was so excited to put it to use. It's a beast of a juicer and handled large pieces of fruits and vegetables with even putting a whole large apple in at once. Easy clean up because of the way it comes apart. The juice spout doesn't leak at all and the pulp and everything else comes out very dry so you are getting all the goodness with very little waste.",
    "post_time": "Reviewed in the United States on April 6, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is a great juicer. We have put in apples, oranges, bananas, kiwies, celeries, and some frozen fruits in it. Each time it seperates liquid and solid remains well and returns healthy juice. It is easy to install and use. Cleaning with the auxiliary brush is also easy once you figure out the design of the brush. A recommend for juice makers.",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Amazing",
    "rating": "5.0 out of 5 stars",
    "content": "Para hacer mis jugos verdes",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use gauze to manually squeeze the celery juice out every time. This one is a hands-saver and lifesaver! Even it is a lil bit slow, my friend's juicer (a different brand ) is about the same. It will give you a feeling that life can be easier! 5 star.",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Easy to install, use and clean",
    "rating": "5.0 out of 5 stars",
    "content": "Love it love it love it",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Un precio elevado para lo que hace. Me atrajo la idea de no estar cortando tanto las verduras pero en realidad ahora las corto mucho mas entre mas pequeñas mejor por k luego la cascara gruesa no se procesa y se queda ahi atorada no es buena para las hiervas no les hace nada, tarda mucho mas tiempo k otros aun k no es problema para mi, eso si es es muy facil de lavar, bueno esperaba mas del producto pero me desiluciono. Apenas tengo un par de meses y con el y ya se me paro en una ocasion por lo que no creo k dure demasiado tiempo.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Exprime muy bien las frutas y vegetales",
    "rating": "5.0 out of 5 stars",
    "content": "I use this product to juice my fruits & veggies. I like that it separates the pulp from the juice very fast. The brush with the stick on the end is perfect for cleaning. Easy to put together & take apart. Not very loud.",
    "post_time": "Reviewed in the United States on June 5, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is the first juicer I have ever bought. It is very useful. I used to use a wall crusher, which had a lot of residue. This juicer can separate it. It is great. It is very easy to use.",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Impressive Juice Yield and Easy to Clean!",
    "rating": "5.0 out of 5 stars",
    "content": "“Impressive Juice Yield and Easy to Clean!”",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’m thrilled with the ECOSELF Cold Press Juicer! The wide mouth accommodates whole fruits, and the high juice yield is fantastic. Plus, it’s a breeze to clean with the included brush. Highly recommend! 🍎🥕🍊",
    "post_time": "Reviewed in the United States on May 31, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Amazing juicer",
    "rating": "3.0 out of 5 stars",
    "content": "This juicer is a great product, it works perfectly fine with all types of veggies and fruits. I am using it on regular basis and love it!",
    "post_time": "Reviewed in the United States on June 7, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s okay it’s hard to get it started with the piece",
    "post_time": "Reviewed in the United States on May 19, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "As you can see, on this video for that product is extremely good, compare to others it's more juice, more  easzy to use and clearing, also it made juice by extrusion not knift that' amazing. So good",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The operation is simple, easy te clean, and the appearance is also very beautiful. The noise is very small, almost no sound can be heard. The most important thing is that the juice yield is very high, and the squeezed juice is delicious.",
    "post_time": "Reviewed in the United States on May 3, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "perfect",
    "rating": "5.0 out of 5 stars",
    "content": "I was excited to use this juicer when it arrived, and the package came very quickly. The product was well-packaged and easy to operate right away. The juicer is efficient and cleaning is straightforward. Overall, was a nice purchase",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I WANTED A SMALL APPLIANCE THAT WAS NOT TO COMPLICATED TO ASEMBLE AND EASY TO CLEAN AND THIS WAS MY FIRST CHOICE. I WAS PLEASANTLY SURPRISED IT WORKED JUST AS I'D HOPED.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Excellent",
    "rating": "5.0 out of 5 stars",
    "content": "It looks like it has great quality. I can't wait to try it!",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use it for onion juice(for my hair) and potato to remove tan for my face, orange for my skin and what not!!!!",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Cup size very small",
    "rating": "2.0 out of 5 stars",
    "content": "The cut size is so small that you can’t feed in two apples in it",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is great, and worth to buy. It's easy to wash and convient to use at all.",
    "post_time": "Reviewed in the United States on April 21, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "work excellently",
    "rating": "1.0 out of 5 stars",
    "content": "I received a possible returned juicer. I looked at the packaging and when I saw tape on top of the box which was used to close it and not sitting flush. After opening the packaging I saw that the brush that is used to clean the juicer was ripped open which confirmed my suspicion. Heck the juicer itself wasn't sitting properly in each of the placement holes it was designed to sit in. I dont know who to blame for this mishap but my excitement of getting this has turned to extreme disappointment",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "wide mouth very convenience.the machine size not take too much space on kitchen counter.efficient high yield and easy to clean.",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Purchased NEW but received USED!!!",
    "rating": "5.0 out of 5 stars",
    "content": "it is great. It is very easy to use and very easy to clean. I really like it.",
    "post_time": "Reviewed in the United States on March 29, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I really wanted to like this item, but it keeps turning off every five minutes when I try to make a juice. I guess it’s not strong enough for what I need to do. So sad.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "efficient & kitchen save space juicer machine",
    "rating": "1.0 out of 5 stars",
    "content": "this is the worst piece of kitchen equipment i have ever used. manual states that motor shuts off when it over heats and will restart once cool, usually about 30 minutes. the juicer motor burned out before i could juice 5 pounds of carrots on its first use. you need a lot of carrots for a small amount of juice so its not unreasonable to expect the machine to work long enough to get through 5 pounds before overheating. once it over heated you could not disassemble the equipment until the motor was cool which is crazy. once cool it was still really difficult to take it apart, it was like suction stuck.",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "i let it rest overnight and trued to juice again and it over heated in under 5 minutes so its a piece junk",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "it’s good. ‏It is worth it.",
    "rating": "1.0 out of 5 stars",
    "content": "The product description and video do not accurately represent the product's capabilities, and I am unhappy with my purchase. A refund request will be made.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "This juicer is so difficult to put together. I have to use all my strength to twist the top onto the base. Seems to be getting worse over time.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "DONT buy this",
    "rating": "1.0 out of 5 stars",
    "content": "DON’T waste your money just used two times and is already not working",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "the item is defective and does not offer UPS shipment for pickup. They know that this item did not work before they packaged it to me. This is crap do not waste your money.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Please do not purchase this item IT'S CRAP",
    "rating": "1.0 out of 5 stars",
    "content": "This machine really let me down. I thought I had taken advantage of such a big discount, but in fact, I just found more trouble for myself, because I not only need to spend time studying this machine that doesn't work. I also have to return it, which is really an unpleasant shopping experience.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "No tritura bien los vegetales",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "It doesn't work",
    "rating": "1.0 out of 5 stars",
    "content": "I used like 5 times and today it stopped working.",
    "post_time": "Reviewed in the United States on August 4, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is not a bad little juicer. I was a little bit concerned about how well this juicer would work since it's so small and I was honestly quite overwhelmed by all of the many parts, but once you read and reread the manual and put it together, it was fairly easy to operate.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "No hace bien los jugos",
    "rating": "1.0 out of 5 stars",
    "content": "Pros:",
    "post_time": "Reviewed in the United States on May 11, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "1)Small size takes up less counter space",
    "post_time": "Reviewed in the United States on July 7, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "It lasted 3 months",
    "rating": "1.0 out of 5 stars",
    "content": "2)Surprisingly easy to clean, despite having a lot of parts that have to come apart for cleaning",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0CSFY1MLV"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "3)The best thing about this juicer is the dry pulp it leaves behind and that it juices all parts of your fruit and veg (it doesn't leave big chunks in the discard)--the last juicer we had left big chunks behind and the pulp was so wet that we had to run it back through again--well, not this one! When you're left with very dry pulp, that means you've extracted the maximum amount of juice",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0CSFY1MLV"
}
]