[
{
    "name": "        Conair Ceramic Hot Rollers for Long, Medium, and All Hair - Hair Curler - Hair Roller Clips Included - 1 1/2-inch Rollers - Amazon Exclusive       ",
    "stars": [
        "59%",
        "15%",
        "11%",
        "6%",
        "9%"
    ],
    "pid": "B0CT1PNK9F",
    "ratings": "3,475 ratings",
    "other_info": {
        "Item Form": "Clip",
        "Hair Type": "All",
        "Number of Items": "1",
        "Material": "Metal Ceramic",
        "Size": "1 Count (Pack of 1)"
    },
    "discount_price": "$ 42.44",
    "normal_price": "$42.44",
    "about_this_item": [
        " Ceramic Hot Rollers For Voluminous Curls: These 12 rollers use Ceramic technology to provide an even heat transfer for long lasting curls; They heat up quickly and evenly in 85 seconds; Velvety covering on the rollers helps protect hair from heat damage.  ",
        " Easy To Use: When the ready dot illuminates, use 1 inch of hair in each roller and secure with a super clip. Leave rollers in for 20 minutes for bounce and volume or 10 minutes for looser waves. Clean the unit and the heating strips with a cloth when cool.  ",
        " Full Set: Includes 12 ceramic flocked rollers in one size for custom curls and waves; Twelve 1 1/2 inch jumbo rollers; This special set includes 12 super clips to hold your hair securely and keep the rollers in place.  ",
        " Heat Wave: To ensure that your hot rollers heat up, place the hot roller container on a flat surface with the cover tightly closed to prevent heat from escaping. Wait 85 seconds for the hot rollers to get up to a temperature between 140F-230F before using  ",
        " Conair Hair Care: Since 1959, we have made innovative small appliances, hair styling tools, and more; Our hair care line includes high quality hair dryers, brushes, styling tools, and hair accessories  "
    ]
},
{
    "title": "Curls galore!",
    "rating": "5.0 out of 5 stars",
    "content": "I had not used hot rollers since HIgh School! My girlfriend was visiting and had this same set and I couldn’t believe how quickly she got added bounce! She has had them for over 10 years and I figured… that is the quality I want! Easy to use and I love the clips!",
    "post_time": "Reviewed in the United States on June 5, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "So I have used hit rollers for probably 30 years or more. Im not sure about these just yet, they don't get very hot. When I go to put in my hair they font even feel very warm. Im used to my hot rollers being hot and once in your hair you can feel the heat on your head. I don't feel it with these. So I'm not sure if they are good or not. They barely do anything to my hair so im not sure if they will work for me. Im goung to try a few more times if no curl im going to return them",
    "post_time": "Reviewed in the United States on January 25, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Hot",
    "rating": "3.0 out of 5 stars",
    "content": "Looked great but honestly didnt get hot enough to curl my hair.  I have used hot rollers for years but these just dont work for me.  bummed as they were rated really well.  I need old school hot rollers.",
    "post_time": "Reviewed in the United States on May 12, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Happy with purchase! Heats quickly & stays in my straight fine hair.",
    "post_time": "Reviewed in the United States on December 10, 2023",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Not hot enough",
    "rating": "4.0 out of 5 stars",
    "content": "Great value. Do not use these as often as I should as I am a lazy bun person but when needed they are great, heat up quickly and easy to use. Would purchase again.",
    "post_time": "Reviewed in the United States on December 25, 2023",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Overall these worked great. However, the clips were a bit funky and were a little too small to hold up the roller. But the results looked good. Just needed to be shaken out a little.",
    "post_time": "Reviewed in the United States on March 14, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Happy with purchase! Heats quickly & stays in my straight fine hair.",
    "rating": "4.0 out of 5 stars",
    "content": "I love my new hot rollers. At my age you would think I would have used them before but the answer is no! I'm so happy I have tried them out. They work great. Very quick to heat up. I'm still experimenting on different placement of the rollers for different looks. So far I'm really pleased each time I use them. Give them a try. I leave them in until they are completely cool. Good value for your money as well.",
    "post_time": "Reviewed in the United States on July 10, 2022",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "These electric curlers heat up quickly and stay hot for a good amount of time. I have only used the set once. I do wish that it came with a variety of curler sizes and not all the same size curlers (that was my fault for not paying attention to the description). In the past, the electric curlers I purchased had small teeth on them making it a bit easier to wrap hair around them. These curlers are very smooth and are a little harder for me to manipulate my hair around; however, they don’t get easily tangled in the hair due to their smoothness. While the set is somewhat compact, they’re not exactly what I would consider “travel size.” You do have a choice of metal clips and super clips. I like the metal clips, but some folks may like the super clips to hold the curlers in place.",
    "post_time": "Reviewed in the United States on November 10, 2023",
    "pid": "B0CT1PNK9F"
},
{
    "title": "has a hard time staying put",
    "rating": "3.0 out of 5 stars",
    "content": "I love the size of the curlers but the clips are terrible.  I have used Conair curlers most of my life and have never had such cheap clips.  They don't hold very well, especially if you put curlers on top of your head, and I am disappointed.",
    "post_time": "Reviewed in the United States on May 18, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love the size. Love the heat. Hair clips leave crease in hair. I bought some hair pins for that size roller but still not a good fit.",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Wish I could rate this more than 5 stars!",
    "rating": "5.0 out of 5 stars",
    "content": "I chose the Conair Big Curls and Waves Jumbo Ceramic Hot Rollers after reading dozens of reviews, plus comparing the pros/cons with other Conair hot rollers.  I am a senior citizen with shoulder length natural hair, color is natural combo of blonde/gray/silver/white.  My hair is fine and completely straight.  I have used these felt rollers 3-4 times and I am so pleased with the volume and soft curls resulting. I use a pick and finger-comb my hair out, no brush.  I receive so many compliments every time.  Now, in hot, humid Florida, my curls do not retain the volume hours on end, plus I do not use hair spray. But I am ok with that.  Regarding the device, it heats quickly, it comes with both the plastic claw-type clips and metal clips.  All rollers are felt covered and the same size, which is one of my reasons for choosing this set. My hair never tangled in a roller.  Do they get hot?  Yes--after all, they are called \"hot rollers.\"  When a couple of rollers near my face/ears felt hot against my skin, I just repositioned them.  The unit would be bulky for traveling, but that was not a feature that was important to me.",
    "post_time": "Reviewed in the United States on July 26, 2022",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "overall, I like this set. They get hot there a cute color love love love the clips it comes with because I have multiple sets of hot rollers and the clips can be a pain in the butt. The negatives are it takes at least 15 to 20 minutes to get really hot and the ends of the rollers are so hot. You can barely roll them in your hair. Like I said, I have multiple sets of rollers a different brands and this is the only said I’ve ever had were the ends are so hot you can barely touch them. It’s a little bit of a bummer makes it hard to use.",
    "post_time": "Reviewed in the United States on April 11, 2023",
    "pid": "B0CT1PNK9F"
},
{
    "title": "good",
    "rating": "3.0 out of 5 stars",
    "content": "The rollers get nice and hot but the clips are absolutely trash super flimsy and does not support the weight of the roller and hair and they just fall right out I have never seen so cheap very thin plastic clips",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "easy clips and do not get to hot to handle",
    "post_time": "Reviewed in the United States on March 13, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Horrible clips",
    "rating": "3.0 out of 5 stars",
    "content": "I have fine, shoulder-length, straight hair. I had high hopes for these rollers as they are described as 1.5” and I thought they would produce good volume and curl. Sadly for me, they did not. I got some decent volume, but within a few minutes, it was half flat. Curl did not last. Tried this set twice with different hair products, duration in hair, etc., but results were the same: a slight increase in volume and zero lasting curl. I also thought the heat plates inside the unit looked dented (slightly damaged? previously used??), and I also thought not all rollers got up to the same temperature as some felt hot to the touch and others were just warm. I’ve read other reviews where people complained that their fine hair would get stuck in the internal slit of the roller, which I partly agree with. You can’t just quickly remove them, you have to consciously and slowly unroll so that your hair doesn’t get caught in that part. Not a big deal, just a learning curve and something to be mindful of.",
    "post_time": "Reviewed in the United States on February 26, 2023",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought the heating curlers for my mom because she has such thick hair it takes atleast two hours for the standard hair curlers to do what there supposed but with the conair hot curlers it only takes 15 minutes to bring her hair to Texas high quality you know what they say the higher the hair the closer to God",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "like the clips",
    "rating": "4.0 out of 5 stars",
    "content": "It does the job, but wish they got a bit hotter.",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I spefically ordered this set of rollers because the description stated it included flexible metal pins however they were NOT included.",
    "post_time": "Reviewed in the United States on September 5, 2023",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Sadly, these rollers did not work out for me.",
    "rating": "5.0 out of 5 stars",
    "content": "****Full Set: Includes 12 ceramic flocked rollers in one size for custom curls and waves; Twelve 1 1/2 inch jumbo rollers; This special set includes 12 flexible metal pins and 12 super clips to hold your hair securely and keep the rollers in place.***",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Again, forgot to return them",
    "post_time": "Reviewed in the United States on January 7, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Easy to use and good price",
    "rating": "5.0 out of 5 stars",
    "content": "I bought a lot of expensive products, but the reason I didn't use them after one use was because I have a lot of hair, so the device was very uncomfortable to use when I had to hold my arm for a long time.  So I bought this product and it is really very comfortable.  After you roll it up, just unwrap it after putting on makeup or doing something else, and it is done.",
    "post_time": "Reviewed in the United States on February 28, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The rollers themselves, are great! The plastic clips, however, are worthless. Go ahead and buy the metal clips seperately, because you will need them if you have any thickness to your hair at all.",
    "post_time": "Reviewed in the United States on November 11, 2023",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Rollers are great!",
    "rating": "4.0 out of 5 stars",
    "content": "I have a set from Conair that’s probably 10 years old but it has an on and off power button. This new set does not. You can’t tell when it’s heated you just plug it up and wait about five minutes but they work great.",
    "post_time": "Reviewed in the United States on October 15, 2023",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I used the rollers about 2 to 3 times a month. After I take the hot rollers out of my hair, I roll up the curl and pin it so the curl last longer. I recommend using a heat protectant spray because the rollers can really dry your hair out. In addition, make sure you use hairspray after you style your hair because the curls do not last long.",
    "post_time": "Reviewed in the United States on February 17, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Love these rollers.",
    "rating": "4.0 out of 5 stars",
    "content": "The clips are flimsy. But the rollers are nice.",
    "post_time": "Reviewed in the United States on February 17, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Don't really get hot enough to curl hair",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Mixed feelings",
    "rating": "4.0 out of 5 stars",
    "content": "My only issue with the Conair Ceramic 1 1/2-inch Hot Rollers is the \"Super Clips\".  They don't hold the curler in place. Otherwise, it's perfect.",
    "post_time": "Reviewed in the United States on December 4, 2023",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been happy with these rollers. I like the velvet base so they don’t burn the ends of my hair. They work perfectly. I bought a few extra clips just in case any of these that come with the rollers break and I’ve been very happy with them as well.",
    "post_time": "Reviewed in the United States on April 20, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Loose clips",
    "rating": "5.0 out of 5 stars",
    "content": "It has been years since I used hot rollers. I have been using a curling iron on the high setting every day for the past six years. After burning my neck a few times I realize how hot it is and that I’m probably frying my hair. I was pretty skeptical when I ordered these rollers but I knew something needed to be done. These rollers work. It doesn’t take any more time than my curling iron and the curls last so much longer, even in the heat and the humidity of the south. The rollers took out the flyway frizzies. I was using the curling iron to do that, too.",
    "post_time": "Reviewed in the United States on August 3, 2022",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I am amazed!",
    "post_time": "Reviewed in the United States on December 9, 2023",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Malfunctioning",
    "rating": "2.0 out of 5 stars",
    "content": "So I purchased these a month ago and just now decided to use them this morning on my daughter’s hair for picture day! They were plugged in an hour before use and the light was still red and still is. The rollers do get hot. My daughter has a very lovely hair texture so that’s not the reason the curls didn’t form. I left the rollers in her hair for about 20mins. Instructions state to leave them in for about 10min. The worse curls. I curled her hair better with my flat irons. They are still plugged up and the red dot hasn’t changed to white. What is the issue? I’m very unsatisfied with these. I seen them online and thought they would be a great fit for us. Not exactly what I had in mind.",
    "post_time": "Reviewed in the United States on May 1, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I like it came fast. Easy to use",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Came quickly and works well",
    "rating": "5.0 out of 5 stars",
    "content": "They're just that, don't burn my fingers and leaving them on for 20 mins gave me beautiful big and bouncy curls (my hair is about waist length and this roller size is perfect)",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Rollers are good and they heat fast. However description states they come with wire and claw style holders.  I did not receive the wire holders and I absolutely hate the claw style type.  I am currently trying to purchase wire holders but the reviews of wire holders vary so much I have not had the courage to order.",
    "post_time": "Reviewed in the United States on January 14, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Heat rollers",
    "rating": "2.0 out of 5 stars",
    "content": "They sort of work. They get plenty hot. But, it is impossible to get the rollers to hold tight enough for them to really set a good curl. Definitely need a better fastening system.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "These do a good job with volume but for my hair the curls fell out quickly after. I have used these a dozen times and it doesn't matter if I leave them in for 2 hours - the curls still fall out.",
    "post_time": "Reviewed in the United States on February 22, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Rollers are good - holders are not",
    "rating": "4.0 out of 5 stars",
    "content": "These work fine once they are fully heated up, but that takes longer than the 90 seconds advertised.  This was also supposed to come with the wire clips but they didn't.  The claw-type clips are very flimsy and don't hold very well at all.  I had to buy the wire clips for this to work for me at all.",
    "post_time": "Reviewed in the United States on July 27, 2023",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "I probably would not have bought this if I had known that the curls would not stay in but for a couple minutes. I tried it and I guess my hair is hard to curl because they didn't stay  in very long even leaving the curler in for over 10 minutes. I would not buy again.",
    "post_time": "Reviewed in the United States on January 18, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Well, Sort Of...",
    "rating": "5.0 out of 5 stars",
    "content": "This product is cost effective for those wanting a decent curler for a decent price! The product works well. Advice: when waiting for the ready light, the light is on the curler itself (very small). Don’t make the same mistake I did waiting for the large circle light to change… it doesn’t. 😂",
    "post_time": "Reviewed in the United States on February 18, 2024",
    "pid": "B0CT1PNK9F"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Liked product",
    "post_time": "Reviewed in the United States on December 9, 2023",
    "pid": "B0CT1PNK9F"
}
]