[
{
    "name": "        OJA Red Wine Glasses Set of 4- Hand Blown Premium Crystal Wine Glasses-17 oz, Long Stem,Thin Rim, Perfect for Red or White, Daily Use, Unique Wedding Anniversary or Birthday Gift       ",
    "stars": [
        "78%",
        "10%",
        "5%",
        "2%",
        "5%"
    ],
    "pid": "B0CTQMQ11T",
    "ratings": "2,228 ratings",
    "other_info": {
        "Brand": "OJA",
        "Color": "17 Oz",
        "Special Feature": "Lead-free Crystal",
        "Style": "Modern",
        "Theme": "Wine & Celebration"
    },
    "discount_price": "$ 38.",
    "normal_price": "$9.75",
    "about_this_item": [
        " PURE CRYSTAL: LUNA&MANTHA comes from the OJA brand,it's red wine glasses have passed the European certification, using premium titanium crystal, making the wine glasses ultra-thin (as thin as 0.8mm), brilliant and light enough. Its sparkling appearance, resonant sound and pleasant hold are indeed a gift you can cherish for years  ",
        " 100% HAND BLOWN: Inheriting traditional hand-blown craftsmanship, LUNA&MANTHA red wine glasses are carefully blown through 27 processes by sophisticated craftsmen with over 12 years experience. Unique glasses with its unique pulled stem, there is no seam between stem and bowl  ",
        " ENHANCE WINE TASTING: Tulip glassware is the best shape for wine glasses. The bowl is not only aesthetically pleasing, but it allows wine to breathe without over-oxygenating. The rim of the glass feels ultra-thin and inconspicuous in your mouth, like floating in the air and drinking. These make to better experience the wine itself while tasting it  ",
        " LONG STEM: The slender 4 3/4in stem allows to easily hold, and the decanent feeling in your hand makes it easier to swirl wine. Long crystal stem adds an elegant and refined visual feel to the wine glass. Not only exquisite artwork placed at home, but also a must-have for serving the most important guests  ",
        " GIFT BOX: Its modern packaging style is best for your friends and families as birthday or wedding gift. The intimately designed handle allows you to take crystal wine glass to anywhere safely. We also provide the perfect customer service, any problem after receiving the wine glasses, please contact us, we will solve the problem for you soon  "
    ]
},
{
    "title": "Very nice wine glasses!",
    "rating": "5.0 out of 5 stars",
    "content": "Classy wine glasses, great quality, and easy to hand wash.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love the quality and looks of these wine glasses, very beautiful!",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Perfect for white or reds!",
    "rating": "5.0 out of 5 stars",
    "content": "These glasses are large and soo nice looking. They look like an expensive house warming gift. I'll be repurchasing for other friends moving soon!",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are good glasses, clear, level, thin rimmed. The packing case is excellent: thick foam with six perfect glass shapes cut out. IMO they are a good shape for white wines rather than red. Just be mindful that they are tall and delicate, so they will challenge some dishwashers should you choose not to wash by hand.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Large glasses, great for a gift!",
    "rating": "4.0 out of 5 stars",
    "content": "These are nice glasses but not quite what I expected. They are not as thin as the description says. They are also small, more suited for white wine, not red, which is written on the box. I returned.",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased the OJA Red Wine Glasses and I am extremely pleased with my purchase. These premium crystal wine glasses are hand blown and making them perfect for both red and white wines. I specifically bought them for date nights and they have truly enhanced the experience. The quality and durability of these glasses are outstanding. The smoothness of the glass and the elegant thin rim give them a fancy and sophisticated look. I highly recommend these wine glasses not only for daily use but also as a unique gift for special occasions like weddings, anniversaries, or birthdays. They are truly a great addition to any wine lover's collection.",
    "post_time": "Reviewed in the United States on January 23, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Good glasses",
    "rating": "5.0 out of 5 stars",
    "content": "Ordered these and one arrived broken and another slightly chipped.  seller shipped another glass to me but it was also broken.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "they are beautiful glasses but they need to be packed  in a better way to survive shipping…",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Nice, but smaller than expected",
    "rating": "4.0 out of 5 stars",
    "content": "i was refunded so I am satisfied with that.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "update: they are sending two more glasses to me.  customer service is excellent!",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Matches experience cyrstal!",
    "rating": "5.0 out of 5 stars",
    "content": "Highly recommend these wine glasses. Bought to add to my expensive crystal red wine glasses of which several broke. Perfect, and guests could not tell difference.  A quality product which has good hand feel for both women and men. Packaged in excellent fashion to avoid damage. If U had option to give these glasses 10 stars, I would. Don’t hesitate to purchase.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "on time and nice",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Exactly what it was supposed to be",
    "rating": "5.0 out of 5 stars",
    "content": "Real ones know wine tastes better in a thin stemmed glass. Rarely do I have company over because I don’t like people but when I do they can’t shut about this glassware.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I was expecting a larger size but these work great.",
    "post_time": "Reviewed in the United States on June 29, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Thin Stem",
    "rating": "5.0 out of 5 stars",
    "content": "Durable and good value for the money",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love these wine glasses!",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Good size",
    "rating": "5.0 out of 5 stars",
    "content": "The quality is exceptional, and the design is both elegant and stylish, making them a perfect addition to any gathering. The customer service was top-notch, promptly addressing any concerns and ensuring a smooth experience.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Highly recommended!",
    "post_time": "Reviewed in the United States on June 9, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Good quality wine glasses for decent price",
    "rating": "5.0 out of 5 stars",
    "content": "I was so pleasantly surprised at the beauty of this wine glass!  Elegant, light, classy… and now my favorite set of wine glasses ever!  I use it even when I’m home with just the hubby.  It will not be one of those ‘ only use for company’ glasses.  Sincerely Trish",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These glasses are actually beautiful and sophisticated looking. They are surprisingly more durable than I anticipated. I have nothing bad to say about them besides I should've bought more. I plan on buying more of these glasses as gifts. On top of this, the seller went out of their way to ensure my package was received in great condition and offered any assistance if needed. I appreciate when sellers reach out to ensure satisfaction. Thank you! These glasses look amazing in my wine cabinet!",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Delicate",
    "rating": "4.0 out of 5 stars",
    "content": "I bought these after my other crystal glass broke. These are nice but inconsistent in thickness and stance as they're out of round. Not a deal breaker but I subtracted 1 star for that",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These glasses are very nice, elegant, a great value and were delivered, literally, within hours of being ordered (not just same day, but very shortly after the order was placed.) They were well packaged and well received by the friends we used them with that evening. Highly recommended.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Nice glasses, great value...",
    "rating": "5.0 out of 5 stars",
    "content": "Love these! Look great hanging on a bar cart.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "These are elegant glasses - in general, I do recommend them. But they are very thin and lightweight, and in my experience damage much more easily than other wine glasses I have had. The good news is that the sellers are very responsive and helpful in dealing with that issue.",
    "post_time": "Reviewed in the United States on March 10, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Elegant",
    "rating": "5.0 out of 5 stars",
    "content": "I appreciate the fact that they sent an email regarding the handling of the glasses while in transit. They assured me that if anything were to be damaged that they would take care of it. Good customer service is difficult to come by these days and I appreciated that level of care. Thank you!",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Ps, The wine glasses are wonderful and just what I ordered!",
    "post_time": "Reviewed in the United States on July 15, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Tasteful, but handle with care",
    "rating": "5.0 out of 5 stars",
    "content": "The design fits the aesthetic of my other wine glasses.  I also have a set of Bugandy glasses, which double as gin & tonic glasses, this set of red wine-size glasses which I also use for white wine, and a set for Port/Dessert wine.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Each of my sets is from a different manufacturer:  The Burgandy is Layla by Joy Jolt, while the red wine is by LUNA&MANTHA, plus this port/dessert set by Stolzle.  They are all similar in design and work well together, but are not exactly the same.",
    "post_time": "Reviewed in the United States on July 31, 2022",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Quality customer service!",
    "rating": "4.0 out of 5 stars",
    "content": "If you are looking for an exact match: Stolze is the way to go.  They offer a wide range: Burgandy, Red, White, and Dessert wine glasses in each of their designs.  However, out of all my sets, Stolze is the cloudiest.",
    "post_time": "Reviewed in the United States on December 28, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The clearest of my lead-free glasses is the Luna & Mantha.  L&M glasses also have the clearest bell sound.  To me, they are the best value.  L&M also seems to be the sturdiest, or at least just as sturdy as the Stolzle.  The problem with L&M is they don't offer the range Stolzle does.",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Great glasses",
    "rating": "4.0 out of 5 stars",
    "content": "The glasses were great. One came broken but got a replacement thanks to the seller. There were some imperfections on 2 of the glasses but overall they are great.",
    "post_time": "Reviewed in the United States on March 22, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought a set of two and one arrived broken then, the seller contacted me before I did and I explained them about the issue I had and they gave me a solution by sending me a new replacement right away. I like these wine glasses they look great and elegant! I recommend it.",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Excellent wine glasses and elegant!",
    "rating": "5.0 out of 5 stars",
    "content": "These are beautiful glasses I use for white or red wine and I always get complimented on them. Good looking and you cant beat the price for actual hand blown crystal. They are fragile so handle with care.",
    "post_time": "Reviewed in the United States on June 11, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These wine glasses are versatile. One can serve white, rose or red wine in them. The rims are of a thinness that allows you to appreciate the wine in an elegant shape. They offer great value for the price. I am pleased with them and use for both daily drinking and for special occasions",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "beautiful",
    "rating": "4.0 out of 5 stars",
    "content": "These glasses are very pretty and elegant.",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Like this glass everytime when I use it.  Thank you and I might order next time.  Wish I don’t break these soon.  ^^",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Elegant Simplicity",
    "rating": "4.0 out of 5 stars",
    "content": "I received my order the day after I placed it. I accidentally broke one the next day and a replacement was sent out immediately. Well worth it",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "They arrived in good condition. They are pretty nice quality. Do note though that these are smaller than your average red wine glass.",
    "post_time": "Reviewed in the United States on March 22, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verry nice glasses but thin and looks delicate",
    "rating": "5.0 out of 5 stars",
    "content": "Lovely… good  quality. However I thought they would be larger from photo",
    "post_time": "Reviewed in the United States on June 3, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "These glasses are just what we were looking for. They are tall, elegant, and do the job. All arrived the same day and intact. I appreciated that the packaging was well done to avoid breakage.",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Great glasses",
    "rating": "5.0 out of 5 stars",
    "content": "Quick delivery and all glasses were intact when they were delivered. They are just as described pretty good.👍🏻",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought these for my partner and she loves them. They are so light that they almost feel like plastic but you can totally make the lip sing like good crystal with a wet finger! (entertaining for the grandkids too)",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Simply beautiful",
    "rating": "5.0 out of 5 stars",
    "content": "I added my art to these for a custom ordered wedding gift. They were beautiful and packed nicely, I will def order them and the matching Champagne glasses again",
    "post_time": "Reviewed in the United States on June 5, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Made in China these glasses are more of a red / white hybrid. My wife and I agreed it’s more white wine glass than red. Decent glass for a red Zin or Chard but not a go to glass for bigger red Bordeaux or Rhône reds. The pictures do not convey the bowl being smaller than the stem and the measurements are not discreet in that regard. Focus on the 15 oz. size when making a decision to purchase. The glasses are packaged securely and would make a great gift. They washed up well and look nice.",
    "post_time": "Reviewed in the United States on September 14, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Elegant and modern",
    "rating": "4.0 out of 5 stars",
    "content": "Really happy with these glasses. Not quite as thin as a more expensive glass might be, but much thinner than any I have already. Nice long stem that keeps fingers off the bowl. Deep bowl that lets the aroma develop nicely.",
    "post_time": "Reviewed in the United States on November 30, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "For the price, I am very happy (although my year-old granddaughter has already broken one!).",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "White / Red hybrid glass",
    "rating": "4.0 out of 5 stars",
    "content": "I may try the champagne flutes next.",
    "post_time": "Reviewed in the United States on January 15, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This stem. Perfect.",
    "post_time": "Reviewed in the United States on January 4, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Great glasses for the price",
    "rating": "5.0 out of 5 stars",
    "content": "These glasses were good quality, but not a red wine glass.  They do, however make an excellent white wine glass. Customer service was amazing, quickly switching out the smaller glasses for larger ones.",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are great wine glass, light in the hand but very sturdy,  100 times better than glass.  Customer service is amazing. They asked if I would give the glasses a good look over and let them know if I found any issues. 3 of the 4 piece set were perfect. The 4th had a very tiny blemish. You wouldn't notice unless you were looking for it. I let them know and they immediately sent a replacement. This kind of customer service is hard to come by these days and I will be buying more of their wine glasses in the future.",
    "post_time": "Reviewed in the United States on November 29, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Quality glasses for price point & nice sellers",
    "rating": "5.0 out of 5 stars",
    "content": "Very happy with these glasses for their price. Durable while still looking good and being nice to drink from. Sellers were very kind to reach out and confirm they didn't break during freight.",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the shape of these wine glasses and the thin rim on them. I hand wash all my wine glasses because I do prefer the thin rim. They look great!",
    "post_time": "Reviewed in the United States on May 7, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Long stem and thin elegant glass.",
    "rating": "4.0 out of 5 stars",
    "content": "Cheaply made, way too “delicate” around the stem.",
    "post_time": "Reviewed in the United States on November 23, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Addendum:The company came back to me to see how they could make this right. I made some suggestions and they followed through with a nice set of glasses with a slightly sturdier base, a bit less “elegant”, but very nice indeed. Kudos to Jane from Luna & Martha!",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Breaks at the stem very easily",
    "rating": "5.0 out of 5 stars",
    "content": "My new favorite glasses!!!",
    "post_time": "Reviewed in the United States on November 23, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered a set of four of these crystal glasses some months ago and just ordered and received another set in time for a Thanksgiving family gathering. They are beautifully proportioned and look stunning with both red and white wines.",
    "post_time": "Reviewed in the United States on December 20, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Elegant!!",
    "rating": "3.0 out of 5 stars",
    "content": "I received an email from Luna & Mantha while the new set was in transit, instructing me to contact them immediately if any glasses were broken during the pre-TG holiday crush. But the set arrived on time, each glass fully surrounded by form-fitted foam, and the package was carefully handled by the Amazon driver.",
    "post_time": "Reviewed in the United States on June 30, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I will probably order another set before Christmas. I highly recommend Luna & Mantha crystal!",
    "post_time": "Reviewed in the United States on April 23, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Beautiful and hardy",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered two boxes of these wine glasses. We love them. They are very solid, thick glasses. The glasses were packed so securely. The glasses came securely packed in wine glass form fitting foam (?) casings, then an outer hard box & then in an amazon box. The glasses & packaging would make a beautiful gift for anyone. All eight of our glasses came in perfect shape. The seller immediately reached out prior to our delivery (through amazon) to let me know how to contact them immediately if the glasses arrived damaged. That is customer service! Job well done!",
    "post_time": "Reviewed in the United States on February 24, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I didn't care for how tall they were, otherwise beautiful glasses.",
    "post_time": "Reviewed in the United States on January 9, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "inconsitent quality",
    "rating": "3.0 out of 5 stars",
    "content": "I have two sets of the same from these people the first box was waaaay nicer than new ones",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "As expected! Also reached out to make sure they didn’t show up broken!",
    "post_time": "Reviewed in the United States on May 25, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Great!",
    "rating": "5.0 out of 5 stars",
    "content": "From the moment I purchased these wine glasses till the moment I received them, the seller was gracious enough to stay in contact with me to ensure that I received perfect wine glasses! For that I am grateful and will not hesitate to buy again from them…the glasses are truly beautiful along with the service that comes with it! Thank you!",
    "post_time": "Reviewed in the United States on February 25, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "perfect wine glasses. light weight and thin rims.",
    "post_time": "Reviewed in the United States on May 28, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Beautiful Glasses",
    "rating": "5.0 out of 5 stars",
    "content": "The shipping materials were great. Glasses are a very nice shape lending to use for red or white wine. A great value.",
    "post_time": "Reviewed in the United States on April 30, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These glasses are beautiful! When I reported an issue with one of them, a replacement was sent almost immediately. The company cares about its products and customer's happiness, which is not very common in today's world.",
    "post_time": "Reviewed in the United States on April 2, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "great customer service",
    "rating": "4.0 out of 5 stars",
    "content": "Quality glasses but...",
    "post_time": "Reviewed in the United States on October 4, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great stem and base.",
    "post_time": "Reviewed in the United States on February 14, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Excellent Value",
    "rating": "5.0 out of 5 stars",
    "content": "The overall size of the bowl is small.  If you already have some large bowl glasses you can go with these as your white wine options.  I'm sorry that I'm being over the top but a red glass should have a larger bowl.",
    "post_time": "Reviewed in the United States on October 17, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "yah raving about packaging.  is he a kook?  Maybe.",
    "post_time": "Reviewed in the United States on May 30, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Amazing Customer Service!",
    "rating": "5.0 out of 5 stars",
    "content": "Wow - these glasses are amazing quality. I just used them at my family Christmas party and everyone raved about their quality. I also wanted to commend the service I received from their company representative Jane. She helped me replace two glasses that arrived broken through no fault of their own. Amazing seller, easy to work with and customer focused. I would order these again simply based on my experience with Jane!",
    "post_time": "Reviewed in the United States on December 26, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Best wine glass I’ve ever found. Perfect for",
    "post_time": "Reviewed in the United States on April 26, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Best wine glass",
    "rating": "5.0 out of 5 stars",
    "content": "red and white. Durable but delicate and modern. Perfect!",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are so sleek. Love the slight shape on the end. Would look great with any table setting. Holds plenty of wine. Not too big and not too small of a size. Seem sturdy for sure not like some that are quite thin. Would buy more. Packaged well from the company as well.",
    "post_time": "Reviewed in the United States on May 12, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "🍷",
    "rating": "5.0 out of 5 stars",
    "content": "Perfect for a housewarming gift. Arrived quickly and in perfect condition.",
    "post_time": "Reviewed in the United States on April 10, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "These are very nice glasses and are our go-to when entertaining.  They have an elegant look to them that elevates every occasion.",
    "post_time": "Reviewed in the United States on December 10, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Great buy",
    "rating": "5.0 out of 5 stars",
    "content": "These wine glasses are so cute. I bought them just in time for the holidays. I can’t wait to use them.",
    "post_time": "Reviewed in the United States on December 3, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These are great wine glasses. They are shipped in a very heavy foam case. But what I liked best is the great service from OJA. They voluntarily contacted me thru Amazon to ensure I was highly satisfied and to check on the condition of the glasses. This was not an automatic big business email but rather the email of a concerned and caring owner.  I can’t wait to share these glasses with my family",
    "post_time": "Reviewed in the United States on April 29, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Classy",
    "rating": "5.0 out of 5 stars",
    "content": "Very pretty but smaller than expected. Seems to be good quality",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Beautiful wine glasses and the best customer service! I emailed about an issues and it was quickly resolved. They went above and beyond",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Beautiful, tall, elegant glasses",
    "rating": "5.0 out of 5 stars",
    "content": "These are gorgeous!! The shape and proportions are exactly as pictured, but they're even more elegant in person. Mine showed up safe and sound. I had bought another set of a different brand with a similar shape pictured and when they came they were short and not nearly as pretty. I'm very happy with this purchase!",
    "post_time": "Reviewed in the United States on January 30, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "One of the 4 glasses arrived broken. The seller messaged before they were delivered saying to contact them in case of any issues. I messaged them with a picture of the broken glass and they very quickly replied and are replacing the broken glass free of charge. The glasses are also",
    "post_time": "Reviewed in the United States on January 10, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Lovely glasses and great customer support",
    "rating": "5.0 out of 5 stars",
    "content": "Lovely and feel great in hand! Would recommend",
    "post_time": "Reviewed in the United States on October 5, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered these glasses for my new apartment and they were everything I was looking for! Very elegant and timeless. I also want to mention how wonderful the seller/customer service has been! They messaged me as soon as I placed my order making sure to let them know if the glasses came damaged at all or if I had any other concerns, they would make it right. Luckily, the glasses came PERFECT! Overall my experience was fantastic and I HIGHLY recommend these glasses to anyone considering buying them! :)",
    "post_time": "Reviewed in the United States on November 14, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Amazing product, and even better customer service!!!",
    "rating": "5.0 out of 5 stars",
    "content": "Gorgeous set of wine glasses! I chose this set because I wanted a glass shape that could be used for red or white wine and these are perfect. They are lightweight and easy to drink from.",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Update - Rinse in warm water only! I tried to hand wash and one shattered. The merchant was quick to ship me a replacement and send rinsing instructions and tips. Very happy with the customer service and product.",
    "post_time": "Reviewed in the United States on April 29, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Beautiful Glasses!",
    "rating": "5.0 out of 5 stars",
    "content": "Nice price for 4 crystal glasses. They arrived quickly and were very securely packaged, so nothing was damaged.  I'm shopping for more of these.",
    "post_time": "Reviewed in the United States on April 14, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love them. They are beautiful and affordable.",
    "post_time": "Reviewed in the United States on December 8, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Good Value",
    "rating": "5.0 out of 5 stars",
    "content": "The glasses arrived well packaged and protected with custom molded foam. The seller had warned me in advance that they had received reports of some glasses arriving broken. Some customers had a cloudy appearance on the glass . The cloudy appearance was possibly due to the foam protection used. Our glasses also had a slight film which washed off with no issues, intact.  Best of all, these glasses are lead free, which may affect the ring tone when toasting glass to glass.  These glasses have more of a duller tone compared to leaded crystal glasses we own.  The stem to bowl is seamless which is easy to hold. The tulip shape bowl is attractive and easy to drink from. Cheers!",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered these wine glasses for my daughter for Christmas (they were on her wish list).  I checked them to make sure they were okay and they were very well padded for packing and fine.  Lovely wine glasses and a nice shape and comfortable to hold.  I know she will love them.",
    "post_time": "Reviewed in the United States on January 14, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Narrow",
    "rating": "3.0 out of 5 stars",
    "content": "Nice glasses but my partner has a big nose and can't use them comfortably",
    "post_time": "Reviewed in the United States on May 13, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered these wine glasses and they were delivered really fast! And the seller was super nice about making sure the glasses weren’t broken when they were delivered! Best experience for the best wine glasses!🍷",
    "post_time": "Reviewed in the United States on February 1, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "The most gorgeous wine glasses!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered a pair of these beautiful wine glasses and one arrived cracked.  Jane reached out and immediately replaced the damaged glass.  I received the replacement within days and very happy with the service and the product. Highly recommend",
    "post_time": "Reviewed in the United States on January 25, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've always liked wine, but have just recently gotten into paying attention to what I'm tasting, how the wine transfers from the lip of the glass to the palate etc...",
    "post_time": "Reviewed in the United States on July 5, 2022",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Excellent customer service",
    "rating": "5.0 out of 5 stars",
    "content": "The hand blown glass with the thin lip really does make a world of a difference compared to machine-made glasses with a thicker lip.",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The glass itself is tall and does really well to give reds with high tannin room to breathe - most whites are gonna do fine in this glass as well..",
    "post_time": "Reviewed in the United States on February 1, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "To be handled with care - but GREAT for tasting",
    "rating": "5.0 out of 5 stars",
    "content": "I gave sturdiness a 4 star rating just for the fact that it really is EXTREMELY fragile to hold - lol definitely DO NOT throw it in the middle of a ton of plates and bowls on a rack to dry..",
    "post_time": "Reviewed in the United States on March 2, 2024",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Take care and store on an actual glassware rack or in a cupboard and it should hold up just fine :)",
    "post_time": "Reviewed in the United States on November 30, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Amazing!",
    "rating": "5.0 out of 5 stars",
    "content": "I was looking for a good set of wine glasses for a while. I’m so glad I chose these ones, they feel elegant & are great quality. I love not only drinking my wine in these glasses, but my mocktails as well. Definitely recommend!",
    "post_time": "Reviewed in the United States on November 25, 2023",
    "pid": "B0CTQMQ11T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Glass is a little thicker than I would prefer, which makes them feel a little cheap. They are also smaller than I thought they would be. Overall not bad for the price since I did get them on sale but I'm not super impressed, probably wouldn't buy again.",
    "post_time": "Reviewed in the United States on July 30, 2023",
    "pid": "B0CTQMQ11T"
}
]