[
{
    "name": "        Women Oversized Striped Color Block Long Sleeve Crew Neck Sweatshirt Casual Loose Pullover Y2K Shirt Top       ",
    "stars": [
        "68%",
        "16%",
        "7%",
        "5%",
        "5%"
    ],
    "pid": "B0CZ6TQ79M",
    "ratings": "1,063 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Just ok.",
    "rating": "4.0 out of 5 stars",
    "content": "I had to laugh the second I put this on my husband said I looked like a piece of fruit stripe gum. I will admit it was cuter in the picture. I plan to keep it but may just use it to lounge around the house. Oversized fit for sure.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have two free people ones and I like this one better ! Buy it",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Love this!",
    "rating": "3.0 out of 5 stars",
    "content": "The shirt is exactly as pictured, which I appreciate. Visually it is very close to the FP top, but the quality and structure isn’t even in the same ballpark (I have both this and the Free People one). This one is heavier, doesn’t drape effortlessly, isn’t super soft, and the bottom is more cinched (even with it being oversized). If you’re looking to get this purely as a dupe, this is fine enough but couldn’t pass as the “real thing”. Obviously the prices between the original and this are vastly different, but if you really love this style and can swing the FP price tag, I’d 100% recommend the original. If you’re just looking for an oversized long-sleeve, and like the stripes/colors, then this is a good top.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love my sweatshirt, but I put in on low in the dryer and the oversize fit went away after I dried it. I wished I had just line dried. The sleeves and overall length shrunk. I still wear it, but if I get it in another color I will not machine dry.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Decent top but wouldn’t call it it an exact dupe",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent quality and material.  I have bought others and the material is polyester... This is not.  This is exactly like the free people without the hefty price tag.  This is a must have!!!",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great quirky perfect fit!",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Cute! but shrank after first wash",
    "rating": "5.0 out of 5 stars",
    "content": "This shirt is adorable, soft, and of good quality. Can't be beat for the price for sure.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Obsessed with this striped shirt, it is not super thick so I wore it in the heat of the summer and will layer for winter and fall",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Free People Dupe",
    "rating": "4.0 out of 5 stars",
    "content": "Absolutely adorable and vibrant; I get compliments everytime I wear it!",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love the colors and very comfy but should have gone bigger.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "So comfy",
    "rating": "5.0 out of 5 stars",
    "content": "This sweatshirt is so soft and comfy, I’ve gotten so many compliments and the colors are even better in person",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Loved the color, the fabric was good and it was super cute on. I bought my regular size and it was a baggy fit just like I wanted.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Really cute",
    "rating": "4.0 out of 5 stars",
    "content": "I loved this product so much when I first got it, but after drying it once the sleeves shrunk and now hit me 3/4 down my arms. The color matches the pictures perfectly and it is very comfortable. If you get this just don’t put it in the dryer!",
    "post_time": "Reviewed in the United States on June 4, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It's good quality and very comfortable. It looks a little like it is hand made, though well done! I like that it is similar to the Free People shirt!",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Shrinks quite a bit after washing",
    "rating": "4.0 out of 5 stars",
    "content": "This top is so cute and comfy! The sleeves were a little too short to mmm for me but that’s okay!",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I do like the sweatshirt but I came on here to leave a review regarding size . I read in a few reviews this was true to size and that’s absolutely not true. I would say it’s at least two sizes oversized, so take that into account when ordering.",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Super Cute and Comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "The color and fit of these are just as advertised. I think they’re a little expensive for the type of material it was. I thought it would be a more smooth cotton, but it’s not. It’s actually one of those cheaper type of fabrics. Everyone will know what I’m talking about, but the color does look like advertised and fit is slouchy ( nice ) but the fabric is awful ( why can’t they get real cotton clothes like we used to but not all these cheap fabrics - what’s happened- the fabric quality is horrible- as is everything since Covid ( pay more and get less",
    "post_time": "Reviewed in the United States on June 25, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this oversized pullover. Perfect FreePeople dupe for a fraction of the price. I’m 5’3 170lbs and the medium fit baggy!",
    "post_time": "Reviewed in the United States on August 17, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Super cute! Sleeves are a little short",
    "rating": "5.0 out of 5 stars",
    "content": "Soooo comfortable and definitely worth the money! I got size XL.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Exactly as expected. Oversized easy cotton summer stripes.  So beachy.  Bought two.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Surprisingly great quality - very comfy",
    "rating": "5.0 out of 5 stars",
    "content": "I’m 5’3 160 and the medium fit perfectly oversized without swallowing me. Perfect FP dupe. Washed on a delicate cycle and did a low heat tumble dry and looks great. Very happy with how it turned out. I thinking about another color.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have ordered 3 of these in different colors!",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Great!",
    "rating": "5.0 out of 5 stars",
    "content": "Such a cute, comfy and stylish sweatshirt. Actual free people dupe as well….for a fraction of the price! Great quality and value for the money! Not sure about shrinkage just yet as I haven’t washed it but I may air dry to just be safe. Highly recommend!",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Absolutely love this shirt! It is so comfy, stretchy material. Great quality and after several washes, it's still perfect. I will say it is definitely oversized. I'm a solid large/xl because of my chest and I ordered a large. It is very big on me, but I'm not mad at it! If you want a smaller fit, size down.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Love love love",
    "rating": "5.0 out of 5 stars",
    "content": "I get so many compliments on this top! A competitor has this top listed close to $100 and this is equally has nice in terms of value and quality. I’ve worn it casually as a lounge top and paired with jeans and worn it out, safe to say it’s a versatile top.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very cute.  Thinner material.  I sized up to a large for an oversized fit.  I would normally wear a M in sweatshirts but like them oversized.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "New FAVORITE!",
    "rating": "5.0 out of 5 stars",
    "content": "I have been seeing this shirt all over social media and decided I had to have it.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It is perfectly oversized and super comfortable. It washed up great. You never know if something will shrink or not and this didn't shrink at all.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "My favorite shirt!",
    "rating": "5.0 out of 5 stars",
    "content": "Great purchase!",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I got the light blue with yellow trim",
    "post_time": "Reviewed in the United States on May 14, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Comfy",
    "rating": "5.0 out of 5 stars",
    "content": "Nice quality, comfortable, I bought a size larger because I wanted to wear it baggy.",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "nice and comfy and it is good quality!  I highly recommend!",
    "post_time": "Reviewed in the United States on August 15, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "exactly as described",
    "rating": "4.0 out of 5 stars",
    "content": "Absolutely love the shirt but I washed it on cold and tumble dried on low and it shrunk. I bought it a size bigger to get the oversized look but now it just fits like a regular shirt. I liked the oversized look better. So bummed.",
    "post_time": "Reviewed in the United States on May 8, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is really cute, very good quality and true to size. Will be buying more. Great for a gift also.",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Do not tumble dry!!!",
    "rating": "5.0 out of 5 stars",
    "content": "Love it! Oversize fit yet still looks classy! Comfy material and for this price, you can’t go wrong.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The sweater is wonderful and the material is so soft. It runs big so depending on how you like to wear sweaters you could go down a size. If you like them oversized, go for your normal size. The colors are pretty and it fits well.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Super cute, good quality",
    "rating": "4.0 out of 5 stars",
    "content": "A little thinner than I was expecting but still works! Be careful because it will shrink in the dryer but still super cute.",
    "post_time": "Reviewed in the United States on May 26, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is so cute & comfy! However, I feel like I have short to regular length arms/torso and it barely comes to my wrists/waist. My hair ties and bracelets stick out perfect for me- but if you have longer arms or torso, size up at least 1 size. I run between a medium and a large. I do tend to like my clothes looser than tighter so I went w a large and it fits perfect for my petite body. SUCH FUN VIBRANT COLORS. the one (pleasant but strange) thing I am sketched out is that is has the best perfume scent on it!? so strange but delightful lol.. would absolutely buy again.",
    "post_time": "Reviewed in the United States on May 29, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Awesome",
    "rating": "3.0 out of 5 stars",
    "content": "The design and colors combination is really cute and stylish. However the inside material came out of dryer really rough and scratchy. If only the inside was made from the same weave as the outside. I seem to be in the minority for not thinking shirt is soft. Returning. It would drive , e crazy and I would never reach for thins in my closet. Bummed.",
    "post_time": "Reviewed in the United States on August 6, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love everything about this shirt and have it in multiple colors. I actually sized down bc it is oversized and it’s so comfy and a terry material. Big fan and will order more…much better than the OG!",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Love the many color choices!!",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great throw on casual top with interesting contrast at the top, hem, and cuffs. It isn't too heavy or hot, but oh so comfortable for a cool evening in the Summer. There are so many choices in colors and I will probably order another for Fall.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved this so much!  Very cute. Good quality.  It runs oversized so don’t size up!",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Free people vibe",
    "rating": "4.0 out of 5 stars",
    "content": "This is a cute oversize sweatshirt. The colors are vibrant and it’s very comfortable.",
    "post_time": "Reviewed in the United States on May 17, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great SS. Washes great, no pilling or shrinking. Check all listings  there’s a huge gap in pricing between manufacturers.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Adorable",
    "rating": "5.0 out of 5 stars",
    "content": "It is definitely oversized, so order what you normally would. I’m between a small/medium in tops, and I ordered a small. If they offered an XS I could even do that. It is SO comfy, and warm, but not super warm. I love it!",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This sweatshirt is a fun dupe. It's very thin so it's not a soft thick luxurious sweatshirt. It's more of a terry cloth feel like you would wear for a breezy beach night.",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Love love love",
    "rating": "4.0 out of 5 stars",
    "content": "The sweatshirt is soft and so comfy! It looks just like the free people one but for like a third of the price! The only reason I gave it 4/5 stars is because the pink stripe was a lot more vibrant in real life than the pic. It’s my fav new sweatshirt!",
    "post_time": "Reviewed in the United States on March 30, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Nice color combine but I don’t feel this was oversized ran small to me. Did return",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "So soft and cozy!",
    "rating": "3.0 out of 5 stars",
    "content": "Material and quality is good, giving it a three stars because it shrank and now it’s no longer oversized.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great Free People dupe! The fit is loose and comfortable. Not a thick sweatshirt but super cute and comfortable! Get value",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Pretty good dupe",
    "rating": "4.0 out of 5 stars",
    "content": "Cute free people dupe, I don’t have the FP version but this is probably not as good, quality-wise (obv); however for the price, not bad! It’s not as oversized as it is on the model, I would size up if you are looking for that look, however it is roomy and fun!",
    "post_time": "Reviewed in the United States on April 16, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Love this top but highly recommend air drying it. I washed cold and dried on low and it really shrank the very first time I washed it. I can still wear it but preferred the longer length in torso and sleeves pre-wash.",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Love this top but do not dry!",
    "rating": "4.0 out of 5 stars",
    "content": "Obviously I knew this was a risk, but when I saw it on other people I thought I might have a little more wiggle room however, I got an XL and I just wish it was more oversized as it is supposed to be. So for my bigger girls keep in mind it is not oversized as you think! Still super cute and soft but I will air drying this!!!!",
    "post_time": "Reviewed in the United States on March 23, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Really bright colors doesn’t look good. Is comfortable but much brighter then I thought",
    "post_time": "Reviewed in the United States on May 24, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Love the Look…Wish it was Oversized",
    "rating": "4.0 out of 5 stars",
    "content": "The color isn't spot on but it's a great dupe. The FP item was soooo large, this one fits much better. Nice and light for spring and summer. Will definitely buy another color!",
    "post_time": "Reviewed in the United States on April 24, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "The perfect spring top. Love the oversized",
    "post_time": "Reviewed in the United States on May 27, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Super comfortable fits to size, but colors are way too bright",
    "rating": "5.0 out of 5 stars",
    "content": "I wear these with a tattered jean and white converse kicks! Easy outfit and always get asked where I got the sweater! Also it’s very comfortable!",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "would repurchase is other colors, the material is very light so i would consider this a good summer sweater for late summer nights. washes pretty good, does not stretch nor shrink. i got a size large but could've ordered a medium and it would of still been oversized for me. i am 5'2 and weight 150 for anyone who is looking to compare sizes.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Fits better than the FP original",
    "rating": "5.0 out of 5 stars",
    "content": "I can’t get enough of this sweater! The sweater is very similar to the original, the only caveat is that it’s not as high of quality - but after all it is a dupe for a fraction of the price. The material is soft made from mostly cotton so it’s comfortable to wear. It holds up nicely in the wash - I suggest tap cold and laying flat to dry to ensure longevity.",
    "post_time": "Reviewed in the United States on April 3, 2024",
    "pid": "B0CZ6TQ79M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I own the original Free People sweater in red and blue in a size XS. I ordered this item in a Medium for a slightly more oversized look. The sweater RUNS BIG!!!!!!!!!! I suggest sizing down 1 size from what you usually wear. I’m 5’6”, 130lbs, and typically wear a size Small. I ordered a medium so it would be baggy, but I wish I had sized down for a better fit.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0CZ6TQ79M"
}
]