[
{
    "name": "        TIRTIR Mask Fit Red Cushion Foundation | Full coverage, Weighless, Skin fit, Satin Glow Finish, Korean cushion foundation (#15C Fair Porcelain, 0.63 Fl Oz (Pack of 1))       ",
    "stars": [
        "57%",
        "16%",
        "11%",
        "6%",
        "11%"
    ],
    "pid": "B0D2L1YLNR",
    "ratings": "19,111 ratings",
    "other_info": {
        "Item Form": "Cushion",
        "Color": "15C Fair Porcelain",
        "Skin Type": "All",
        "Finish Type": "Satin Glow",
        "Recommended Uses For Product": "Base Makeup"
    },
    "discount_price": "$ 25.",
    "normal_price": "$39.68",
    "about_this_item": [
        " [1st KOREAN CUSHION FOUNDATION with 40 SHADE RANGE] TIRTIR Mask Fit Red Cushion is the first Korean cushion foundation with a wide range of shades. From light to deep tones, TIRTIR cushion foundation Korea product provides strong, comfortable coverage filled with nutrients for a flawless, all-day wear. Achieve the perfect \"glass skin\" look with this innovative Korean makeup solution.  ",
        " [SKIN-FIT COVERAGE with SATIN GLOW] This Korean foundation makeup offers medium to full coverage that feels weightless on the skin. With high, breathable coverage and a satin glow finish, it ensures a naturally beautiful and radiant look. Experience the ultimate in Korean makeup cushion foundation performance with a flawless finish that lasts all day.  ",
        " [72 HOUR LONG-LASTING & WEIGHLESS] Experience the foundation makeup that feels super thin like water with a lightweight, non-greasy formula. The TIRTIR cushion’s 72-hour lasting power ensures enduring wear, proving that a little goes a long way. Perfect for K-beauty enthusiasts looking for a reliable base TIRTIR.  ",
        " [NOURISHING ELASTICITY] Infused with hibiscus and red propolis extracts, our formula enhances skin elasticity, providing a lasting finish that radiates a satin glow. Enjoy makeup that not only lasts but also highlights your glass skin beauty all day long.  ",
        " [EASY, QUICK APPICATION] Goes on easily and sets quickly, providing a smooth, flawless finish. It can be applied lightly for a natural look, embodying the best in Korean cushion innovation for ease and efficiency in your daily makeup routine.  "
    ]
},
{
    "title": "THE BEST!!!!!",
    "rating": "5.0 out of 5 stars",
    "content": "OMG! I cannot believe how amazing this foundation is! I tried the pink one as well by Tir Tir. Please do not listen to the bad comments, run and buy it and test it yourself! I honestly did not order this sooner because of the bad reviews but decided to give it a try. I have tried from the most expensive foundations and nothing compares to this one! I had people stop me and ask me what I was wearing. It’s been a few years that I have not liked the way my foundation looks like, as you age, everything settles into your fine lines. I love the fact that it’s all in one simple compact and easy to travel with. I no longer need a brush nor a beauty blender. Also, this foundation does not need primer nor setting spray! All you need is to apply powder to set the foundation. My skin looks flawless, like I have no makeup, full coverage but not cakey, it’s super thin like water and covers every little spot. I feel I have a filter. For reference I use the Origins nights ins as a moisturizer and then apply the Tir Tir followed by Chanel powder. My face looks amazing and I will forever wear this, I hope they never discontinue this. I also go the pink one, it is more matte but settles the same, the red one gives it a matte radiance finish while the pink is matte with no radiance but settle exactly the same.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love this product, but I would recommend buying it off of a different site. I was sent the wrong shade twice and one that was used. They won't give me refunds unless I do the leg work to bring it 20 miles to UPS to return it !!! Trying to order this has been a nightmare and Amazon customer service has been terrible . Being a prime member is just not worth it anymore . Amazon used to be great about making things right that they messed up, but now they just push it all on the customer - what a joke !!!!",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "The product is great - but Amazon isn't !!!",
    "rating": "4.0 out of 5 stars",
    "content": "I like the packaging. The coverage is full upon first application. No need for 2 layers. A little bit goes a long way. Wore nicely under powder and only my T zone became oily after hours of wear (I have oily skin). I am very pleasantly surprised at this foundation's performance. I think it will work for all types of skin. The shade range for richer complexions is not the greatest, though.",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Female in her mid 20s here and let me tell you how much I love this foundation. I saw the hype on tik Tok and decided to try a sample of this stuff just to find my shade. I ended up buying the full product and I was so surprised by just how good it is. I naturally have oily skin around my nose and forehead area while the rest of my face is a bit dry so finding a foundation that can tackle both of those issues is difficult. I also have acne (just PCOS things) and hyperpigmentation which is worth mentioning because this stuff covers almost all of it! Before my routine would be me applying concealer over my acne and then go over it with foundation, but I don't need to do that anymore. This foundation manages to cover the the majority, all while still feeling lightweight on my face. Not to mention that I use a small amount of this product.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Surprisingly good",
    "rating": "4.0 out of 5 stars",
    "content": "Another big issue I used to have was the fact that my face would be so oily within a few hours but I noticed that I can pretty much go the whole day without retouching as much as I used to.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Overall, this foundation is lightweight yet it covers very well and the packaging is so nice with the pad being able to be tucked away inside. Will definitely be buying this again and again!",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "My new holy grail!",
    "rating": "4.0 out of 5 stars",
    "content": "The only issue i have with this product is it make my oily skin worse. No matter what setting powered i used the oil from this makeup didn’t work.  For the price you can’t beat it. Love the sponge it comes with.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This product isn’t amazing but it isn’t terrible. Other ppl say it oxidizes a lot and makes the orange but it didn’t happen for me. The color match is pretty good. The coverage isn’t good though, it’s more of a light-medium coverage for me. Doesn’t cover scars, bumps, acne. However it doesn’t look cakey which is good.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "product goes in smooth and the finish is beautiful.",
    "rating": "5.0 out of 5 stars",
    "content": "First of all, I loath foundation make-up. Not dislike or even hate... I loath it. It always feels like my skin is being suffocated under a centimeter of mud or clay. Not so with this product. My skin can still breathe and it doesn't feel like I'm wearing anything on it. Sadly, the lightest shade currently offered is just a bit too dark for me. I'm hoping the 10 range is available soon.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "NOTE: I did notice a bit of a perfume-y scent but it wasn't unpleasant and didn't trigger an allergic reaction.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "This foundation is not a miracle, but..",
    "rating": "5.0 out of 5 stars",
    "content": "It IS quite pretty. I’m quite fair (zero sun exposure for years) and I’m still searching for my shade, having started with vanilla, too pale, moving to soft beige, too dark and settled at cool ivory.  They’ve been out of the light sample packs so my usual bouncing around. Did not attempt to return as I can mix what I’ve bought to get to a decent shade. It feels very good on the skin even though I tend to build it up a bit. This foundation is also good for minimal settling into marionette  lines, not so much pore minimizing. I will say. You’ll need a primer if you have noticeable pore issues. All in all, I’d say it’s quite good.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I NEVER write reviews but I was heavily influenced by the tiktok girls and I am equally as stunned. This foundation is such a beautiful match it just gives the illusion I have clear skin. I got several compliments that I was glowing! It applies like a dream even in the small size! The tiny package is so cute! I love the little pad but I may definitely need the bigger size because this foundation is so LIGHTWEIGHT I want to wear it every.day. 10/10 on the new shades!!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "ITS GIVING SKIN",
    "rating": "4.0 out of 5 stars",
    "content": "First off: I have combo skin and lean way more toward the dry side. I have hyperpigmentation and acne scarring.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This foundation oxidizes like crazy!!! Soooo that being said, if you think the color is your right color, go one down. I’ve tried 3 different shades before I found the one that works best for me.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Overhyped but worth a shot",
    "rating": "4.0 out of 5 stars",
    "content": "I initially bought this for the “smudge proof” it claims. We had a concert recently and it did not withstand the sweat and the tears and we were at the concert for only 4 hours. I even brought my fans (yes plural lol)",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I also don’t recommend the applicator if you’re trying to go for more of a buildable “natural” coverage. If you’re wanting that full coverage glam, by all means; the applicator is where it’s at. However, highly suggest exploring your options with different brushes and sponges.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Cushion Converted",
    "rating": "5.0 out of 5 stars",
    "content": "Nothing but nice things here. I really like the coverage, the finish, the way it holds up for a long period of time, the less amount of smudging, etc. I just only wish the shade range was true to color initially. (Color used: 27N Camel)",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love this foundation. It’s full coverage and slightly dewy. I have always struggled with finding a shade with a neutral undertone so I first bought sample swatches before buying a full size. My makeup looks flawless all day with this and I barely use much foundation. I did not notice much oxidizing either. I think that the sponge should be smaller, so I may purchase the mini cushion.  My shade is 24N and I use the Kosas concealer in 5.50 as my all over concealer shade.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Great idea",
    "rating": "4.0 out of 5 stars",
    "content": "I love the fact that I could test a few shades without having to order the full size product. This is much lass wasteful. I did end up finding my shade and ordered the full size product.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I wear mineral sunscreen for my face so need a bit of cover and I am dry skin. So this works well with light coverage but if you want full coverage, I\"ve seen some say the zinc in the foundation shows up too much.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "So far it’s good, not amazing but good",
    "rating": "4.0 out of 5 stars",
    "content": "It’s a good product but nothing phenomenal as many make-up influencers state. I recommend it for on the go as the sponge applicant is convenient. I will update my review if for some reason this turns out to be amazing as the claims are.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I struggle to find foundations that do not sink into my pores or wrinkles. I am so in love with this product.  I moisturize my skin then use the Nyx hydrating/plumping primer. I wait five minutes and then apply the product using the pad it comes with. I do admit I often use my fingers in hard to manage areas.  Since I started using this product, I do not even need to use under eye coverage, I just use the foundation.  I am falling in love with this product line.  the hardest thing is to find your skin color, I brought several of the smaller kits to try.  Will definitely be reordering and trying some of their other products as well!",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Best makeup that I have found for a 62 year old",
    "rating": "4.0 out of 5 stars",
    "content": "I found that I liked the color match. It didn’t oxidize and turn orange like cheap makeup. As far as stay power it’s a good medium. I found it settling into fine lines about an hour in but that not unusual for me. It’s a true matte. Overall not a bad product but I won’t be investing in a bigger size",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "If you wear foundations ONE SIZE color M3, NARS Stromboli, Makeup forever 2N26 and the original MAC formula NC42 and Estée Lauder 3w1 please consider 29N &28N for me now during summer 29N is perfect and 28N I’m looking forward to using it during winter time as it’s my literal color. Also if considering i ordered 21N to use as a concealer and it’s perfect for me. Hope this was helpful as I had a hard time picking a color and using reviews for reference. I would say that if you are very yellow undertone then 27n would be a best fit as I really don’t like it",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Decent product for the price",
    "rating": "4.0 out of 5 stars",
    "content": "I really liked this. I’ll probably order a few different shades to perfectly cover match. Coverage is great, and easily blends!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Great compact size for on the go in your purse or for trying it out before committing to the bigger size. The applicator makes it a little hard to apply due to its size but it’s still doable and works.",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Get it ,hope this helps",
    "rating": "5.0 out of 5 stars",
    "content": "My sister had this and when I tried it I knew I had to have it. I know it is a foundation but I used it on top of my blush and I feel like it gives me such a nice glow.  I think it will be a great smooth base coat with great coverage.  I am pretty sensitive to new products but had no issues with this.  Love it!",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "It has a great coverage but I think I got a wrong shade. I hope I can replace it still.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Good Choice",
    "rating": "5.0 out of 5 stars",
    "content": "***Update*** This great company reached out to me and offered a full refund for the damaged product and an apology for the issue. That is how you keep customers coming back! I have ordered many wonderful Tirtir skincare and makeup products in the past and will continue to do so without worry in the future! They take pride in their products and customers. THANK YOU TIRTIR!!",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": " I should have listened to previous reviews that claimed to receive open and used compacts. It was obvious that the packaging was open when I opened the shipping box. This is very disappointing since I have wanted to try this foundation for so long.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Too yellowish and creates cakey texture around mouth",
    "rating": "4.0 out of 5 stars",
    "content": "I tried this product because of a lot of good reviews. The color is too yellowish though I am a east Asian. Also my skin around mouth is cakey, though I don't have dry skin. The coverage is very good but I look like I have a full heavy makeup. The best part of this product is that the heavy coverage stays more than 12 hours. Maybe I should try a cool and lighter tone and give the product another chance.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "This is my first time using a cushion type foundation. I stopped wearing foundation because I couldn’t find the right one for my 48 year old skin and I could never find the right color match. I have peach fuzz facial hair and also texture near my chin area/mouth so foundation would never settle in properly.  So far I like Tirtir. Amazon was out of the sample sizes so I bought a travel size. I had no idea what color to get so I took a chance on 15C since I heard from others this product oxidizes so I went a shade lighter than what I thought I would be. I  selected correctly.  It matches my skin perfectly so I was lucky with my choice.  I’m happy about the travel size for my trips but for everyday use the applicator pad is pretty small.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Still testing it",
    "rating": "4.0 out of 5 stars",
    "content": "I haven’t tried this product with my heavier sunscreen so this review is based on just a skin prep with a Cerave moisturizer.",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Giving this a 4 star rating because they put a scent in it which reminds me of old fashioned perfume so it’s a little too floral for me.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "In Love",
    "rating": "4.0 out of 5 stars",
    "content": "I was skeptical about trying this product and getting my shade correctly so when I finally received and tried this item— I was so shocked! the hype is real. The shade was perfect, the application was flawless and it lasted me all day.",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I put it on around 11 am, did errands, and living in hawaii it is hot and humid this time around. I was sweating and usually on my upper lip and around the nose my make up tends to cake up or sweat off— but with this one… it did not! it stayed in place! after my errands I took a nap and got up around 6 pm and it was still flawless like I  just put it on.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Long lasting and full coverage",
    "rating": "5.0 out of 5 stars",
    "content": "a little goes a long way! definitely worth the buy!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This cushion is in general a very good cushion. Full coverage finish and very long lasting. However, the glow kind of went away after a couple of hours, and also, it oxidizes after awhile, so the color isn't that great anymore by the afternoon. It is also kind of dry compared to other cushions that I have used over the years. It's a good cushion, but I don't think I will purchase it again.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Glad I watched influencer’s reviews",
    "rating": "5.0 out of 5 stars",
    "content": "Use just a little at a time and tap it into your skin until you achieve the desired coverage.  It easy to blend, looks lovely but also easy to use too much.  I had a hard time selecting a shade.  Many reviews said it was lighter in color than expected, so I went up a shade.  Good thing I did, as it is still too light for me, but will be perfect in the winter.  They claim it is 72 hour wear.  I can’t imagine why anything needs that kind of wear time, but decided to not wash my face one night to see how it looked in the morning.  Let me just say…always wash your face before going to bed.  You’ll look much better the next day!",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I bought 2 of these travel size foundations in different shades to try and make my best match before purchasing a larger one and let me tell you, there ain't a whole lot in these. I used each one once and they're already almost completely gone! I was disappointed because I really wanted to try them out at least a few times to make sure I was going to like it first. That being said, the product itself did not disappoint! I have a moderate case of melasma so I've been on the hunt for ages for a full coverage foundation that will really cover everything. This one is really buildable so I can cover almost all of my dark spots without even using concealer. Hopefully when I buy the larger size it will last much longer than these did.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Full coverage but some issues",
    "rating": "4.0 out of 5 stars",
    "content": "Very light and good coverage. Latte is perfect color - I’m usually natural beige for most foundations (green undertone). However, I found it difficult to apply (need blender sponge to blend) and does become patchy end of day.",
    "post_time": "Reviewed in the United States on September 12, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve tried so many foundations. NARS, Makeup Forever, Clinique, Milk, Marc Jacobs…this is the BEST foundation hands down. I have super dry skin and texture and it doesn’t cling to my flakiness and makes my skin look so healthy. A little goes SUCH a long way. I’ve been searching for a decent foundation for awhile and I’m so happy I have found this. The shade match for me was perfect, but I suggest you buy the minis then trying to find your match.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Wowza.",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve sent this to my mom and besties so they can buy it too because I’m in LOVE.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Honestly, was a little skeptical that I’d find a shade that fits me—but the 29N was a great match. It helped that I got the trial kit to figure out my shade, and the coverage is good with the help of color correcting. I managed to hide dark marks that got left behind from pimples, and it stayed on the whole day without any touch ups.",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Probably the best cushion foundation I ever owned",
    "rating": "4.0 out of 5 stars",
    "content": "I needed makeup that matches and fits in the car it lives in: TIRTIR mini. I did my research, made a spreadsheet on how to find your shade with pictures and photoshop. I had it down to one shade before I ordered. In that time it became very popular and sold out of every color except one that was close to my shade. It arrived, unopened and was close-ish. It was giving uncanny valley vibes. Every thing else is good or great, size is perfect, color of the compact it self matches my car exactly, it doesn’t smell weird, coverage was ok. it bunched up in creases I didn’t know I had, could be a little cakey and felt suffocating/heavy depending on application but otherwise it was good.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Covered up all imperfections and was light on my face. Also no irritation or hard to remove.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Good luck finding your shade",
    "rating": "4.0 out of 5 stars",
    "content": "So I originally Brought the shade I believe fudge, and it Was too dark for me like the application was beautiful, but was too dark and then I end up getting deep cocoa, and it was too light 😭 I even tried blending the two shades together and it helped a little bit, but I’ll just have to add a little less or a little more of which everyone whenever I try to do a blend test again because I really want this to work. I really hope in a future they extend their shades for deep/ darker complexions because the formula in this foundation is top tier!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Also tip: For best results for application try going to a dermatologist or Sephora to figure out your skin type and what type of makeup based products can you use because not all of them work for all skin types. make sure the ingredients in each product is correct for your skin❤️",
    "post_time": "Reviewed in the United States on July 15, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Great",
    "rating": "4.0 out of 5 stars",
    "content": "Like the coverage, color and longevity, but not the stickiness. Will buy again!  Worth the money",
    "post_time": "Reviewed in the United States on July 1, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I like that I could try samples to find a shade and a travel size to try it out. The foundation is very pretty and I am enjoying it. However, their shade range is not as good as others on the market currently. I think the two most important things in a foundation is shade and formula. The formula in this one is really lovely, the shade is not what I prefer. I had to go with shade 23 N, that's the only neutral shade that was closest to my skin tone, this shade is very very warm leaning and makes me look more warmer than neutral. There is no 21N or 22N either. I can sometimes wear cool olive tones too, but they don't have anything olive either. I know they expanded the shade range recently, I hope they are reading reviews and hopefully they will expand the shade range further to include more shades that are perfect for me :)",
    "post_time": "Reviewed in the United States on August 10, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Great coverage!",
    "rating": "5.0 out of 5 stars",
    "content": "I was pleasantly surprised with the coverage of this product. A little goes a long way! I have a scar on my cheek and as you can see, it's concealed nicely! The 43N color is a good match and the texture isn't too thick. I also used a beauty blender as I didn't care for the sponge applicator it came with. I have to order a large one now! 😁",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I love this foundation so much but the sponge it comes with doesn’t last long enough. Mine started pilling onto my face. It left black specks all over my face after just 2-3 weeks of using this product 5 times a week. I wish you could buy replacement sponges! I used an off brand beauty blender after the sponge needed discarded and that works well but I think it wastes the product more.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "I LOVE THIS but…",
    "rating": "5.0 out of 5 stars",
    "content": "Wow and wow! If you are on the fence about purchasing this foundation, run, don't walk to get yours. This is the easiest way to apply foundation. No brush needed. Comes with a sponge applicator. It covers redness with just one swipe. If more coverage is needed, you can build on it. I am ecstatic. My face looks airbrushed. It's no surprise that this is the number one best selling foundation in Japan. Get yours today!!! I have purchased three in different shades. This is to coordinate the shade with the season. Lighter for winter months..a bit darker for summer months.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I LOVE this product!!!",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Flawless complexion",
    "rating": "5.0 out of 5 stars",
    "content": "I was skeptical at first, but you barely need to put anything on that sponge. You could even tap some off and put that under your eyes and instantly it covers your under eyes circles. I’m getting now to wear I don’t want  make up routine. Guys, this is it this is it basically this is all you need. If you really want it just to keep it simple just a little bit of this some eyeliner mascara flush and you’re good to go. You’re not gonna regret it. I promise it’s very light on your skin it doesn’t feel like you’re wearing anything",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I highly recommend buying the trial kits to find your shade. In every brand I have a warm/golden undertone so I purchased the 24W but it was way too light and way too yellow. For reference YSL Nu Bare Skin shade no.8 is a perfect match for me. I bought the trial kits and ended up with 30N, which I would not have picked since I’ve never been a neutral undertone in any brand had it not been for the trial kits.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Great product",
    "rating": "4.0 out of 5 stars",
    "content": "There’s a bit of a learning curve, you have to be very lighthanded with the cushion, and it’s a must to press out any excess onto the plastic inner cover before applying to your face. You should barely see any product on the cushion when you apply it. Also, swiping will not work, you have to really tap it into your skin. Watch some youtube tutorials and once you learn how to apply it, it’s a beautiful finish that lasts and it feels like nothing on the skin. I do recommend wearing sunscreen underneath, the amount of foundation for light coverage is unlikely to be enough to provide sun protection even if it is SPF 50.",
    "post_time": "Reviewed in the United States on July 19, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’m so glad that Tirtir came out with a wider range of colors so that people with deeper skin tones are able to also use this wonderful product. I wasn’t sure what to expect, so thought to try the smaller size first before committing to the full-sized compact. This has been amazing!! You only need the smallest amount of product to get medium-full coverage. You can easily apply more if needed for fuller coverage. Best of all, it stays put without needing to use a setting spray!! I’m glad that it has SPF40 built in also, so it removes steps in my makeup routine. I don’t need a primer with this either. This has become my favorite foundation now!!",
    "post_time": "Reviewed in the United States on August 5, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Learning curve but great product once you get it down",
    "rating": "4.0 out of 5 stars",
    "content": "Nothing special, it’s a foundation just like any other full coverage drugstore make up. This is 21W and I should’ve gone with 24w. Made it work by using a darker setting powder.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0D2L1YLNR"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Product fell out from the box and the box was all dented and open probably got squished (not an issue). Good thing the product was not broken. Compact’s label is almost faded in the middle. See pics.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0D2L1YLNR"
}
]