[
{
    "name": "        OBD Power Cable Kit Dash Camera USB to Type C Hardwire Kit, OBD Power Cable for Dashcam 12-24V to 5V/3A with Low Voltage Protection 24h Parking Surveillance/Acc Mode for Dashcam, GPS or Radar       ",
    "stars": [
        "100%",
        "0%",
        "0%",
        "0%",
        "0%"
    ],
    "pid": "B0D2K7FKT7",
    "ratings": "3 ratings",
    "other_info": {
        "Brand": "SKLK-SEL",
        "Connector Type": "USB Type C, Micro USB",
        "Cable Type": "USB",
        "Compatible Devices": "Camera",
        "Special Feature": "Built-In GPS"
    },
    "discount_price": "$ 16.99",
    "normal_price": "$17.99",
    "about_this_item": [
        " High Compatibility Dash Cam OBD Hardwire Kit：The OBD dash cam hard wire charger cable is suitable for the OBD port of most vehicles and is designed for most dash cams, GPS, radar detection, and other electronic devices with USB Type-c/Micro USB/Mini USB connectors. It is compatible with the best dash cam power cord for Jeep Cherokee, Chevrolet, Toyota, trucks, and more, as long as you have an OBD port  ",
        " Packaging Content：1 X OBD dashcam hardwire kit (USB Type-C), 1 X Opening Tool Bar, 1 X Micro USB Connector, 1 X Mini USB Connector. The accompanying Micro USB Connector and Mini USB Connector make the OBD hardwired kit a more versatile device, allowing you to easily solve problems, save time, and offer a more cost-effective package  ",
        " MODE 1 : Press the red button switch to \"MODE -\": In this mode, regardless of whether the car is turned on or off, the dash cam will maintain 24-hour recording. If the voltage drops below 11.6V, the power will be cut off, suitable for parking monitoring  ",
        " MODE 2 : Press the red button switch to\" MODE O\": this is ACC mode. at this mode your dash camera will turn on/ off when your car turn on/off  ",
        " Special Reminder: 【 MODE Switching 】 When switching between 【MODE 1】 and 【MODE 2】, the OBD adapter must be unplugged and reinserted once, otherwise the mode switching will not working. Specific steps: 1. Pull out the ODB adapter. 2. Switch to the mode that you want. 3. Reinsert the OBD adapter  ",
        " Simple Plug-in Installation: This type of OBD dash cam hard cable installation is very simple, just plug it into the car's OBD connector and make sure it can power the dash cam, then hide the excess wires; Easy to set up dash cam  ",
        " Low Voltage Protecting: OBD Power Adapter USB C: OBD2 dash cam power cable, which has a built-in intelligent program control chip with automatic battery voltage detection and low voltage protection, automatically cutting off the power output when the battery voltage is below 11.6V to ensure the vehicle can start normally  ",
        " Only for Charging OBD Power Connector: Obtaining power from OBD interface only, no interference in other OBD data communication  "
    ]
},
{
    "title": "Works great!",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to install! Better than trying to hardwire dash cams with their hardware kits which requires messing with fuses.",
    "post_time": "Reviewed in the United States on July 31, 2024",
    "pid": "B0D2K7FKT7"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I got this in the nick of time. I wanted my dash cam to be able to record while I was on a trip. And it was a good thing that I did. while my car was at the airport parking I got struck by an other vehicle and my dash cam came on and recorded the license plate and drive. Needless to say, justice was served. Works as described.",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B0D2K7FKT7"
},
{
    "title": "Great for additional protection.",
    "rating": "5.0 out of 5 stars",
    "content": "Don't have a 'cigarette lighter' or 12V accessory outlet?  This connects directly to your OBD panel.  Recommended",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B0D2K7FKT7"
}
]