[
{
    "name": "        Food Dehydrator Machine Detachable, 8 Stainless Steel Trays, 600W Dryer for Jerky, Herb, Meat, Veggies, Fruit, Dog Treats, LED Display, 48H Timer & 86℉-167℉ Temperature Control, Recipe Book Included       ",
    "stars": [
        "75%",
        "17%",
        "5%",
        "3%",
        "0%"
    ],
    "pid": "B0D4VCNW8H",
    "ratings": "74 ratings",
    "other_info": {
        "Brand": "KEENSTAR",
        "Material": "ABS+Stainless Steel",
        "Color": "Black",
        "Wattage": "600",
        "Product Dimensions": "12.2\"D x 16.73\"W x 11.42\"H"
    },
    "discount_price": "$ 99.99",
    "normal_price": "$99.99",
    "about_this_item": [
        " 8-Tier Stainless Steel Trays: KEENSTAR Food dehydrator with build to last 304 stainless steel drying trays. Compared to plastic drying trays that are heavily contaminated with the food oils and juice, KEENSTAR corrugated mesh drying trays has a smaller contact area with the food, making it easier to clean. The machine body is made of food-grade high-quality plastic, all materials are BPA-free. Enjoy healthy, delicious & low-calorie snacks with the KEENSTAR Food Dehydrator Machine.  ",
        " Even Heat Horizontal Food Dryer: Hot air of the Vertical Food Dryer comes out from the bottom, the upper layer receives less heat and the food dries slowly, KEENSTAR Horizontal Food Dryer makes each tier food even heat , no need to manually adjust the position of the drying tray. The KEENSTAR Food Dehydrator has 600 Watts of drying power to ensure you can dry more food, faster and easier.  ",
        " Digital Temperature & Time Control: An enclosed thermostat from 86ºF to 167ºF in 9ºF increments. At the same time, the time can be set from 0.5-48 hours in 30-minute increments. It allows you to achieve the best results when drying different foods. We have prepared 6 optional drying function modes. You can adjust the time and temperature according to actual needs.  ",
        " Easy to Clean & Safty: Each stainless steel tray is dishwasher safe or washed with warm soapy water. When the timer ends, the dehydrators for jerky will automatically shut off. If the machine overheats, the overheat protection will turn on. The transparent outer casing helps you track your food's progress without opening the whole machine up.  ",
        " Large capacity but Not Bulky: KEENSTAR food dehydrator can be assembled and disassembled by yourself. You can prepare different types of dried fruits or jerky simultaneously in 7.2ft²drying space. If the food dehydrator is not used for a long time, it can be disassembled and stored in a small size. KEENSTAR food dehydrator comes with assembly tools, a mesh screen, a fruit roll-up sheet, a user manual, and a recipe.  ",
        " Customer Service: KEENSTAR provides 24-hour friendly customer service. If you have any issues related to KEENSTAR food dehydrator, please feel free to contact us. You can dry fruits, vegetables, grains, meats, herbs, and flowers, and also can be used to make snacks for your pets.  "
    ]
},
{
    "title": "Get's Really Hot So Keep It Ventilated",
    "rating": "4.0 out of 5 stars",
    "content": "This is my first dehydrator, and I gotta say I enjoy it. It was pretty easy to assemble as the instructions depict how quite well. The included tool is also much better than I'm use to (allen key with a handgrip). It came with all the metal holding trays, but after doing research it looks like you'll want to use silicone or food grade plastic to make things easier to clean. That said, it came with one food grade cooking tray so you'll probably want to invest in more since you have 10 shelves.",
    "post_time": "Reviewed in the United States on March 27, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "I Don’t Like the Stainless Steel Trays at All",
    "rating": "4.0 out of 5 stars",
    "content": "I sliced up two bananas and was able to fit them all on one tray for my first attempt. It has a preset which made it nice and easy, however, as I would periodically come by to check on it... I noticed it was very hot to the touch. The back/top was so hot you can't touch it. I was worried as I thought I was smelling something electrical burning, but I believe this was the banana. Anywho, all went well and they turned out great!",
    "post_time": "Reviewed in the United States on April 16, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "easy to set up, complex to use",
    "rating": "4.0 out of 5 stars",
    "content": "Cleanup was super easy when using the food grade plastic tray that came with it and I've purchased a couple more since two bananans cooked down to a handful of chips. As far as I can tell though, this is a good dehydrator as long as you leave it ventilated.",
    "post_time": "Reviewed in the United States on March 9, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "I’ve been wanting one for so long, and I’m definitely not disappointed.",
    "rating": "4.0 out of 5 stars",
    "content": "This dehydrator is such a great size compared to my old one which was huge (the size of a small refrigerator).  I like that I can do small batches of herbs, fruits, or vegetables.  The fan seems to circulate the air evenly and the temperature and time control work well.  It is decently quiet.  However, the stainless steel trays are not to my liking.  They are a twisted and woven wire grid and not easy to clean.  I’ve already replaced them with silicone mesh.  Other than the trays, I like the dehydrator.  Four stars.",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Excellent dehydrator",
    "rating": "4.0 out of 5 stars",
    "content": "PS.  The dehydrator needs to be assembled.  It takes about 15 minutes and is not at all hard.  The manufacturer includes a special tool to assemble.",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Works Well, Fit and Finish Just Ok",
    "rating": "4.0 out of 5 stars",
    "content": "I have an orange tree with way too many oranges for me alone.  So first thing I tried with this was picking a dozen oranges and washing and slicing them thin, then I steamed the slices for about 3 minutes.  I filled the six trays and started the machine at 9 pm at 160 degrees F and turned it down to 135 degrees and left them over night for 18 hours until afternoon.  It is easy to look at the contents thru the clear top and sides, and it is not a bad idea to check for texture a couple of times.  I allowed them to cool completely and then put the slices into vacuum jars for storage.  I used about 11 kwh of electricity, so at US average of 23 cents per kwh, it works out to about $2.50 for the drying.  You need to consider whether freezing or drying would be more economical for you.  It can be expensive if you use the machine during peak hours, and it might not be competitive with freezing in some locales.  I like the texture and the flavor of the dried orange slices, but it is a fair amount of work and I cannot see myself doing it as a regular method of food storage.  For the rating, I'm judging based on the fact that it works as advertised.",
    "post_time": "Reviewed in the United States on April 8, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Affordable and works well",
    "rating": "4.0 out of 5 stars",
    "content": "I'm obsessed with this food dehydrator! It has 8 trays, adjustable temperature control, and a digital timer, making it so easy to dry jerky. I haven’t got to try anything else yet, but I’m sure it will work great.",
    "post_time": "Reviewed in the United States on April 11, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Works perfectly!",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator works perfect for smaller items. With 8 racks I’ve been using for dehydrating chicken to make chicken jerky for my animals. Also dehydrated, chicken feet, herbs, and sauces, like applesauce. It’s great to prep meals for hiking or camping!",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Works well, but you have to assemble it",
    "rating": "4.0 out of 5 stars",
    "content": "This dehydrator works really well. We made jerky and some other things. The temp is consistent throughout with no need to swap shelves around during the process. Med thick sliced jerky took around 6 hours. Only complaint is the door. It doesn't fit quite evenly all around and you can feel a slight leak of warm air on the latch side.",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Works really well for it's size",
    "rating": "5.0 out of 5 stars",
    "content": "No complaints so far. This is a very nice sized dehydrator for under $100 everything dehydrates evenly and it’s really easy to setup, use & clean",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Love it!",
    "rating": "4.0 out of 5 stars",
    "content": "So simple to set up and use, and easy to clean. Compact enough for my countertop but also big enough to do decent size batches of food. The temperature control allows for precise dehydration. I love it!",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Great, portable dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator has an impressive 8-tier stainless steel tray system, allowing for a variety of things to be dried simultaneously, which is a significant advantage for those looking to prepare large batches of goods. Its digital temperature and time control caters to different drying needs well. The 360° hot air circulation makes sure the heat distributes evenly. The body is made of a high quality plastic, though some might prefer their dehydrator to be made of full metal construction. Additionally, the large capacity is a plus, but it may require considerable counter space, which could be a downside for users with limited kitchen space. Overall, this dehydrator worked great for my needs!",
    "post_time": "Reviewed in the United States on May 16, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Easy to assemble, easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to clean up and works great. We started a farm and are working to he more self sufficient. This helps me make a variety if snacks and preserve foods. It's compact but holds a lot.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Easy to Assemble, Easy to Use",
    "rating": "5.0 out of 5 stars",
    "content": "I used to have a dehydrator that was used a few times but it was such a pain to put together and then clean afterwards that it fell into disuse and finally given away.  This one is so much easier to assemble, use and then cleanup.  This takes up very little space on my countertop.  It operates very quietly.  The controls are easy to understand and to use.  Finally, it holds a lot.  I love dried fruit but it is so expensive for a little bag at the grocery store - and look at the list of ingredients!  Here I can make as much as I want with only the ingredients I want for just the cost of some apples, oranges, etc.  Recommended",
    "post_time": "Reviewed in the United States on May 10, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Much easier to use than my old round one",
    "rating": "5.0 out of 5 stars",
    "content": "This was such a breeze to put together, and what a difference design makes! I had an old round dehydrator with stackable trays that was just a pain to use. These slide out trays make all the difference. My dogs now have healthy chicken jerky for treats.  It is nice knowing that the treats I feed them have been prepared by me, and I know everything that went into making them - chicken, just chicken, and nothing but chicken! The cost of making them at home versus buying in the store means that this dehydrator will pay for itself in nearly four months (we have two dogs, and they have friends). I plan to have dogs longer than four months, so this is a smart investment. The trays are easy to clean and use.  The directions and recipes for drying various items are great - I may try drying some other items once I'm caught up on chicken jerky for the dogs. I highly recommend this easy-to-use dehydrator.",
    "post_time": "Reviewed in the United States on April 18, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "So cool.",
    "rating": "5.0 out of 5 stars",
    "content": "I've always wanted to try food dehydrating, but never had the means or the know-how.  This device gives me both.  It comes with a really useful guide for use and setup instructions to assemble the machine.",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "The dehydrator is a must-have it is EXCELLENT !!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I love banana chips and have bought them a bunch of times, so that's the first thing I wanted to try to make.  It's so easy to do with this machine.  And you know exactly where the banana came from, and how it was made, unlike buying them from the store.  Honestly this thing is worth it to me as a banana chip making machine, but I do want to try other things, especially jerky.  I look forward to getting into that at some point in the near future.",
    "post_time": "Reviewed in the United States on April 25, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Works Great, Easy Assembly, Good Time/Temperature Controls, & Excellent Quality & Written Warranty",
    "rating": "5.0 out of 5 stars",
    "content": "This high quality very sturdy and durable dehydrator has a ton of room to dehydrate everything that you could ever think of. It has nine different shelves to separate out different food items. You could also dehydrate flowers or herbs. This is an excellent purchase and you will wonder why you didn't get one sooner. With gardening season here this is the perfect way to save and store all those extra vegetables that you might not have a chance to eat right now. Dehydrate them and you can store them safely!! This is absolutely a must have and a great price!!! We've made our own trail mix a multitude of times and it's very easy to clean.",
    "post_time": "Reviewed in the United States on April 15, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Good beginner dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "#FoundItOnAmazon",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Awesome!!",
    "rating": "5.0 out of 5 stars",
    "content": "This is a good quality dehydrator with plenty of room to dehydrate a large batch of jerky, fruits, vegetables, or a combination of such. It is not flimsy or fragile, but sturdy and durable. The assembly of the unit was easy and straightforward, and everything needed for the assembly is in the box.",
    "post_time": "Reviewed in the United States on April 17, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Perfect for the occasional dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to assemble and straightforward to use. Plus it's quiet! Also breaks down when you're done so it takes up less space when storing. Really good instructions, which is unusually nice. Has preset options / programs for different foods, but these can be overridden if you want too. Overall, pretty impressed with it. Made some great dehydrated oranges for us!",
    "post_time": "Reviewed in the United States on April 16, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Simple",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator is simple in design, easy to use, and works perfectly. Easy to clean.",
    "post_time": "Reviewed in the United States on April 19, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "I will now dehydrate everything!",
    "rating": "5.0 out of 5 stars",
    "content": "I like jerky but don't like the price of good quality jerky, so I figured I could try to make my own and buying this was the perfect opportunity to do so.",
    "post_time": "Reviewed in the United States on March 26, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Smaller profile",
    "rating": "5.0 out of 5 stars",
    "content": "First, this machine is mostly plastic and though folks may have reservations about this, the material works very will at distributing the heat inside so that even if you touch it as it is cooking, you will not get burnt. It is warm so I don't recommend just putting your body on it, but it was great to notice how user-friendly this is. The other part of the material, is that it is made this way so it can be disassembled and washed easily.",
    "post_time": "Reviewed in the United States on March 5, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Compact dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "The machine comes with instructions and directions on times and temperatures to use depending on what you want to dehydrate, however, I really would caution that this is strong and though I did make and ate jerky, the time and temp recommended by the instructions was just way too much so the jerky got really dry. I'll need to play around with it a bit to figure out how it works best for me, but although it was dry, the jerky tasted amazing and the machine kept the seasoning on point.",
    "post_time": "Reviewed in the United States on March 13, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Easy to assemble and works great",
    "rating": "5.0 out of 5 stars",
    "content": "The actual machine controls are digital and look really well put together.",
    "post_time": "Reviewed in the United States on March 19, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Food dehydrator has low sound, simple operation, clean and sanitary, and is just for home use",
    "rating": "5.0 out of 5 stars",
    "content": "I recommend this product, but caution to get well acquainted with how to dehydrate certain foods so it doesn't get dry!",
    "post_time": "Reviewed in the United States on March 21, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Works well and stores smaller than most",
    "rating": "5.0 out of 5 stars",
    "content": "Okay so I've been looking for dehydrators for myself personally for years, my mom always had one and it was really big on the counter and it just took up a lot of space and when you do that for over a period of time you kind of get slowly booted out of your kitchen and that's frustrating .",
    "post_time": "Reviewed in the United States on April 5, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Easy assembly, ample room",
    "rating": "5.0 out of 5 stars",
    "content": "This piece has a smaller profile and with it being glass and stainless, it would pretty much match any design you got going on in your kitchen .",
    "post_time": "Reviewed in the United States on March 10, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "works good",
    "rating": "5.0 out of 5 stars",
    "content": "A lot of the older styles used to be white plastic trays and I personally have been moving away from a lot of the plastic pieces in my kitchen for health and personal reasons and this definitely is one of the reasons why I picked this up .",
    "post_time": "Reviewed in the United States on April 12, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Exactly what I needed",
    "rating": "5.0 out of 5 stars",
    "content": "This is exactly what I needed. I grow my own herbs and I'm always trying to dry them and this drives them very well. There's no hydration in there when they're done, which is perfect for storing them so I don't have to worry about mold issues. It seems to heat evenly and dry thoroughly. It was easy to set up and I like that I'm able to break it down. Really good dehydrator",
    "post_time": "Reviewed in the United States on March 31, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Great for first timers!",
    "rating": "5.0 out of 5 stars",
    "content": "As a first timer who knows nothing about food Dehydration, this is a great machine to start with. It is small enough that you can try different foods in small batches. It is also perfect size that doesn't take up too much storage. with the 8 trays, it gives you options to customize.",
    "post_time": "Reviewed in the United States on March 19, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Manageable sized dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "And for first timers, it also comes with a detailed Dehydration guide, which is everything you need to know about. It gives you the time and temperature for most of the food you can think of.",
    "post_time": "Reviewed in the United States on March 22, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Makes fantastic jerky",
    "rating": "5.0 out of 5 stars",
    "content": "Really like that this unit is small enough to fit easily on the kitchen counter without monopolizing the kitchen.  The dehydrator works well, taking no longer to reduce meat than more industrial sized units.  I like that the shelves are so easy to remove and replace after cleaning. And especially like that the entire contents of the unit are visible as the dehydrator works its magic.  This is a nice choice!",
    "post_time": "Reviewed in the United States on April 14, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Transparent and Easy To Use",
    "rating": "5.0 out of 5 stars",
    "content": "I got this dehydrator to make some deer Jerry and man it is fantastic.  Gets food completely dry. Has a controlled temperature and it was super easy to put together.",
    "post_time": "Reviewed in the United States on March 22, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Easy to clean dehydrator with nice display",
    "rating": "5.0 out of 5 stars",
    "content": "I love the ability to see what is going on from any side, making it easy and fun to see what is going on inside.  It was easy to assemble even though it did not have the parts numbered and they said.  Not really a good test but on the first load I packed apples, bananas, orange, lemon and two limes.  The apples came out very nice and a little chewy and the citrus (orange, lime, lemon) were crisp.  The bananas never really made it but I know it was me and not the unit.  I cut them about a quarter or less and they came out chewy instead of crisp but taste was excellent so I’m happy but my daughter wants them crisp. I used the silicon for the bananas but they did stick a bit so I don’t recommend that and will use parchment next time and be more careful slicing them thin or use a mandolin.  Overall I like the machine and any problem was user error. I’m totally pleased with the unit along with my daughter who is anxious to use it also.  At under a hundred dollar price point it's well worth it.",
    "post_time": "Reviewed in the United States on March 27, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Able to feed an army and still collapse down to tiny package",
    "rating": "5.0 out of 5 stars",
    "content": "I love how easy it is to clean this dehydrator. Unlike massive industrial dehydrators, this dehydrator is relatively light and comes apart for a deep cleaning easily. I find that taking out the metal trays and the drip tray and then cleaning up the dehydrator by wiping it down does the job great. This dehydrator shows the temperature on the LED display rather than relying on a circle dial and I much prefer the precision.",
    "post_time": "Reviewed in the United States on March 7, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "This is amazing",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator is seriously impressive. Although it arrives in a rather large box, this is entirely for protecting all the parts. Assembled it's about the size of a full-size microwave, where the usable space is also in similar to the inside of a microwave.  Compacted down the footprint is more comparable to two 3\" binders stacked to make a rectangle.",
    "post_time": "Reviewed in the United States on March 18, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Major upgrade",
    "rating": "5.0 out of 5 stars",
    "content": "Inside there are more than enough racks for most home needs. So far it's only gotten some test trials but the controls are intuitive and the results comparable to the standard name brands.",
    "post_time": "Reviewed in the United States on March 14, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Works great!",
    "rating": "5.0 out of 5 stars",
    "content": "Was pretty easy to put together. Made beef jerky in it and they came out perfect. Tasted great. Cant wait to dehydrate other food items.",
    "post_time": "Reviewed in the United States on March 22, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Compact SIze, Lots of Trays, and See-through",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator is a little larger than a 1-foor cube. You won't have to open the door to check on the drying progress because the front and all sides are clear BPA-free ABS plastic. Set includes 8 stainless steel racks and a drip tray for the bottom. Looks a bit overwhelming when you see all the pieces in the box, but it really goes together very quickly using good instructions. A nice hex handled driver is included and no other tools are needed. Took maybe 5 minutes to assemble. Feels solid once the pieces are interlocked and the 4 long screws are tightened.",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "KEENSTAR Food Dehydrator Machine, 8 Stainless Steel Trays, Dryer for Jerky, Herb, Meat",
    "rating": "5.0 out of 5 stars",
    "content": "Best of all is the color touch screen controls which are very intuitive and very simple to adjust the time and temperature. There are a few seconds included in a video with the unit in heat mode so you can maybe hear the fan running. It's very quiet and much more silent than another one that we have used.",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Versatile and easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "This is a nice dehydrator that makes the most of a relatively small counter footprint.",
    "post_time": "Reviewed in the United States on March 11, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Works Great",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to use and simple to clean. Plenty of room for bigger batches. Breaks down easily and saves a good amount of room. I have no complaints about this.",
    "post_time": "Reviewed in the United States on March 15, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "So cool",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator has a modern look and is easy to use. It's not a high-volume machine but should be fine for most residential uses.",
    "post_time": "Reviewed in the United States on March 12, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Awesome!",
    "rating": "5.0 out of 5 stars",
    "content": "Good dehydrator works great. Perfect for deer Jerky or healthier dehydrated fruits. Very simple to put together and use. Great instructions and love the recipes suggestion book. Highly recommend. This is a great gift idea.",
    "post_time": "Reviewed in the United States on March 17, 2024",
    "pid": "B0D4VCNW8H"
},
{
    "title": "Great concept, poor execution.",
    "rating": "2.0 out of 5 stars",
    "content": "Easy to use and clean. You can make your own healthy version of beef jerky.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B0D4VCNW8H"
}
]