[
{
    "name": "        Heated Eyelash Curlers, 2 in 1 Clip-Type Eyelash Curler, Natural Curling 24 Hours Long Lasting, 3 Temperature Modes with USB Rechargeable, Gift for Women Girls (Black)       ",
    "stars": [
        "76%",
        "3%",
        "6%",
        "3%",
        "12%"
    ],
    "pid": "B0D5BDWMLM",
    "ratings": "340 ratings",
    "other_info": {
        "Color": "Black",
        "Brand": "MGKO",
        "Material": "Acrylonitrile Butadiene Styrene (ABS)",
        "Handle Type": "Clamp\" or \"Clip",
        "Included Components": "User Manual, Brush, USB Charging Cable"
    },
    "discount_price": "$ 15.",
    "normal_price": "$15.99",
    "about_this_item": [
        " 【Attractive and fast curling】：The lash curler can fast heat up within 10s and the curved curling head quickly creates a perfect, natural curl for your eyes. Lasts up to 24 hours.  ",
        " 【Adjust Temperature Accurately】：Our heated eyelash curler comes with 3 temperature settings from 60°c to 80°c to gently curl your lashes and create stunning curls for different types of lashes without frizzing or pinching them.  ",
        " 【How to use】： Press the root of eyelashes and stay for about 5-10 seconds. Brush to the middle of the eyelashes and press again for about 5-10 seconds. Then press the end of the eyelashes and stay for about 5-10 seconds. Repeat 5-8 times.  ",
        " 【Rechargeable Portable】:Fast charging and easy to carry , Rechargeable heated eyelash curler has a slim and compact design, perfect for carrying on the go. It is a must-have in every girl's makeup bag.  ",
        " 【Safe and Harmless】：The double-sided anti-scalding comb teeth are safe and do not harm the skin, and the lashes are protected from the grooves through the bumps so that they are curled without damaging the eyelids.  ",
        " 【Tips & Tricks】:Apply mascara repeatedly to the roots of the lashes, move to the roots of the lashes and curl them upwards. Repeat 3-4 times, then apply another coat of mascara to define the look.  ",
        " 【A perfect gift】：This innovative heated eyelash curler is the perfect Valentine's Day/Thanksgiving/Christmas and birthday gift for your loved ones.  "
    ]
},
{
    "title": "Great tool for curl",
    "rating": "5.0 out of 5 stars",
    "content": "I was skeptical at first about using a heated eyelash curler, but this product completely changed my routine! It heats up quickly, and the temperature settings are perfect for getting a natural lift without damaging my lashes. The design is ergonomic, making it easy to hold and use, even if you’re a beginner.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Unlike traditional curlers, this one doesn’t pinch or crimp my lashes. I love how it provides a long-lasting curl, even on days when I skip mascara. It’s also compact and great for traveling. The battery life is decent, and it’s super easy to recharge.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Great Eyelash Curler",
    "rating": "5.0 out of 5 stars",
    "content": "My only suggestion would be to include a protective cap for better storage, but other than that, this heated curler is a game-changer for anyone looking for a little extra oomph in their beauty routine!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have straight Asian lashes that don’t curl easily.  This heated eyelash curler helps to curl them nicely.  There was a bit of a learning curve, but once I got it, it works great.  I heat the curler up & use it to push my lashes up a few times.  After, I put on a couple of coats of my favorite mascara, then use the heated eyelash curler again by opening it & “clipping” my lashes in between the “jaws”.  I gently pull out & up in a curling motion to make sure my lashes curl nice. I’ve gotten compliments on my lashes where people think I’ve had a lash perm or even extensions.  I make sure to wipe down my eyelash curler as it’s cooling down so there isn’t any mascara left on it before I put it away.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Where has this been all my life?",
    "rating": "5.0 out of 5 stars",
    "content": "I was always afraid of traditional eyelash curlers, so I looked for an alternative on Amazon. I swear everything I need can be found on Amazon lol. Anyway back to my review, I have heard that heated eyelash curlers allow the curl to set and this Heated eyelash curler does exactly that.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": " It is a 2 in 1, I feel safe and comfortable using this item to set my primer and mascara. I have naturally long lashes and thanks to two kinds of mascara by Maybelline and this Headed eyelash curler, It looks as if I am wearing false eyelashes. I have sensitive eyes and I have no problem using this. I have attached a pic of the heated eyelash curler being charged. If you are looking for a heated eyelash curler, you need to buy yours before they sell out! You won't regret it!! I am so glad I took a chance and bought this curler. It works great and the price and customer service was even better. I have tried all the settings and my eyelashes look great every time.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Great Eyelash Curler",
    "rating": "5.0 out of 5 stars",
    "content": "Great little curler! Super comfy grip for anyone with grasping issues like Carpal. This beauty heats up really quickly (<30 seconds) and is quite easy to use. Simply clip it around your lashes and move upwards in a curling motion and the magic is complete. It looks like salon-level results but without the salon-level prices! The battery lasts quite a while before needing to be recharged as well, but most importantly, I am saving a fortune on false lashes and all that jazz! 5/5",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I’ve always had short lashes and been searching for something that would help with making them look longer. I just don’t like false lashes and getting them done at a shop is quite expiry and not affordable. I found this eyelash curler that works amazing. It works best after I applied mascara as it made my lash look fuller. I would recommend to anyone needing their lash curled without needing to apply false lashes.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Heated eyelash curler",
    "rating": "5.0 out of 5 stars",
    "content": "The curler arrived promptly and was beautifully packaged. It heats up in about 30 seconds, which is incredibly convenient for my busy mornings. As I used it, I noticed that it created a gentle, natural-looking curl that opened up my eyes beautifully. The best part is curls lasted all day without drooping. One concern I had was the safety aspect. Thankfully, this curler has a temperature control function to prevent overheating. I felt safe using it, which is crucial for any heated device. Compared to my old manual curler, this heated version is a revelation. No more crimped lashes or uncomfortable pinching.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I won’t lie, there is a learning curve when using this. It’s quite easy to master though. I’ve used all three heat settings and even the hottest isn’t unbearable. I use this BEFORE mascara and it holds the curl all day. They suggest using after a coat of mascara and I found that was a one way ticket to Clump City. 10/10 would recommend.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Worked for me!",
    "rating": "5.0 out of 5 stars",
    "content": "I was on the fence about buying a heated lash curler. I was looking into getting a lash lift but after talking to a friend she suggested I try a heated lash curler. I was shopping around but then found this one. After reading reviews I decided to give it a try. I am so not sorry I purchased this. I love it!! It helps lifts my downward lashes and saved me a ton of money getting a lash lift. It’s easy to use, charge, and does not take up a lot of drawer space. Bonus you get a lash separator that is easy to use. I love my heated lash curler.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Got the heated eyelashes curler after doing some research on what kind of curler to get and found the heated ones are better. This product surprisingly works great and my eyelashes stay curler for a longer time than the regular curlers. This product is super easy to use, you can adjust the heat based on your eyelashes hair type and it’s super safe to use.",
    "post_time": "Reviewed in the United States on October 4, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Great product! Buy it!",
    "rating": "5.0 out of 5 stars",
    "content": "Curler heats up super fast and the clamp is the perfect amount of pressure to curl the eyelashes but not pull them out. The charge holds for a long time also because you really only use it a minute at a time.",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This eyelash curler takes eyelash curling to the next level!!! It heats up just enough to hold a curl but not burn such a sensitive area of your eye. I enjoy the three heat settings. A tip i learned was to curl them after applying mascara with this wand it works soo well!!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Works great",
    "rating": "5.0 out of 5 stars",
    "content": "I have short, straight eyelashes. They curl but don't hold a curl well. I got this heated eyelash curler and it works well. It took me a little while to learn how to use it, but once I did I can now curl my eyelashes every morning.  I would purchase this again!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This product works well. It is easy to charge and easy to use and a good price. It can be used two different ways, you can crimp your eyelash between the heat sensors or use it like a heated brush. It also comes with two eyelash accessories.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Great tool",
    "rating": "5.0 out of 5 stars",
    "content": "I was used to using a lighter to heat up my old regular lash curler. Soot would build up and become messy. This lash curler is a much better way.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Takes some practice, I haven’t burned myself though. Adding a little oil to your lashes first helps. It holds a charge for about a week or 2, depending on how often you use it. Comes with a charger.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Very good heated eyelash curler.",
    "rating": "5.0 out of 5 stars",
    "content": "There was a lit of a learning curve, especially with my left eye since I’m right handed, but overall I’m satisfied and haven’t gone back to my old lash curler.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love the product and have been using the product for a month now. I been searching on Amazon market place for something like this for the last couple of months. Thank you for an amazing product.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Great curler",
    "rating": "5.0 out of 5 stars",
    "content": "Love the curler. Easy to use. I really like that I  can clamp it on the lashes or use the back and just comb the lashes in place with the heat. Great design.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Way better than the old ones that rip out all of your lashes!!! I originally thought I'd use this because I always sleep on the same side and bury my face in my pillow, which smashes all of my lashes in towards my nose and it looks ridiculous when I wake up; I just wanted something to force them back to their normal position. But it also curls well and makes a big difference in how my lashes turn out! There's a learning curve I'll admit. It takes some time to figure out how to position the wand to grab your lashes the right way, but once you get it down, it will replace your old barbaric torture devices/ eyelash curlers. I even use it to make false lashes look better! Glad I finally broke down and bought one!",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Fun and functional!",
    "rating": "5.0 out of 5 stars",
    "content": "I love this for my falsies…. It gives them that curl I love… I have really short natural lashes so I can’t speak for that but this little thing heats up really nicely",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I was skeptical, but I’m actually impressed with how well it has curled my eyelashes!  I love this style compared to the old wire crimping type that always seemed to pull too hard on my lashes. This is very gentle and works well",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Perfect!",
    "rating": "5.0 out of 5 stars",
    "content": "i bought this eyelash curler, because i have stick straight eyelash’s and heard so many people recommend, a heated curler i’m never going back to a regular curler!! 100/10 recommend",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great buy! I was using the standard eyelash curler and wanted to try something new. At first it takes a bit of time to get the hang of it but I ended up loving it! The normal curler only curls my lashes for a little while and it goes back to straight. With this heated curler it last much longer. I recommend to you girlies but take the time to get to know the product before judging!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Works well",
    "rating": "5.0 out of 5 stars",
    "content": "I really like my purchase. I like that the curl stays longer and it looks like I have extensions on. It’s really easy to use and the charge holds for a long time.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Pretty decent eyelash curler, love how it clips over my lashes but wish it grabbed a little tighter since my lashes are fine and they slip through easily. Took a bit of a learning curve to get it to work properly but I mastered it within one weeks time. I did love how it came with the lash wand and separator, they both work beautifully. All items have become very handy in my everyday makeup routine.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "amazing!!",
    "rating": "5.0 out of 5 stars",
    "content": "At first, I was a little weary about using a heated lash curler. I was scared that I was going to burn my eyelid. But after a little practice, I got the hang of it! Unlike a normal lash curler, my eyelashes held the shape for a lot longer and I got some many compliments!",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Came right out of the box working.  Had a nice weight to it, didn't feel cheap at all.  The clamp had the perfect tension to hold onto your eyelashes without causing a crease in them.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Handy little tool.",
    "rating": "5.0 out of 5 stars",
    "content": "I love the size of this curler. Easy to pack in my makeup bag, doesn’t take much space. It heats up quickly.  Also appreciate the extra tools it comes with.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "I waited a bit to review simply because I just wasn't seeing the results I wanted to. For awhile I ended up using this to pull through my lashes to warm them, then curling with a typical lash curler. Finally, I came across a TikTok video and realized I was doing it all wrong. You clamp your lashes at the base and instead of pulling up you twist/roll it towards your eye lid without moving the actually placement or the wand. Since I happened across that video and started using it correctly, I'm really loving it! Gets nice and warm but not too hot as long as you don't accidently pinch your eye lid. Soooo glad I went with this one with the clamp because I don't see the ones that simply brush through giving much curl.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Works if you use it right",
    "rating": "5.0 out of 5 stars",
    "content": "This eyelash curler works really well, it took a bit of practice to get used to it but I absolutely love that it has a little arm to hold your lashes wrap around.",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I definitely recommend.",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Works great!",
    "rating": "5.0 out of 5 stars",
    "content": "Super easy to use, very essential for my daily life",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The best product for my eyelashes. I can curl them very easily and they last longer.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "my favorite for eyelashes",
    "rating": "5.0 out of 5 stars",
    "content": "OMG, what an amazing concept. I was so amazed that is was actually heated. Don't be alarmed. It doesn't get hot enough to burn just enough to work.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This did what I was looking for.  I like that it gets warm to help keep the lash curled.  I would have liked that it had a tighter hold when clamping on my lashes but putting mascara on before using it does make it hold tighter. I have very fine lashes so keep that in mind if you are the same.  Overall it's a nice product!",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "So amazing",
    "rating": "5.0 out of 5 stars",
    "content": "I got very straight lashes, I love how nice this curler makes my lashes look,and how easy it’s to use. Also love how much longer they last curled compared to a regular curler.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I saw someone was posting that this does not work without mascara and it is true...you need to put mascara first. Also, it is hard to use the clip so I gave up. It still works pretty well when I have mascara on and this is rechargable so I decided to keep it.",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Best Heated Eyelash Curler I’ve Used!",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve tried many heated eyelash curlers and this is by far the best!! It heats up extremely fast and provides amazing curl that lasts all day. Would definitely recommend and buy again.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this eyelash curler as the standard ones hurt me and don't do nearly as well! This comes out so natural and very easy to use on both upper and lower lashes!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Love this!",
    "rating": "5.0 out of 5 stars",
    "content": "I was skeptical when I ordered this but it is pretty easy to use just takes a few times to get used to it.  I would definitely recommend purchasing this product.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This curler has worked wonders for me! It’s actually curls my lashes and they last all day! It’s gets very hot, so be careful, but overall it works great!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Very Easy To Use",
    "rating": "5.0 out of 5 stars",
    "content": "I really like the fact that you can grasp the eyelashes. I like it for the purpose of straightening some of my overcurled eyelashes.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is one of the better heated curlers I've owned, I love that it came with a comb to brush through any clumps. Very good purchase!",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "It works!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I could never get a traditional lash curler to work. This works well. I have to curl them with the tool then immediately apply my mascara for the curl to hold. Maybe I just have resistant lashes. But it works and I love the wired tool that it comes with to comb thru lashes after the mascara.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was a great buy, it’s rechargeable and the spooly and lash comb are handy accessories. It took a couple tries to get used to. You kind of have to treat it like a tiny hair straight and curve it upwards for to curl. If heats up really quick and the clamp isn’t too tight so it won’t pull too hard on your lashes.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "To curl or not to curl",
    "rating": "5.0 out of 5 stars",
    "content": "I curled on the highest setting in the morning and they were still curled by evening. Even without mascara. It was a nice way to wake up my eyes.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is exactly what I’m looking for. I was looking for a curler that had a clamp on it to grab and hold your lashes and that’s exactly what this does.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Love this",
    "rating": "5.0 out of 5 stars",
    "content": "I can’t wear mascara because I hate the feeling on my eyelashes and they itch. This separates and curls at the same time. 34 years later I finally found something that works.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "At first I didn’t think it worked but I figured it out! Works great and lasts all day too. I prefer to use it before applying mascara.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Great purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I’ve had this for about a month now. I was a little scared to use it and now I can’t live without it! I highly recommend!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "So I was a little skeptical of this item to begin with. It actually works. I watched a couple videos on technique to get the correct flip to the curler. You can use it before applying mascara or after applying the mascara. I actually find flipping after mascara has a more dramatic look! I am very happy with the results!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Works great!",
    "rating": "5.0 out of 5 stars",
    "content": "My eyelashes have always been long but difficult to keep curled. I couldn’t use mascara because they wouldn’t hold the curl, but with the electric eyelash curler, it’s so much easier, and the curl lasts all day, even longer. This is a great product.",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is my favorite eyelash curler I used!  And for the price, it is amazing!  It looks high end!  And what I love about it is you have the option to just curl it on the 2 ends or it opens up like a hair iron!  The iron is gentle do not be afraid of it.  You get 3 heat settings.  I keep it on setting 1 when warming it up.  Whithin 2 minutes you can use it.  If it does get really warm, you can turn it off and still use it.  And it will cool off soon.  To turn on and off just hold in the button for a few seconds.  My eyelashes looked amazing!  For a better lash lift, just apply 1 coating of your favorite mascara, then do the eyelash heater then apply the rest of the mascara when you are done.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "It works!",
    "rating": "5.0 out of 5 stars",
    "content": "I love love love my heated curler for my eye lashes! It's simple and fast to heat up and gets me ready faster in the morning. My eye lashes are much more defined and curled better than ever! I use this every morning and I recommend anyone struggling with uneven and non curling lashes to try this out!",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This curler takes some time to learn. The learning curve is not long though. Watching some tiktok videos also help with the learning. Once learnt it’s actually a handy tool for curling lashes. The trick is to get the root of the lashes on the curler and wait for 15 seconds. The effect is wow!",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Perfect !",
    "rating": "5.0 out of 5 stars",
    "content": "I was very pleasantly surprised when I used it, it curled my lashes in no time and was very easy to use.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to use I can take it anywhere without a problem and the charge lasts for many times I would buy it again",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Absolutely love it!",
    "rating": "5.0 out of 5 stars",
    "content": "I was little skeptical at first but honestly nothing but a good eye lash curl! I could not get nice smooth curled eyelashes with the conventional little squeeze one. But this one make them look like no other. It’s super easy to use the heat of the curler isn’t too much either. Its truly is great",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I originally bought this to help tame some stray lash hairs out of my eyes every day - but the compliments I get for my lashes since using this have been insane. Everyone wants to know what serum or mascara I’m using. Also, I’m pretty clumsy and have yet to burn myself.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Better than expected",
    "rating": "5.0 out of 5 stars",
    "content": "Works as expected and pairs nicely with the tubing mascara that I have. Love that it has the heat indicator on it too!",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have eyelashes that don't go hold a curl.  This helps tremendously.  Make sure you put on mascara before curling.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "This eyelash curler works great!",
    "rating": "5.0 out of 5 stars",
    "content": "Its super easy if you have short lashes it helps giving you an extra lift to open your eye!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have straight lashes so even with a normal lash curler and mascara they aren’t visible but with this tool my lashes stay up even with multiple coats of mascara. Definitely a game changer because now my lashes stay curled and complement my eyes more too!",
    "post_time": "Reviewed in the United States on September 21, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Works great!",
    "rating": "5.0 out of 5 stars",
    "content": "Take some getting used to and need to find the best grip/angle for you but once you figure it out, it works well and curls good. Great for my straight eyelashes. Also love that it comes with the charging cable and extra brush.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Heats quickly, easy to use and curls nicely. It came with some nice accessories-2 combs for use during and after curling. Works best if your lashes are on the longer side, as the heated part gets close to the eyelid on shorter lashes.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Its easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "Love the heated eyelash curler no more pinching from metal clamp style, and the lash comb is the best for separating lashes",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It work really well! Doesn’t get extremely hot, but enough to make a difference on your eyelashes! Strongly recommend.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "It Works!",
    "rating": "5.0 out of 5 stars",
    "content": "I had high hopes for this product as the standard eyelash curler is a little annoying to use for me. I will say this does not curl them probably any faster than a standard, but I do feel like they last a lot longer. It definitely takes some getting used to. Once you know what you’re doing it’s great.",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love it for photos this is a great product. It helps my eyes pop.",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Make sure your lashes are clean",
    "rating": "5.0 out of 5 stars",
    "content": "I absolutely love this. Super helpful to get the shorter lashes that somehow always sneak under my regular lash curler. Plus I think the slight heat definitely keeps the curl a little longer.",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This heated eyelash curler is great. I like how it curls my eyelashes. I have bought other heated eyelash curlers but they have tugged on my eyelashes, these don’t! It has different setting for the level of heat. Heats up pretty quickly.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Awesome",
    "rating": "5.0 out of 5 stars",
    "content": "I like that it has a clamp to help curl along with the heat.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This curler is the first heated curler I have ever purchases. Chose this one based of other reviews. Does exactly what it says it will do. I use this every day! does NOT damage lashes and makes them look fabulous.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Curls very well.",
    "rating": "5.0 out of 5 stars",
    "content": "This is life changing. I kept getting lash lifts but I felt like it was damaging my lashes overtime plus it was pricey. I was skeptical, but I put on one coat of mascara then curl with this and it stays all day! Worth it and not scary to use",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This lash curler provides a long lasting curl and my lashes have grown so long and healthy while using. Love it!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Eyelash Curler",
    "rating": "5.0 out of 5 stars",
    "content": "Love this little tool.  I have tried many different falsies and could never get them on.  With this I get the desired lift and curl with minimal effort.  Be sure to put mascara on first!  LOVE it….super happy!!",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this curler because unlike other curlers, it does not crimp lashes with a harsh angled line to lift. This allows you to do a natural upward curve with the lash. I am very impressed with the curl it produces and have to say, so far it is my favorite lash curler",
    "post_time": "Reviewed in the United States on September 16, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Lovely Lashes",
    "rating": "5.0 out of 5 stars",
    "content": "I really like how this curls my eyelashes so effortlessly, I like it so much better than manual eyelash curlers!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Pretty easy to use once you get used to it!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Works great",
    "rating": "5.0 out of 5 stars",
    "content": "I have very short, straight lashes and this curler warms up nicely to give me a lift. It doesn't get too hot at all, just enough for a hold.",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this eyelash curler! I love that it’s safer lashes unlike some of the other curlers! Works great! Heats fast!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Curls short lashes!",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried sooo many heated lash curlers and none of those come close to this one!",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "i like that it heats up quickly and charges too. gives a nice curl",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Safe for lashes!",
    "rating": "5.0 out of 5 stars",
    "content": "makes my lashes naturally curled instead of a harsh L shape",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The item is sturdy, portable and easy to use.",
    "post_time": "Reviewed in the United States on October 14, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "REALLY WORKS!",
    "rating": "5.0 out of 5 stars",
    "content": "I like this Heated Eyelash Curler because you can also use it on your Eyebrows.  It reminds me of a very tiny curling iron.  My lashes and brows are extremely wild.  This aides in taming both of them.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I had a scary experience with a lash curler, so I decided to buy a heated one. I like to use it on the first heat setting and hold it for 10 seconds on each lash. It takes some practice to get used to, but it works.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Heated eyelash curler",
    "rating": "5.0 out of 5 stars",
    "content": "Product works very well - best if mascara applied first",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love this product, easy to use, works as the description says.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "This curler comes with important accessories that are crucial for beautiful eyelashes.  Start practicing with the lowest heat setting until you can control the wand.  Amazingly the curl on your lashes lasts more than a day once you master the wand.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It works. It’s hot enough to curl your eyelashes.",
    "post_time": "Reviewed in the United States on October 13, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Quality Eyelash Curler",
    "rating": "5.0 out of 5 stars",
    "content": "I really like this. I use it every day!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have long salt and pepper eyelashes and was looking for something to make them curl. I found mascara too be too harsh but this is a good curler and gives me the curl that I like without damaging my lashes.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "I like it",
    "rating": "5.0 out of 5 stars",
    "content": "I use it every day, great product!!!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Eyelash curler works well on my straight lashes!",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Heat",
    "rating": "5.0 out of 5 stars",
    "content": "Eyelash curlers always tear my eyelashes out but I've been using this for only a few weeks and already my eyelashes are so much fuller. This will be my go to from now on",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D5BDWMLM"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I didn’t actually think it would work as good as it does. I curled my lashes which are pretty short, and they stayed curled through a work day!",
    "post_time": "Reviewed in the United States on September 27, 2024",
    "pid": "B0D5BDWMLM"
}
]