[
{
    "name": "        LOFTILLA Bathroom Scale for Body Weight, Highly Accurate Weight Scale for Home Used, Digital Scale with Sturdy Tempered Glass, Bathroom Scales for Weight with Bright LED Display, 400lb       ",
    "stars": [
        "75%",
        "19%",
        "3%",
        "3%",
        "0%"
    ],
    "pid": "B0D6RF2VFF",
    "ratings": "106 ratings",
    "other_info": {
        "Brand": "LOFTILLA",
        "Color": "White",
        "Recommended Uses For Product": "Adults, App not supported",
        "Special Feature": "Portable, Backlit Display, Lightweight, Auto Shut Off, Bodyweight",
        "Display Type": "LED"
    },
    "discount_price": "$ 12.33",
    "normal_price": "$16.99",
    "about_this_item": [
        " Note: This scale does not support app connectivity  ",
        " Slim & Stylish Design: Elevate your space with a sleek 10.2 x 10.2 x 1.1 inches design; At only 2.2 pounds, this compact bathroom scale fits effortlessly into any small space, blending seamlessly with your modern decor  ",
        " Clear & Bright Display: Never miss a reading with LOFTILLA vibrant dital display; It automatically alerts you when the battery is low or the scale is overloaded; Experience the ultimate convenience with a digital scale that keeps you informed at all times  ",
        " Pinpoint Accuracy Every Time: With advanced precision sensors, this weight scale offers consistent readings with an accuracy of up to 0.4 lb; Say goodbye to fluctuating numbers and hello to reliable results every step on the scale for body weight  ",
        " Safe & Durable Structure: Crafted with tempered glass, non-slip pads, and curved edges, this bathroom scale offers safety and durability; Perfect for the whole family, it withstands daily use while providing a secure weighing experience  ",
        " Easy Step-On & Auto Shut-Off: Simplify your routine with the user-friendly digital scale; Just step on to see your weight instantly, and let it automatically shut off to conserve battery life, Effortless and efficient  ",
        " Extensive Weight Range: From 0.4 lbs to 396 lbs, LOFTILLA body weight scale accommodates all body types; Whether you're tracking your goals or keeping tabs on progress, this bathroom scale provides accurate measurements for everyone in the family  ",
        " Enhanced User Experience: Designed with your lifestyle in mind, this weight scales bathroom product offers seamless functionality and a stylish look; Perfect for health enthusiasts and casual users alike  "
    ]
},
{
    "title": "If you are looking for a stylish yet reliable and simple scale, this should work well for you.",
    "rating": "4.0 out of 5 stars",
    "content": "PROS:",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "great value",
    "rating": "4.0 out of 5 stars",
    "content": "- Cool design",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Good value basic scale",
    "rating": "4.0 out of 5 stars",
    "content": "- Easy to use",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Seems fine",
    "rating": "4.0 out of 5 stars",
    "content": "- Accurate",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Tiny",
    "rating": "4.0 out of 5 stars",
    "content": "CONS:",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "works fine",
    "rating": "4.0 out of 5 stars",
    "content": "- It’s a smaller size scale. It felt like my feet didn’t fit well on it",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "A Reliable Tool for Tracking Weight",
    "rating": "4.0 out of 5 stars",
    "content": "- Doesn’t have any memory or app feature to store your weight",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Works great so far!",
    "rating": "4.0 out of 5 stars",
    "content": "Upon getting my scale set up, I got the 2 AAA batteries put in(which are included) and the scale set down on a flat surface, the scale automatically turns on.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "What does F mean",
    "rating": "4.0 out of 5 stars",
    "content": "Its digital display shows in red numbers. And when you are done weighing yourself the display turns off very quickly.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "very nice scale",
    "rating": "5.0 out of 5 stars",
    "content": "I weighed myself both with this scale and my current one at home to see if they would match up and they were almost exact. The pounds matched, but the Loftilla scale goes all the way to the decimal point for more accuracy.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Small, lightweight, basic scale; ability to pair with Loftilla Plus app; only to 396 pounds",
    "rating": "4.0 out of 5 stars",
    "content": "This scale has a very modern and sleek design. It is small and lightweight. I love the look of it. Besides the scale, two AAA batteries and a user guide are included. Be careful removing the plastic wrapper on the scale. I actually scratched some of the black off the scale when I tried to puncture the wrapper for removal.",
    "post_time": "Reviewed in the United States on August 14, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Accurate bathroom scale",
    "rating": "5.0 out of 5 stars",
    "content": "Per the product specs in the manual, this scale measures from 0.4 to 396 pounds (not 400 pounds). It is easy to use. I just put it on a non-carpeted level floor and stepped in the center of the clear glass section with each foot. Within seconds I had an accurate reading of my weight.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "works as intended",
    "rating": "5.0 out of 5 stars",
    "content": "There is also the ability of downloading the Loftilla Plus apps to create an account and pair it with the scale. I did not do this as I am sick of having to sign up for apps. Also the ratings on the app showed 2.1 stars. ",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Sturdy scale with bright display",
    "rating": "5.0 out of 5 stars",
    "content": "In summary, I think this is a nice basic scale for the price. The scale's footprint is small, so I do have my doubts that it can support someone in the higher weight range. It is certainly not a scale for people with big feet--like my boyfriend's size 13. I am a little over 200 pounds and it supported me fine. The current price of $14.99 is excellent for this. The option to pair this with an app may be a plus for some but I did not try that.",
    "post_time": "Reviewed in the United States on September 17, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Easy to use - no tap",
    "rating": "5.0 out of 5 stars",
    "content": "This scale looks pretty cool. I like how there are two spots to place the feet. I placed this in my bathroom and received lots of compliments on it. The scale is really accurate and so far it's been working like new in the past few months. I like that the battery life lasts a while because it has some battery saving features built into it.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Nice",
    "rating": "5.0 out of 5 stars",
    "content": "This scale is nice looking and easy to set up. Just pop the batteries in and after a few seconds it self calibrates and will read 0. After that you can use as normal. I like the sleek design a lot and it goes with everything in my bathroom.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Attractive and shows true weight",
    "rating": "5.0 out of 5 stars",
    "content": "I love the modern design look of this weight scale, the digital screen is easy to read from standing height and measures my weight pretty accurately. It well built to stay steady when standing on it, no wobbling.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Perfect",
    "rating": "5.0 out of 5 stars",
    "content": "I am able to use this scale by just stepping on - I don't have to tap it to turn it on. This is very convenient. The directions say to put weight on it, then step off and wait for it to calibrate. I found I got the same results when I didn't do this. Even if it was needed, it is easier than tapping hard enough to jostle my old scale awake. This scale is very lightweight - Since I keep my scale under the bed and take it out to use it, the light weight is convenient. The only downsides are - 1) the red numbers look a bit menacing, and 2) this scale weighs about 1/2 pound heavier than my old scale. I'm not sure which is correct. On repeated weighings, this scale gave the same reading 4 out of 5 times, so it is fairly consistent.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Easy to read and use!",
    "rating": "5.0 out of 5 stars",
    "content": "Nice small bathroom scale. Easy to use, accurate, stylish and seems like a great value. Wife really likes the size of it, while not much its probably a couple inchs less wide and tall as standard scales. Just makes stowing away easier and takes up less floor space while out",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Vibrant, accurate",
    "rating": "5.0 out of 5 stars",
    "content": "This is such a nice, thin digital body scale!  It even came with the batteries!  All you need to do is step onto the scale and wait for the easy to read digital numbers to show up.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Accurate",
    "rating": "5.0 out of 5 stars",
    "content": "This review is for the following item:  LOFTILLA Bathroom Scale for Body Weight, Highly Accurate Weight Scale for Home Used, Digital Scale with Sturdy Tempered Glass, Bathroom Scales for Weight with Bright LED Display, 400lb",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Accurate and Sturdy Scale",
    "rating": "5.0 out of 5 stars",
    "content": "Very nice looking scale.  A bit smaller than most scales, so takes up less room in the bathroom.  But it is not too small, most people should be able to stand on it very comfortably.",
    "post_time": "Reviewed in the United States on August 29, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Extreme value and accurate",
    "rating": "5.0 out of 5 stars",
    "content": "I found the scale to be accurate compared to my other scales.  The display lights up nice and bright and it is easy to read.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "A good, basic scale",
    "rating": "5.0 out of 5 stars",
    "content": "It uses 2 AAA batteries and they are included with the scale.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Petit, chic scale",
    "rating": "5.0 out of 5 stars",
    "content": "The scale says it is accurate up to 396 pounds.",
    "post_time": "Reviewed in the United States on August 25, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Sleek and Accurate: Bathroom Scale",
    "rating": "5.0 out of 5 stars",
    "content": "Since it is glass, make sure your feet are dry before stepping on the scale so you don't slip and fall.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Great scale!",
    "rating": "5.0 out of 5 stars",
    "content": "I do like this scale and how it looks.  I am happy with it.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Stylish, light, easy.",
    "rating": "5.0 out of 5 stars",
    "content": "My whole family loves this stylish scale. It looks great in my bathroom. The display is really easy to read and it is very accurate. It was the same as the weight taken at my doctor's office. I appreciate that the batteries were included. It makes it so easy to track your weight. The scale is also very sturdy. My husband, who is on the taller side, finds it to be very sturdy when he steps on it. I really recommend this accurate, sturdy, and stylish scale for your house.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Works well!",
    "rating": "5.0 out of 5 stars",
    "content": "I don’t know whose idea it was to store a bathroom scale near a toilet years ago but …yuck.  I have cleaned way too many scales that were not smooth and flat.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Great high quality scale!",
    "rating": "5.0 out of 5 stars",
    "content": "This scale is not stored by my toilet but if it had to be for some reason, it would be easy to clean and very sanitary.  In my opinion this scale from LOFTILLA is very accurate and easy to use. It requires 2 AA batteries and then just step on to active.  The weight lights up to the closest 1/10 of a lb.  So it doesn’t just show 124 lbs, it shows 123.8 lbs. The price at the time of this review is $17.99. I think this is a tremendous value and my rating is 5 Stars.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Nice body scale",
    "rating": "5.0 out of 5 stars",
    "content": "This body scale is easy to use, the LED display is clear, easy to read, and the scale is accurate that I weighted myself with this scale and my previous scale. It's good basic scale if you are not planning to track the numbers on your phone. Overall, works great and a good value of body scale.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Great basic scale",
    "rating": "5.0 out of 5 stars",
    "content": "This is a great scale for the price. Modern, sleek design and the weights it says are accurate. No complaints from me at this price especially.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Easy weigh",
    "rating": "5.0 out of 5 stars",
    "content": "This is a beautiful and attractive scale that is highly precise in weighing. The scale has a stable base that allowed me to stand on it and weigh myself easily. The anti-slip feet at the bottom also made it sturdy and prevent it from slipping or sliding. The scale has a tempered glass top that gives it a clean and sleek appearance and its simple toy clean. The scale has a bright and bold LCD display that’s easy to see the readings even at a glance or low light conditions. The scale is light weight and compact which make it easy to store or move from one area to another. This scale can hold my body weight with no issues and it also provided accurate measurements that I can track.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Digital Scale",
    "rating": "5.0 out of 5 stars",
    "content": "A sleek glass digital scale that has a modern look. The width of the scale is smaller than my previous one, but it still works. It has a nice modern look. I like the white color because it goes with my light colored tile.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Sleek and Accurate",
    "rating": "5.0 out of 5 stars",
    "content": "It's sleek, lightweight, and fits nicely in my bathroom. Setting it up was super easy, just add the included batteries, and it’s ready to use. The scale gives quick, accurate readings, and the LED display is bright and clear.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Scale works well!",
    "rating": "5.0 out of 5 stars",
    "content": "Very simple and basic design scale with a clean look that can go in any room of the house. Came with batteries which I love so I could use it immediately and reasonably priced. Now I just need to burn off these extra 25 lbs and we'll feel better about using it.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Perfect Size!",
    "rating": "5.0 out of 5 stars",
    "content": "Nice scale, easy to read and store. It’s very thin and lightweight so I can easily put it under my vanity until needed.",
    "post_time": "Reviewed in the United States on August 26, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Bathroom Scale",
    "rating": "5.0 out of 5 stars",
    "content": "This scale comes equipped with what you need to power it up (AAA batteries). It comes accurately calibrated and comparatively measures up to the scale I currently have. The readings seems to be pretty accurate. It’s easy to use and you can connect it to an app for extras (I’m just using it as a basic scale without app).",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "nice simple scale - clean design",
    "rating": "5.0 out of 5 stars",
    "content": "Put in batteries, set on solid surface, hop on, read the weight.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Accurate Scale with an Easy to Read Display",
    "rating": "5.0 out of 5 stars",
    "content": "No need to install the app if you don't want to.  I just use this as a scale, so it works out fine.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Nice, accurate scale.",
    "rating": "5.0 out of 5 stars",
    "content": "A very nice, thin, accurate scale that's easy to use. I like that it has the spots for your feet indicated by the clear glass. Great scale.",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Nice scale",
    "rating": "5.0 out of 5 stars",
    "content": "This is a nice scale. It appears to be accurate compared to my other scale and it looks nice. The display is easy to read. It does need 2 AAA batteries to work. The material feels nice. It is easy to set up and use. It is a good value for a decent product.",
    "post_time": "Reviewed in the United States on August 19, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Love these scales",
    "rating": "5.0 out of 5 stars",
    "content": "I love this LOFTILLA Bathroom Scale for Body Weight. These scales are good quality, lightweight, accurate readings, very easy to set up and use, and beautifully designed. I appreciate that it included the batteries. Highly recommend",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Accurate and Stylish Bathroom Scale",
    "rating": "5.0 out of 5 stars",
    "content": "The LOFTILLA Bathroom Scale stands out with its sleek design and accurate measurements. The tempered glass is both sturdy and stylish, blending well with any bathroom decor. The LED display is bright and easy to read, which is a nice touch. It handles up to 400 pounds, making it suitable for most users. This scale consistently provides precise readings and adds a modern look to my bathroom.",
    "post_time": "Reviewed in the United States on August 20, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Sleek",
    "rating": "5.0 out of 5 stars",
    "content": "Sleek design, appears to be very accurate",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "This bathroom scale is easy to use and works well.",
    "post_time": "Reviewed in the United States on August 18, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Nice and clear display",
    "rating": "5.0 out of 5 stars",
    "content": "This scale is heave and durable. The display is clear and easy to read. I thought the setup was easy and the scale seems accurate.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Off by more than 1 lb",
    "rating": "3.0 out of 5 stars",
    "content": "This scale is not too accurate and is off by about 1.4 lbs. Either that or the other Loftilla scale (app connected version) that I used to compare with is off. This scale is very small compared with my existing glass bathroom scale that I've been using the past 10 or so years as it is roughly 70% the width/length. Also the glass is about half the thickness of my existing one.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Basic digital scale",
    "rating": "3.0 out of 5 stars",
    "content": "Despite what the manual says, this scale does NOT connect with the app. They do sell one that does connect with the app and that is only a few more dollars extra. I tried that one as well and recommend it over this one.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "It seems to work fine as a scale, but never connected to the app.",
    "rating": "2.0 out of 5 stars",
    "content": "I doubt this scale could take the full 396 lbs without breaking since the glass is relatively thin.  I also don't recommend this for people with shoe size larger than around men's 9 (U.S.) since a large portion of your feet will be off the scale. Overall this scale is okay if you are not concerned about accuracy and don't mind a smaller scale.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D6RF2VFF"
},
{
    "title": "Love it",
    "rating": "5.0 out of 5 stars",
    "content": "Honest true scale not fake or false advertising quick shipping comes with batteries and it’s smart and connects to your phone i will recommend",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0D6RF2VFF"
}
]