[
{
    "name": "        voenxe Seamless Women Underwear Thongs,High Waisted No Show Ladies Panties,Breathable Comfortable Brief,Hi Rise Undies,5-Pack       ",
    "stars": [
        "74%",
        "16%",
        "5%",
        "1%",
        "4%"
    ],
    "pid": "B0D62PVG95",
    "ratings": "263 ratings",
    "other_info": {},
    "discount_price": "$ .",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "Most comfortable panties EVER!!!!",
    "rating": "5.0 out of 5 stars",
    "content": "I'm 5'6, 150 lbs. Got Mediums. These are the most comfortable panties EVER! It feels like wearing nothing. They're super soft and thin/breathable. They don't dig into the crack, excellent quality, the high waist is not super high, just enough it doesn't sit right in my Mom belly roll. They don't ride up or down or roll at all. Perfect panties!",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I FINALLY found a thing that isn’t irritating! These are so comfortable I actually forget I’m wearing a thong at all! Sits higher up which can sometimes show in low rise pants so be aware of that. The fabric is unique, super thin and breathable! I am 5’4 130 lbs size 2/26 pant, I wear a medium in these and they fit perfectly. Not too tight, not loose.",
    "post_time": "Reviewed in the United States on August 22, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Most comfortable thing ever",
    "rating": "4.0 out of 5 stars",
    "content": "I like the way these panties look, the patterns are super cute, and I like that they're seamless. I ordered my usual size, but they are a little bit big. They don't stay put and slide around a bit. They have a lot of give, so I think a smaller size would have been better for me. Otherwise, they seem good.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Great material, great fit, super light, very soft, I am absolutely happy and will order more now.",
    "post_time": "Reviewed in the United States on September 30, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "cute but a little big",
    "rating": "5.0 out of 5 stars",
    "content": "I typically don't wear thongs as I find them very uncomfortable that is until I found Voenxe Seamless Thongs!  They are so comfy that I forget I have them on!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Perfect!",
    "rating": "5.0 out of 5 stars",
    "content": "This pantries are so comfy. Got a M but it’s slightly big so I’ll probably get a size lower for my next purchase.",
    "post_time": "Reviewed in the United States on October 8, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These set of thongs are very comfortable and breathable especially in These hot summer days. The appearance was what I expected soft and nicely clinging to the body.  Must haves and Saved for future repeat orders.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Comfort No Show Thongs",
    "rating": "5.0 out of 5 stars",
    "content": "Favorite thong undies ever! Super comfortable and don't migrate - if you know what I'm saying lol",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have been struggling to find a thong that doesn’t ride up every crevice. Not only is this thong comfortable, but it stays put!! I’m ordering another set.",
    "post_time": "Reviewed in the United States on September 23, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Might need to size down",
    "rating": "5.0 out of 5 stars",
    "content": "This fabric is so soft and comfy! Buying more!",
    "post_time": "Reviewed in the United States on September 26, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Nice undies",
    "rating": "5.0 out of 5 stars",
    "content": "Great thong. Can’t tell you’re even wearing them. Medium fit in the length of crotch much better than a large but both are perfect side height to not roll down or bunch up",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am new to thong underwear and I have to say these are by far the most comfortable and love the fit",
    "post_time": "Reviewed in the United States on August 11, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Great fit",
    "rating": "5.0 out of 5 stars",
    "content": "Fits like higher end purchases at a great price - doesn’t bind or dig in.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "These are so pretty and the fabric is so very soft but I did not even try them on because the crotch was so narrow that I knew they were not what I was looking for. I would love some exactly like this, but about twice as wide in the crotch",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "New favorite",
    "rating": "1.0 out of 5 stars",
    "content": "These fit so perfectly at first. I especially love the width of the band and stomach coverage. However, within an hour, they stretch out at least two sizes. They ride up in places they do not belong. I am a large who sized down to a medium because of this. But the mediums are much too large after an hour. Disappointed.",
    "post_time": "Reviewed in the United States on October 11, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "These are super comfortable. Almost like you’re not wearing anything. It’s been about 90 degrees here and these kept me cool. They are seamless and very soft. I am a size small which’s what I ordered. I feel like these run a big on the big side. I also feel like the white color panty seems bigger than the others. Over all, I am happy with these.",
    "post_time": "Reviewed in the United States on June 16, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "VERY NARROW IN CROTCH",
    "rating": "4.0 out of 5 stars",
    "content": "_My wife liked the \"voenxe Seamless Women Underwear Thongs,High Waisted Cut No Show Ladies Panties,Breathable Comfortable Briefs Undies,5-Pack (Pattern, X-Large)\" high waist design. The way they constructed make for a seamless wear, fit good and stay put __",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This fit just as expected! Super comfortable and very flattering!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Great fit for under an hour",
    "rating": "4.0 out of 5 stars",
    "content": "I ordered these based on the size chart and they fit me perfectly. How can I not love colorful and comfortable panties that fit me well? These are great. They're stretchy and the fabric is soft against my skin. The designs look really good.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "These thongs are super cute and so comfortable. I love the nice designs and the great quality. They fit nicely on my waist without rolling down. They are true to size and they are truly seamless which I really love. They are the perfect thickness to be comfortable yet seamless and give me the coverage I'm looking for. Such a great deal for cute thongs.",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Comfortable and cute",
    "rating": "5.0 out of 5 stars",
    "content": "I really love these voenxe Seamless Women Thong Underwear. They are seamless and silky and so comfortable. They’re a tad big on me so I wish I would’ve gone a size down. I can still wear them though. The floral patterns are so pretty. I feel very feminine in these. I love them!",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "no shows!",
    "rating": "5.0 out of 5 stars",
    "content": "These are great no show panty line underwear. The designs are really fun and different. Highly recommend.",
    "post_time": "Reviewed in the United States on July 22, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "10000000% recommend 🤍",
    "rating": "5.0 out of 5 stars",
    "content": "Omg!! I just love these underwear!!! They are soooo comfortable and stretchy!!! I just love all the assorted colors!! Amazing quality and amazing value for the money!!! They are breathable and silky soft to the feel!! They wash very well too!!! 100000% recommend!!!!  Will definitely be purchasing more!!!",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "Super super comfortable! No lines show through when wearing.Washes and dries well. The print is perfect.",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Super cute and comfortable!",
    "rating": "5.0 out of 5 stars",
    "content": "These underwear are super soft to the touch. They are silky and smooth and seem very breathable. They fit very well and do not ride down. They are seamless so even when wearing leggings you cannot see the outline of your underwear.",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "very comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "I loved the cute prints and colors! So fun and cute! However, I wouldn't really consider these a thong. There's a lot more fabric in the back than in typical thongs. These are more like bikini/hipster cut. Not a bad thing, but something to pay attention to if you really want a thong.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Surprised by how much I liked these!",
    "rating": "5.0 out of 5 stars",
    "content": "I love these thongs!  The are very soft, comfortable, and breathable.  They seem to be true to size and and the high waist is nice.  It almost feels like you aren't wearing anything and you don't see any lines, even under leggings.  I love how fun and pretty the patterns and colors are.  They also held up well in the wash.  The price is great for 5 pairs.  I plan to by these in the solid colors as well.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Vibrant Colors and Patterns, Comfortable Material",
    "rating": "5.0 out of 5 stars",
    "content": "And I say that because virtually all of my thongs are not \"low-rise\" but certainly not high-waisted as these are. They are incredibly comfortable, and the fabric has a slight texture to it, I guess what makes them \"breathable\" as it says in the description. They're nice and silky, lay flat again the skin and are SUPER comfortable. No bunching, no rolling, very lightweight. They launder well and I just love them. I got the Basics (gray/navy/white/beige/black) in a size Small. I'm 5'3\", 110 lbs. and petite. Very happy with them and will likely order other colors.",
    "post_time": "Reviewed in the United States on June 19, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Well-made and comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "I really like the style and look of these underwear.  I'm constantly rotating through underwear just from changing outfits often and working out a lot.  It definitely makes it easy to grab and go and this set of five pair of underwear are a great addition to my collection. I can wear these under virtually anything, and they have an array of colors to match different outfits or undergarments!",
    "post_time": "Reviewed in the United States on June 13, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Love these!",
    "rating": "5.0 out of 5 stars",
    "content": "These are fantastic…they are incredibly soft and comfortable and what a great price! I appreciate the fact that they have a cotton gusset and they seem very breathable in general. I typically wear a size 7 or 8 in panties but knowing that things on Amazon typically run smaller, I ordered an extra large and they fit perfectly. FYI, I wear a 14/32 in dresses, pants, jeans and shorts. I have included a flat/unstretched measurement of the waist so that you may compare what you already have as it may help you decide if they will fit.",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Breathable--and SO Comfortable",
    "rating": "5.0 out of 5 stars",
    "content": "This set of seamless underwear by voenxe is perfection!",
    "post_time": "Reviewed in the United States on June 20, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Comfortable, not sweaty",
    "rating": "5.0 out of 5 stars",
    "content": "The underwear fit like a second skin and give the perfect amount of coverage without being too cheeky. There was no riding up and no falling down--they are the perfect breathable panty! Even being high-waisted, they are perfect for any outfit and do not leave visible panty lines.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Comfortable and seamless",
    "rating": "5.0 out of 5 stars",
    "content": "A new favorite!",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Silky smooth comfort",
    "rating": "5.0 out of 5 stars",
    "content": "I ordered the floral pack in size medium. I'm 5'8\" 125lbs and medium fit comfortably, could have done small if I wanted a tighter fit. The fabric is stretchy and has mesh holes throughout to make it breathable. There is a cotton lined gusset at the crotch area and the sides do have seams, but they are fairly flat and not scratchy. I've worn these on a hot summer day outside and they don't trap the sweat like a lot of these stretchy fabrics do. Overall, comfy and true to size, or size down.",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "voenxe Seamless Women Underwear Thongs,High Waisted Cut No Show Ladies Panties",
    "rating": "5.0 out of 5 stars",
    "content": "Great quality, the material is very nice and soft and washes well. Super cute designs.",
    "post_time": "Reviewed in the United States on June 22, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Cute",
    "rating": "5.0 out of 5 stars",
    "content": "Great fit, true to size.  Very comfortable, breathable fabric that stretches and moves with you.  The front gives more coverage than most thong style underwear, and is able to be worn all day without feeling irritated or annoyed by the strip in the back.  Best of all, no panty lines!",
    "post_time": "Reviewed in the United States on June 23, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Comfy",
    "rating": "5.0 out of 5 stars",
    "content": "These are comfortable panties. I typically wear a size 10/12 pants and the XL fit great.  Patterns are fun.",
    "post_time": "Reviewed in the United States on June 15, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Breathable",
    "rating": "5.0 out of 5 stars",
    "content": "Cute and stretchy and very nice front coverage",
    "post_time": "Reviewed in the United States on June 14, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Cute",
    "rating": "5.0 out of 5 stars",
    "content": "These are great. I wouldn't normally review panties, but these are so soft and comfortable.",
    "post_time": "Reviewed in the United States on June 12, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "So embarrassed",
    "rating": "3.0 out of 5 stars",
    "content": "I love these underwear. The designs are adorable. They are light weight and breathable. To me they are very comfortable to wear. I love the material it’s made out of.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "Comfy and cute prints",
    "rating": "5.0 out of 5 stars",
    "content": "These are very comfortable with stretchy fabric. No cutting into your skin. Feels smooth against your skin. Prints are pretty too.",
    "post_time": "Reviewed in the United States on June 18, 2024",
    "pid": "B0D62PVG95"
},
{
    "title": "So uncomfortable",
    "rating": "1.0 out of 5 stars",
    "content": "I didn't like these at all. They are so uncomfortable, ride up in all the wrong placed.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0D62PVG95"
}
]