[
{
    "name": "        Cold Press Juicer, ZASMIRA Juicer Machines for Vegetable and Fruit with Upgraded Juicing Technology, Powerful Quiet Motor, Compact Size for Space-Saving Juicer, Easy to Clean       ",
    "stars": [
        "81%",
        "9%",
        "4%",
        "0%",
        "6%"
    ],
    "pid": "B0DCNBLLPX",
    "ratings": "89 ratings",
    "other_info": {
        "Brand": "Zasmira",
        "Color": "Navy",
        "Special Feature": "Overheat Protection",
        "Product Dimensions": "11.23\"D x 6.95\"W x 11.66\"H",
        "Recommended Uses For Product": "Fruits, Vegetables"
    },
    "discount_price": "$ 99.27",
    "normal_price": "$99.98",
    "about_this_item": [
        " 【Enhanced Cold Press Technology】Zasmira cold press juicer features advanced 3-in-1 cold press technology, combined with 0.1mm ultra-fine compound grinding teeth ensures to extract juice which preserves vital nutrients and enzymes with enhanced purity and optimal absorption, making it an ideal choice for health-conscious individuals.  ",
        " 【Lock Design, Locked Nutrition, Juice \"JAR\"】 Zasmira juicer machines adopts the plug design to lock nutrition and avoid oxidation during juicing. Meanwhile, you can use it as a walking juice bottle to store the juice and drink it whenever you want or get a refill. This makes it a great helper for an outdoor picnic or a road trip.  ",
        " 【Compound Grinding Teeth Design】Zasmira mini juicer comes with innovative patent design with ultra fine up-down compound grinding teeth to filter the juice from the juice pulp. This design adds the fineness and purity to the juice, and also eliminates the hassle for mesh-strainer cleaning. Our juicer adopts streamlined design, all parts can be directly flushed clean.  ",
        " 【Compact and Lightweight for space saving】This cold pressed juicers designed with both functionality and aesthetics in mind. It equped with 100w Copper motor, which ensures stable and powerful performance to extract juice in a efficient way and keep the quiet operation.It has a sleek and compact design that seamlessly fits into any kitchen. Maximize your counter space.  ",
        " 【Ideal Gift with 3 Years of Warranty】Zasmira masticating juicer can handle a variety of ingredients from leafy greens, vegetables to soft fruits and hard fruits. With a 3-year warranty and 24/7 customer service, not only it is a practical addition to your kitchen, but also an ideal gift for you loved ones, let's cheer for health!  "
    ]
},
{
    "title": "Smaller thank I thought",
    "rating": "3.0 out of 5 stars",
    "content": "Compact. Design is good. Quality of juice is great. Just on the smaller size if you want to make alot of it to store not that great",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This small lightweight, USB-charged portable juicer is great for making smoothies or protein shakes. I can just screw the included lid on the cup and take it with me, or put the whole unit in my bag for smoothies on the go. It’s surprisingly powerful for its size. It came with 2 8-oz cups for attaching to the juicer, 1 lid, and 1 silicone ring. To clean it, I just put dish soap and water into the cup attachment and run the juicer for a few seconds. The instructions aren’t very in-depth or clear but it seems pretty self-explanatory.",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Mighty little juicer",
    "rating": "5.0 out of 5 stars",
    "content": "This is a easy quick, very fast method for my fruits when I'm on the go. Is very easy to clean I wash it by hand. It's not noise at all. The style by itself is so beautiful it's worth the money and the quality is great y'all should get one.",
    "post_time": "Reviewed in the United States on April 22, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I recently purchased this portable juicer, and I am extremely satisfied with its performance. One of the standout features is its convenience; it allows me to make smoothies on the go effortlessly. The juicer is surprisingly powerful for its size, ensuring smooth and consistent blends every time. Another highlight is its easy cleaning process, which is a huge time-saver. Overall, I highly recommend this juicer for anyone looking for a convenient and efficient way to enjoy fresh smoothies.",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "For my fruits",
    "rating": "5.0 out of 5 stars",
    "content": "I like this product because it is easy to use. It is easy to clean. This these to points it make you motivated to make juice. It is small enough to sit on your counter. It pressed the fruit and veggies good. The results are dry so you k now you are getting all the juice out of the product. The containers are good to hold the juice. The juicer is not loud so you can use it at night or early in the morning. Good buy.",
    "post_time": "Reviewed in the United States on December 17, 2023",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like using shaker bottles for protein shakes; but sometimes the clumps are just so annoying and impossible to get rid of. This thing is excellent for that use. A few seconds of use and perfectly smooth protein shakes. It seems strong enough to do some frozen fruit smoothies; but bigger workloads will probably need a more powerful blender. Excited to keep using this.",
    "post_time": "Reviewed in the United States on February 7, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Powerful and Convenient Portable Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "I love this product!!!! I’ve had several juicers but this one tops them all! It’s easy to use & clean. It’s the perfect size for my kitchen counter, does not take too much space. I recommended this juicer to my friends & family, they were all pleased with it as well!!!!I",
    "post_time": "Reviewed in the United States on February 29, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This little juicer packs a big punch. No job is too big! I've tried oranges, cantaloupe, apples..... Even skme chunks of grilled chicken for my dachsaunds dinner. I love that it comes with two glasses cause i can make two drinks at one time.",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "Travel size.  Plastic,  so durable.  2 bottles,  so you can prep 2 drinks.  Not good for juicing fruit, but good for mixing protein powders or broth powders.",
    "post_time": "Reviewed in the United States on February 28, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this juicer! I use it to juice and it’s awesome!! The quality was surprisingly nice considering the price!! You won’t be disappointed!!",
    "post_time": "Reviewed in the United States on March 14, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Very fast!",
    "rating": "5.0 out of 5 stars",
    "content": "This product does a really nice job when I need a quick breakfast. Easy to take apart and clean. Very safe for younger kids to use as well. Highly recommend!",
    "post_time": "Reviewed in the United States on February 22, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Im started doing Protein shakes and this is great for doing my shake at the office, or at home on vacation. Easy to clean, great quality and price",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Great for to go",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is great and convenient. Easy to use and doesn’t take up a lot of space. Recommended.",
    "post_time": "Reviewed in the United States on March 5, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is great for a quick smoothie.  Easy to use and easy to clean.  I use this every day!",
    "post_time": "Reviewed in the United States on February 21, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Great juicer!",
    "rating": "5.0 out of 5 stars",
    "content": "I love it! It's super practical and good quality! And what I was looking for months ago, the perfect size, what I can take anywhere. ❤️",
    "post_time": "Reviewed in the United States on February 7, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Very powerful and does not make a lot of noise when juicing. I really like its compact size making it a space saver for my kitchen. Very easy to clean and very easy to use.",
    "post_time": "Reviewed in the United States on January 9, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Awesome juicer for on the go or just at home",
    "rating": "5.0 out of 5 stars",
    "content": "My kids love juice! So I tried this juicier machine and it’s just perfect ! Like it!",
    "post_time": "Reviewed in the United States on February 22, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is very easy to use and practical to make juice",
    "post_time": "Reviewed in the United States on February 21, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Love so much!",
    "rating": "1.0 out of 5 stars",
    "content": "Ordered this sleek juicer in Navy Blue. Very attractive and easy to assemble and use.",
    "post_time": "Reviewed in the United States on September 25, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "Worked beautifully twice and I was raving over it up until the 3rd use. Then the fruits and veggies dropped straight down without the chewing process so no pulp and no juice was being extracted. Blade spinning and motor running but no juicing action.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Great!",
    "rating": "5.0 out of 5 stars",
    "content": "Love this!",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Blender",
    "rating": "5.0 out of 5 stars",
    "content": "Tried this and was amazed and it really juices the flavor from the fruits and very easy to use the weight is light weight so far durable and small value for money so far is great and worth it",
    "post_time": "Reviewed in the United States on September 13, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Amazing Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "I love this juicer so much , it’s easy to use, it’s good quality. I enjoy juicing now and it’s very easy to clean.  Performs really well worth every penny and not too much noise.",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Easy portable blender",
    "rating": "5.0 out of 5 stars",
    "content": "The blender is easy to use since there is not much to it . Cup is very thick and durable . Cup also comes with a nice screw top with spout . Charges quick and is the same charger for smartphones.",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It is not dishwasher safe or good to use for nuts, beans or grinding meat. I’m just making smoothies so I’m not overloading the machine .",
    "post_time": "Reviewed in the United States on February 13, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Great juicer",
    "rating": "5.0 out of 5 stars",
    "content": "If you’re looking for a portable blender , this is a good choice . I’m excited to take this blender out camping since it’s small and portable but would be good to take to the office if you’re in the mood for some smoothies .also would be good to make baby food with .",
    "post_time": "Reviewed in the United States on November 18, 2023",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer has been amazing especially doing my morning runs I’ll throw some fruits and juice in it blend it real quick and put it in the portable cup and off I go it’s quick and easy plus an affordable price",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "This juice machine is a game-changer! It's super easy to use and extracts every last drop of juice. Cleaning up is a breeze with dishwasher-safe parts. The sleek design adds style to your kitchen. Get ready for delicious and nutritious juices every morning.",
    "post_time": "Reviewed in the United States on February 5, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is so useful when you’re in a rush but want a healthy drink ! Really great quality",
    "post_time": "Reviewed in the United States on February 20, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Loved it !",
    "rating": "5.0 out of 5 stars",
    "content": "Super easy to use, very compact, and very easy to store. I'm always on the go. This gadget is purse size and It’s easy charge and clean! Simple to operate and it is travel friendly! I love this!Perfect to take it to work or the gym .",
    "post_time": "Reviewed in the United States on February 21, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "excellent",
    "rating": "5.0 out of 5 stars",
    "content": "I loved it because now I can make my shake wherever I want to take my protein, its charge is long-lasting and very practical",
    "post_time": "Reviewed in the United States on February 9, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Excelente batidora me ayuda mucho para mis batidos y jugos lo recomiendo doy 5 estrella",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Excelente batidora",
    "rating": "5.0 out of 5 stars",
    "content": "It doesn't take up much counter space, making it ideal for smaller kitchens like mine. The design is sleek and modern, adding a touch of elegance to my kitchen. The parts are easily disassembled and can be cleaned in no time. The stainless steel components not only contribute to the juicer's durability but also make the cleaning process efficient and hassle-free.",
    "post_time": "Reviewed in the United States on November 26, 2023",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am so in love with this juicer! I couldn’t wait to get, and now I’m so impressed. It is very quick and expresses juice with very little leftovers. I might buy another one for Christmas for my sister!",
    "post_time": "Reviewed in the United States on November 17, 2023",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Powerful",
    "rating": "5.0 out of 5 stars",
    "content": "The blender was smaller than I imagined, but perfect for morning smoothies on the go and the blending cups transition to drinking cups, which is helpful.",
    "post_time": "Reviewed in the United States on March 5, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s easy to clean and fits anywhere since I can take it apart.",
    "post_time": "Reviewed in the United States on February 22, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Wow!",
    "rating": "5.0 out of 5 stars",
    "content": "This little juice packs a punch! I've used it several times now, and it works like a charm. It's easy to clean up, and not loud at all. I can't wait to try more varieties of juicing with this machine!",
    "post_time": "Reviewed in the United States on February 27, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use this to make juice almost every morning and it works very well. It’s super easy to use and to clean.",
    "post_time": "Reviewed in the United States on February 23, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Cute little blender",
    "rating": "5.0 out of 5 stars",
    "content": "exceeded my expectation! It's super good, it doesn't make noise, it fits anywhere you put it and super easy to clean. The juices are very rich. 100 percent recommended",
    "post_time": "Reviewed in the United States on February 10, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This blender is so fun to used out of the house and for small shakes! It work perfect for smoothies ♥️",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Great buy!",
    "rating": "5.0 out of 5 stars",
    "content": "worth the money, great little juicer! It’s portable and quite. Very easy to clean and love that it comes with a drinkable spout top! Definitely would recommend",
    "post_time": "Reviewed in the United States on February 2, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I needed a compact and powerful juicer machine for my small kitchen. This one easy to handle, clean and store. 100% recommended, now I can have my fresh pressed morning juice 🥳",
    "post_time": "Reviewed in the United States on February 21, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "This is just what I needed",
    "rating": "5.0 out of 5 stars",
    "content": "Awesome little portable blender. Love that is rechargeable and small. Easy to take on long car rides or toss in my lunch box for work. Comes with 2 cups and 1 lid to attach to the cup to drink from.",
    "post_time": "Reviewed in the United States on February 15, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This things is amazing very handy to make smoothies .",
    "post_time": "Reviewed in the United States on February 28, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Great mini portable blender",
    "rating": "5.0 out of 5 stars",
    "content": "Comes with two cups makes good mix drinks .",
    "post_time": "Reviewed in the United States on February 10, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Easy operate  charges fast battery last compact design. Easy to pack .",
    "post_time": "Reviewed in the United States on July 12, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "Well worth it for price very happy . Make good gift to anyone",
    "post_time": "Reviewed in the United States on February 26, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a small compact blender perfect for the health conscious person who wants to have a fresh smoothie or juice on the go. The blender is powerful and rechargeable.",
    "post_time": "Reviewed in the United States on February 9, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Compact but powerful",
    "rating": "5.0 out of 5 stars",
    "content": "Good quality",
    "post_time": "Reviewed in the United States on February 28, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This was great to add to my kitchen! Not a huge bulky item so it doesn’t take up too much storage room and it works great! Easy to use and does not make a lot of noise which is nice.",
    "post_time": "Reviewed in the United States on February 21, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "I thought it would be bigger but it’s okay",
    "rating": "5.0 out of 5 stars",
    "content": "Size is on the go literally mini it’s cute and works great does have lots of power to mix up everything in there",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Loved it! Made my life so easy since I don’t have to plug in every time I want to make juice. It’s super easy to carry and doesn’t need much space. I’d definitely recommend it.",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Very convenient",
    "rating": "5.0 out of 5 stars",
    "content": "Guys, let me tell you about this mini portable blender! It's seriously a game-changer! I'm always on the run, whether it's for class, the gym, or just hanging out with friends, and this blender has become my new bestie.",
    "post_time": "Reviewed in the United States on February 26, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "First off, it's tiny but mighty. I can throw it in my backpack or purse without it taking up much space, which is a total win. And when it comes to blending power, it's no joke. I've thrown everything from frozen berries to kale in there, and it blitzes it all up into the smoothest smoothies in, like, seconds.",
    "post_time": "Reviewed in the United States on February 27, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Sleek and Handy Mini Blender for Smoothie Lovers",
    "rating": "5.0 out of 5 stars",
    "content": "Battery life is solid too. I can use it multiple times without needing to recharge, which is awesome for a forgetful person like me. Plus, it's dishwasher safe for lazy days – can't beat that.",
    "post_time": "Reviewed in the United States on March 4, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Seriously, if you're into smoothies and always on the move, you need this blender in your life. It's convenient, powerful, and just plain awesome.",
    "post_time": "Reviewed in the United States on March 16, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "SO GLAD I GOT THIS!!",
    "rating": "5.0 out of 5 stars",
    "content": "5 out of 5 stars, hands down!",
    "post_time": "Reviewed in the United States on February 19, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is super perfect to jumpstart my health journey! I’m doing everything I can to stay on the right path and adding this to it will help ALOT!! Affordable, no issues with shipping & delivered at expected date. 100% recommend.",
    "post_time": "Reviewed in the United States on November 23, 2023",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Great for the office",
    "rating": "5.0 out of 5 stars",
    "content": "I took this to the office to make healthy juices and love it.",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Super facil de usar y transportar, su tiempo de carga super corto y duradero , triturado preferentemente sin duda mi mejor compra 🥰",
    "post_time": "Reviewed in the United States on February 7, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Very Happy.",
    "rating": "5.0 out of 5 stars",
    "content": "Excellent blender to solve my juices and smoothies in the morning, it is very practical and easy to use, I really liked it and the shipping was quite fast. 100% recommendable. So happy with My purchase, i receive the package on time and un excelent condition.",
    "post_time": "Reviewed in the United States on February 12, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Wow product is excellent love it use it today for the first loved it. Will make juice every day going forward taste so delicious 👍👍👍👍👍",
    "post_time": "Reviewed in the United States on February 4, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Excellent produc would recommend to every one",
    "rating": "5.0 out of 5 stars",
    "content": "I've used this little juicer the past couple mornings since I received it, I just absolutely love it! It is rechargeable, so I can go ahead and put my smoothie stuff in the cups the night before and have the base in my work bag ready to go, then I just have to grab the cups and head off and can make my smoothie whenever I'm ready for it. I'm always running behind so I love that I can do this now! It comes with 2 cups to attach so I have 1 for my breakfast and 1 at lunch, it's really powerful to be small and blends everything wonderfully!",
    "post_time": "Reviewed in the United States on February 10, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This juicer is unbelievably great, quality is A+. It fits everywhere, the money is worth paying for. You can add any fruit and it will blend it perfectly. It is very easy to clean",
    "post_time": "Reviewed in the United States on February 6, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Great for on the go!",
    "rating": "5.0 out of 5 stars",
    "content": "This is a good juicer and smoothie machine, you can take it with you anywhere: for travel, trips, etc. The machine is small, but powerful, easy to use and easy to clean. Overall, good quality product. It does exactly what it’s supposed to do, and is very simple to use. This is definitely something to add to your kitchen would definitely recommend.",
    "post_time": "Reviewed in the United States on February 25, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I'm surprised at how much power that little machine has; it's perfect for preparing protein at the gym.\"",
    "post_time": "Reviewed in the United States on February 13, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "It's easy to use and perfect for on-the-go juicing. The compact design makes it ideal for short travel. recommend for anyone looking for convenient and portable juicing option.",
    "post_time": "Reviewed in the United States on February 24, 2024",
    "pid": "B0DCNBLLPX"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "My old juicer can only get less than half of the juice comparing to this one. Would recommend because of the saving from all the fruits you have to buy. Save me time hand squeeze the remain of the fruits.",
    "post_time": "Reviewed in the United States on December 9, 2023",
    "pid": "B0DCNBLLPX"
}
]