[
{
    "name": "        Juicer Machines, ECOSELF Cold Press Juicer with 4.35\" Large Feed Chute Fit Whole Fruits & Vegetables, Slow Masticating Juicer Self Feeding Effortless for Batch Juicing, High Juice Yield       ",
    "stars": [
        "70%",
        "11%",
        "5%",
        "3%",
        "12%"
    ],
    "pid": "B0DFBGHC7M",
    "ratings": "270 ratings",
    "other_info": {
        "Brand": "ECOSELF",
        "Color": "Carbon Black",
        "Special Feature": " ",
        "Product Dimensions": " ",
        "Finish Type": " "
    },
    "discount_price": "$ 99.99",
    "normal_price": "$189.99",
    "about_this_item": [
        " Large Feed Chute & Compact Design：Our juicer machines upgraded 4.35\" inch large feed chute and 40oz capacity is larger than normal, while the size is smaller. You can juice whole fruits and vegetables without chopping. Moreover, the slow juicer doesn't take up too much space on a kitchen counter, which fits for a small kitchen, and can be carried to any part of the kitchen easily.  ",
        " Powerful Motor & Efficient High Yield：With a High-power motor, our cold press juicer separates the pulp from the juice well, providing you with better-tasting, purer juice. Cold press technology maximizes the retention of nutrients and reduces oxidation, extracting a high yield of vitamins for your satisfying juicing experience. Enjoy fruit and vegetable juices such as apple, carrot, orange, watermelon, ginger, celery, tomato and more!  ",
        " Easy to Assemble & Clean：Our ECOSELF masticating juicier features a hopper & screen integrated design, which can be easily assembled and disassembled in minutes, and is also easy to clean. Except for the motor base, other parts can be quickly cleaned with water, with an included brush for a hassle-free cleanse.  ",
        " One-button Operation & Safety Design：It is easy to operate with a simply rotating button. You can enjoy fresh juice with ease. And the reverse function helps prevent clogging. The juice maker will automatically stop working if the cover is open accidentally while juicing, which is safer for children.  ",
        " Protection Service & Brand Story：We provide 24 months of Repair and Replacement Service. Get in touch with us whenever you need. We will reply to you within 24 hours. ECOSELF is committed to providing customers with better service and shopping experience.  ",
        " Troubleshooting Steps：The juicer can only be powered on and work normally after it is fully assembled. Rotate hopper clockwise to align Guidemark with Lock symbol, then close the hopper cover, and ensure full assembly before powering up the juicer.  "
    ]
},
{
    "title": "Great additional to my health routine",
    "rating": "5.0 out of 5 stars",
    "content": "I am absolutely happy to have decided to buy this Ecoself Juice machine. I put it right to the test and it works great. Cleaning is a breeze as well. Definitely worth the money!",
    "post_time": "Reviewed in the United States on October 9, 2024",
    "pid": "B0DFBGHC7M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this juicer to replace my old one. This one is much easier to operate and get more juice than my old one. The best thing is it is so easy to clean. All the parts can be taken off to wash. I like this juicer very much.",
    "post_time": "Reviewed in the United States on September 24, 2024",
    "pid": "B0DFBGHC7M"
},
{
    "title": "Great Juicer",
    "rating": "5.0 out of 5 stars",
    "content": "The best juice extractor I have had so far. The wide mouth hopper is so convenient, you can place all your items at the ame time instead of little by little through a chute. It is quiet and powerful. Easy to assemble and disassemble.",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0DFBGHC7M"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Hey, folks! This juicer has exceeded all my expectations. It's incredibly easy to use, even for a juicing beginner like me. The process is smooth and efficient, producing delicious, nutrient-packed juices every time. And the cleanup is breeze! Everything comes apart with ease, making washing is a quick and hassle-free task. I'm so glad I made this purchase - it's become a staple in my healthy lifestyle routine. Highly recommend!",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0DFBGHC7M"
},
{
    "title": "Quiet and powerful",
    "rating": "5.0 out of 5 stars",
    "content": "Hey there! This juicer has totally changed my mornings for the better. It's incredibly easy to use - just pop in your fruits and veggies, press a button, and in seconds, you've got a fresh, delicious juice. No hassle, no mess! Plus, cleaning it up is a breeze. All the parts come apart easily and can be rinsed or popped in the dishwasher. Seriously, can't recommend it enough for anyone looking to add more fruits and veggies to their diet. Happy juicing!",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0DFBGHC7M"
}
]