[
{
    "name": "        OSEA Undaria Body Bestsellers Full Size Set – Includes Undaria Algae Body Oil 5oz & Undaria Algae Body Lotion 5oz – Hydrating & Firming Body Care – Perfect Holiday Gift Set       ",
    "stars": [
        "100%",
        "0%",
        "0%",
        "0%",
        "0%"
    ],
    "pid": "B0DG4DD6WT",
    "ratings": "1 rating",
    "other_info": {
        "Item Form": "Oil, Lotion",
        "Brand": "OSEA",
        "Product Benefits": "Hydrating, Moisturizing, Nourishing",
        "UPC": "675468103381"
    },
    "discount_price": "$ 68.",
    "normal_price": "$13.60",
    "about_this_item": [
        " Age-Defying Skincare Duo: This best-selling pair of Undaria seaweed-packed body care essentials transforms dry, distressed skin into soft, hydrated, and glowing skin with every use.  ",
        " Undaria Algae Body Oil (5oz): Clinically proven to improve skin elasticity while delivering deep moisturization, leaving skin firm, smooth, and radiant.  ",
        " Undaria Algae Body Lotion (5oz): Scientifically proven to visibly firm skin in just 4 hours, this ultra-hydrating, lightweight lotion is packed with undaria algae and hyaluronic acid for long-lasting hydration.  ",
        " Pro Tip for Layering: For optimal hydration and glow, apply the Undaria Algae Body Oil first, then layer the Undaria Algae Body Lotion on top for a radiant, moisturized finish.  ",
        " Perfect Holiday Gift: Ideal for gifting, this luxurious full-size duo is a thoughtful holiday treat, offering a spa-like experience and age-defying results in one set.  "
    ]
},
{
    "title": "Very Clean & Great For All Skin Types",
    "rating": "5.0 out of 5 stars",
    "content": "This skincare set is really very nice and seems as though it would be excellent for all skin types. It's wonderful on my mature combination skin. Provides moisturization without leaving unwanted residuals along the surface of the skin. Well balanced and does not upset the oilier side of my complexion, yet it hydrates my skin and makes if more supple and elastic. I really love each and every one of these items.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0DG4DD6WT"
}
]