[
{
    "name": "        HOBOT-2S Window Cleaning Automatic Robot with Ultrasonic Water Spray, Intelligent Cleaning, AI Smart Route Plan, Dual Replaceable Water Tanks, and Control via Smartphone or Remote       ",
    "stars": [
        "51%",
        "8%",
        "13%",
        "8%",
        "20%"
    ],
    "pid": "B097CM7P9L",
    "ratings": "55 ratings",
    "other_info": {},
    "discount_price": "$ 399.",
    "normal_price": "",
    "about_this_item": [
        " Effortless and efficient cleaning: Innovative ultrasonic water spray nebulizes water into dense mist to deliver unparalleled cleaning results without leaving water stains. A powerful vacuum (7kg ascending power) safely attaches the robot to the surface while extracting dust and removing all impurities.  ",
        " Safety and reliability design: An auto-adjustable pneumatic pad automatically controls the driving force and keeps the force between the caterpillar treads and cleaning cloth in balance. Auto-edge detection with AI-smart route planning navigates the robot in zigzag pattern in horizontal and vertical directions suitable for frameless windows. A long (15 ft) safety rope and embedded UPS (Un-interrupted Power System) prevents the robot from falling in case of a power outage.  ",
        " Large cleaning area and position memory: Large size (9.5 X 9.5 inches) cleaning cloth with extended corner coverage to reach deep into corners. Long power and included extension cords provide a wide range of cleaning coverage ideal for not only residential use but also small-scale businesses such as restaurants, cafes, offices, etc. The robot automatically returns to its starting point once the window is cleaned, ensuring easy access and removal in hard-to-reach areas.  ",
        " Dual replaceable water tanks and edge-leakage sensor: In case the ultrasonic spraying nozzle is clogged, simply replace the entire water tank or spraying nozzle with a standard screw driver. The edge-leakage sensor technology can detect air leakage caused by the slight lift around the window seal or the edge of the frameless windows.  ",
        " Voice Prompt. AI-technology and Control via Smartphone APP or Remote. 3 programs for automatic cleaning of surfaces. OTA Firmware update.Receive notifications and alerts on your smartphone, such as when a task is completed, by installing HOBOT APP. Please read the included manual before use. You can also use the link to video tutorial on the box. The robot works with power cord ONLY. Do NOT use on frames with non-rectangular (rounded) edges. Minimum surface cleaning area is 15х15 inches for glass of any thickness. FAQ are found on our Amazon store page.  "
    ]
},
{
    "title": "Use dry cycle first, change the pads l, and then run wet cycle with sprayer on for best results",
    "rating": "5.0 out of 5 stars",
    "content": "I have to admit I was somewhat skeptical, but after getting one I am very impressed. It cleaned my four large windows in about an hour with great results. Instructions are easy to follow and it's simple to use. We also used it to clean the shower cabin. It's expensive but definitely worth the investment.",
    "post_time": "Reviewed in the United States on June 6, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "IT STARTS CLEANING BUT NEVER GOES UP.  JUST GOES DOWN.  THE PREVIOUS VERSION WAS MUCH BETTER.  IT WORKED AND CLEANED GLASSES AND WINDOWS.  UNFORTUNATELY THIS VERSION SEEMS TO HAVE AN ISSUE WITH THE ROTOR BAND.",
    "post_time": "Reviewed in the United States on June 25, 2022",
    "pid": "B097CM7P9L"
},
{
    "title": "IT DOESN'T WORK.",
    "rating": "5.0 out of 5 stars",
    "content": "I Purchased this because at the age of 70 my glass sliding doors in Florida need cleaning a lot more than I am able to do. A bit skeptical, I opened the product, followed the directions,  and put it to work. Took a few minutes to get used to it, but it is user-friendly. I am extremely pleased with the results. Although the cleaning fluid seems a bit pricey, it takes very little to complete a large square footage of windows and doors. Don’t take any shortcuts, and you will be pleased with the results as well.",
    "post_time": "Reviewed in the United States on May 24, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Likes:",
    "post_time": "Reviewed in the United States on May 25, 2022",
    "pid": "B097CM7P9L"
},
{
    "title": "Unusually true to its advertising!",
    "rating": "5.0 out of 5 stars",
    "content": "Easy to place on window and get it cleaning.",
    "post_time": "Reviewed in the United States on June 7, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Reaches the top of tall windows, so I don't have to pull out a ladder.",
    "post_time": "Reviewed in the United States on October 3, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "95% of the way there",
    "rating": "4.0 out of 5 stars",
    "content": "Lots of extras in the box. Cleaner, extra cleaning pads, and extra replacement nozzles",
    "post_time": "Reviewed in the United States on March 14, 2022",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Dislikes",
    "post_time": "Reviewed in the United States on June 27, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "Highly recommend!",
    "rating": "3.0 out of 5 stars",
    "content": "Does not clean 100% on all windows. The outside of my windows have a bezeled edge and it has trouble knowing where the edge of the window is which causes it to miss cleaning about 5% of the window. The inside of my windows are better but it can still miss corners and the very top and bottom.",
    "post_time": "Reviewed in the United States on April 2, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I feel like the cleaning patterns could be a little smarter around edges and corners of windows. Hopefully that improves with software updates.",
    "post_time": "Reviewed in the United States on June 25, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "Very satisfied!",
    "rating": "5.0 out of 5 stars",
    "content": "I totally love my window robot. I’ve already used it on windows, mirrors, and my granite counter tops. It works quieter than expected and having two water tanks that spray over cleaning area efficiently is awesome. The pads are very durable and easy to wash, and it even comes with a bottle of detergent!",
    "post_time": "Reviewed in the United States on June 22, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This window cleaning device works as described. Very happy to let the HOBOT do the work!",
    "post_time": "Reviewed in the United States on August 29, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "HOBOT 2S",
    "rating": "5.0 out of 5 stars",
    "content": "It still takes time to move the robot around the house as it completes the washing but I can easily be doing other things while the windows are being cleaned.",
    "post_time": "Reviewed in the United States on June 25, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I've already used a similar robot in the past. The dual spray is an amazing thing. Don't need to spray cloths manually anymore. The best part is you can clean your window more often because you don't need to spend time cleaning. Just put the robot on a window that's it.",
    "post_time": "Reviewed in the United States on January 2, 2022",
    "pid": "B097CM7P9L"
},
{
    "title": "Happy with this robot. ❤️❤️❤️❤️",
    "rating": "5.0 out of 5 stars",
    "content": "I found that the Hobot 2S was very easy to use. It works best on a window that is not filthy. The cleaning cloth only cleans a small amount of dirt before you need a clean one to replace it. I ordered 3 more cleaning pads and may end up ordering more. Once the dirty to clean ratio of the cleaning cloth is to the clean side, it does a great job and doesn't leave streaks on the window. I think it will be my window bot friend for a long time. I am quite happy with the job that it does.",
    "post_time": "Reviewed in the United States on June 12, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This will save you money especially if you have large windows and hard to reach areas. The robot is easy to set up and requires no supervision. It comes with a bottle of cleaning detergent and extra pads. Customer service is excellent. Do yourself a favor and get this window cleaner!",
    "post_time": "Reviewed in the United States on July 4, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "I love letting the robot do all the work",
    "rating": "5.0 out of 5 stars",
    "content": "I love the robot. It’s easier to wash windows and mirrors, which means my house will always be brighter.  I just turn on the hobot and do housework while it polishes.  I am very happy with the purchase.",
    "post_time": "Reviewed in the United States on June 14, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It did a good job cleaning our exterior windows, that was a hard to reach area and we could never get our windows looking clean and shiny. Problem solved,  we are happy!",
    "post_time": "Reviewed in the United States on July 3, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "Way better than cleaning windows yourself or paying someone",
    "rating": "1.0 out of 5 stars",
    "content": "My wife has found it so helpful around the household. We have clean windows and shower everyday now. So cool.",
    "post_time": "Reviewed in the United States on February 5, 2022",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The device is insufficiency designed. Can't map out a window and therefore creates inconsistent pathways and incomplete cleaning. Gets stuck/confused against simple linear surfaces. If car companies can keep their autonomous vehicles from running over your dog I would assume the technology exists to design a product that can work around a rectangle without getting confused.  It doesn't with this product.",
    "post_time": "Reviewed in the United States on December 9, 2022",
    "pid": "B097CM7P9L"
},
{
    "title": "A",
    "rating": "5.0 out of 5 stars",
    "content": "A",
    "post_time": "Reviewed in the United States on June 8, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s perfect for my house with big windows",
    "post_time": "Reviewed in the United States on December 19, 2022",
    "pid": "B097CM7P9L"
},
{
    "title": "Excelente product",
    "rating": "1.0 out of 5 stars",
    "content": "Really really wanted to love this. It sprayed the window edges, scrubbed the edge of the window, left marks all over and skipped finger prints. Windows were barely dirty and I feel like this left even more marks. Hope this technology keeps improving and works eventually",
    "post_time": "Reviewed in the United States on April 3, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "It’s little belt driven system doesn’t seem to have enough traction to properly move up on large window surfaces. Moving down works fine, so I suppose if you have a small window you start it at the top. However, if you need to go higher than you can reach - the whole point of having it for me - it simply does not work. Waste of money.",
    "post_time": "Reviewed in the United States on February 6, 2022",
    "pid": "B097CM7P9L"
},
{
    "title": "Leaves smear marks everywhere",
    "rating": "5.0 out of 5 stars",
    "content": "sometimes it gets stucked while cleaning",
    "post_time": "Reviewed in the United States on December 6, 2022",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "It is a device that speaks and does not work",
    "post_time": "Reviewed in the United States on December 10, 2021",
    "pid": "B097CM7P9L"
},
{
    "title": "Doesn’t work. Can’t clean large windows",
    "rating": "1.0 out of 5 stars",
    "content": "Most of the times simply does not run or runs sporadically.",
    "post_time": "Reviewed in the United States on March 22, 2023",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "When cleaning - keeps getting stuck for \"power failure\" and/or \"air leakage\" with no reason.",
    "post_time": "Reviewed in the United States on December 24, 2021",
    "pid": "B097CM7P9L"
},
{
    "title": "sometimes it gets stucked while cleaning",
    "rating": "5.0 out of 5 stars",
    "content": "Spray works only half the times.",
    "post_time": "Reviewed in the United States on November 16, 2021",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Finishes in locations out of reach! How stupid can it be???",
    "post_time": "Reviewed in the United States on December 21, 2021",
    "pid": "B097CM7P9L"
},
{
    "title": "fun to watch it working",
    "rating": "5.0 out of 5 stars",
    "content": "I'm impressed it was able to clean the bathroom tile wall , I even tested it to cleaned the windows of my store from the outside and strapped it down just in case but it didn't fall, the suction is very strong, overall a very handy robot , it's got an app for the phone that is user friendly and it saves me a lot on window cleaning services.",
    "post_time": "Reviewed in the United States on November 20, 2021",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Another great AI Technology.",
    "post_time": "Reviewed in the United States on January 16, 2022",
    "pid": "B097CM7P9L"
},
{
    "title": "iHome Must Have.",
    "rating": "5.0 out of 5 stars",
    "content": "It is easy and fun to use. My lazy friend has one. Looks like it will be my Xmas present for my girlfriend",
    "post_time": "Reviewed in the United States on December 2, 2022",
    "pid": "B097CM7P9L"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I have tried a few window-cleaning robots, but this one is THE WINNER! It cleans very well, makes no noise! Will suggest to anyone!",
    "post_time": "Reviewed in the United States on June 26, 2023",
    "pid": "B097CM7P9L"
},
]