[
{
    "name": "        Tai Chi Fit: ALZHEIMER'S & Dementia Prevention & Relief with David-Dorian Ross Protect the Brain with Easy Mind/Body Exercise       ",
    "stars": [
        "85%",
        "15%",
        "0%",
        "0%",
        "0%"
    ],
    "pid": "B09FRNZHN1",
    "ratings": "20 ratings",
    "other_info": {
        "Genre": "Exercise & Fitness, Special Interest, Exercise Fitness, Faith & Spirituality",
        "Format": "DVD",
        "Runtime": "40 minutes",
        "Studio": "YMAA Publication Center",
        "Manufacturer": "YMAA Publication Center"
    },
    "discount_price": "$ 16.",
    "normal_price": "",
    "about_this_item": []
},
{
    "title": "its a gentle relaxing routine.",
    "rating": "5.0 out of 5 stars",
    "content": "This program seems to me to be perfect for the 30min or less  morning wake up  or before bed  or time out  from the day. It refreshens, and relaxes. More of a flow in the rhythm than some of the more involved dvd strengthen/balance routines. This is not a complaint. I have arthritis and with it go good days bad days . Its nice to have a routine that can be worked on either. Its a good DVD to have!",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B09FRNZHN1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I use the DVD for my own work out and to lead a group at the local senior citizen center. I have used several of David-Dorian Ross' DVDs. By checking them out from the library, I've been able to try out quite a few of them. This is the first that I've purchased w/o trying it first. My experience w/his DVDs told me that I would probably like this one as well. I'm very glad that my instinct was correct! It is a clear and gentle work out that will work well in our rotation of some of his other DVDs. Thanks! I hope to continue to 'keep breathing, keep moving, and keep smiling' for a long, long time and to help others to do the same.",
    "post_time": "Reviewed in the United States on April 25, 2022",
    "pid": "B09FRNZHN1"
},
{
    "title": "Very clear and gentle work out.",
    "rating": "5.0 out of 5 stars",
    "content": "Eons ago (15 or so) , I had taken some courses in Tai Chi/Qigong and thoroughly enjoyed them.  Unfortunately I was paired with a class a bit more advanced than I was and decided to discontinue as I was getting frustrated in not learning the form.  But, I would be lying if I didn’t say I missed it.",
    "post_time": "Reviewed in the United States on January 10, 2022",
    "pid": "B09FRNZHN1"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Over the years I picked up a DVD on Qigong and did a routine based on this for quite a long time.  I was contemplating getting back to it, when Amazon had this DVD in their Vine program.",
    "post_time": "Reviewed in the United States on March 30, 2022",
    "pid": "B09FRNZHN1"
},
{
    "title": "Easy routine, good instruction will certainly loosen up my upper body",
    "rating": "5.0 out of 5 stars",
    "content": "While to the best of my knowledge I don’t have Alzheimers or Dementia, my Mom did and that is a road I don’t want to go down.  So this seemed like a good fit.",
    "post_time": "Reviewed in the United States on January 19, 2022",
    "pid": "B09FRNZHN1"
},
{
    "title": "Good For Those With Some Tai Chi Experience But Not All Beginners Will Know What To Do",
    "rating": "5.0 out of 5 stars",
    "content": "WHAT YOU GET:",
    "post_time": "Reviewed in the United States on December 5, 2021",
    "pid": "B09FRNZHN1"
},
{
    "title": "For anyone!",
    "rating": "5.0 out of 5 stars",
    "content": "DVD case and DVD.",
    "post_time": "Reviewed in the United States on January 30, 2022",
    "pid": "B09FRNZHN1"
},
{
    "title": "Piercing the fog, great instruction and content",
    "rating": "5.0 out of 5 stars",
    "content": "USAGE:",
    "post_time": "Reviewed in the United States on January 10, 2022",
    "pid": "B09FRNZHN1"
},
{
    "title": "Simple video for any age",
    "rating": "4.0 out of 5 stars",
    "content": "First I watched this DVD entirely, as I wanted to know what I would be doing.  I noted all the exercises were symmetric, so if you did the opposite side from the instructor, there would be no issue. I’m notorious for this.  As long as you continued doing the opposite, you would be good and everything would balance out.",
    "post_time": "Reviewed in the United States on January 28, 2022",
    "pid": "B09FRNZHN1"
},
{
    "title": "Nice book to learn exercises to have brain relaxation",
    "rating": "5.0 out of 5 stars",
    "content": "Also he doesn’t use any terms that would be necessary for you to know prior to doing this. My prior doing Tai Chi, helped me anticipate what the moves might be prior to seeing the DVD, but nothing is that complex. He explains everything as he is demonstrating it and gives you an idea when a move will change in plenty of time.",
    "post_time": "Reviewed in the United States on January 13, 2022",
    "pid": "B09FRNZHN1"
},
{
    "title": "Very Pleased with purchased",
    "rating": "5.0 out of 5 stars",
    "content": "We have all of David-Dorian Ross's Tai Chi Fit DVDs.  Being in our 60's, my wife and I both want to stay as healthy as possible.  My wife had a major fall a few years ago and while she deals with pain on a daily basis, doing Tai Chi has eased the pain, increased mobility for both of us, and we do not fumble on our feet like we used to.  Remembering the different Tai Chi Forms is excellent for the memory, and while we follow along with the DVD, we are able to practice on a daily basis without the DVD as well, proving that these DVDs are excellent for anyone.",
    "post_time": "Reviewed in the United States on November 28, 2021",
    "pid": "B09FRNZHN1"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am a fan of DDR and his Tai Chi Fit videos and own almost all of them.",
    "post_time": "Reviewed in the United States on December 3, 2022",
    "pid": "B09FRNZHN1"
},
]