[
{
    "name": "        Rechargeable Hearing Aids, Mini Hearing Amplifier with Charging Box and Discreet Fit for All-Day Comfort,Clear Sound for Elderly,Blue & Red Pair       ",
    "stars": [
        "100%",
        "0%",
        "0%",
        "0%",
        "0%"
    ],
    "pid": "B0CN99B9QQ",
    "ratings": "2 ratings",
    "other_info": {
        "Brand": "sierescon",
        "Color": "Royal Blue and Red",
        "Material": "Plastic",
        "Style": "hearing amplifier",
        "Model Name": "Sierescon Rechargeable Hearing Aids"
    },
    "discount_price": "$ 189.",
    "normal_price": "$209.99",
    "about_this_item": [
        " Advanced digital hearing aid technology: Equipped with the latest digital chip, our hearing amplifiers can effectively reduce background noise and enhance speech clarity, providing you with a clear and natural sound environment.  ",
        " Easy to use: The hearing aids are equipped with easy-to-use buttons, Ear amplifier for hearing you can easily make adjustments to the volume and settings of the hearing aids, depending on the environment you are in. One button for both volume and toggling between the preset programs. Whether you are in a noisy restaurant or a quiet library. The hearing amplifier comes with a charging box and USB charging cable.  ",
        " All-day comfort: The hearing amplifiers are designed with a small and lightweight design, making them easy to wear and remove. The ear canal hearing aids can fit your ear canal perfectly, reducing the discomfort of wearing traditional hearing aids.  ",
        " Three Modes: You can play with the settings to figure out which mode worked best for your environment.When you are in noisy places, you can switch to noise reduction mode. When you are in a quiet place, you can switch to other modes.  ",
        " Mini Size for Max Portability:The compact and lightweight design of the hearing aids makes it the perfect choice for everyday portability, allowing you to carry them wherever you go effortlessly.  "
    ]
},
{
    "title": "Tiny hearing aids with easy volume adjustment",
    "rating": "5.0 out of 5 stars",
    "content": "I love how tiny these hearing aids are. The battery lasts longer than expected while the charging case itself lasts me the whole week without needing to be recharged. These hearing aids are good for the price. I like that all I have to do to adjust volume is press a tiny button. And to switch the mode I rapidly press the button three times in a row. It would be nice if these also had Bluetooth but besides that, these are great.",
    "post_time": "Reviewed in the United States on January 13, 2024",
    "pid": "B0CN99B9QQ"
},
{
    "title": "comfortable, small size",
    "rating": "5.0 out of 5 stars",
    "content": "I got these as a backup for a more expensive pair. Tried them out and they were surprisingly small, fit well in the ear. They have these little antennas and work well. Great value.",
    "post_time": "Reviewed in the United States on January 5, 2024",
    "pid": "B0CN99B9QQ"
},
]