[
{
    "name": "        VIVOHOME Electric 5 Trays Food Dehydrator Machine, 400W Hydrator Machine with 72H Digital Timer and Temperature Control for Fruit Vegetable Meat Jerky Herb Beef Mushroom, Black       ",
    "stars": [
        "66%",
        "16%",
        "4%",
        "4%",
        "10%"
    ],
    "pid": "B0CSFLDHPJ",
    "ratings": "41 ratings",
    "other_info": {
        "Brand": "VIVOHOME",
        "Material": "Plastic",
        "Color": "Black",
        "Wattage": "400 watts",
        "Product Dimensions": "10.2\"D x 12.6\"W x 10.4\"H"
    },
    "discount_price": "$ 69.99",
    "normal_price": "$79.99",
    "about_this_item": [
        " POWERFUL DRYING CAPACITY - Equipped with 400W of drying power and consistent airflow, our food dehydrator removes moisture and preserves the original flavors of your favorite foods; The bottom-mounted fan and heating element provide consistent airflow for optimum drying, maintaining a 97% vitamin and mineral retention rate in food; This is definitely the best way to preserve food while retaining maximum nutritional benefits  ",
        " DIGITAL TEMP & TIME SETTING - Easily set the time and temperature with a digital control panel; You can adjust the temperature from low to high settings (95℉ to 158℉) and set the timer (1-72H) for precise dehydration durations; Choose the optimal time and temperature depending on the ingredients; A hot air fan will automatically switch on and off to balance the temperature; Never worry about making a mess again  ",
        " 5-LAYER & ADJUSTABLE TRAYS - This food dehydrator is designed with 5 large capacity food-grade drying trays, which is enough to hold most food and create uniform drying; 5 stackable trays can be rotated together 180 degrees for different heights (1.25” and 0.78”) to accommodate foods of varying sizes and thicknesses; Make whatever jerky or fruit you want  ",
        " DURABLE & SAFE MATERIAL - The main body is made from BPA-free plastic with food-grade plastic trays, which is absolutely safe for you; A dehydrator fine-meshed plastic sheet is used to dry small food like herbs while the silicon tong helps you pick up and place food more conveniently; This dehydrator operates quietly, making it suitable for home use without causing disruptions; Enjoy an easy, healthy homemade snack without any additives  ",
        " EASY TO STORE & CLEAN - The dehydrator is detachable and the trays are dishwasher safe, making it easy and convenient for you to clean and store; It is suitable for drying fruit, vegetables, meat, herbs, flower tea, nuts, mushrooms, or to make beef jerky, turkey jerky, fish jerky, and any other homemade food; Also it can be used to make chews and snacks for your pets (Note: The dehydrator fine-meshed plastic sheet and silicone trivet tong are not dishwasher safe)  "
    ]
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "I likes the 8 trays and the ease of usage.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0CSFLDHPJ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this for my daughter for Christmas so she could dry all her herbs which it works perfect for, but now she is trying just about everything and it is doing a wonderful job it is a good dehydrator. Lightweight and not very noisy and you can use it for a lot of stuff or a little stuff the trays all are removable and stackable",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0CSFLDHPJ"
},
{
    "title": "Herbs",
    "rating": "4.0 out of 5 stars",
    "content": "Need to keep adding time to it to get hot peppers dry. No drying time for them. Adding time and heat oh well.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0CSFLDHPJ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love this one it is easily cleanable. It does a great job for the different things we use it for.",
    "post_time": "Reviewed in the United States on April 2, 2024",
    "pid": "B0CSFLDHPJ"
},
{
    "title": "Ok but not the greatest",
    "rating": "5.0 out of 5 stars",
    "content": "This thing rocks. It's everything you can hope for, it holds a lot of goods, temp and time control and is quiet.",
    "post_time": "Reviewed in the United States on December 1, 2023",
    "pid": "B0CSFLDHPJ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works great",
    "post_time": "Reviewed in the United States on January 5, 2024",
    "pid": "B0CSFLDHPJ"
},
{
    "title": "Love it",
    "rating": "1.0 out of 5 stars",
    "content": "Do yourself a favor and buy a nesco. Around the same price point but works ten times better. This one takes literal days to dry something when it should only take 8 hours.  It holds a lot but that is really a mute point when it doesn't work. Bottom blower makes it incredibly difficult to clean.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0CSFLDHPJ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This is a Christmas gift. She will love it.",
    "post_time": "Reviewed in the United States on December 11, 2023",
    "pid": "B0CSFLDHPJ"
},
{
    "title": "WOW!",
    "rating": "4.0 out of 5 stars",
    "content": "I did venison jerky and was pleasantly surprised at how easy this is to use. I love the timer feature. I did over cook mine just a tad but that was user error.",
    "post_time": "Reviewed in the United States on March 20, 2024",
    "pid": "B0CSFLDHPJ"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "Pros",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B0CSFLDHPJ"
},
{
    "title": "Nice little dehydrator",
    "rating": "4.0 out of 5 stars",
    "content": "I'm quite pleased with this little dehydrator so far.  I've only used it once to make banana chips, but for that it worked very well.  It is definitely a step up from the old round dehydrator I inherited from my parents.  This dehydrator is programmable.  You can set the temperature and time according to what you are dehydrating.  It doesn't take much room to store.  It is also attractive enough to leave setting out if you need to.  I like the fact that you can create a bit more space between the trays by reversing the trays.  And the trays are dishwasher safe, which is a big bonus in my book.  It comes with a set of tongs and a fine mesh insert for smaller items.  All in all a solid little dehydrator.",
    "post_time": "Reviewed in the United States on November 16, 2023",
    "pid": "B0CSFLDHPJ"
},
{
    "title": "Not for jerky",
    "rating": "1.0 out of 5 stars",
    "content": "It doesn't get hot enough to make jerky mine has been sitting in it for 11 houres still bloody and raw",
    "post_time": "Reviewed in the United States on January 14, 2024",
    "pid": "B0CSFLDHPJ"
},
{
    "title": "Compact & Efficient",
    "rating": "4.0 out of 5 stars",
    "content": "This food dehydrator works well. It is compact. The trays are plastic and it comes with silicone tongs. It is simple to program. So far I have made my dehydrator version of sun dried tomatoes. They were perfect. Also made some dog treats and dried herbs. The fan switches on and off which is to be expected. Everything was dehydrated evenly, though keeping size uniform helps. Pleased with this appkiance.",
    "post_time": "Reviewed in the United States on October 26, 2023",
    "pid": "B0CSFLDHPJ"
},
{
    "title": "Small",
    "rating": "1.0 out of 5 stars",
    "content": "Very disappointed in how small it was",
    "post_time": "Reviewed in the United States on November 26, 2023",
    "pid": "B0CSFLDHPJ"
},
]