[
{
    "name": "        12\" Stainless Steel Floating House Number, Metal Modern House Numbers, Garden Door Mailbox Decor Number with Nail Kit, Coated Black,Numbers 1       ",
    "stars": [
        "83%",
        "17%",
        "0%",
        "0%",
        "0%"
    ],
    "pid": "B0CXXP1Y8F",
    "ratings": "7 ratings",
    "other_info": {
        "Brand": "SKLK-SEL",
        "Color": "#1",
        "Material": "Stainless Steel",
        "Mounting Type": "Wall Mount",
        "Orientation": "Portrait",
        "Pre-printed": "Numbers",
        "Recommended Uses For Product": "Property, Office, Garden, Shops",
        "Product Dimensions": "12\"L x 3.5\"W",
        "Manufacturer": "SKLK-SEL"
    },
    "discount_price": "$ 16.99",
    "normal_price": "$18.99",
    "about_this_item": [
        " Easy To Read: Modern house numbers for outside will create a good shadow effect after installation,12 inch house numbers for outside modern is big enough,black modern house number floating are easy to read from a long distance,will not miss any parcels or any emergency rescue  ",
        " Premium Material: SKLK-SEL metal address number is made of high-quality stainless steel, which is very sturdy and durable. It is resistant to high temperatures, weather, and wear, and is not easy to rust.The paint surface is firm and will not peel off.It can withstand harsh weather conditions and meet your long-term needs very well  ",
        " Multiple Installation Options: Outdoor door signs can be installed vertically, horizontally, or obliquely to suit your own creative style. The exquisite modern style and 3D floating design allow you to install numbers about an inch away from the wall, creating a 3D floating effect and making your house stand out  ",
        " Widely Used: 12 inches high and 1 inch thick, our modern floating house numbers are large and clear. 12 inches are enough to add visual appeal to any space that needs recognition. You can freely combine the 0-9 numbers, which is very suitable for various ground level houses, gardens, offices, streets, villas, shops, etc. Suitable for various types of walls, including wood wall, rough wall, and stone wall.It will bring a lot of convenience to your daily life  ",
        " Easy Assembly: Modern house number are equipped with mounting hardware/ template/ Installation guidance（In the product link）, for flush or floating numbers,can be easy assembly with a drill gun in 10-15minutes  ",
        " Packaging Content: 1 x stainless steel black house number, 3 x long stainless steel screws, 3 x plastic spacers 4 x plastic anchors, 1 x template (one spare long stainless steel screws and two spare plastic anchors)  "
    ]
},
{
    "title": "Lucky number",
    "rating": "5.0 out of 5 stars",
    "content": "We have recently moved and need a new door number. Previously, I bought this product for around $22. This time, I chose this cheap one, which is amazing. It is not inferior to expensive products at all. The stainless steel material is very good, and it will not rust or fade. I will feel at ease in any weather. The size is very good, and it is very suitable for viewing from a distance. I don't want to miss any packages anymore. This is what we need, and it is easy to install,",
    "post_time": "Reviewed in the United States on May 22, 2024",
    "pid": "B0CXXP1Y8F"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Don’t recommend mixing and matching numbers- this is nice quality and looks easy to install.",
    "post_time": "Reviewed in the United States on May 21, 2024",
    "pid": "B0CXXP1Y8F"
},
{
    "title": "Looks easy to install",
    "rating": "5.0 out of 5 stars",
    "content": "This house number appears to be made out of a decent piece of metal -- it's relatively heavy and strong, it certainly isn't going to easily break or bend. It also arrives with the necessary screws and spaces for hanging it up, and since it uses a very simple design for hanging (just two screw holes straight through the metal) and comes with a lifesize template/drawing on the instructions for aligning the screws on the wall -- well, it's very very easy to install.",
    "post_time": "Reviewed in the United States on May 4, 2024",
    "pid": "B0CXXP1Y8F"
},
]