[
{
    "name": "        COKUNST Electric Wine Opener, Automatic Corkscrews Wine Bottles Openers, Battery Operated Reusable Wine Remover for Wine Lover Gift Home Kitchen Party       ",
    "stars": [
        "74%",
        "6%",
        "8%",
        "5%",
        "7%"
    ],
    "pid": "B0D31MFWTQ",
    "ratings": "59 ratings",
    "other_info": {
        "Material": "Acrylonitrile Butadiene Styrene",
        "Color": "Black",
        "Brand": "COKUNST",
        "Item Weight": "210 Grams",
        "Product Dimensions": "9\"L x 1.8\"W",
        "Is Customizable": "No",
        "Manufacturer": "COKUNST"
    },
    "discount_price": "$ 13.",
    "normal_price": "$34.99",
    "about_this_item": [
        " 【POWERFUL & DURABLE】 COKUNST automatic electric wine opener (Batteries Not Included) can help you open any traditional wine bottle with minimum effort. Noiseless and fast, it can safely remove corks in just about 5-7 seconds. Open up to 30-40 bottles one time  ",
        " 【EASY TO USE】 ① Just install the batteries firstly. ② Hold the wine opener vertically on the top of the bottle firmly and press the extract button. ③ Press the upper release button when the cork is extracted, and it will come out automatically in seconds  ",
        " 【LIGHTWEIGHT & PROTABLE SIZE】Our corkscrews wine opener boasts a fashionable finish and protable size 9''H*1.8''W in size, making it perfectly sized for handholding and easy to store away when not in use. Wine opener weight about 210g, handy for you to carry around  ",
        " 【EXQUISITE DESIGN】This wine bottle opener made of the high-quality ABS material and adopts the appearance of carbon crystal black in the overall color-matching design, dotted with two round CD pattern button switch. The overall effect is low-key and durable but presents a noble, fashion and exquisite feeling at the same time  ",
        " 【IDEAL GIFT】This automatic electric wine opener is cordless, lightweight and elegant design, with foil cutter accessories, are the best choice for the gift to wine lover. Ideal for weddings, parties, bar, or home kitchen use  "
    ]
},
{
    "title": "Easy",
    "rating": "5.0 out of 5 stars",
    "content": "So easy to use and does the job!",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I purchased this as a gift for my 90 year old mother who loves wine, and can no longer operate the old fashion wine opener.  She LOVES this opener, and I'm very impressed with this too.  I'm going to purchase more for gifts for friends for the holidays.  Great opener!!!!",
    "post_time": "Reviewed in the United States on October 3, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Great for Elderly",
    "rating": "5.0 out of 5 stars",
    "content": "Using this is way easy every durability and works grate.",
    "post_time": "Reviewed in the United States on September 14, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The two-button electric wine opener is super handy especially for me. Although it runs on 4 AA batteries it does make opening wine bottles super easy. It’s very convenient and takes all the work out of opening my wine. Now time to enjoy another glass.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "This little wine opener has worked beautifully. I’ve opened a handful of bottles already with no issues. I normally use a basic waiter style opener that I often miss place so this was an upgrade. It has hit the center of the cork each time I’ve used it. The simple design doesn’t require any directions so anyone can use it. I would buy it again.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "The COKUNST Electric Wine Opener requires FOUR AA Batteries... I used four high-level rechargeable batteries.",
    "post_time": "Reviewed in the United States on June 21, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "easy as wine",
    "rating": "1.0 out of 5 stars",
    "content": "It is a bit tricky securing the battery cap, but once secured, I opened a cock top bottle of wine.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I am disappointed in the performance of the COKUNST Automatic Wine Opener...",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Works like a charm",
    "rating": "5.0 out of 5 stars",
    "content": "1. it did NOT go in straight",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "2. the cork split in half upon removal.",
    "post_time": "Reviewed in the United States on July 18, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Battery compartment",
    "rating": "2.0 out of 5 stars",
    "content": "I’ve been fighting for an eternity trying to close the battery compartment. Why is this thing so hard to close?",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "\"The opener does not perform the function for which it was intended.\"",
    "post_time": "Reviewed in the United States on September 28, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "\"The opener does not perform the function for which it was intended.\"",
    "rating": "4.0 out of 5 stars",
    "content": "This thing works good, my only complaints are the battery compartment was a little difficult to access and put the cover back on, and the three bottles I opened with it, I felt like it gave everything it had to open them, and to me I would rather have something that has more power in reserve to get the job done... but ultimately it works and opens the bottle.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "100% love this wine bottle opener! It’s so easy to operate (see video) - you just hold the bottom button down and hold the wine bottle still until it cycle stops and then the cork is completely removed. It’s very slender and compact. The price is very reasonable and it works great!  Operates on four AA batteries and I have opened at least four or five bottles of wine and it’s no where near needing replacement batteries.  I think this will be perfect for a gift for any wine lovers!",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "A little weak but gets the job done",
    "rating": "5.0 out of 5 stars",
    "content": "This wine opener is so easy to use and beautifully made it Is great quality and as a wine lover this is a must have excellent product.",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Very simple & easy",
    "rating": "5.0 out of 5 stars",
    "content": "This is an amazing value.  This is a very good quality product.  It is easy to use and works perfectly.  The batteries are also easy to install.  It has a compact size and is easy to store.  This is a great substitute for a traditional wine opener and makes it much easier to open the bottle.  This item would make a great gift.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Life saver",
    "rating": "5.0 out of 5 stars",
    "content": "Hand crank electric openers are a bit difficult to use with arthritis and other ailments that plague the hand. Given the fact that I have arthritis, and a bit of carpal tunnel, I decided to try this electric wine opener.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Great wine tool and gift",
    "rating": "5.0 out of 5 stars",
    "content": "First off, it completely eliminates the need for any force from the hands. Simply align the corkscrew tip to the center of the bottle, press down and hold the bottle in place, press the lower button and let the opener do all the work for you. This was an amenity I never knew I needed!",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Great Alternative to Crank Openers",
    "rating": "5.0 out of 5 stars",
    "content": "Now that said, I’ve posted a video of this item in action…Even with 4 new AA batteries, the opener struggles a bit as it’s retracting to pull the cork out. Listen carefully to the motor as the corkscrew enters the cork, then as the opener begins to extract the cork from the bottle. It was expected there would be some pause, but the first couple of times I used this thing, my thoughts were that it might get stuck during the extraction portion.",
    "post_time": "Reviewed in the United States on June 27, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Easy to work with",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, this electric wine opener works as designed, and based on that I’m giving 5 stars, however, I’ll be monitoring the power during continued use and will edit my review accordingly.",
    "post_time": "Reviewed in the United States on June 24, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Did Not Work!",
    "rating": "2.0 out of 5 stars",
    "content": "I got this to replace my electric wine opener and I am disappointed. I almost messed up a good bottle of wine with this thing. It does not have enough power to remove the cork.  It worked perfectly to screw into the cork but then it couldn't pull the cork all the way out. I reversed it and tried two more times and it still did not have enough power to pull the cork all the way out.  I ended up using my manual wine opener to finish the job of pulling the cork out. I gave it two stars since it can only do half the job.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Great wine opener",
    "rating": "5.0 out of 5 stars",
    "content": "I bought this electric wine opener for my husband, and it's been a game-changer! Opening wine bottles has never been easier or faster. The device is sleek, compact, and easy to use  just place it on the bottle and press a button.",
    "post_time": "Reviewed in the United States on June 26, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "The opener is powerful and efficient, removing the cork in seconds without any struggle.",
    "post_time": "Reviewed in the United States on July 20, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "Simple and easy instructions and what would have taken me 5minutes took me 2seconds. Will never open wine again without this!",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love my Electric Wine Opener! It's so easy to use and opens wine bottles in seconds. No more struggling with corks. It's a must-have for anyone who drinks wine.",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Easy to use 🥰",
    "rating": "5.0 out of 5 stars",
    "content": "I love it. It’s the best thing ever I definitely needed this. It’s easy to use no mess.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Its perfect for what I needed. if you dont want to spend too much for an opener this is a great choice. Its easy to use and only requires batteries. The quality is great. Its not too bulky or anything and looks sleek in the kitchen",
    "post_time": "Reviewed in the United States on July 11, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Great",
    "rating": "5.0 out of 5 stars",
    "content": "This Electric Wine Opener it’s fantastic!",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "It’s easy to use – just push a button, and the cork is out in seconds. Perfect for anyone, regardless of strength",
    "post_time": "Reviewed in the United States on June 28, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "works amazingly!!",
    "rating": "5.0 out of 5 stars",
    "content": "I find the design really cute . It’s lightweight, sturdy, and comfortable to hold.",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Perfect gift",
    "rating": "5.0 out of 5 stars",
    "content": "It was the perfect fathers day gift for my stepdad as he's a wine drinker but he has arthritis and this made it so easy for him to open his wine without having to get help. Its not too heavy either and it works great.  Its pretty cool.",
    "post_time": "Reviewed in the United States on June 17, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Haven’t use it yet the quality is a little thin but it’s ok",
    "post_time": "Reviewed in the United States on July 4, 2024",
    "pid": "B0D31MFWTQ"
},
{
    "title": "Nice",
    "rating": "5.0 out of 5 stars",
    "content": "It doesn’t use batteries I’m in not sure how it works",
    "post_time": "Reviewed in the United States on August 2, 2024",
    "pid": "B0D31MFWTQ"
},
]