[
{
    "name": "        YASHE Food Dehydrator Machine, 9 Stainless Steel Food Dryer, 1000W Dehydrators for Food and Jerky, Herbs, Meat, Fruit, Dog Treats, 48H Timer and Temperature Control (95-165℉), Recipes Book Included       ",
    "stars": [
        "64%",
        "11%",
        "6%",
        "5%",
        "14%"
    ],
    "pid": "B0D3WKG9XY",
    "ratings": "53 ratings",
    "other_info": {
        "Brand": "YASHE",
        "Material": "Stainless Steel",
        "Color": "Silver",
        "Wattage": "1000 watts",
        "Product Dimensions": "13.6\"D x 15.9\"W x 12.3\"H"
    },
    "discount_price": "$ 139.99",
    "normal_price": "$158.99",
    "about_this_item": [
        " Efficient Drying Technology: The 1000W food dehydrator with dual rear fans and 360° hot air circulation ensures rapid and uniform drying of various foods, including meats, herbs, vegetables, and fruits  ",
        " Customizable Settings: Features adjustable temperature control (95-165℉) in 5℉ increments and a 48-hour timer with 30-minute intervals, allowing for precise and personalized dehydration  ",
        " Spacious and Quiet: Equipped with nine stainless steel trays for ample drying space and operates quietly at less than 48 dB, making it suitable for home use without causing disturbances  ",
        " Durable and Safe Design: Made from food-grade BPA-free stainless steel with dishwasher-safe trays. It includes automatic shutdown and thermal protection to prevent overheating, ensuring user safety  ",
        " User-Friendly Features: Includes an LED digital display for easy monitoring, a transparent door for viewing the dehydration process, and a comprehensive package with additional accessories such as 2 mesh sieves and a fruit roll tray for versatile use  "
    ]
},
{
    "title": "Easy to use",
    "rating": "5.0 out of 5 stars",
    "content": "We liked how easy it was to dehydrate fruit - simple snacks to take along in the car.  Also appreciate how lightweight the unit is, and easy to move around.  Our adult children can easily pick up the unit from us and use it themselves.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Love that it is not plastic and has plenty of shelves. I used it outside my home to dehydrate cayenne peppers. Took a little bit longer to do because it started raining that evening. It was on our front deck that has a cover, so the dehydrator was protected. (I had been warned to not dehydrate cayenne peppers inside my home).",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Used it outdoors under porch cover",
    "rating": "1.0 out of 5 stars",
    "content": "I ordered two of these and within a few weeks of receiving they stopped working. The top heating element went out in one, then the bottom element. A few days later same thing happened with the second machine. I’ve spent two weeks trying to get them replaced or refunded with no success. So much produce gone to waste.",
    "post_time": "Reviewed in the United States on September 7, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This works great!  I have done several batches of things and even had a power outage for a minute or so and it went back to the timer it was at which was great!  I recommend!",
    "post_time": "Reviewed in the United States on September 2, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Piece of garbage",
    "rating": "4.0 out of 5 stars",
    "content": "This thing works great and has everything you need to dehydrate literally anything you want. There are several racks that are included, which allow for so much variety in what you can dehydrate in one round. We made dog treats in them and they came out perfect. It heated up to temp quickly, treats came out wonderful and well made, and the clean up was a breeze. Highly recommend for the price.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I love it!!!",
    "post_time": "Reviewed in the United States on October 6, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Works Wonderful!",
    "rating": "5.0 out of 5 stars",
    "content": "Lightweight and makes great jerky.  Perfect for RV",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Cheap feel and smells like plastic no light also Amazon never follows delivery instructions",
    "post_time": "Reviewed in the United States on August 13, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Works well!",
    "rating": "5.0 out of 5 stars",
    "content": "Made beef jerky and it came out great! I would definitely recommend this",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Great buy",
    "rating": "5.0 out of 5 stars",
    "content": "My husband loves it. Its spacious and perfect for dehydrating any food, especially jerky.",
    "post_time": "Reviewed in the United States on August 12, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Not stainless steel",
    "rating": "2.0 out of 5 stars",
    "content": "Pics showed stainless interior but it’s not. Only the trays are. Returned immediately",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I bought 2 and both stopped heating after using it a few times.",
    "post_time": "Reviewed in the United States on October 12, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Very disappointed",
    "rating": "1.0 out of 5 stars",
    "content": "Had to throw out Partially dried food. This is a big issue because I'm disabled and get very little money plus the pain of having to send the dehydrator is a big inconvenience for me.",
    "post_time": "Reviewed in the United States on October 5, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Verified Purchase",
    "rating": "1.0 out of 5 stars",
    "content": "I thought it might be metal on the inside but it’s not it’s plastic. It smells weird and imparts that same smell to the food dehydrated inside. Everyone should know the harms of plastic including cancers and hormone disruption. Find one that isn’t plastic on the inside. This is a ripoff",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Dries food but is terrible",
    "rating": "1.0 out of 5 stars",
    "content": "Worked for just two weeks. Heater gave out. It blew cold air only. All the meat ruined! Sat out overnight while the thing blew cold air. What a waste of money.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Verified Purchase",
    "rating": "3.0 out of 5 stars",
    "content": "Literally 2 days after return eligible date it stopped heating. Don’t buy!",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Lasted 2 weeks",
    "rating": "4.0 out of 5 stars",
    "content": "The good:",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I like the size, weight and design of this dehydrator.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Stopped heating",
    "rating": "5.0 out of 5 stars",
    "content": "I've been using one of those ancient circular column dehydrators which stacks as many round trays on top of each other as you need, within reason.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "This new dehydrator takes up a defined, limited space.  Better for me as we downsize.  All the trays are included as well as a few accessory mesh and solid sheets to suit basic dehydrating needs.",
    "post_time": "Reviewed in the United States on September 10, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Great for making backpacking food!",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator was easy to set up, came with multiple racks and silicone mats for fruit leather. I have dehydrated wild foraged mushrooms, orange slices, and fruit so far. The book comes with recommended temperatures and times and easy to follow recipes. Great addition to the kitchen.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Great treat at half the store bought cost",
    "rating": "5.0 out of 5 stars",
    "content": "Before we had refrigeration, people had to dry their foods for long-term storage.  It could have been in a smokehouse or strips of meat on a line, drying in the sun.  Now we have dehydrator machines that can do the same thing in a significantly shorter time and without the flies and birds trying to eat the drying meat or pooping on it.",
    "post_time": "Reviewed in the United States on July 6, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Great set-up to get started",
    "rating": "5.0 out of 5 stars",
    "content": "For the first experiment, we bought 1.6 pounds of bottom round meat at around $12.  It was already cut thinly, and we would have cut it thicker if we had to do it ourselves.  Jerking meat is a little more art than science because the length of time to dry the food depends on your preference.  We like it \"al dente,\" like our bacon:  Cooked but still a little chewy.",
    "post_time": "Reviewed in the United States on July 30, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Top Notch - Great Design - Easy to Use",
    "rating": "5.0 out of 5 stars",
    "content": "We started at 145 for 60 minutes, then 150 for another hour, then 165 for 90 minutes, and the meat was excellent.  Thicker meats will require longer drying times.  It dehydrated to about half its original weight, and we figured that doing it ourselves would cost half what we would have bought at the store.  It could become an expensive treat.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Great product",
    "rating": "5.0 out of 5 stars",
    "content": "The second experiment was with the spicy apple recipe in the manual.  Since apples are mostly water, this took nine hours, and they are super yummy.  You will need to figure out the drying times based on your personal preference.  The key thing with meat is that it needs to be a lean cut, and the internal temperature reaches (I believe) 165 to kill any bacteria that would form in long-term storage of the jerky.",
    "post_time": "Reviewed in the United States on August 16, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Efficient food dehydrator.",
    "rating": "5.0 out of 5 stars",
    "content": "I backpack a lot and find that commercial meals really add up quickly! I also have wanted a way to better control the ingredients I'm eating. This dehydrator has been phenomenal! It comes with multiple trays. I was also pleased to see that it included two 'mats' that are great for small items (think peas or carrot pieces) that might otherwise fall thru the holes in the trays as they dry. It also includes a a solid plastic tray that can either be used to line the bottom of the unit to make clean up easier or to allow you to dry liquid foods. The controls are really easy to use and I love the wide range of temperature settings. The fan is a little loud, but not overwhelming. I'm really pleased with this unit and have been able to get great results so far!",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "We Love This! Easy to use and clean. A+",
    "rating": "5.0 out of 5 stars",
    "content": "I've been using this food dehydrator as an amateur beef jerky maker, and it's been perfect for helping me achieve amazing results. It's easy to assemble and has all the options I need.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Great dehydrator!",
    "rating": "5.0 out of 5 stars",
    "content": "The stainless steel racks are easy to clean and make me feel confident about the cleanliness after a long drying process. The door closes securely, ensuring an even temperature throughout the unit. All the foods I've tried, have dried evenly, and I've achieved consistent results batch after batch.",
    "post_time": "Reviewed in the United States on July 21, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Small but mighty",
    "rating": "5.0 out of 5 stars",
    "content": "The controls are intuitive, and I'm really impressed with the amount of food I can dry at one time. If I ever need to buy another food dehydrator, this will be the one I purchase.",
    "post_time": "Reviewed in the United States on July 27, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Great Food Dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "Works great. Dehydrates very well. Low noise. Easy to use.",
    "post_time": "Reviewed in the United States on July 17, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Great!",
    "rating": "5.0 out of 5 stars",
    "content": "With 9 removable trays this is fantastic for making lots of jerky.  I was able to put a large amount of venison in the dehydrator - basically about 3x the amount I could fit in my old dehydrator. Super user friendly with easy, simple controls.  A great plus is the removable drip tray - makes it much easier to clean.  Very pleased.",
    "post_time": "Reviewed in the United States on July 25, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "got this for jerky and fruits",
    "rating": "5.0 out of 5 stars",
    "content": "This dehydrator is straight up awesome... Really great for drying your own jerky which I have always wanted to do at home... I also love banana and apple chips which I use this dehydrator for. The settings are customizable allowing you to tweak the temperatures and set and forget the 48 hour timer... which is ideal for my busy schedule. Plus it's quieter than my roommate's gaming sessions so it won't disturb you either... It's easy to clean and has a really nice design... even comes with different trays for different treats. Really a nice addition to my kitchen setup so I'd highly recommend it!",
    "post_time": "Reviewed in the United States on July 13, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Easy to Use",
    "rating": "5.0 out of 5 stars",
    "content": "I love a good dehydrator. I am a DIYer, and I like to make my own dehydrated fruit and jerky. This appliance works well and is very spacious. It is reasonably priced and would make a great housewarming gift for the right person. It has several racks, so you can make a nice amount of dehydrated food.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Works great!",
    "rating": "5.0 out of 5 stars",
    "content": "Beautiful Stainless Steel outer shell with side handles so it is easy to move.  Very user friendly touch screen at the top.  Comes with metal trays, fruit roll up tray and 2 mesh trays.  User manual is easy to understand and it includes a recipe booklet.  Loving it.  Not loud at all when operating.  Easy to clean with soap and water rag.",
    "post_time": "Reviewed in the United States on July 8, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Great for jerky",
    "rating": "5.0 out of 5 stars",
    "content": "Very easy to set up and use works really well especially with beef jerky the temp control is easy to adjust and it's pretty quiet",
    "post_time": "Reviewed in the United States on July 9, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Cool dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "This is the first Ike I’ve used a dehydrator. Instructions were clear. Setup was easy. Day 1 I was able to load this up with mostly veggies and started dehydrating. It works easily and seems to week well based on my veggie results. Very excited to make more foods with this.",
    "post_time": "Reviewed in the United States on July 10, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "It works great",
    "rating": "5.0 out of 5 stars",
    "content": "It has 9 heavy duty trays!!! It's easy to use it works great and it's silent compared to my old dehydrator, it fits on my counter perfectly and it's easy to clean, it was a fantastic value and I highly recommend 5 stars",
    "post_time": "Reviewed in the United States on July 5, 2024",
    "pid": "B0D3WKG9XY"
},
{
    "title": "Made in China.  Nice for an assortment of fruits and more.  Nice circulation.",
    "rating": "5.0 out of 5 stars",
    "content": "This is a nine-tier square dehydrator.  Two fans in the back for better circulation.  Easy temp / time set.  If you’re unfamiliar with dehydrating. . . You’ll want to do some research first.  There are things which you will need. . . . All depending upon what you plan on dehydrating. . . . Such as apple peeler. . . Cherry pitter. . . Citric acid. . . and so on.  You’ll also need some glass jars with tight fitting lids.  But once you get started. . . I think it’s a lot of fun.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0D3WKG9XY"
},
]