[
{
    "name": "        Food Dehydrator Machine 800W, 12 Stainless Steel Trays Dehydrated Dryer with 12H Timer & 86°F-194°F Temperature Control for Beef Jerky, Meat, Fruit, Herb, Dog Treats, Veggies, Recipe Book       ",
    "stars": [
        "70%",
        "9%",
        "10%",
        "0%",
        "11%"
    ],
    "pid": "B0D4TNF1FF",
    "ratings": "14 ratings",
    "other_info": {
        "Brand": "Osluken",
        "Material": "Stainless Steel",
        "Color": "Silver",
        "Wattage": "800 watts",
        "Voltage": "1.2E+2 Volts"
    },
    "discount_price": "$ 153.",
    "normal_price": "",
    "about_this_item": [
        " Large Capacity of 12 Trays: The dehydrator comes with 12 removable stainless steel trays (11.8\" x 7.9\") made of 304 food-grade stainless steel for safety and durability. All trays are dishwasher safe. Holds a variety of foods at once, such as vegetables, fruits, meats, flowers, etc. Designed to meet the needs of large volume food drying, the fruit dehydrator provides plenty of healthy and delicious 100% natural food for the whole family.  ",
        " Dual Fan Three-Dimensional Dehydration Dryer: This powerful 800W dehydrator features dual fans and 360° hot air circulation technology. It conducts heat to the box through the improved and thickened heating tube to form an internal circulation, so that the heat is evenly distributed to realize efficient and fast dehydration and drying. It can lock the nutrients of fruits, vegetables, meats and other foods without affecting the taste.  ",
        " Precise Timer & Temperature Control: Easily customize the drying process with precise drying time and temperature settings. Drying time settings from 1-12 hours (30 min. increments) and digital temperature presets from 86°F to 194°F (in 9°F increments), ensuring you create delicious dehydrated meals at the optimal temperature and time. The timer displays and automatically shuts off when dehydration is complete.  ",
        " Fully Visible Window: The dehydrator is equipped with thickened, tempered viewing glass and built-in explosion-proof lighting, allowing you to watch the drying effect of ingredients in real time as you wish, so you can enjoy the fun of turning ingredients into delicious snacks.  ",
        " Relatively Quiet & Overheat Protection: Low-noise dual fans with sound levels between 45 dB and 50 dB won't make unwanted noise in your kitchen or disturb your sleep during overnight dehydration. The unit will automatically shut down if the cabinet overheats during operation.  ",
        " User-friendly Accessories: Our dehydrator comes with 12 stainless steel drying trays, drip tray, recipe book, manual. Stainless steel trays eliminate concerns about the potential health risks of plastic drying trays. The recipes will inspire you to make a variety of homemade snacks and will unlock the potential of your dehydrator.  "
    ]
},
{
    "title": "Racks actually FIT in dishwasher. :D",
    "rating": "5.0 out of 5 stars",
    "content": "Measure your dishwasher racks. Most of the dehydrator trays touted as \"dishwasher safe\" are too big to fit in the dishwasher. I also have a round dehydrator style and was sink washing them. These smaller trays are super easy to work with. I like loading the rectangle tray more than working around the circle trays. It worked great making jerky in 2hrs!",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0D4TNF1FF"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "Works so much better than my old round plastic one.  My son LOVES beef jerky, so we had gotten a dehydrator years ago.  Saw this and decided to try it and see.  I get pre-sliced carne asada meat from the grocery store, and marinade that for a day or so, then dehydrate it.  This guy works great.  Was able to load a lot more of it in there at once, and seems to work quicker than the old one.  And the racks clean up MUCH easier after a soak in hot soapy water.  Would probably fit in the dishwasher, but hand washing is so easy.  A+",
    "post_time": "Reviewed in the United States on September 29, 2024",
    "pid": "B0D4TNF1FF"
},
{
    "title": "Works great",
    "rating": "5.0 out of 5 stars",
    "content": "Why did I wait so long to get a dehydrator? Oh my goodness, we are are having so much fun experimenting with this. We are new to this so this a bit of trail and error but so far we have been pleased with everything we have tried thus far. We need to work on making our beef jerky better ( but it still very good), but we not expecting it to be perfect on our first try. This unit is fantastic, the size is nice as it is not HUGE and bulky yet it holds a lot of food. It is whisper quiet and works so much better than I expected. We have dried apples (multiple times), peaches, cherry tomatoes and made a huge batch of beef jerky. This has already saved us money and we're just getting started. I would say the recipe book is not great and kind of odd frankly, but we searched the internet to find recipes to use as a guide. The racks clean up so easily as well, have not had issues with things sticking to them. I just soak the racks (if even needed) in warm water for awhile and then rinse them. So easy. I am so excited to make more stuff, we even dried the apple scraps for the birds.",
    "post_time": "Reviewed in the United States on July 23, 2024",
    "pid": "B0D4TNF1FF"
},
{
    "title": "Excellent",
    "rating": "1.0 out of 5 stars",
    "content": "I unboxed it and thought the metal smelled really awful, returning. Also, it is very small.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0D4TNF1FF"
},
{
    "title": "Metal smell",
    "rating": "3.0 out of 5 stars",
    "content": "Going to buy a hard plastic one.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0D4TNF1FF"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "You would think with a company making these appliances would take one extra minute to get the Chinese to English translations right in their literature. There is a lot of strange text in the \"recipe\" booklet. ( if you call it that)  The heat control has some strange and unnecessary settings such as 154.4°.  Odd temperature conversion on the temp dial.",
    "post_time": "Reviewed in the United States on August 7, 2024",
    "pid": "B0D4TNF1FF"
},
{
    "title": "fruit I made came out great  Make sure it's all the way dry for food storage",
    "rating": "5.0 out of 5 stars",
    "content": "Ran one cycle with apples, blueberries, strawberries, and watermelon as a test for 9 hours at 158° Fahrenheit . Everything came out good. Would recommend doing all the same fruit for better results and more space efficacy. If you run different types of things, you'll have to pull some sooner than others. I would do all the same fruit next time. The noise is low, runs silently.  Filled the kitchen with a pleasant watermelon small. yummm...  Simple Machine, does the job it's made to do. This could have been better executed for no additional cost.  I question the long term quality giving the effort put into fixing small issues that could have been corrected by this company.",
    "post_time": "Reviewed in the United States on September 5, 2024",
    "pid": "B0D4TNF1FF"
},
{
    "title": "Overall a good value dehydrator with some quirks",
    "rating": "5.0 out of 5 stars",
    "content": "Works well so far. The trays are lightweight. The odd part might be the dial for temperatures doesn’t seem to line up with the recommended temperatures listed on the machine for common items. For example, they list apple, strawberry, shrimp all at 158 degrees, grapes, chicken, banana, fish at 140 degrees and lemon and meat at 122 degrees F but none of those are temperatures marked on the dial. Instead it has 32, 86, 109.4, 131, 154.4, 176 and 194 degrees F and it’s hard to tell where those line up with the knob. The included recipe book has great pictures and ideas for fruit, pet treats etc. although, some of the recipes aren’t very specific (telling you to brine the item but not with amounts or ingredients of anything). Looking forward to using this more.",
    "post_time": "Reviewed in the United States on August 21, 2024",
    "pid": "B0D4TNF1FF"
},
{
    "title": "Food dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "This food dehydrator holds so much more at one time than I expected. It's compact and fits on my table when in use. We have made so many versions of beef jerky and dried fruit and each comes out perfect. The drying time is really not bad at all. Definitely worth it!",
    "post_time": "Reviewed in the United States on August 9, 2024",
    "pid": "B0D4TNF1FF"
},
{
    "title": "Much better than my circular shaped dehydrator with stacking trays",
    "rating": "5.0 out of 5 stars",
    "content": "I really like that this dehydrator is all together as is. All the trays stay in the system and you can pull one tray out without having to reorganize the rest of them.  I found it easier to load this one up and to remove food after dehydration.  Very happy with this dehydrator.",
    "post_time": "Reviewed in the United States on July 28, 2024",
    "pid": "B0D4TNF1FF"
},
{
    "title": "Nice Large Capacity Dehydrator",
    "rating": "5.0 out of 5 stars",
    "content": "Dehydrator is a nice size and the 12 trays allows for a good amount of fruit or any kind of other food items. Temperature control is simple enough with easy to use buttons and adjustments. I've only dehydrated just fruit so far and it worked flawlessly. For the size, it's a great value.",
    "post_time": "Reviewed in the United States on August 1, 2024",
    "pid": "B0D4TNF1FF"
},
]