[
{
    "name": "        Jabra Enhance Select 500 OTC Hearing Aids, Audiology Team Care Included, Bluetooth LE Audio & Bluetooth Streaming for Calls, Music, Media (iOS/Android), Nearly Invisible & Comfortable - Silver       ",
    "stars": [
        "56%",
        "26%",
        "0%",
        "7%",
        "11%"
    ],
    "pid": "B0D5WW8TSB",
    "ratings": "32 ratings",
    "other_info": {
        "Brand": "Jabra",
        "Color": "Silver",
        "Ear Placement": "In Ear",
        "Form Factor": "In Ear",
        "Model Name": "Enhance Select 500"
    },
    "discount_price": "$ 1,794.98",
    "normal_price": "$1,794.98",
    "about_this_item": [
        " OUR SMALLEST, MOST ADVANCED HEARING AIDS - Excellent in the most complex listening situations, like hearing multiple people at a loud party.  ",
        " LICENSED, US-BASED CARE - With our Premium Package, included with your purchase, our licensed Audiology Team and highly-trained Customer Service team are available 7 days/week to help you get the most out of your hearing aids.  ",
        " CUSTOMIZABLE - Virtually meet with our Audiology Team to get your rechargeable hearing aids custom-programmed to your individual hearing needs. You can also customize your hearing aid settings without Audiology Team support if desired.  ",
        " SOUNDSCAPE HEARING TECHNOLOGY - Hear conversations more clearly, know where sounds are coming from, and enjoy next-level noise cancellation with SoundScape proprietary speech clarity technology.  ",
        " READY FOR THE FUTURE OF CONNECTIVITY - Among the first hearing aids in the industry to offer Bluetooth LE Audio and Auracast, while also supporting existing connectivity such as hands-free calls, for current and future compatible devices.  ",
        " HANDS-FREE PHONE CALLS - Take calls just like earbuds when using iPhone 11 and newer, or your compatible Android device.  ",
        " TAP CONTROL - Answer calls to your compatible Apple or Android device simply by double-tapping your ear or hearing aid.  "
    ]
},
{
    "title": "CRYSTAL CLEAR SOUND",
    "rating": "5.0 out of 5 stars",
    "content": "For years I wore an in-the-ear hearing aid. I thought an over-the-ear aid would interfere with my eyeglasses and not be very secure. Wrong on both accounts. I recently moved and my hearing aids were lost (with several larger things like a sewing machine). I could have returned to the same brand but decided instead to do some research first. Jabra topped the list in all the reviews I read. Jabras are small and easy to put on. They are so comfortable I forget I'm wearing them. Much more comfortable than the in-the-ear brand. Jabra has a nice solid charging case and I don't have to worry about fumbling with battery changes. (My old hands and small objects do not work well together.) The app is great for making sound adjustments and works best for me. I can hear the birds now. I didn't realize I couldn't hear birds until I played back a video I took one morning when I thought there was no sound. I was very aware that I could not clearly understand what people said and had to keep asking them to repeat or speak louder. This gets bothersome quickly for both parties. Jabras are a great investment. I'm not sure why it took 2 weeks from the time I ordered until delivery, perhaps it was a glitch. Look at the payment options and select the one best for you. Paying over time is a good choice and allows you to hear the birds sing.",
    "post_time": "Reviewed in the United States on September 4, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "They are pricey, but seem to be of good quality and support.  Very important to use the Jabra app to set up and use these. They seem to have a little trouble staying connected to my phone at times. Includes adequate documentation, spare rubber tips, filters and tools in a good sturdy box. Comes with set of large flash cards that will get you up and going in a very short time.",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Pricey for OTC, but seem to be good quality.",
    "rating": "5.0 out of 5 stars",
    "content": "Amazon's new (to me) totally automated Customer Service system is awful.  Finally discovered a way to  explain my concerns through the \"chat\" feature.  Never did I talk directly to a real person.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "A year or so ago, I got sudden hearing loss in my left ear. After seeing my ENT right away and being treated, he wanted to see how my hearing was after a year before deciding on the next step. He was leaning toward cochlear implant, but after my latest test, he wanted me to try a hearing aid. The ones he offers are very expensive so I decided to try over the counter first.",
    "post_time": "Reviewed in the United States on August 3, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Very Honest Audiologist",
    "rating": "1.0 out of 5 stars",
    "content": "I ordered the Jabra hearing aids, and thought they were helping. After the Jabra Audiologist read my test results, without even trying any tuning,  she said I should send them back and go back to my ENT for a higher end hearing aid.",
    "post_time": "Reviewed in the United States on September 19, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "That level of honesty is hard to find these days. They could have easily kept my money, especially since I thought they were helping.",
    "post_time": "Reviewed in the United States on October 7, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Top Quality and Affordable!",
    "rating": "5.0 out of 5 stars",
    "content": "As far as the hearing aids themselves, they seemed really good. They kept a charge for a long time.",
    "post_time": "Reviewed in the United States on August 28, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Verified Purchase",
    "rating": "2.0 out of 5 stars",
    "content": "If you prefer virtual doctor visits over in-person, and like the idea of using an app on your phone to control your hearing aids, this may be a good fit for you.",
    "post_time": "Reviewed in the United States on October 10, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "RETURN WINDOW SHORTER ON AMAZON THAN THE COMPANY",
    "rating": "1.0 out of 5 stars",
    "content": "I thought my hearing issues were ‘mild to moderate’. After taking the Jabra online hearing assessment, turns out my hearing loss in one ear was ‘severe’ and the other ‘moderate to severe’. At the recommendation of a friend, I made the decision to give Jabra Enhance a try and it has exceeded my expectations.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Verified Purchase",
    "rating": "4.0 out of 5 stars",
    "content": "Highly recommend the premium support option for professional adjustments, as needed. By using their app, they can adjust your hearing aid settings remotely. Convenience and time-saving.",
    "post_time": "Reviewed in the United States on September 20, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Game Changer!!",
    "rating": "4.0 out of 5 stars",
    "content": "I recently purchased the Jabra Enhance Select 500 OTC Hearing Aids, and I am thoroughly impressed! From the moment I unboxed them, I could see the attention to detail in both design and functionality. These hearing aids are nearly invisible and incredibly comfortable to wear for long periods.",
    "post_time": "Reviewed in the United States on September 11, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Minimalistic and good audio",
    "rating": "4.0 out of 5 stars",
    "content": "The audiology team care included in the package was a fantastic bonus, providing support and personalized adjustments that truly enhance my listening experience. The Bluetooth LE Audio feature allows me to stream calls, music, and media directly to the hearing aids, making conversations and listening to my favorite songs a breeze on both iOS and Android devices.",
    "post_time": "Reviewed in the United States on September 18, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Pricey, but lightweight with good adjustments",
    "rating": "4.0 out of 5 stars",
    "content": "The sound quality is exceptional. I can finally enjoy conversations without straining to hear, and the background noise reduction is impressive. Whether I’m at a noisy gathering or just watching TV, the clarity is remarkable.",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Great quality",
    "rating": "4.0 out of 5 stars",
    "content": "Overall, I highly recommend the Jabra Enhance Select 500 for anyone seeking a high-quality, user-friendly hearing aid solution. They have significantly improved my quality of life, and I couldn’t be happier with my decision!",
    "post_time": "Reviewed in the United States on August 24, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Worked right out of the box",
    "rating": "5.0 out of 5 stars",
    "content": "These hearing aids are pretty impressive. They come in a case much like earbuds for charging, they're bluetooth, and the audio is pretty good. Most of all, these hearing aids are hard to see when you're wearing them, making the user feel less self-conscious. They also take up minimal space on and in the ear. They do come with a ton of reading material to get them programmed, but with some patience and probably some assistance, these are at a decent pricepoint and worth the effort.",
    "post_time": "Reviewed in the United States on October 1, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "I can hear conversations again",
    "rating": "5.0 out of 5 stars",
    "content": "These are very pricey compared to what I'm used to at almost $2000, however they're lightweight, feel very high quality, and have great adjustments via the app. Very cool how the Audiology team will adjust and help program them for you included in the price.",
    "post_time": "Reviewed in the United States on September 15, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "wow",
    "rating": "5.0 out of 5 stars",
    "content": "Love these hearing aids, they are virtually invisible and very lightweight to wear. I don't really have actual hearing issues but these are way more beneficial than I expected them to be. Being able to understand someone without asking them to repeat what they said is a huge blessing. I really enjoy the Bluetooth music ability, the sound quality is nowhere near as good as the quality you get when using it as a hearing aid but it still does the job. The case is rather bulky as well which makes it harder to travel with. Overall I feel the price is a little too high but they work great.",
    "post_time": "Reviewed in the United States on September 22, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Excellent for OTC",
    "rating": "5.0 out of 5 stars",
    "content": "The Jabra 500OTC hearing aids are pretty comfortable to wear, and the sound quality is nice and clear. I love that they're easy to set up without needing a professional fitting, and the instructions were straightforward to follow. You will need to install an app, there's no way around this that I could find.",
    "post_time": "Reviewed in the United States on August 27, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Great hearing aids!!",
    "rating": "5.0 out of 5 stars",
    "content": "The rechargeable batteries last all day, which is great because I don't have to worry about running out of power when I'm out and about. The Bluetooth connection worked on the first try and it let me stream music and take calls directly through the hearing aids, which makes everything much more convenient. Adjusting the volume and settings is also really simple through the app.",
    "post_time": "Reviewed in the United States on August 23, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Game changer for me",
    "rating": "5.0 out of 5 stars",
    "content": "Overall, these hearing aids have helped me hear better without all the hassle, and they help cover up the tinnitus in my left ear. They're not overly bulky or uncomfortable, and I can wear them all day without even noticing they're there. I would definitely recommend them to anyone looking for a reliable and easy-to-use option for hearing support.",
    "post_time": "Reviewed in the United States on September 9, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Absolutely AWESOME Hearing Aids!",
    "rating": "5.0 out of 5 stars",
    "content": "These particular hearing aids are far and away the best I have ever seen! The quality and craftmanship are peerless, and they are so easy to put in and take out of your ears! They are super easy to adjust the sound level to your particular liking and they are excellent at amplifying sound! I give these, my whole-hearted, best possible recommendation!",
    "post_time": "Reviewed in the United States on August 31, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Wow, a wonderful set of hearing aids",
    "rating": "5.0 out of 5 stars",
    "content": "Hearing aids have come a very long way! I am thrilled with all these can do and how easy they are to set up and start using.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "works great, clear and long battery life",
    "rating": "5.0 out of 5 stars",
    "content": "I love the customer service support that is available. I haven't had to use it yet, but I like what they say they can help you do or questions answered.",
    "post_time": "Reviewed in the United States on September 3, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "I like these hearing aids.",
    "rating": "5.0 out of 5 stars",
    "content": "These are nice and small and compact. I love that they are rechargeable compared to replacement batteries.",
    "post_time": "Reviewed in the United States on September 1, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Great hearing aids",
    "rating": "5.0 out of 5 stars",
    "content": "Super happy with them.",
    "post_time": "Reviewed in the United States on August 30, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Jabra Enhance Select 500 OTC Hearing Aids",
    "rating": "5.0 out of 5 stars",
    "content": "great ear piece for elders, help them to hear again very clear, with no delay, also with the background noise cancellation feature it helped step up to another level.",
    "post_time": "Reviewed in the United States on September 8, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Great hearing aids",
    "rating": "5.0 out of 5 stars",
    "content": "These are a great way to get to hear a phone call better. They work with androids as well as iOs. They have great sound and feel comfortable.",
    "post_time": "Reviewed in the United States on July 29, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Very tinny sound, so much so, that it hurt my ears",
    "rating": "2.0 out of 5 stars",
    "content": "Fit well, and after the audio test, Jabra sends updated parameters to the buds to find tune them to your specific needs. Great quality, and easy to use.",
    "post_time": "Reviewed in the United States on July 26, 2024",
    "pid": "B0D5WW8TSB"
},
{
    "title": "Customer service is trash",
    "rating": "1.0 out of 5 stars",
    "content": "These hearing aids are excellent quality in both sound and structure. They are super comfortable, and you can hardly feel that you're wearing them. They are easy to set up, and the sound quality is superb! You're able to also received calls on these and are compatible with Android devices.",
    "post_time": "Reviewed in the United States on July 24, 2024",
    "pid": "B0D5WW8TSB"
},
]