[
{
    "name": "        AMZCHEF Cold Press Juicer Machines, 4.5-inch Wide Feeding Chute Fit Whole Fruits & Vegetables juicer, Two Upgraded Filter, High Yield Juice, 250W Power, Easy to Clean, Black       ",
    "stars": [
        "100%",
        "0%",
        "0%",
        "0%",
        "0%"
    ],
    "pid": "B0DBDSQ32T",
    "ratings": "2 ratings",
    "other_info": {
        "Brand": "amzchef",
        "Color": "Black",
        "Special Feature": "Powerful Motor, Whole Fruit Processing, Stainless Steel Housing, Quiet Motor",
        "Product Dimensions": "7.7\"D x 14\"W x 14\"H",
        "Recommended Uses For Product": "Fruits & Vegetables"
    },
    "discount_price": "$ 79.",
    "normal_price": "",
    "about_this_item": [
        " 4.5-inch Large Diameter Feed Chute: Introducing our juicer with spacious 4.5-inch large feed chute designed for whole fruits and vegetables. Say goodbye to tedious chopping while masticating and increase your juicing efficiency with this time-saving feature.  ",
        " 250W Powerful Cold Press Motor: Equipped with a robust 250W motor, our juicer machines combines cold press technology with raw power. Slowly rotating at 50rpm, it ensures minimal oxidation, preserving the natural enzymes and nutrients in every glass.  ",
        " Dual Filter System: Our AMZCHEF juicer included two filters designed for different produce. One for softer fruits and the other for harder vegetables, ensuring every fruit or vegetables have a versatile and efficient juicing.  ",
        " Silent Operation at 60 Decibels: Our AMZCHEF juicer's slow masticaing technology allowed you enjoy quiet kitchen time with our juicer that operates at a mere 60 decibels. Unobtrusive juicing means no more early morning or late-night disturbances.  ",
        " Easy Assembly with Rotation Lock: Our juicer is designed for user convenience with a simple, secure rotation lock mechanism. Few parts mean quick assembly and disassembly, making cleaning a breeze.  "
    ]
},
{
    "title": "I really enjoy this juicer...",
    "rating": "5.0 out of 5 stars",
    "content": "Is petite not too loud ...it does the job",
    "post_time": "Reviewed in the United States on October 2, 2024",
    "pid": "B0DBDSQ32T"
},
{
    "title": "Verified Purchase",
    "rating": "5.0 out of 5 stars",
    "content": "I really like this juicer it’s not a 150$ juicer and it’s compact easy to disassemble. The little pieces need to be cleaned after each use. I like that they give u instructions and the noise is not loud. Overall it extracted with little to no pulp in the juice. My green juice tasted very GREEN! just how I like. The chute is fine for me may need to cut some in half or quarters but I already did that anyway. I am happy that the filter is not mesh and it is hard plastic. The only thing I didn’t like was the packaging it was well kept but so much plastic! Not recyclable at all. But that’s just my environmental perspective",
    "post_time": "Reviewed in the United States on September 6, 2024",
    "pid": "B0DBDSQ32T"
},
]